[
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "adrien_ngoc_1701",
        "review_rating": "10",
        "review_title": "A one-of-a-kind mind-blowing masterpiece!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "clipturnity",
        "review_rating": "9",
        "review_title": "Matrix but in dreamworld? Nah.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "srcooper-756-646671",
        "review_rating": "10",
        "review_title": "Is it possible the makers understand how incredible this film is?",
        "review_detailed_main": "You only get to watch this for the first time once, so choose your state of mind carefully. It is a film about movies and dreams and reality, and what sort of life it is best to find when you leave the cinema and return to whatever you left to enter. It is spectacular, and brutal, and enigmatic and disturbing. It is beautiful and absorbing. It is about one of my favourite characters ever to grace the screen. I don't see it often, in case it's not as good as I like to remember it. That is my secret, that I lock away in my safe in the basement. That somewhere there is a perfect world for us all. For some, perhaps it is in the cinema watching this."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "mrmocun",
        "review_rating": "10",
        "review_title": "Inception was only less shocking to me than the Matrix",
        "review_detailed_main": "When you wake up from a good dream, you feel the reality is harsh. When you wake up after a bad dream, you will be sentimentally attached to the beauty of reality. But as long as life is good, reality and dreams don't matter."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "forzosky",
        "review_rating": "10",
        "review_title": "Generation defining.",
        "review_detailed_main": "The 20th Century had Casablanca, Star Wars, the Godfather, Blade Runner, and others - this is the first of the 21st Century masterpieces. Truly in awe at how amazing this movie is, an astounding show of all aspects of films. Amazing story and cinematography accompanied with actors worthy of telling the tale. Remarkable and breathtaking."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "naman-avastol",
        "review_rating": "10",
        "review_title": "Insanely Brilliant ! Nolan has outdone himself !!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "EVON1TY",
        "review_rating": "10",
        "review_title": "Answering all the questions with one answer: I feel guilt. ⭐",
        "review_detailed_main": "When I first watch this movie, I was just shocked with it's twist. I'm not gonna mention details, because can't share any spoilers.\n\nSimply this movie makes a complex story, that makes you question so many things. \"Why he is keeping her in his dreams?\" or whatever your question is answering with some well written line. That scene is the key to the whole movie. That line between Cobb and Mal answers all your questions at once.\n\nThat's why I like this movie so much. Some movies has that potential. Making a complex story that someone could answer with only one sentence. You're waiting for that line for whole content. But most of the contents (I mean movie or TV Series) are not managing that well.\n\nBesides the greatness of the storyline this movie has a really great cast. So Acting Performances are also great. Award Winning Cinematography by Wally Pfister was too great. Original Scores by Hans Zimmer was brilliant. Visual Effects are unique. So not only the Screenplay but nearly all the technical details are great."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "dario_van_kuschn",
        "review_rating": "6",
        "review_title": "Inception has a lot of ideas and it doesn't do anything with them",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "Carl_Tait",
        "review_rating": "5",
        "review_title": "Good idea lost in the noise",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "siddhantadlakha",
        "review_rating": "10",
        "review_title": "Inception; Christopher Nolan's masterpiece?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "Xstal",
        "review_rating": "9",
        "review_title": "Mindcraft...",
        "review_detailed_main": "There are those who seek to dive into your mind, take your secrets and whatever else they find, espionage, conspiracy, infiltration, skulduggery, through worlds that are all conjured, well designed. They've been asked to plant a seed, start an idea, change the course of an industrialists career, but it needs dreams within deep dreams, an architect to build the schemes, and the consequences, could be quite severe.\n\nImaginative beyond words, elegantly crafted and constructed, presented and performed by legends of the screen with a great storyline that keeps the viewer constantly engaged and on the edge of their seat - what more do you want out of movies."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "Ch4ndler_B1ng",
        "review_rating": "10",
        "review_title": "Didn't win Best Picture? WHAT?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "lhbaker-28783",
        "review_rating": "10",
        "review_title": "My number one favorite movie",
        "review_detailed_main": "Inception is my number one favorite movie off my twelve years on earth! It's absolutely impossible to explain the incredible that Inception has. Inception is Sooooooooo dang exciting, edge of seat, mind blower, and I wish there were more movies like it and more Christopher Nolans out there. Congratulations to the well deserved best director, writer, and producer of films (in my opinion). Also the acting is fabulous, everyone did an amazing job, and Leonardo was fabulous at explaining the dream concept. Also the CGI and effects are amazing. Go watch Inception because it is incredibly amazing in every aspect, and is my number one film of my twelve years on earth. Bravo to the Inception crew and wow at this fabulous movie!"
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "D_Burke",
        "review_rating": "10",
        "review_title": "In a Decade, \"Inception\" May Be A Religion",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "mollyshelhamer",
        "review_rating": "10",
        "review_title": "Perfect for Sci-Fi Fans",
        "review_detailed_main": "Christopher Nolan's \"Inception\" (2010) is a complex science fiction thriller about a group of people with varying specific skills that create a perfect team of dream-sharers. Dom Cobb, the main protagonist, is an extractor who is able to find out people's secrets by intruding into their dreams. His right-hand is Arthur, who researches and plans what they are trying to accomplish in a dream. Bright graduate student Ariadne is the architect for the dreams, meaning she literally constructs the physical aspects of a dreamscape. Eames is a professional at turning into anyone else in a dream, almost like shapeshifting. Lastly, Yusuf is a chemist who creates perfect concoctions of sedatives to achieve ideal conditions for the dreams to take place. This elaborate combination of characters is asked by a rich businessman, Saito, to infiltrate his dying competitor's son, Robert Fischer's, dream and place an idea in his mind so that Saito's business can become more successful. Traveling through the layers of someone's mind and making them think of an idea on their own is what they call \"inception.\" Cobb is dedicated to making this happen so that Saito can arrange for Cobb's return to America to see his children. Without Saito, Cobb would not be able to return to America because of his alleged criminal background, but Saito has connections and power to clear his name. Some members of his team think achieving inception is impossible, but Cobb convinces them to be on board and they must come up with a mastermind plan with no room for error to achieve this extremely difficult yet imperative task. They begin a three-layer plan that involves elaborate depths of the dream dimension, taking advantage of Fischer's sensitive and dysfunctional relationship with his father, practiced methods of leaving a dream and entering the next, all while trying to avoid Cobb's wife Mal who lives in his subconscious and often sabotages his plans. The shocking ending leaves viewers at a cliffhanger and fans theorizing.\n\nNow that I've gone over the plot, let's talk about the other components of the film. The marketing strategies did an excellent job gathering hype for the film. The movie poster features the famous actors that everyone was excited to see, Leonardo DiCaprio, Tom Hardy, Elliot Page, and the rest of the dream crew. It also says \"Inception\" in a large red font and notes that is directed by the same director of \"Dark Knight,\" which was an insanely successful and highly rated movie that was premiered two years prior to Inception. Dark Knight scored a 94% on rotten tomatoes and is #112 on IMBD's most popular movie list. This likely drew in the audience from Christopher Nolan's movies and set a high expectation for the quality of Inception. Another great marketing move was the contents of the teaser trailer. The trailer features a brief voiceover of Leonardo DiCaprio and amazing scenes with impressive cinematography taken out of context that show the viewers the production value and exciting action contents of the film all while confusing them so that they go see the film when it is released. I think the shock factor and science fiction aspect of the trailer is owed to the scene where a city block starts to fold over top of itself.\n\nThe content of the film stayed true to the marketing because the cinematography, directing, and acting is quite well-done. Starting with the cinematography, the zero gravity scenes and cityscape building from the ground up were very realistic looking and intensified the movie watching experience. There was a lot of attention to detail. The directing of Inception is very montage based. It draws amounts and amounts of suspense. For example, the montage near the end of the film with the van, the fortress, and the hotel was painfully long but created such thick suspense. For the acting, I only have compliments and no complaints. Inception was casted beautifully and everyone fit their roles perfectly. Leonardo DiCaprio did an excellent job as Dom Cobb, especially in the emotional scene with his wife and two kids in one of the dreams. My personal favorite performance was Cillian Murphy's role as Robert Fischer. He played as his character really well and he captured his relatively constant sadness surrounding his father situation.\n\nInception is a staple film in the science fiction genre and is similar to a few other sci-fi movies as well. Inception is at #135 on IMBD's most popular movie list and has a rating of 87% on rotten tomatoes, so there is no doubt about its quality. In my opinion, Inception is pretty similar to the well-loved movie \"The Matrix\" (1999) starring Keanu Reeves. They are both iconic science fiction and action films with themes of alternate realities. The second film I think is very similar is a more recent film, Tenet (2020) with Robert Pattinson. Tenet is also about bending the rules of science and is also directed by Christopher Nolan. If you enjoyed either of these movies, I recommend Inception. I also recommend it to general fans of Christopher Nolan's directing, so if you have watched and enjoyed any of his films, you would probably like Inception too.\n\nOn my rating scale of one to five, with one being the worst possible score and five being perfect, I give Inception a five. It has no weaknesses in my opinion. Every aspect of this movie combines into perfection. The acting and cinematography is what takes it over the top, and I am a fan of Leonardo DiCaprio and Cillian Murphy in all of the roles they play. This is a movie I have voluntarily watched multiple times and it only gets better with each watch. It is very complex and a complete experience to view. My favorite aspect of the film is the ending. Many people say they hate cliffhangers, but I enjoy them because it leaves it up to the audience to imagine. Basically, you can choose your own ending based on what you think makes the most sense with the facts you are given in the film."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "mach1ne",
        "review_rating": "4",
        "review_title": "Boring, too long, illogical, awful dialogue",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "marcusdean118",
        "review_rating": "10",
        "review_title": "Nolan at his most intelligent best.",
        "review_detailed_main": "Inception is truly one of a kind. A concept which has long gestated in Christopher Nolan's mind, his eye for drama mixed with his large scale sensibilities ring true in Blockbuster season making Inception a true original in the sea of reboots, remakes and sequels.\n\nTo try and explain Inceptions many plot twists and incredibly intelligent arcs, would be a foolish task. As Nolan himself has been reluctant to. The best way to approach the film would be with an open mind, if you are prepared to be taken on a ride of a lifetime, then trust that you 100% will. If Avatar was a seminal film in technology (although coming out as a rather poor film, in my opinion), then Inception is seminal in it's storytelling. With a 148 minute running time, you would expect a lot to take place, but what you wouldn't expect is the pace of it all. I did not think at one time in the film about how long was left. I was simply blown away by the depth in every single part of the film. If my enthusiasm for the storytelling aspect of the film has left you worried about the spectacle, then don't worry. They are, as hinted in the trailer, incredible, looking real and unbelievable simultaneously. The most pleasing thing about the action set pieces, is that they are genuinely used to illustrate the story, rather than to blow stuff up a la Michael Bay.\n\nWith this complex movie in it's high concept, a stellar cast is needed. And Nolan as always, delivers with just that. This is vintage DiCaprio, perhaps only equalled in The Aviator, which is even more impressive as his role as Cobb in Inception is not a showy one, needing DiCaprio to be the constant at the centre of the film. And he pulls off Cobb's emotional contradictions sublimely. The rest of the cast members all shine in parts of the films, Cillian Murphy shows off his usually non-existent tender side, Gordon-Levitt bottles his usual charm for his confidently reserved turn as the reliable Arthur, Watanabe is devilish as the seemingly ambiguous Saito, Page shows why she's the next big female star and Tom Hardy revels in being the comic relief of the film compared to his recent turns as decidedly psychopathic characters.\n\nOverall, Nolan has indeed surpassed himself. He has created a world as expansive as his Gotham, a plot dwarfing the intricacies of Memento and one which blows The Prestige's cinematic reveal out of the water. This is truly unmissable cinema. Revel in it, we've still got to wait a whole two years before Batman 3."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "akdjreview",
        "review_rating": "9",
        "review_title": "Intellectual masterpiece",
        "review_detailed_main": "Inception is a beautiful piece of film that has impacted a large part of the film industry. With everything from the actors to the cinematography to the music, this movie without any elaboration perfected almost everything there is.\n\nInceptions slow start is the only weak point of this movie. It begins intensely to then slows down for the next 20 - 30 minutes. While then finishing off as an impeccable film. Nevertheless, this is what brings the film down for me.\n\nThe director Christopher Nolan managed to create a masterpiece with little to no mistakes. At no point during this intensely long movie did I feel bored. Instead, I was always excited and on my toes intrigued.\n\nThe acting in this movie was phenomenal. A small number of great actors that all had their character arc while also doing incredible performances. It is truly beyond me how Dicaprio didn't win an Oscar for his performance.\n\nMeanwhile, also employing the greatest composer in history with Hans Zimmer, the music adds significantly. The music adds an extreme amount of excitement and keeps you constantly interested. Few composers can make you notice the music, but Zimmer succeeds per usual.\n\nTo finish of the film was astonishingly shot. With beautiful eye-catching scenes. While also containing some incredible action scenes that might be some of the best action I've seen. With a thought-provoking storyline that finishes of with an unbelievable ending.\n\nI highly recommend Inception to everyone and I promise you won't be disappointed."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "drakula2005",
        "review_rating": "10",
        "review_title": "Incredible-Nolan keeps improving and Inception is by far the best improvement!",
        "review_detailed_main": "I saw Memento very recently, something that turned out to be a great miss.I saw it again, just to make a couple of thins straight-and i'll definitely do the same with Inception.\n\nChristopher Nolan keeps improving himself, with even more complex and multilayer script like this.And i thought Memento was hard to reach by most of the viewers, but no.Inception will keep you mesmerized and captivated by the genius, that's hidden behind it.And not just directors and screenwriters (or with other words-Nolan), but with acting and sound-and effects and editing as well.\n\nWhen you have a cast like this-i mean Leonardo DiCaprio, Joseph Gordon-Lewitt, Michael Caine, or Marion Cotillard (a personal favourite), the movie just keeps going flawlessly.Most of the crew is the same the Nolan brothers worked with on TDK and earlier in Batman Begins.So the Oscar noms in those categories are a certainty for me.\n\nThe only thing one could have against the movie, is the headache one could have.See, most of my friends go to the movies for brainless action, they enjoyed Iron Man 2 and The A-Team, but this movie-you have to see it at least twice, to understand it.The levels and the layers on which thing are happening are so many, that one surely'll miss something vital.This is a reason for not fitting to the mass audience, but i hope that won't happen, because Nolan is one of my favourite directors/writers, and he showed, that the brainless action flicks aren't all of it.There are still movies like Inception out there and still people like the Nolans to make those movies, so it's not all lost.And i hope this movie could show the audience that the story is still important for the experience one could receive, not the endless, constant explosions.Because this is really a one of a lifetime event.\n\nSaying that, i must say, that in a world full of remakes, reboots, sequels, prequels and God knows what, this is a unique chance to see something different and unmatched so far-a strong movie, that, surely will be Nolan's latest masterpiece! My Grade won't change-it's the same for all Nolan movies-sheer 10!"
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "howemonika",
        "review_rating": "10",
        "review_title": "Amazing Directing, Captivating Plot, Overall Great",
        "review_detailed_main": "I had the privilege of seeing this movie before it came out, and, like most of DiCaprio's films, it blew me away.\n\nInception is a well-made movie, filmed in about 6 locations all over the world. The directing was outstanding, there were only about two moments, maybe three seconds in total, where i noticed that visual effects were being used (of course defying gravity is pretty difficult).\n\nThe plot was very pleasingly intricate, with a twist-and-turn, keep-you-on-the-edge-of-your-seat type feel. I noticed that this film had similarities with DiCaprios thriller Shutter Island (which i also enjoyed very much)seeing as it left you wondering what was real and what was not. It's great to see a movie with a thick and emotional plot and not just grenade-throwing action heroes who achieve greatness in the end.\n\nInception also has a very well-composed score, which to me was the finishing touch to a perfect movie. If you're thinking about seeing Inception, definitely go! Even though i was fortunate enough to see a free show, it is worth every penny you pay.\n\nTruly unique, like nothing i've ever seen before. Christopher Nolan certainly covered new ground with this film and wasn't afraid to leave us hanging with a spectacular ending."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "technofunkie",
        "review_rating": "10",
        "review_title": "Nolan's first true masterpiece",
        "review_detailed_main": "Usually I try to be careful with over hyping a film, or setting the expectations too high, as film geeks all are guilty for, however for Christopher Nolan's Inception, this really is not possible.\n\nThis is possibly one of the only perfect films I have ever seen. It is absolutely confident in every way, something which is extremely refreshing, even more so than Avatar. Christopher Nolan gets some slack for making great to look at but ultimately heartless affairs, which I for one do not agree with, however I do not think anyone can argue that here. The emotional aspect of this film not only ties it all together but is really the centre of this film, it is the focus.\n\nI do not want to over simplify the film, by simply calling it Kubrick doing Bond, or Gondry on a huge budget, because I am sure it will be called that but it is far more than that, it is something I do not think Kubrick could have ever made. It is pure Nolan, and pure greatness.\n\nI hate writing something which is pure fan-boy gushing, but its really difficult here. I did not find a thing I did not like about it, I am sure if maybe I saw it a second time, maybe I would find something about it I didn't like, but not the first time. The way it is cut, means that there is always action on screen, if not, then the visuals are interesting enough to keep your eyes glued.\n\nThe final hour of the film, is possibly one of the most complicated action sequences put on film. You have to constantly be paying attention to remember all of the layers of what is happening. Without spoiling anything, all I have to say is that is what this film is about, that is what makes this film so great, layers. Once you have seen this you will now what I am talking about.\n\nAll of the actors are fantastic too, Di Caprio is the stand out here. Yes, this is probably due to the fact he is the star and given all of the emotional weight, but he handles it perfectly, similarly to his performance in Shutter Island. Ellen Page, whom I usually hate, gives a great performance here. Tom Hardy gives a break out performance here, he is quite the bad ass.\n\nI hope audiences are ready for a film like this, a pure auteur driven film which does not sacrifice a single frame for the studio. I would hope this film will change Hollywood, as it is 100 percent the directors vision yet it is definitely a marketable film, much like District 9, yet I do not think it will.\n\nI cannot recommend this film anymore than I have, I just have to say everyone and anyone should see it. Sorry about all the gushing, it is just so hard not too.\n\nIf you liked this review check out my new film blog: http://thedeletedscene.wordpress.com"
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "chaaa",
        "review_rating": "10",
        "review_title": "The perfect summer blockbuster?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "dvc5159",
        "review_rating": "8",
        "review_title": "Sci-fi perfection. A truly mesmerizing film.",
        "review_detailed_main": "I'm nearly at a loss for words. Just when you thought Christopher Nolan couldn't follow up to \"The Dark Knight\", he does it again, delivering another masterpiece, one with so much power and rich themes that has been lost from the box office for several years. Questioning illusions vs reality usually makes the film weird, but Nolan grips your attention like an iron claw that you just can't help watching and wondering what will happen next. That is a real powerful skill a director has. No wonder Warner Bros. put their trust in him, he is THAT good of a director, and over-hyping a Christopher Nolan film, no matter what the film is about, is always an understatement instead of an overestimate like MANY films before.\n\nNot since the eras of Stanley Kubrick, Andrei Tarkovsky and Alfred Hitchcock has there been a more brilliant director than Christopher Nolan. He is, undoubtedly, one of THE most brilliant and gifted Hollywood filmmakers in history. Filmmakers like him come but just once in a lifetime. He has the ability to seduce our eyes, ears and most importantly, mind, and then delivers what he intends to deliver in full blast. Rarely have blockbusters have the gall to deliver such amounts imagination and intelligence at the same time. And yes, it is similar to the excellent anime film \"Paprika\" in the whole \"invading dreams\" plot, but the similarities end there as Nolan brings the film to a whole different level.\n\nVisuals and intelligence rarely come together in movies at the same time, it's either all-visuals-no-smarts (\"G.I. Joe\", \"Transformers\") or the exact opposite (\"Doubt\", \"Invictus\"). In this film the excellently directed action sequences combined with immensely groundbreaking and jaw-dropping visual effects are combined smoothly with a heavy dose of intelligence and believability.\n\nAlthough having an ensemble cast and financed by a Hollywood giant studio (Warner Bros), this film is a very personal film for Nolan, he wrote the film as well as directing it, and as you watch the film you get many glimpses of Nolan's perplexing, increasingly imaginative thoughts and dreams in the dialog that he writes and the plot that he sets up. Ideas have never felt more interesting and put to good use than in this film. This film is NOT for the popcorn muncher, rather it is a film for thinkers. Honestly I can't explain the plot for fear of spoiling the movie for you readers. Even the slightest hint will ruin the experience. The viewer will walk out of the cinema feeling dazed, confused and ultimately breathless. It's like a puzzle, both physically and mentally, and you have to pay attention throughout the film for the clues. However Nolan controls the spectacle of the film and is careful not to let it overwhelm the film's humanity, and this is where \"Inception\" shines. It is a very deep film that will have one thinking and asking questions for years to come. That's right, years.\n\nOnce the film ends, you'll want to watch it again, for there's something new every time. This is a film that requires multiple viewing for someone to truly comprehend the film's ambiguous themes, and will be discussed by many in the future. This is an original film, no adaptation, no sequel/prequel, no remake/reboot, which is extremely refreshing having gone nearly three years of mostly unremarkable visual effects roadshows (\"Avatar\" be damned).\n\nOf course, a film is not complete without the actors. Leo DiCaprio delivers an Oscar worthy performance, similar but better than his previous effort \"Shutter Island\". He shows glimpses of a flawed, grim, fragile man, who has knowledge about everything else but yet can't seem to come in grips with himself and his demons. Joseph Gordon-Levitt, Ellen Page, Tom Hardy, Ken Watanabe, Dileep Rao, Cillian Murphy, Tom Berenger, Michael Caine, Marion Cottilard, Pete Postlethwaite, Lukas Haas... Nolan really brings out the best in this unusual yet extremely talented group of supporting actors who make their roles their own.\n\nNolan is of course, a master behind the camera, a real virtuoso when it comes to film. His direction is taut, focused, gripping, and extraordinarily fascinating. The detailed and complex original script is no surprise from Nolan, considering the fact that he turned Batman the superhero into pop-culture art two years ago (\"The Dark Knight\"). The action sequences are unique, exciting and fresh, something absent from the cinema which has since been interested at things popping towards the screen and stuff blowing up every two milliseconds. The visual effects are awesome and imaginative, and best of all they do not bring down the movie's quality one bit, rather it makes the movie more fascinating to watch. The cinematography is absolutely, beautifully shot, so we can see the action and emotion in all their glory. Production design is top notch, with terrific design of sets and locations. Hans Zimmer's complementing music score is simply outstanding, and knowing the man, that's really all I have to say. Together all of these elements combine to deliver a mesmerizing movie experience like no other this year.\n\nChristopher Nolan has once again outdone himself. He truly is a gifted filmmaker, arguably the most imaginative in Hollywood today. And \"Inception\" can proudly stand alongside \"Blade Runner\" and \"2001: A Space Odyssey\" as science-fiction masterpieces that push the boundaries for movie making and become a different experience altogether.\n\nThere are two types of films: the crowd-pleasing blockbuster and the intelligent indie/art film. Nolan has combined two of these tropes together into one exceptionally brilliant package, pulling off that rare, now nearly-extinct Movie Magic that has since been wiped off the planet by sequelitis and reboots. Movie of Summer 2010? Movie of 2010? Heck this is possibly the first masterpiece of the decade! Nolan is a genius and I applaud him for treating his audiences as intelligent people.\n\nMissing this film and not getting the film's point is a crime.\n\nOverall value: 9/10 (Excellent)"
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "funkyfry",
        "review_rating": "6",
        "review_title": "All right.....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "Egg_MacGuffin",
        "review_rating": "3",
        "review_title": "You are not as stupid as Christopher Nolan thinks you are.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "planktonrules",
        "review_rating": "8",
        "review_title": "Amazingly original...but also a bit overwhelming.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "spaaw",
        "review_rating": "10",
        "review_title": "Inception - A benchmark in all cinema to come.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "harveyneary-73065",
        "review_rating": "10",
        "review_title": "Nolan's best film by far",
        "review_detailed_main": "This is an excellent film. The CGI is great. The characters are great. But I have one problem which is the character development. It didn't have much of it, but that is the only problem. The movie did start of really confusing, but in the 40 minute part I got used to the story. In conclusion this is a great film and I would highly recommend it."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "hitchcockthelegend",
        "review_rating": "9",
        "review_title": "This is your first lesson in shared dreaming. Stay calm.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "murtaza_mma",
        "review_rating": "9",
        "review_title": "A Potpourri of Vestiges Review: Buñuel meets Kubrick in Nolan's most ambitious venture, till date",
        "review_detailed_main": "Surrealism can appear to be ineffably bizarre, or inquisitively titillating, depending purely on the viewer's intellect. Though the realm of surrealism is highly nebulous and complex, but even a slight attempt at improvisation can sometimes go awry and open a Pandora's Box, making the task highly improbable and nigh impossible. This facet of reality may pose a handicap to the most gifted of the directors, but not to the genius of Christopher Nolan, who not only dabbles with the concept of surrealism, but also ingeniously blends it with the elements of Science Fiction in his latest wonder named Inception. Nolan created a niche for himself a decade back by unleashing a monster of a movie called Memento. He further substantiated his status by conjuring movies like Insomnia, The Prestige, Batman Begins, and The Dark Knight. His unremitting desire for innovation and uncanny craving to foray into the unexplored realms of imagination deservedly earned him an auteur tag, which gave him the carte blanche that a story-teller like Nolan desperately needs. It's highly apparent that Nolan takes every possible advantage of this liberty while filming Inception. Inception is not only dreamlike, but is a dream in itself and is superior to any other thing conceived on the silver screen. With its entwined layers, the movie for the most part serves as an unfathomable riddle and makes multiple viewing extremely essential. It incredibly does extremely well on both the humanistic as well as the technical fronts. In fact, the balance between human emotions and the elements of Science Fiction is so adequate that it's impossible to separate them.\n\nThe movie is about a futuristic world where the human mind can be intercepted through dream invasion. Cobb is an expert in the art of extracting information (stealing valuable secrets) from deep within the subconscious in the dream state. His proficiency in extraction is marred by a turmoil that begins with his wife's untimely death. He is forced to live the life of a fugitive away from his children. His only chance for redemption lies with a Japanese tycoon named Saitu, who wants him to do an inception (planting information into someone's mind). In order to accomplish this unprecedented task, Cobb and his team must overcome a labyrinth of unforeseeable challenges, where even a slight miss could trap them in a perpetual limbo. Any further revelation would be remissness on my part as the plot is filled with such intricacies that even expatiation would be incapable of justifying its profundity.\n\nLeonardo Dicaprio gives a solid performance in the lead role, following his memorable performance in Shutter Island. He has brilliantly depicted the complexities and limitations of Cobb's enigmatic character highlighting his pain and mental trauma. Marion Cotillard is ravishingly scintillating as Cobb's whimsical wife, Mal. The rest of the cast has given a thorough performance with special mention of Ken Watanabe, Ellen Page and Joseph Gordon-Levitt.\n\nInception is incredibly brilliant as a movie and is a breakthrough in contemporary cinema. Nolan's creativity and his unparalleled execution definitely make it an object of great cachet, but whether it would become Buñuel's 'Un chien andalou' or Kubrick's '2001: A Space Odyssey' and serve as a prototype for the movies to come is for the time to decide. Irrespectively, Inception is sine qua non not only for an aficionado, but also for the average viewer, who is willing to delve deep enough to savour the delight.\n\nPS: One has to imagine it to believe it. 9/10\n\nhttp://www.apotpourriofvestiges.com/"
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "manojitbaidya",
        "review_rating": "10",
        "review_title": "Masterpiece",
        "review_detailed_main": "An amazing science fiction movie... Christopher Nolan's another masterpiece... Need a sharp mind to understand the story & enjoy this movie."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "angeltapia-18869",
        "review_rating": "6",
        "review_title": "Really good movie just a but overwhelming",
        "review_detailed_main": "Watched it for the the first time. In order to enjoy this movie you need to be prepared. You need to be focused and pay attention or else you will get lost. You also have to be patient. You needs these things to really understand this movie because this film can get overwhelming. There is a lot of going on and can be overwhelming. Normally when I sit down and watch a movie I like to relax on my couch and will probably check me phone in the beginning until it reall catches my attention. With this movie you can't do that. You need to fully pay attention and it lowkey felt like I was forced to watch it because of how much focus you need to watch this film. I feel like a great movie shouldn't be that hard to watch. This is why I take some points off the rating. Other than that the movie is good and I understand why people give it a 10/10."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "seabrapalma",
        "review_rating": "2",
        "review_title": "Insulting",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "Hitchcoc",
        "review_rating": "10",
        "review_title": "Come Back Again!",
        "review_detailed_main": "If one goes to an art gallery to see a provocative piece, one sees something new each time. That's what true art is. That's why a black light Elvis is not art. This film is certainly a tour de force. It requires engagement at every step. LIke most works of art, it doesn't give it all away. I look forward to seeing this the second or even third time. First of all, the premise is wonderfully engaging. Our consciousness is layered as everyone knows who thinks they have awakened, only to find themselves in another nightmare--then they awaken again. We know that the subconscious by nature is out of our control. There you have a wonderful premise. Now layer that further with people who can flip in and out and use this to their own ends. While confusing, it's exciting. The amazing thing is that the director/writer pulls it off. Every nuance and event is picked precisely for its effectiveness. We have the luxury of watching from one precipice into the abyss. We do care about the people and not just because we want them to succeed. We care about the matrix of the dream levels. Great movie."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "greenwardsuzy",
        "review_rating": "10",
        "review_title": "Brilliant on every level",
        "review_detailed_main": "Boring of me to say but this is one of my favourite movies of all time. Stellar performances, great plot and an ending that keeps you guessing. The CGI is exceptional and I think it's arguably one of Nolan's best films."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "Smells_Like_Cheese",
        "review_rating": "10",
        "review_title": "Sweet Dreams",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "jordandorothy-30739",
        "review_rating": "8",
        "review_title": "Am I dreaming",
        "review_detailed_main": "Though this was a very good, on your toes, don't blink kind of movie. In the end, I had to ask myself, \"Was it all a dream?\". Acting superb and directing on point. Very good movie."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "moviexclusive",
        "review_rating": "10",
        "review_title": "Inception is Christopher Nolan's masterpiece, a work of sheer brilliance that astounds on intelligence, spectacle and heart",
        "review_detailed_main": "\"The mind is like an iceberg, it floats with one-seventh of its bulk above water.\" -Sigmund Freud\n\nChristopher Nolan's \"Inception\" plays very much like its subject matter described so aptly above by Freud. On your first viewing, you will quite possibly only grasp just a fraction of its complexity, but the brilliance of what this reviewer proclaims as Nolan's masterpiece lies in how engaging it is- even though you cannot quite fully comprehend what Nolan is trying to say. Indeed, it may take multiple viewings for one to absorb completely his audacious new creation that dares to tackle as dense and intricate a subject as that of dreams.\n\nIt isn't easy to understand the nature of dreams, particularly because they seem to defy logic. The same can probably be said of some of the elements in \"Inception\", but in order for one to understand what dreams really are, one has to first accept that they are not part of the conscious mind, and therefore cannot be understood by rationality. Freud proposed that the rational mind is just that one-seventh of the iceberg that we see, and the rest of the mind is made up of the preconscious and the unconscious. Freud also believed that dreams were the road to the unconscious and existed in the preconscious, a state between the conscious and the unconscious mind.\n\nIt is in this context that Nolan invites his audience to approach \"Inception\". Here, Nolan imagines a world of corporate espionage where a thief enters a person's mind during his dreams to steal ideas. This process he terms \"extraction\", done by a team of people who design the architecture of the dreams, plant several people including the subject into the dream, forge identities within the dream and then proceed to steal the idea from the subject. Leonardo DiCaprio is the master thief of them all, Dom Cobb, and Joseph Gordon-Levitt his long-time right-hand man Arthur.\n\nBut this latest mission is different- a tycoon Saito (Ken Watanabe) wants him to plant an idea (so termed inception) within a rival's (Cillian Murphy) mind in order that he will break up his ailing father's business empire after he takes over. Cobb agrees to this dangerous mission- a fugitive wanted for the murder of his wife, Saito promises that if Cobb succeeds, he will wipe Cobb's slate clean so he is allowed to return to the United States to see his children. So Cobb begins assembling his team- the architect Ariadne (Ellen Page), the forger Earnes (Tom Hardy) and the chemist Yusuf (Dileep Rao)- think of it like a heist, only much more complicated.\n\nAs Cobb explains the rules of the game to his team while preparing for their mission, Nolan is too establishing the rules of his game to his audience- what it means to die in a dream, why one can feel pain even when you're in a dream, the significance of the people you see in your dream, the difference between dream time and real time. Not to spoil the experience to you- but suffice to say that there are many many such rules that Nolan plays by in his movie. Those who have had some experience in the study of dreams will likely grasp this more quickly, but those who have not may take more time to accept the logic and regulations behind Nolan's world- hence the multiple viewings.\n\nRegardless, there is no doubt that it is engrossingly intriguing. All this takes place in the first half of the movie, which sets the stage for the inception itself in the latter half, an ingenious conceit set within a world of layered dreams that defies any description. Nolan uses the interconnectedness of these elaborate dream layers to intercut several breathtaking action spectacles - the storming of a vault within the Arctic within a zero-gravity fight along a hotel corridor within a high-speed vehicular freeway chase. Each of these would be thrilling in their own right, but with Nolan's vision, Wally Pfister's expansive photography and Lee Smith's fine editing, the simultaneous unfolding of these set-pieces is utterly riveting.\n\nBesides grand action, Nolan also delivers heart-wringing moments courtesy of Cobb's troubled past with his late wife, Mal (Marion Cotillard), who threatens to wreak havoc on his missions by surfacing from his unconscious in the most inopportune manner. We're kept in the dark most of the time, believing that Mal is an insidious presence Cobb is unable to eradicate, but Nolan's reveal towards the end of the film that puts into perspective Cobb's unresolved guilt delivers an emotional finish that will leave you floored.\n\nAs with his previous movies, Nolan displays a knack for choosing actors who can best embody the characters in his films. While DiCaprio's role here may be reminiscent of that in his earlier Shutter Island, there's no question that he anchors the movie with a perfectly calibrated performance that is equal parts intense and heartfelt. The rest of the supporting characters fill out their roles just as vividly- Joseph Gordon-Levitt radiates confidence and suavity, Ellen Page displays suitable wit and grit, and in particular Marion Cotillard exudes both sultriness and danger in an edgy yet eventually heartbreaking performance.\n\nBut \"Inception\" is Nolan's vision through and through- and in fact, a visionary director and a master filmmaker at that. Many years Nolan spent refining his screenplay, and it shows in the great detail and complexity that makes \"Inception\" both an intellectual and visceral enjoyment- just take the names of the various characters, each of which have a special significance. With \"Inception\", Nolan invites you to open your mind to possibilities- possibilities of alternate realities, of complexities beyond the conscious mind to grasp and most importantly, of the power of imagination. It is that rare gem of a film that is so multi-layered, so profound and so fascinating that you'll want to experience it again immediately after you've seen it- just so you can fully appreciate its genius."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "Sleepin_Dragon",
        "review_rating": "10",
        "review_title": "A complex, hypnotic, incredible thriller.",
        "review_detailed_main": "Inception is a first class, mind blowing, complex action thriller, it boats outstanding special effects, an A list cast, and some insanely clever concepts.\n\nIt was love at first sight, I adored this film when I first saw it, and over a decade on, it's still as good. For me it's up there with The Matrix, it truly is that good.\n\nIt's one of those films that improves with subsequent viewings, as there is always something new to pick up, some detail that you may have missed the previous time.\n\nThis film packs some big punches, it dazzles in every avenue, one of the biggest features, the visuals, those special effects look remarkable still. The scenes of the streets folding over, just an incredible moment, surreal.\n\nAnother incredible feature, the acting, Cain, Cotillard, Murphy, Hardy all fantastic, as for Leonardo DiCaprio, I still regard it as one of his best ever performances, he's phenomenal, he commands your attention.\n\nHave you ever dreamed you're dreaming?? What a thing to contemplate.\n\nPersonally, this film is in my top 10.\n\n10/10."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "mnjacks",
        "review_rating": "10",
        "review_title": "Unique cinematic gem-a discussion of the paradox of the movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "RedLime",
        "review_rating": "6",
        "review_title": "(Spoiler) Did You See It? Did You Really See it?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "ap_griffiths",
        "review_rating": "5",
        "review_title": "Over long, pretentious twaddle",
        "review_detailed_main": "This is not a bad film per se, had it been about 30-40 minutes shorter I would not have been too offended. But I am genuinely perplexed as to how people can rave over it - #13 on all time list at time of writing!! There is virtually no character development, the plot is overly complicated and riddled with holes and contradictions. Frankly you don't need to suspend disbelief so much has have it surgically removed and flushed down the toilet. By the end I was wishing I was in a dream within a dream policed by a completely arbitrary set of nonsense rules - anything to get me out of that chair.\n\nIs this really the same man who gave us Memento??"
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "lifefourhome",
        "review_rating": "10",
        "review_title": "A Masterpiece at It's Best",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "Jay-1168",
        "review_rating": "10",
        "review_title": "Smartest Film of The Year!",
        "review_detailed_main": "Inception is the Smartest film of the Year\n\nINCEPTION (PG-13) Directed by Christopher Nolan (Batman Begins and The Dark Knight) Inception is the smartest film you will see all year. It never plays down to the audience, in fact, it assumes the audience is intelligent. Inception tells the story of Dom Cobb (Leonardo DiCaprio) as a thief with the rare ability to enter people's dreams and steal their secrets from their subconscious. His skill has made him a hot commodity in the world of corporate espionage but has also cost him everything he loves. Cobb gets a chance at redemption when he is offered a seemingly impossible task: Plant an idea in someone's mind. If he succeeds, it will be the perfect crime, but a dangerous enemy anticipates Cobb's every move.\n\nThis movie is challenging, but always in a fun and inventive way that keeps you captivated. It is an updated 40's crime drama with a technological twist that just works.\n\nAfter the fight scene in the hallway, you will agree with me that Christopher Nolan will no doubt take home a few Oscars this year. Sound Design, Cinematography, best Original Screenplay, Director and Film unless something monumental is released between now and then.\n\nOne scene alone should get Nolan the Oscar, and that being the city folding back on itself.\n\nMost films this year are like sitting down to a bowl of potato chips, Inception is like sitting down to the juiciest thickest most filling steak dinner you've had in years. Inception opens Friday July 16 5 out of 5 Stars Jay Fox"
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "laura_macleod",
        "review_rating": "",
        "review_title": "Totally simple story for an idiot dressed up with special effects and nothing more",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "JBreez",
        "review_rating": "10",
        "review_title": "Pure Stimulation For Your Mind",
        "review_detailed_main": "I had the honor of seeing a pre-screening of this film tonight in Dallas. Now, I have seen lots of movies in my time, but this movie is by far...excellent. I am simply amazed at Christopher Nolan for blessing us with this film...i truly am.\n\nThe trailers can only give you so much and I'm so glad they don't go too much in depth with the plot. You are literally drawn into the movie.\n\nActing=10, Cinematography=10, Story/Plot=10, Mind Stimulation=10+ I cannot wait to read more reviews on this film. It was well worth 2+ hours and I am positive that I will be seeing it AGAIN later this week when it opens in theaters.\n\nGO SEE IT."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "sayans-world",
        "review_rating": "10",
        "review_title": "After DI Caprio' magic with SCORCESE...It's time 2 see the pairing of 2 BRIILIANT people with a completely different piece of A MASTERPIECE....",
        "review_detailed_main": "When i see any upcoming NOLAN films, i cannot hold my nerves together...Starting from the sheer brilliance of MEMENTO,THE PRESTIGE,THE DARK KNIGHT n all perhaps he is the most talented and thought innovative director in Hollywood..In other words, unless u see a NOLAN film till the climax , u cant't predict it's ending n that's what i like about him...He simply keeps puzzling the past and the present in perhaps the most thoughtful way... Coming 2 the film, its another gem of a work by Di Caprio after SHUTTER ISLAND...N wen u have casting like MICHAEL CAINE,ELLEN PAGE,Joseph GORDON- LEVITT etc its surely a must watch..I can assure u that u cant't even leave a single second while watching the film..It's a sci-fi,thriller directed by NOLAN..That says it all... Afterall \"YOUR MIND IS THE SCENE OF THE CRIME\"... Frankly speaking a must watch movie without any doubt...."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "blackmambamark",
        "review_rating": "9",
        "review_title": "More than just an aMAZEing movie",
        "review_detailed_main": "Only a small handful of directors have the ability to make an audience wait on pins and needles for their next NON sequel release. For me, i cannot remember the last time i was this excited for a movie i know virtually nothing about. Now i know i may be speaking on my own here, but director Christopher Nolan very well may be the best director of our generation. Because the guy has not missed so far. \"Memento\", \"The Prestige\", The Batman Series......the guy is a loose cannon who fires nothing but cinematic gold. As time goes on, he only seems to get better and better. Hopefully he can continue the re-occurring trend.\n\nOkay, let me get this off my chest, because it feels like an alien ready to burst out of my chest........this is easily one of the 10 best movies i have ever seen in my entire life. And that is not because i built this up in my mind or bought into the hype generated around this film, because everything i thought this movie was going to be, fell short of what it actually was about 20 minutes into it. This movie is cinematic genius at it's best, plain and simple. We have been due for a movie like this for a loooonnngggg time. And i don't mean this year, or the recent string of poor movies that have been released......i mean we are due for a movie that actually changes the way we look at movies. Now i know one would be quick to say \"Well wait a minute, Avatar already did that.\". But that is where you would be wrong. James Cameron gave us a feast with \"Avatar\". This movie cooks you an entire Thanksgiving dinner.\n\nI could honestly sit here and try as hard as i could to try and describe the movie to you, and it wouldn't make a lick of sense because the movie is beyond in-depth. Case in point.....you remember the first time you saw the first \"Matrix\", and how complex and deep the plot was. Well, in words, this movie makes that idea look like \"Kindergarden Cop\". No disrespect to \"The Matrix\" at all, but this movie is probably the most in-depth, detailed, complex, and entertaining movie ever created by man.\n\nAnd that's all Nolan seems to do. He creates these scripts that almost take a life of their own. You get a glimpse of it in \"Memento\", and you certainly see it in action with \"The Prestige\"......how the actual plot outline and story, is the actual trick. In this movie, it deals with mazes, and in turn, the whole movie is like a giant maze that you try and figure out.\n\nBut that's where Nolan's true genius comes in. Through out the entire picture, he gives you these little clues as to whats going on, like a puzzle, and he shows you how they all get put together, rather than putting it together for you. He leaves it up to the audience to do so. And that's what makes this movie great, because he challenges the audience like no other movie i have ever seen.\n\nAnd speaking of things i have never seen. In order for a movie written this well to work, it must be shot in the same fashion. And Nolan, once again, out does himself. If you are a fan of cinematography, as i am as well, then this movie, literally, is your wet dream. Talking about these elaborate dream sequences is one thing, but seeing them in action is beyond anything you have ever seen on the silver screen. Throughout the entire film, i kept taking a napkin to my face to wipe the clumps of drool that were collecting at the bottom of my jaw.\n\nBottom Line, this is a movie i could write a novel about, and it certainly deserves that attention. To pretty much sum it up, if you want to see the movie that is going to win best picture of the year, go and see this movie. If you want to see one of the best movies in the past 10 years, go and see this movie. If you want to see a movie that will pretty much change your method of thinking, then go and see this movie. God only knows how many movies i have seen in my lifetime, but i can say with complete just, that this is certainly one of the 10 best i have EVER seen."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "deepfrieddodo",
        "review_rating": "9",
        "review_title": "Requires Concentration",
        "review_detailed_main": "An incredibly unique film which deserves its plaudits purely for the intelligent world created. Whilst extremely complex, the 'science' allowing the story to unfold is explained for the most part, although I imagine everyone loses the plot on a first viewing at some point, for me I was okay until the very final Saito scene. It keeps you engaged throughout and I think (?) you're routing for the right people, although in reality the overarching reason to undergo the entire film is a little weak, possibly skimmed over, and purely a vehicle to discover the world of dreams.\n\nVisually it cannot be faulted, and the pairing with the music works excellently as well. You're constantly drawn into the film without it ever being something that will get your heart racing, more interesting than compelling. Having said that, it is really one of a kind, at least at this level, and so everyone should see Inception, if only to appreciate the depth Nolan went into."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "sa_online",
        "review_rating": "10",
        "review_title": "Nolan plays with a tense Narrative",
        "review_detailed_main": "I just saw inception last night and absolutely loved it. Everything is top-notch. Most of all, like in every Nolan movie, the editing is crisp. There is no room for even a smile. Action is unique and highly entertaining; although make a note there is no adrenaline rush during any action scenes. This is where Nolan's problem lies. We would have experienced that missing adrenaline rush if he had taken some time to develop the supporting characters, in order to make us feel for them. The only characters I felt for is Cobb and Mal. Their love for each other is shown beautifully, I personally have never seen a relationship explored in this unique way. The only reason I can think why Nolan didn't spend time on other characters is because of the plot he had to first explain and then execute. The plot is hard to explain let alone execute, Nolan did a very good job given the short amount of time. At the same time he had to make sure he did not loose the audience in confusion. A job well done. Now, what I really like about this movie, is the IDEA. Nolan has this great idea for a movie about dreams. On the surface the movie is loaded with multiple tense narratives, but in the background he's also exploring how powerful the medium of dream can be. Also at the same time he maintains the through-line of the movie. Not letting anyone forget why we are watching this movie, why we should care the protagonist reaches to a conclusion. Without the strong through-line we would be lost like in dreams. I think the best actor in the movie is Marian Cotillard. She plays her part with such a beauty I just can't describe. Leonardo also convinces us to fall for his motivations and makes us want him to accomplish his mission. Joseph Gordon-Lewitt also plays his part brilliantly, he is very straight forward unlike the earlier mentioned actors. The rest of the actors are just fine. Everyone Needs to see this movie if not because it is the best Sci-Fi movie after Matrix, then for the fact that it is the best movie of the year. If only Nolan can make a movie with this tight narrative and make us fall for the characters at the same time; your heart will stop beating. 10/10"
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "casualobjection",
        "review_rating": "9",
        "review_title": "Incredible movie",
        "review_detailed_main": "This movies is a masterpiece by one of he greatest directors Christopher Nolan. And he made it in some way that the twists and turns are the best of the best of the best. I also appreciate the actors in this movie. I especially liked DiCaprio, Tom Hardy , Gordon Levitt."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "hot_action_ninja",
        "review_rating": "7",
        "review_title": "Christopher Nolan continues his climb to the top... of the most overrated directors list",
        "review_detailed_main": "If there was ever a film to label as \"overrated\", it would be The Dark Knight. If there was ever another film to label as \"overrated\", it would be Inception. I just don't understand what it is about Christopher Nolan's films but they have the tendency to receive large amounts of unwarranted and undeserved praise.\n\nWhile they are very well-made films, they are for the most part nothing more than entertaining popcorn flicks (Memento being the one exception). Popcorn flicks of the up-most quality but nothing truly memorable or deep. Now that I have gotten that out of the way, lets get on with the review.\n\nNow, basically, Inception is a heist film with a twist. The heists take place inside of a dream, thus allowing for some creative and tricky special effects to be pulled off. These effects are pretty amusing to watch, most notably a scene where the gravity of a hallway is shifting and the two actors are duking it out amidst the gravity shifts, and this makes for some impressive-looking chaos.\n\nThe story while somewhat original, wasn't pulled off as smoothly as it could have been in my opinion. There were just far too many plot holes that you could drive a tank through. Now with a certain proper ending, these plot holes would diminish, but Nolan has yet to confirm just what the ending means so the plot holes are left intact. If you want a better idea of what I mean by that, PM me.\n\nActing for the most part is good and gets the job done. Just don't expect anything Oscar-caliber here. If there was one stand-out performance in Inception, I would definitely say it's from Leo Dicaprio. The guy proves time and time again that he's one of the better young actors working right now. The rest of the cast gives passable performances, but nothing special. Michael Caine is wasted, and I feel the only reason he was hired was to get his name on the box.\n\nNot much needs to be said about the special effects. They're some of the best yet, and at times even creative. Possibly the strongest aspect of the film, next to the effects, is the musical score. Inception has one of the best scores in recent memory. My hat is off to Hans Zimmer. The effects, score, and flawed but intriguing story come together in making Inception a very enjoyable and entertaining film. It's definitely smarter than your average popcorn flick, but at the end of the day it's still just a popcorn flick. Nothing more, nothing less. It lacks the emotional punch and attention to detail that made District 9 so great (now that's a true masterpiece, and one of the greatest sci fi films ever made).\n\nI give Inception 7.5/10 and highly recommend it to anyone looking for a fun film that will also make them think a little bit."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "agreaves-8-151592",
        "review_rating": "5",
        "review_title": "Lost in its own complexities",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "bob the moo",
        "review_rating": "",
        "review_title": "Not all the hype suggests but still an enjoyable action thriller built on a good concept and encourages thought afterwards",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "moeedsheikh8-225-673296",
        "review_rating": "9",
        "review_title": "What a GREAT Movie !!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "DICK STEEL",
        "review_rating": "10",
        "review_title": "A Nutshell Review: Inception",
        "review_detailed_main": "Action aside, there will be some who will liken this to the Wachowski Brothers' Matrix, given its similarities in combining science fiction with philosophical existentialism issues, with cutting-edge action seemingly beyond its time. Nolan goes one up however, with this attempt as he, like Neo, goes beyond the computerized world of the Matrix, where it's still a construct led by binary ones and zeroes, good and evil battling it out under black and white rules. Rules that one cannot escape from since they are what binds our universe together. Here Nolan goes into that untapped power of the mind, the dream worlds that we create in our subconscious, where the dreamer has everything in his subtle control, where anything goes as far as the imagination dare venture beyond physical limitations and rules.\n\nThis allowed for such a film to be created from a simple idea with a bank heist premise having its skill-based assembled team break into unsuspecting victims to steal ideas locked away in the mind. Nolan loves to tease and test the audience, not lulling us into complacency, with Inception beginning in the thick of the action with tremendous questions being asked as we try and digest the multitude of information thrown at us, with the whys and the what ifs answered in due course, needing to pay attention to subtle details, ideas and concepts to make the film work.\n\nWe follow Cobb (Leonardo DiCaprio) and his lieutenant Arthur (Joseph Gordon-Levitt) as information hackers and social engineers of the new age, offering their services as the black and white ops type either to teach corporate honchos how to defend against like-minded and skilled peers, or to be engaged by these same industrialists to steal information from the competition. With the promise of being able to return to the USA without being arrested at immigration, Cobb accepts the challenge posed by the Japanese Saito (Ken Watanabe), to assemble an A-Team to plant a seed of thought and an idea, known as an inception, into his business enemy Robert Fischer Jr (Cillian Murphy). It's an almost impossible task, but the promise to see his kids again makes Cobb recruit the likes of Ariadne the architect (Ellen Page), Yusuf the chemist (Dileep Rao), and Eames (Tom Hardy) the thief.\n\nLike the layers that the characters navigate through, the film is equally layered with engaging subplots that expand the depth and breadth of the characters involved, the largest one involving the mystery behind the disappearance of Cobb's wife Mal (Marion Cotillard) who now lives only in Cobb's subconscious, and always find a way to thwart his grand plans, making Cobb more of a liability with this unspoken handicap that gets worse as the challenges facing the team grows. The story unfolds like a planning of that perennial big bank heist job, with conflicts between members, the building of skills and the meticulous planning all coming together with so many external variables, that seeks to test the skills of every member to the extreme. And that's what makes the film so terribly engaging, while dealing with emotions and romance, obsession and selfishness, which if I may jest, seem to reflect a side of modern day relationships where sometimes one can get tired and need to seek an exit from constantly being with someone else, 24 hours a day, with nobody around.\n\nDiCaprio with his name sprawled over the poster above the other cast, delivers that pitch perfect flawed lead character that Nolan has a knack to create, and brought to life by DiCaprio's performance, having the actor showcase a wide range of emotions as a man desperate to hold onto what he deems dear, with hidden secrets so jealously guarded, living and repeating his pain through the constant re-visits to his memory, breaking all rules of the game as told to his protégé Ariadne. Ellen Page holds her own against the seasoned thespian in two scenes which is bound to generate some gasps for the special effects generated as she picks up the necessary skills for the job, in what would be a Neo-like discovery of how seductive a limitless world could be.\n\nI can't rave enough of how Nolan got to elicit wonderful performances from his cast of stars, where little nuances can mean so much, without even saying a word. A flick of the eyebrow, a glance at someone, paint that picture to tell a thousand words. Better yet, Nolan's own ability to hold your attention with his storytelling ability and delivering no less than four stunningly created realms all happening simultaneously, each with another as a constraint or a condition to kickstart a chain of events. You're always left guessing whether the team can accomplish their mission, and there's always that constant threat of danger that seeks to derail everything they thought of in their combined state of comatose, What George Lucas does with those simultaneous theatres of war in the finale of each of his Star Wars films, Nolan does it better with just this one, as he puts that grip around you as we flit from one stage to another. There's absolutely nothing quite like the experience of having seen something great, and want to savour it all over again soon.\n\nInception is best experienced on the big screen, and Christopher Nolan has done the ultimate in performing just what the characters of Inception had set out to do, sowing the seed of a premise and concept that holds so much promise, then delivering that promise with aplomb, so much so that you'll want to continue living in that world created by the cognitive senses interpreting what's on screen, then fantasizing on it a lot more with the subconscious. Inception is definitely one of the best this year, if not THE best film of 2010 thus far. Don't miss this film!"
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "TourettesPersonal",
        "review_rating": "10",
        "review_title": "A Brilliant Piece",
        "review_detailed_main": "There is no way \"Inception\" will be a bad movie because it was directed by Christopher Nolan. There are many words to describe this movie and those are: mind-bending, imaginative, exciting, overwhelming, entertaining, and awesome. \"Inception\" might be the only movie this summer that has an original concept.\n\n\"Inception\" is very unique and it is fresh to everybody. The visuals were overwhelming. The action scenes are awesome. The CGI effects were realistic and eye candy. The story is interesting and mind-bending.The performances were great. Leonardo DiCaprio is still a great actor. Tom Hardy and Ken Watanabe are one of the best parts of the movie. Cillian Murphy is disappointing though. Joseph Gordon-Levitt's performance is flawless.\n\n\"Inception\" is mind-bending and non-stop entertaining. Once again Christopher Nolan made another successful blockbuster. \"Inception\" might be the best movie of the year."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "abcprivateemail",
        "review_rating": "8",
        "review_title": "The pieces are amazing, but the whole is \"only\" very good",
        "review_detailed_main": "The pieces of the movie are amazing: 1. Hans Zimmer's music is hauntingly beautiful, probably my favorite movie score ever.\n\n2. The premise is unique and fascinating 3. The special effects are amazing and don't distract (unlike some Pierce Brosnan Bond movies). They fit into the plot perfectly.\n\n4. The acting is very good.\n\nBut the assemled pieces make the whole only very good, not amazing: The movie is just too big, and they had to edit it to cut it down to essential info and scenes, resulting in a slightly unnatural flow that feels like trying to drink from a fire hose shoved in your mouth. A mild, subtle infodump feeling arises at times. There are no natural lulls or pauses to digest info. The first time watching you will feel absolutely lost for the first 45 minutes or so unless you read spoilers first, due to a combination of that flow and some out of sequence story telling. The 2nd time watching will be much more enjoyable than the first... it is that lesser enjoyment the first time through that keeps it from being amazing, knocking it down to just very good. There are two main storylines, one mostly in the present, the other about the main character's past...found myself wondering if the latter could have been less prominent or even cut to focus more on the former."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "hnt_dnl",
        "review_rating": "8",
        "review_title": "Very entertaining, but NOT some influential masterpiece!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "pink_chloee23",
        "review_rating": "10",
        "review_title": "Amazing!!!!!",
        "review_detailed_main": "I got the opportunity to see this movie a week in advance :). Let me just say it is no disappointment in every witch way! As most of Leonardo's movies are good this one is even better! it will blow your mind, so yes i recommend everyone should see it even if you like Leo's work you will still enjoy this movie. Moments in the film keep you at the edge of your seat waiting to find out what happens next. I fell in love with this movie because of its originality and the imagination that took in to realizing this movie, Christopher Nolan has yet again made another great movie. All the cast members did an amazing job with Inception. Thank you for making this movie, I'm sure i will see it plenty more times!"
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "altamishsiddiquee",
        "review_rating": "7",
        "review_title": "Over long, Pretentious twaddle",
        "review_detailed_main": "This is not a bad film per se, had it been about 30-40 minutes shorter I would not have been too offended. But I'm genuienly perplexed as to how people can rave over it-#13 on all time list at time of writing!! There is virtually no character devlopment the plot overly complicated and riddled with holes and contradictions. Frankly you don't need to suspend disbelief so much has have it surgically removed and flushed down the toilet. By the end I was wishing I was in a dream within a dream policed by a completely arbitrary set of nonsence rules - any thing to get me out of that chair."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "jamesfoley-45668",
        "review_rating": "5",
        "review_title": "Can't believe it's rated this high",
        "review_detailed_main": "That fact this movie has an 8.8 Rating shows people's desire to be perceived as being intelligent. This movie is unnecessarily complicated for the sake of being complicated. The story telling is terrible. If a character in a story has to tell the audience directly what the hell is going on the story sucks. A lot of Christopher Nolan's stuff is like this. Whenever someone hears criticism of Inception the first line of attack is \"you just didn't understand it\". I understood it, just didn't like the way it was presented.\n\nHaving said that Christopher Nolan has a lot of original ideas and some of his stuff is good. He is still one of the only director's today that uses practical effects. The hallway rotating scene with Joseph Gordon Levitt was a practical effect and was amazing. Scenes like that was the only reason I rated Inception a 5/10."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "dpvog",
        "review_rating": "",
        "review_title": "Wow... I love a great story!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "schultizzle",
        "review_rating": "10",
        "review_title": "Inception...Great Movie! One of My New All Time Favorites!",
        "review_detailed_main": "I got an invite to a free prescreening of this movie! I had been seeing some previews of the movie but I hadn't really listened to what the previews were saying at all. I hadn't read anything about what the movie was about. So I went into it without any kind of expectations what so ever.\n\nI love Science Fiction and this one did not disappoint!! I thought it was a great movie. If you have a chance to see it on some kind of digital projection or IMAX do it. An old film reel theater just wouldn't do it justice.\n\nIt is pretty action packed, lots of twists and turns, gets a little deep, and leaves you thinking with a little bit of a hanger at the end. Phenomenal cast! I would pay money to see it again and recommend everyone to go see it when it opens Friday! Two Thumbs up! -StEpHeN"
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "with_the_flames_i_die126",
        "review_rating": "10",
        "review_title": "It's true: Christopher Nolan can do no wrong!",
        "review_detailed_main": "I am not the first to claim this, I read that on a Prestige or Batman Begins board. But now I am in complete agreement with the one who said it. Inception can arguably be Nolan's best work yet, improving upon the juggernaut which was The Dark Knight. But before I comment on Inception, I want to review Nolan's work first, shedding light on the true genius he is.\n\nIt all started with a short called Doodlebug. I won't spoil anything, because the film is about three minutes long, but Nolan starts one of his trademarks: the twist. I don't have a link but I know it is online and a few searches should yield a result of the short. If you like Nolan and his work, check it out.\n\nThe next was Following, an ultra low budget film (around $6000), about a young man who follows people just to see what they do and where they are going. He also meets a character named Cobb... interesting name. It features Nolan's next genius trademark--the use of non-linear storytelling. Overall a nice low budget film worth spending an hour and ten minutes on. I recommend it.\n\nNow on to the complete mind f**k that was Memento. It is this film that Nolan perfects his non-linear storytelling. Shown in almost complete reverse, Memento follows a man named Leonard with a rare condition in which he cannot form new memories. We learn early on he only lives for revenge. HIGHLY recommend if you have not seen it yet. It really sets the standard for non-linear storytelling.\n\nInsomnia was Nolan's third full length film, and yet manages to add something else: an all-star cast. It features Academy Award winners Robin Williams, Hilary Swank, and finally, one of the best actors of his generation (maybe ever), Al Pacino. Pacino plays Detective Will Dormer sent to Alaska to investigate a murder. Again, plot twists and non-linear structure are used in this film. It is my least favorite of Nolan's films, but that doesn't take away anything from it. It is still very good.\n\nNow to the film that put Nolan on the map: Batman Begins. The Batman franchise was all but dead in the water until Nolan got his hands on it. Now it sets the standards for super-hero movies. Non-linear storytelling, a great cast, and plot twists are all perfectly placed in this. I personally view it as the second best super-hero movie ever made, and is, in my opinion, a great movie altogether.\n\nTo break up the Batman films, Nolan did a little movie called The Prestige. Telling the story of two magicians, they are first friends, then become rivals, then end up as enemies. Starring Christian Bale and Hugh Jackman and Michael Caine, another all-star cast is present. The non-linear structure in this movie is genius, so be prepared to think a little bit. Overall a great film and one of my favorites.\n\nNow for the one everyone knows. I cannot say enough about The Dark Knight. One thing I can say is it was the first movie to exceed my expectations when they were that high. Heath Ledger's joker is my favorite character ever portrayed on screen, and will be for some time. His Academy Award is well deserved. His passing is such a shame. And although The Dark Knight did not get the Best Picture nomination, or win, it certainly had effects on the Academy. By public outrage, the 2009 Academy Awards featured ten Best Picture Nominations instead of the usual five. Without The Dark Knight, movies like Inglourious Basterds, District 9, and yes, Avatar would have never come close to being nominated. It was definitely the best film of 2008, the best superhero movie ever made, and my favorite movie ever.\n\nUntil about forty-five minutes ago. That's when Inception ended and I sat staring at the credits to what I had just witnessed. I am still thinking about how the movie ended and it's safe to say I will be watching it at least two more times on the big screen. It surpasses The Dark Knight in terms of how big it is by a long shot. The acting was stellar by everyone, especially Leonardo DiCaprio. It's a bit early, but I think a Best Actor Nomination should be in order. Also another trademark of Nolan, the casting of Michael Caine. It's the fourth consecutive film to feature him.\n\nNow on to the best aspect of this film, the storytelling. Again, the non-linear structure is used, and is as perfect as it gets. Every shot has meaning. All the dialog by the characters is relevant. Some may complain it is lengthy, but if anything was cut, things would start to be confusing. I could write page after page about how good the story was, but you have to see it to truly experience it. The tag line 'Your mind is the scene of the crime' is all you should really know going into this movie. I personally avoided (painfully, i might add) every trailer, synopsis, and review i could of Inception before I saw it.\n\nThis movie is not for everyone however. It is not a late night, brainless action movie like Crank or 2012. It requires the audience to have smart brain-think. So on a scale of 1-10, Inception is about a 12. This, without question, the best movie of the year. If The Academy snubs Nolan out of this Oscar, I think I might kill someone. He should have the Best Director award in the bag. However, to truly enjoy it, you have to pay attention. It's complex, but never confusing. If you enjoy a great thriller that is anything but straightforward, this is the movie for you. And be prepared to use your mind. =]\n\nAnd that's all I got. 10/10"
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "lovemichaeljordan",
        "review_rating": "10",
        "review_title": "More than just a movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "onelyfunitd",
        "review_rating": "10",
        "review_title": "The Masterpiece of our generation",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "telia007",
        "review_rating": "10",
        "review_title": "Ingeniousness meets harmony in a not so imaginary future!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "fifibelle",
        "review_rating": "10",
        "review_title": "Mindbending, amazing, multi-layered gem!",
        "review_detailed_main": "Do not let anyone tell you anything about this movie before you go see it. It is best experienced with thrilled expectations -- and you will not be disappointed. The acting by all cast members is terrific, the story line is amazing, and the special effects are breathtaking. I am so honored to have attended a sneak preview of this movie. The theater was packed without one empty seat and the crowd was so into the movie, it was silent until the end. Their reaction at the end was loud and vocal. I will admit that I got a terrible tension headache from the intensity of being a part of this experience. But I will never ever forget the movie. I also must admit there were several times while watching the movie that I wanted someone to explain things to me (I commented to my husband -- WTF?) but rode it out, thinking, comprehending and understanding. I do think that younger people will \"get\" the story better than older people, since they play multi-tiered level games, so the concept won't be so difficult to wrap their brains around it. Outside the theater afterward, no one would leave -- they just stood around talking about it, reliving scenes, ideas and concepts. This is THE movie to see!"
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "Farhad_Aziz",
        "review_rating": "10",
        "review_title": "A movie that will take your breath away.",
        "review_detailed_main": "From the starting till the end, it was dream and dream. At the ending for sure everyone will sit breathlessly and ask himself.... How a movie can be this good."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "parrot007",
        "review_rating": "9",
        "review_title": "Brilliantly creative and well realized.",
        "review_detailed_main": "Inception is a movie you just have to see before you judge it. Maybe you should even see it twice. There are a lot of complex ideas here, and the movie spends a good chunk of time explaining them in the opening act. That main idea though, is something very unique and creative that is brought to life by outstanding filmmaking, everything you'd expect from a Christopher Nolan film. Writing and performances are also great across the board. The only problem with Inception is in ones own interpretation. Some may says it's pretentious and the ideas presented acctualy aren't fully understood by the creators and/or don't make sense. But I think that's a terrible angle to approach the film. It's Sci-Fi, you're not supposed to over-anylasie it in that way. It's meant to plant thought provoking ideas in your head, which I beleive it does very well, not be a perfectly logical and plausible idea. Yes, it does have a few questionable sequences and scenarios, esspecally at the end, but it doesn't drag the rest of the movie down at all to me. It's a must watch"
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "rjw930",
        "review_rating": "6",
        "review_title": "Not bad, but definitely not genius",
        "review_detailed_main": "Inception is one of those movies that \"engaged\" film-goers will mistake for genius. Let me explain my theory on people and movies. There are three types of movie-watchers: passive, engaged, and intelligently engaged. Passive people will watch Die Another Day and like it just as much as the Bourne Identity. They don't go to the movies to think, they go to be entertained by cool effects and witty one-liners. Engaged people think they know what they're talking about, and generally love movies that are edgy in plot and execution but conventional enough to understand, like Fight Club and the subject of this review. They believe themselves to be refined in cinema, but, in reality, just don't quite have the intellect, cinematically speaking, to pull it off. Intelligently engaged people will appreciate the complexity of Inception, but also recognize it's a little sloppy, self-serious, over drawn, and empty. They recognize its audacity, but don't pretend like it is Kubrick or Paul Thomas Anderson. Suffice it to say, most people who fall into the engaged category will try and pretend that Inception is a 'masterpiece' and that they know everything about movies. They don't. Inception is clever, but it doesn't rank anything above respectable.\n\nThe premise is ingenious, and Inception is able to live off its sheer mind-bendiness for the first 45 minutes. Leo is a specialist at entering people's minds through their dreams and extracting, or in this case, planting information. The dream world Nolan creates is so exciting and unpredictable that the audience, me included, couldn't care less about the actual story line. Unfortunately, when the magic wears off and the extravagantly overlong climax starts (almost at the midway point), things fall apart.\n\nThe first problem is the eventual goal of the whole operation is seriously anti-climactic. As far as I could tell, they're trying to break up some obscure monopolistic multi-national company for a rich CEO, who in turn will give them large sums of money and Leo a way back to his kids. Sound under-developed? It is. Nolan never really fleshes it out. He is too busy creating spectacularly slick effects to get caught up in silly things like crucial plot points.\n\nWhen Inception hits its final profligate culmination (the climax inside the climax), I couldn't help but notice how empty it all was. Nolan makes the mistake of thinking multiple things happening at once equals suspense. In an effort to ratchet up the intensity, Nolan piles on at least 5 simultaneous plot-lines that climax at the same time. All this serves to do is suffocate the little suspense that had been built up. There is literally a fifteen minute stretch where Hans Zimmer's deafening score blares and Nolan annoyingly flips through the parallel actions like an ADD-afflicted friend who can't decide what channel to watch. It's mind- numbing, not to mention confusing as hell. One of these little subplots is particularly ridiculous and consists of a guy running around a snowbound bunker shooting people for the whole 15 minutes. Cutting-edge techno thriller? At this point, I was thinking more along the lines of a Roger Moore Bond flick.\n\nFor all its structural faults, the single most damning aspect of Inception is its complete lack of heart or emotion. The one remotely human thread in the film deals with Leo and his mysterious dead wife. This thread is drawn out to excess and becomes more and more incomprehensible as the movie progresses. Inception seems to delight in keeping the audience in the dark regarding if Leo's wife is real or just a projection of his subconscious. Inception thinks it's awfully clever, but it's hard to feel emotion towards characters that you're not even sure exist. Near the end, I found the dialog between the unhappy couple completely devoid of meaning, made worse by Nolan attempting to give it resonance through close ups of people crying and a climaxing score.\n\nDespite the fact that the majority of this review deals with Inception's shortcomings, I actually like the movie as a whole. For all of its faults, I was grudgingly won over through Inception's pure style and visceral power. Nolan occasionally strikes brilliance, especially in an early scene where a dream explodes around Ellen and Leo in slow-motion virtuosity. This movie is not the genius many will claim, but it's not so bad either. Give it a shot, just don't expect to dream about it afterwards."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "ashleybelsham",
        "review_rating": "5",
        "review_title": "Are you people watching the same film as me!!????",
        "review_detailed_main": "OK here goes. I'll prepare myself for an ass kicking.\n\nI finish watching this film thinking are you guys really watching the same film as me!!?? Does this film really deserve 9.1 out of 10??? (1st sept 2010).\n\nI found this film incredibly frustrating. So I guess at the start you learn what a cool concept the film is based on. Nice idea. Very interesting. So why take over 2hrs to get to the point!!?? I fell asleep twice whilst watching it and still managed to catch the end - not feeling that i'd missed anything important.\n\nI didn't really like the characters. In these films you tend to connect with as least ONE character but I didn't feel it here at all.\n\nSo some of you like the FX?? Yeah that ONE scene they used in the trailer. The one they sold the film on.\n\nOh yeah. The last rant....i cant stand films where they introduce rules and details that only apply in the next few scenes. It so annoying and predictable. They do that a lot in this film.\n\nSo anyway. I left asking myself and the other people I saw this with why this film is so overrated and there are a lack of bad reviews about it. We concluded its one of these trendy films that are meant to be clever and intelligent. I think people will be afraid of saying bad points about this just in case it suggests that they don't understand the concept. I for one did understand it, I just didn't like it. I certainly don't think it deserves 9.1 out of 10.\n\nMy suggestion....just go and rent Matrix or Minority Report or something like that. Clever, visually brilliant AND enjoyable."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "MTNmovieMan",
        "review_rating": "",
        "review_title": "Inception = deception by insipid reviewers",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "Arcanjo93",
        "review_rating": "10",
        "review_title": "An idea is hard to remove.",
        "review_detailed_main": "Amazing movie. I was fascinated with the idea of controling our dreams the I even looked up on lucid dreaming. But I just get no results :D"
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "bitsnumber1",
        "review_rating": "8",
        "review_title": "Christopher Nolan is genius",
        "review_detailed_main": "Nolan is careful never to let the scope of the film overwhelm the human element and this is a key reason Inception works as well as it does. The acting, from a great ensemble led by DiCaprio, is as good as it gets. In terms of sheer originality, ambition and achievement, Inception is the movie of the summer, the movie of the year and the movie of our dreams. world need directors like Nolan,Spielberg,Cameron, As with his previous movies, Nolan displays a knack for choosing actors who can best embody the characters in his films. While DiCaprio's role here may be reminiscent of that in his earlier Shutter Island, there's no question that he anchors the movie with a perfectly calibrated performance that is equal parts intense and heartfelt. The rest of the supporting characters fill out their roles just as vividly- Joseph Gordon-Levitt radiates confidence and suavity, Ellen Page displays suitable wit and grit, and in particular Marion Cotillard exudes both sultriness and danger in an edgy yet eventually heartbreaking performance.\n\nBut \"Inception\" is Nolan's vision through and through- and in fact, a visionary director and a master filmmaker at that. Many years Nolan spent refining his screenplay, and it shows in the great detail and complexity that makes \"Inception\" both an intellectual and visceral enjoyment- just take the names of the various characters, each of which have a special significance. With \"Inception\", Nolan invites you to open your mind to possibilities- possibilities of alternate realities, of complexities beyond the conscious mind to grasp and most importantly, of the power of imagination. It is that rare gem of a film that is so multi-layered, so profound and so fascinating that you'll want to experience it again immediately after you've seen it- just so you can fully appreciate its genius."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "nk4263",
        "review_rating": "10",
        "review_title": "A movie that you 'll never forget...",
        "review_detailed_main": "Dom Cobb (Leonardo DiCaprio) is a skilled thief, the absolute best in the dangerous art of extraction, stealing valuable secrets from deep within the subconscious during the dream state when the mind is at its most vulnerable. Cobb's rare ability has made him a coveted player in this treacherous new world of corporate espionage, but it has also made him an international fugitive and cost him everything he has ever loved.\n\nNow Cobb is being offered a chance at redemption. One last job could give him his life back but only if he can accomplish the impossible—inception. Instead of the perfect heist, Cobb and his team of specialists have to pull off the reverse: their task is not to steal an idea but to plant one. If they succeed, it could be the perfect crime. But no amount of careful planning or expertise can prepare the team for the dangerous enemy that seems to predict their every move. An enemy that only Cobb could have seen coming Inception 10/10"
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "billr672002-1",
        "review_rating": "10",
        "review_title": "Amazing",
        "review_detailed_main": "I've never done a review before so be gentle, but having attended the Irish premiere of Inception last night I felt compelled to write and tell people to \"go and see this movie\". If you only see one picture all year make sure this is it.\n\nAs people have stated dream movies have been done before however not with this style and 'complicated simplicity' (you'll understand what I mean when you see it).\n\nThe acting by everyone is first rate, if the emotional story of Cobb and Mal wasn't believable then the film would fall asunder however Di Caprio/Coitillard carry it off to perfection. Everyone else in the ensemble cast is terrific with particular mention to Tom Hardy (get this guy more work).\n\nUnlike many reviewers I didn't find the story difficult to follow although rapt attention is essential, and Nolan has delivered a story which doesn't attempt to talk down to you as I felt with the Matrix instead it draws you in and delivers in the last hour probably the finest piece of film making I've ever seen.\n\nThe end of the movie was met with rapturous applause and I realized my hands were shaking I had tears running down my face and sweat running down my back. Truly outstanding stuff, Christopher Nolan you're a genius."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "Danielpotato",
        "review_rating": "9",
        "review_title": "Didactic, but nonetheless a good movie.",
        "review_detailed_main": "Inception has a problem that I cannot bear: the constant that someone comes to explain the laws and how that world works. The creation of the character of Ellen Page (Ariadne) was for the sole purpose of explaining that to moviegoers. Not that it's bad, but at certain moments it seems like the movie becomes more class at school, to know how that universe works, instead of the characters in this movie live the adventure for themselves. In this aspect the film is didactic. And the space for the imagination is limited. In this aspect everything in this film is chewed, everything explained, where are the possibilities? I do not want someone to explain the universe, I want to see the characters live and react in this universe.\n\nYes the ending leaves open the question whether that is a dream or reality, but it is a cheap gimmick instead of letting them our imaginations fly. If at the end of the movie the experience of the characters was a dream, so it was waste of two and a half hour, at least the Matrix shows the characters in the real world, and that it was not a dream inside a dream. The tension and time invested would not be a waste of time\n\nNot that it spoils the experience of the film, but it disturbs in some parts, mainly in the middle of the film, when the group is preparing for the assault. The concept is good, but it should be presented in a simpler way. Clearly Nolan was very ambitious in the concept of this film. But Nolan is quite integral in the proposal of his films, and he tries to put unknown concepts to the general public in such a cohesive way, even with the problem of trying to explain everything and other problems of pace are easily forgiven. Nolan tries to do his best in each of his films as if his movie was his last, as if his life depends on it. A great honesty on the part of Nolan, and this I can and I want to enjoy. Nolan is such an honest guy and scores points with me. It's the difference between the lousy movie director and an excellent director. The bad elements of Inception are not enough to spoil its qualities. The ambitious ideas of the filmmaker and the great sequences in parallel assembly that characterize his works.\n\nNot that the idea of Inception is innovative, this idea has been copied many times in other works (Paprika, Synecdoche New York and The Matrix are the most practical and common examples). But it's the way Nolan puts these ideas in the big budget blockbuster. Let's be honest here. Smaller or lower budget films are not seen by the general public due to the absence of of large production values (a great soundtrack, great locations for filming or great special effects, etc). See these ideas or concepts in a great Hollywood blockbuster made with such quality and care, it is amazing. And these ideas are embedded in the drama of the film in such a cohesive and exemplary way; it is applauding Nolan's professional integrity. This is why Nolan movies are so well received, he tries to put in these Hollywood blockbusters something more, something common in indie or smaller films, but with the financial aspect of the great studios to provide a better technical quality.\n\nObviously there is quality on this movie; the large parallel sequences are exemplary. The parallel between the Van sequences, the hotel with the Joseph Gordon-Levitt (when character is awake in the elevator), the peak at the military base in the snow and the desolate city of Cobb and Mal is almost perfectly made with an all- encompassing soundtrack. Of course the sequences of action are lousy . And many dialogues are very weak. Two weaknesses in Nolan's movies.Bad things come with the good things. I suspect that the bad action scenes of Inception and Dark Knight were the reason why Nolan turned DKR into an action movie instead of trying to tell a good story, Nolan's ego should have been hurt by the criticism as he directs his action scenes in these two films. Particularly Inception and the action sequence in the snow with Tom Hardy. Too bad, sorry.\n\nBut the performances are amazing, particularly Marion Cotillard as Mal. There are many layers in the various characters which Nolan conducts with mastery and the way they are inserted into the film is almost perfectly. Particularly in the initial sequence (which I thought would be a scene to showcase special effects, and Nolan proved me wrong). Or in the scene between Ariadne and Cobb, when Cobb tries to explain how his wife dies, and then discovered new layers of the character to reveal that in fact, he did have to do with the death of his wife. Of course this will be important to the outcome of the film. It is this ability to put the scenes and the flashbacks in certain key moments of the plot that Nolan shows much quality, and one of his long lists of virtues.\n\nInception is a movie like any movie; it has its flaws, but also its virtues. But, for me the qualities overlap the defects, and in the end the movie is well worth watching. But is its legendary statute being worthy? If Inception was released in the 1980's would it have the same impact in that decade, as it had in 2010? Currently the commercial movies in Hollywood are in crisis. We live in an era of remakes, superhero movies and franchise fatigue without the studios or directors making an effort to improve with originality or at least with a little more original concepts. Inception's credit could be lower if today's Hollywood was not in such a decadent state. But nonetheless, Inception is still a good movie."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "julianx8",
        "review_rating": "9",
        "review_title": "This decade's Matrix - Sheer Awesomeness",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "paperback_wizard",
        "review_rating": "10",
        "review_title": "Two Words To Describe \"Inception\"",
        "review_detailed_main": "Christopher Nolan, the visionary director behind \"Batman Begins\", \"The Dark Knight\", and \"Memento\", has finally brought to life his project of more than twenty years. Featuring a cast of some of the world's greatest stars, both young and old, and having been filmed in locations in six different countries, \"Inception\", in the words of the L.A. Times, \"blends the best of traditional and modern film-making\".\n\nLeonardo DiCaprio headlines as Cobb, a con man who specializes in stealing people's secrets from within their very minds. Joseph Gordon-Levitt (\"3rd Rock from the Sun\") gives a remarkable performance as his partner in crime. Tom Hardy (\"Star Trek: Nemesis\"), Dileep Rao (\"Avatar\"), and Ellen Page (\"Juno\") round out a team of highly talented \"intrusion experts\". They are hired by Ken Watanabe (\"The Last Samurai\") to do the impossible: rather than steal an idea from their target's (Cillian Murphy, \"28 Days Later ...\") mind, they are to plant an idea through a process called \"inception\".\n\nThere are many words to describe this movie. \"Crime drama\", \"sci-fi thriller\", \"international intrigue\", and \"mind-bending masterpiece\" all would certainly be on the list. Nolan keeps you on the edge of your seat until the very last second, barely giving you time to breathe as you try to peel the layers and decide what is real and what is illusion. There are many questions to answer as you follow the characters ever deeper into the world of dreams. The greatest questions, however, surround Cobb himself and his motives.\n\nCobb is not your typical thief taking on \"one last job\". While his partner believes Cobb is just hoping to complete the job so he can see his children again, Page's character begins to suspect that he is seeking something more. She soon learns that Cobb is haunted by the memory of his dead wife, played by Marion Cotillard (\"Public Enemies\"), who does far more than simply distract him from his duties. After all, in the world of the subconscious, even the smallest distraction can take you in directions you never expected to go.\n\nLike the layers of the dream worlds the team constructs for their marks, this movie is crafted to convey one story; one single point that comes delivered wrapped in marvelous visual effects, pulse-pounding action sequences, intelligent dialogue, and even a fair amount of humor. That single point, the two words I would use to describe this movie, is \"love story\". The great mystery of \"Inception\" is the story of Cobb and his family, his wife and children, what he has done to them, and how far he will go to recover them. While most reviewers may focus on the spectacular special effects or the unique storytelling elements, I believe the central theme of \"Inception\" is the unraveling of Cobb's character. Everything else is a vehicle for this storyline.\n\nAs a writer, I think this is one of the finest examples of good storytelling I've seen. As a moviegoer, I can't think of a better way to spend my money. I would recommend \"Inception\" to anyone, be they seeking an action movie, an art film, a mystery thriller, or a science-fiction wonder ride. For me, it is all those things and more; but at its heart, it is a poignant love story.\n\n(Read original review here: http://www.facebook.com/note.php?note_id=419359136543)"
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "MOOVYZ",
        "review_rating": "6",
        "review_title": "What a convoluted mess!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "mreesesh",
        "review_rating": "1",
        "review_title": "Overrated because it makes people \"feel\" smart...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "mikealike",
        "review_rating": "",
        "review_title": "Something is missing...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "charlotetoong",
        "review_rating": "10",
        "review_title": "Incredibly made, mind bending and an excellent film to rewatch over and over.",
        "review_detailed_main": "To be fair, the movie may be a bit hard to follow without any prior knowledge or for those who struggle with information overloads. However i found it an excellent film that kept me thinking and engaged. Few movies are this engaging as many feel like you- well, are watching a film. With Inception, you feel immersed in the film.\n\nIt is definitely a very thought provoking film and was very well shot. One of the best movies ever made, if I must say. It is an extremely clever film with an fairly original plot. The entire idea of dreams within dreams is fascinating and exciting as well."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "tomblakey-27156",
        "review_rating": "10",
        "review_title": "My number 1 movie",
        "review_detailed_main": "Inception is a spectacular movie with twists turns and incredible effects. Nolan blew my expectations away with this movie."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "petra_ste",
        "review_rating": "8",
        "review_title": "Dickian dreams",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "BeatlesFan3287",
        "review_rating": "10",
        "review_title": "Proof That Classics Are Still Being Made Today.",
        "review_detailed_main": "Once in a while, a film comes along that not only takes the cinematic world by storm, but also rewrites the rules of movie making altogether. Christopher Nolan's latest project, Inception, is one such achievement. Nolan had previously directed the masterpiece, The Dark Knight. That film gave us a whole new look into what a Batman film could be like. But with Inception, he creates something so new; so fresh and original that you wonder if even he fully understood it.\n\nInception is a film about dreams. Dreams are complex, surreal, and full of mystery; all traits that this film also exhibits. In Inception, Leonardo DiCaprio plays an agent who penetrates people's dreams. He is after their secrets, and the dream state is when people have their mental guard down the most. The problem is that anything can happen in a dream. We've all had dreams so we know this. This movie introduces the notion of what it would be like if other people were actually allowed in our dreams. Using the best special effects available, the production team has done their absolute best to portray dreams in a way that makes sense to the viewer, but still comes off as fantastic and incredible.\n\nI should warn you: the plot is not easy to follow. One critic who reviewed the movie wondered if it was too smart for general audiences to grasp. Personally, I found that regardless of how complex the storyline got, it pulled off the miracle of not seeming overwrought or unmanageable. This is clearly the trait of a director who has mastered his craft. However, a captain is only as good as his crew. The cast of this film seemed quite committed to the job at hand, and much of the supporting cast (which includes such talented actors and actresses as Ellen Page, Joseph Gordon-Levitt, Michael Caine, and Marion Cotillard) did just as great a job as DiCaprio. All this just goes to show how every little detail was treated with equal care and how flawless the whole production is.\n\nSome film buffs will argue that classics ceased to to be made years ago. I certainly don't agree with them, and this film is my proof. It also proves that even the biggest summer blockbusters can be intelligent and artistic. If The Dark Knight was the revolution, than Inception is the reign established afterward."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "sider0",
        "review_rating": "10",
        "review_title": "A head spinning, action packed, 2 1/2 hours of mind-bending Awesomeness!",
        "review_detailed_main": "All I could manage to say as I left the theater was, \"That was awesome!\" This is one of the best movies I have ever seen. From the story to the acting to the action, there wasn't anything lacking from this film. There are so many layers, not only in the plot but in the depth of story telling that go on in this film. I don't know how he fit so much story into a couple of hours and still it can make perfect sense. This is a movie you can watch 10 times, and I probably will, and still catch something you didn't see before. It was so easy to get caught up and forget you were in a theater and not actually in the room with the characters. I can't remember the last time I was so immersed in a film. I actually had to remind myself occasionally that it was only a movie. I loved everything about this. The action sequences were just amazing, I don't think these things have ever been done in film before. It was like watching a perfectly done live action video game. The mind twisting story keeps you guessing till the end, and even after. There was even a tragic but heart warming love story in the middle. To fit all of this into a film is just incredible. My advice to anyone, is to find the biggest screen in a theater you can and go see this movie. I don't even think an IMax screen is big enough for this gnarly piece of cinema."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "hanjhking",
        "review_rating": "9",
        "review_title": "Why?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "nogodnomasters",
        "review_rating": "10",
        "review_title": "Matrix light",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "ermhm",
        "review_rating": "6",
        "review_title": "Not bad, but overrated",
        "review_detailed_main": "Why are people going mental over this Matrix/Paprika wannabe? It's undeservingly credited for way to many things. Maybe I'm being too harsh since it's the best blockbuster in the last two years, but lets be honest. The first half of the movie is drowning in clichés and the rule 'show, don't tell' is not being utilized at all. Am I the only one who finds those tedious dialogues when they explain the whole plot (as if we were ten year olds) - really annoying? The real people in those situations would talk and react completely differently. That makes the character interactions and conversations barely believable and just empty.\n\nAlso, actors who play Saito and Mal are really destroying any credibility of the drama and tension movie has. Saito (besides being a Morpheus wannabe) always talks as if he was simply happy he remembered the lines. And why, oh why do they have such unnatural, bad and forced accents? Ellen Page was a bad choice too (another cliché - younger student learns everything sensei has to say in 2 min and then teaches HIM a lesson). DiCaprio wasted his talent here, his powerful acting was ruined by the forced tension of the movie and a lousy soundtrack (which apparently never stops).\n\nThe second half of the movie was better and combined with the end gave a certain satisfaction in terms of mental food. Nolan really is a master of plot and king of moments - unfortunately this is obviously becoming his biggest weakness. The overall impression is: it could have been a LOT better. It's not awful, but giving it a 10 and calling it a benchmark is just ridiculous."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "jacqueline-439-75489",
        "review_rating": "5",
        "review_title": "Not Memorable",
        "review_detailed_main": "This film has great effects. That is about all I can say because I found its plot instantly forgettable. Slickly directed, it is a visual treat.\n\nLeonardo D. is solid as usual, Ellen Page is good but she suffers from looking too young to have qualified as an architect.\n\nI would struggle to think of any reason to recommend this film to anyone to watch because beyond the sight of Paris folding over there is nothing else to recommend. Not enough tension within the plot so I didn't actually care about the characters.\n\nLooks good but not a great film."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "treyplemons",
        "review_rating": "",
        "review_title": "A dream inside a dream inside of my dreams....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "ddzsfp",
        "review_rating": "10",
        "review_title": "The best movie of all time",
        "review_detailed_main": "This movie is perfect. Best movie of all time. If you haven't watched it yet, please do."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "hell_boykissmyass",
        "review_rating": "10",
        "review_title": "You Want Something Different You'll Get Different",
        "review_detailed_main": "Well to speak Christopher Nolan's movie memento i saw some what quiet a long time ago i just came into the genre of unfolding events but it was an exceptional movie to watch and i said man i have to check out who is the maker of this film i was hoping for some biggie should be behind its making and then i came to know Christopher Nolan and for years he has done very less films and delivered us all his potential great movies to entertain the audience.\n\nAnd Now He Has done it again with another great movie inception such a remarkable movie you just get to know we have seen movies like the matrix and the talk about mind games movies but it is different from all others because Christopher Nolan has a different mind perception of all others who have tried a different acting is great and how the characters take you into it all you got to do is sit back keep your eyes and ears open and the rest will follow with you."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "adrongardner",
        "review_rating": "8",
        "review_title": "Give him the kick",
        "review_detailed_main": "Great ideas grow like a cancer. Sometimes you never really know where they come from.\n\nChris Nolan has never really had a totally original idea. Like Tarantino, he knows other movies so well, their ideas creep into his work, either intentionally or not. While my words on originality may come as inflammatory, my feeling toward his talent, and films is quite the opposite. He's good - real good. But he isn't original. Nobody is. This is the 21st century folks and its all been done. It is the way he's showing us these familiar things, that keeps us coming back.\n\nExcept for Di Caprio, who never really convinces as a brooding widower/father, the rest of the band is perfect. Not that any of them are actually interesting, the plot is the real character in Inception. Hans Zimmers score is majestic and hugely epic and Wally Pfister's familiar clean visuals make it easy on the eyes.\n\nMuch like a new roller-coaster at 6 Flags, Inception is a ride we've been on on before. Dreams, reality and all that jazz, but this one has a deeper dose of rabbit hole. We have a heist film set in the frame of corporate psychological espionage - whatever the hell that is.\n\nWe get Matrix style pseudo reality and weightless gun fights. We get The Game and Total Recall style onion layers. We get the old man in the bedroom of cubist proportions from the Kubrick 2001 finale. Maybe one too many James Bond ski battles. And I'm just getting warmed up. The wife story rings hollow - in fact, it's downright boring. Exposition goes in circles and we never do get enough Watanabe Ken. But it's that layered time of the tiered dreams that makes this one go boom. The elevator that can't drop and that van that just falls forever with the cameras over cranking at 150 frames per second or more. But we don't want it to hit the water. Go deeper Cobb, cause I don't want to get off this one yet.\n\nThe final joke with the unending spinner? This is Nolan's dream, not Cobb's.\n\nIt's not visionary, it's not original, but just like the meandering Dark Knight or the wretched nonsense of the Prestige, or the titanic plot holes of Memento, Inception is a rabbit hole that owns you til it's over. This ain't art or philosophy to ride to the top. It's just one great kick all the way down.\n\n8/10"
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "SomeoneFromADream",
        "review_rating": "10",
        "review_title": "MASTERPIECE! Highly recommend seeing this movie!",
        "review_detailed_main": "\"Inception\" is undoubtedly one of the most iconic science fiction films ever. It explains the idea of sharing a dream, accessing and changing people s mind. It tells the story of Kobb,the proffesional thief and the master of his craft. He enters the subconscious and steals the information, that his clients need. The only thing he regrets about is that he can't see his children anymore. But one day he receives a deal that will change his life dramatically. This operation seems to be infeasible, but Kobb accepts to risk everything for his family...\n\nThe special effects are fantastic,the plot twists are unexpectable and well-thought-out. \"Inception\" is a clever and heart-pounding thriller, which leaves you with a strange felling that our life is an illusion,a dream where everything is possible."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "ItsRobinTV",
        "review_rating": "9",
        "review_title": "The ultimate high concept movie!!",
        "review_detailed_main": "I've watched this movie because it has a great rating and because I love Christopher Nolan and in my opinion it totally deserves this great rating...it could maybe even be a little bit better...\n\nThere are tones of great stuff in this movie like the concept of dreaming which the whole movie is about and this is one of the greatest concepts I've ever witnessed. It just makes soo much fun watching these Characters do their thing...\n\nOn top of that the movie has such a great soundtrack. Hans Zimmer has once again topped himself. The actors also do their best to make the emotional scenes hit hard and they've done their Job really really well...\n\nThis movie is one of the greatest of all time in my opinion and you should probably watch it if haven't already."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "blehnk",
        "review_rating": "9",
        "review_title": "dreamy",
        "review_detailed_main": "I vaguely remember the time i watched this movie (which was a long long time ago), but i definitely remember being blown away by this masterpiece. I would love to experience something similar again."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "jeqcool",
        "review_rating": "10",
        "review_title": "Incredible!",
        "review_detailed_main": "My personal all time favorite movie.\n\nEverything about this movie is so perfect. The acting, the plotline, the idea behind the plot, the action, the emotion, the adrenaline, the soundtrack, the look. Such a beautifully well crafted movie that I keep understanding new things each time I rewatch it. I personally am more of an action kind of movie-watcher so keep that bias in mind. The movie admittedly is difficult to understand the first time you watch it, but is still quite enjoyable. But I love how the movie gets more enjoyable as you rewatch it. There are so many movies that I'm like \"eh, watched it, solid, wouldn't really care to watch again\" but this movie isn't made up of the \"movie junk food\" that's in most movies."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "mahadevwala77",
        "review_rating": "10",
        "review_title": "awesome",
        "review_detailed_main": "Brilliant technical wizardry Heady at least apparently so A ride more than a movie but a movie none the less Chris Nolan is rapidly becoming the director of his generation and i m longing to find out what is he trying to say He has established his technical power again and again but if I think of Memento for instance I remember the gimmick but not what the story was really about I suspect the same will be said of Inception I m not putting down I m just wondering I left the theater full of questions and nobody could actually give me any answers I m not talking about the plot but at the way Christopher Nolan chose to tell the story Leonardo Di Caprio is acquiring some extra gravitas as an adult presence on the screen Loved Cillian Murphy I always do Riveted by Tom Hardy Enchanted by Marion Cotillard"
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "eatpajdittsvin",
        "review_rating": "7",
        "review_title": "9/10, really? Must be some sort of flocking behavior",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "RIK-22",
        "review_rating": "1",
        "review_title": "Insipid – The pointless film.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "adlion944",
        "review_rating": "",
        "review_title": "Inception, 1 inch deep and a mile wide",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "eduardoantaramian",
        "review_rating": "10",
        "review_title": "Masterpiece",
        "review_detailed_main": "An entire masterpiece of Christopher Nolan. Very mind blowing movie but with an excellent story. Ten out of ten."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "kboool-05834",
        "review_rating": "10",
        "review_title": "Nolan never let you down",
        "review_detailed_main": "One of the best movies out there I highly recommend it"
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "ipawnyoucry",
        "review_rating": "10",
        "review_title": "He spent ten years writing his screenplay for \"Inception\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "ThomasDrufke",
        "review_rating": "10",
        "review_title": "Most Cerebral Nolan Movie Out There",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "joe_raja",
        "review_rating": "9",
        "review_title": "This is what I call a MOVIE !",
        "review_detailed_main": "Repeated views to understand a movie! That is what I call a MOVIE and this one of those. If you can, just watch in theaters.\n\nDream in a dream in a dream in a dream! Amazing concept and how they executed also marvelous.\n\nMust watch !"
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "throad-90112",
        "review_rating": "9",
        "review_title": "Still trying to wrap my head around this movie",
        "review_detailed_main": "Genius from start to finish. Unbelievable. I've been a fan of Christopher Nolan since Memento, but this takes his immense talents to the next level. I wouldn't trust this film in the hands of any other filmmaker. Truly."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "rusi-nikolov",
        "review_rating": "9",
        "review_title": "A masterpiece that everyone should watch",
        "review_detailed_main": "I'm a big fan of Christopher Nolan's work and according to me Inception is the masterpiece of it. Everything in this movie is perfect as per my requirements. There is enough mystery, action, drama, sci-fi and effects. The plot is perfect and Nolan did great in the development of that fantastic idea. I could not want nothing more from the script and the realization of it. As it comes to the cinematography Nolan was exceptional in what he have done in this movie. The final is a bit different and unexpected but perfectly made and all of the people who watch the film will be asking themselves the question: \"What happened?\".\n\nThe actor's play is great too, I think that Leonardo Di Caprio and Joseph Gordon-Levitt are awesome in their roles. It's not strange that Nolan is working with some of the supporting actors in more than one of his movies. Despite the most attention went to Di Caprio and Gordon- Levitt the others should not be passed. Ellen Page, Ken Watanabe, Dileep Rao, Cillian Murphy, Tom Berenger, Pete Postlethwaite and Michael Caine did great too. I want also to mention Tom Hardy. I didn't know him before Inception, but he is one of the actor who won my attention and I enjoy his acts in other movies too.\n\nAs it comes to the soundtrack, I think that just mentioning the name of the Hans Zimmer should be enough for the movie fans. According to me Zimmer is the best in the business. Once I checked his biography I was more than impressed with the fact that he made soundtracks for more movies than I could though. The most impressive part is that he did it for great ones, not just for some mediocre films. The soundtrack of Inception is one of the little that I listened after watching the movie.\n\nAccording to me it is quite normal that Inception won Oscars for cinematography, visual effects and sound, but still it is very strange that the academy awards for best movie, best actor and best writing were not given to Nolan's masterpiece. I really think that Inception is far better in every aspect than King's speech and I know that this topic is widely discussed but Di Caprio was great and deserved the award more than Collin Firth.\n\nAs a conclusion I will definitely suggest to everyone who didn't watched Iception to do it as far as he could, because he missed on the greatest movies ever.\n\nI gave 9/10 because 10/10 is waiting for the movie that is still not done."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "rosebrighton-26024",
        "review_rating": "10",
        "review_title": "Does it get any better?",
        "review_detailed_main": "One of the best movies I can remember seeing. Does it get any better? Layers on layers on layers and all the talent involved were perfection."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "djdksf",
        "review_rating": "7",
        "review_title": "Inception: A Smart Movie For Ignorant People",
        "review_detailed_main": "I'm afraid I'm a bit confused. I saw \"Inception\" last night. I had high expectations based on miles of positive ink from reviewers and professional critics, all tripping over themselves to bestow demigod status upon Christopher Nolan. These expectations were dashed to bits within the first thirty minutes of the film, and turned to a kind of dread as I realized what folks these days will accept as \"depth\" in their entertainment. I wish I'd never seen those gushing reviews, I would've enjoyed the film much more.\n\nNow, don't get me wrong, I'm a fan of Christopher Nolan's Batman reboots \"Batman Begins\" and \"The Dark Knight.\" For my money, those were without a doubt the second and third most effective superhero movies to date (sorry, Raimi wins.) The man certainly knows how to keep a story moving along, and he knows how to film action. In the case of The Dark Knight, Heath Ledger provided an emotional lynchpin non-pareil in his Joker portrait, and Nolan milked it for all it was worth. There was real pathos and genuine mortal horror built into the foundation of the film's impressive structure. Also, the fact that it was based on a comic book lowered the bar and allowed the audience to suspend just enough disbelief to allow most of the dorky plot elements to slip through and do their work.\n\nNow let's discuss obvious comparisons to an earlier effort in this vein—that is, an action movie dolled up to the nines as philosophical treatise. I'll admit that I was never a fan of The Matrix. I thought it was asinine in conception and brutish in execution, even as I admired some of the visual effects and spectacular stunt work. Comparing The Matrix's ridiculous endless \"stream-of-consciousness\" gibberish about free will with, say, Roy Batty's laconic final soliloquy in Blade Runner, is like comparing the Twilight series' moronic teen romantic angst with David Foster Wallace. Unfortunately, Inception had precisely the same effect on me, which is to say very little.\n\nHere we find the great and terrible Nolan exploring the tired territory already plundered in countless films of yore, including Hitchcock's Spellbound and 1980's genre pics such as Brain Storm, The Dead Zone, and Dreamscape. The basic premise reads like a dime store sci-fi novel's back cover: \"In the future, we can enter into each other's dreams! Feel the magic of dreams, within dreams, within dreams! Experience the thrill and wonder of miraculous \"Dream Time\u0099.\" Oh Boy!\" Within twenty minutes of the film's somewhat intriguing intro, I knew not only how it would end—I also pretty much knew how we were getting there. Nolan plays primarily to the back row, and—no offense, America—but we've been slightly dumbed down over the past few decades, and we're much easier as a whole to entertain than we used to be. Look back at a few films of the past with vast, labyrinthine plot structures like Hawk and Faulkner's \"The Big Sleep\", or practically anything by the Coen Brothers. What's defines their deep-impact gravitas, as opposed to the flat and diffuse emotional landscape of Inception? It's character development, pure and simple. In this case, Nolan didn't have a single character —especially the one played with typically earnest gusto by Leo Dicaprio—with a plausibly human fatal flaw, foible, or reason for doing\u0085 uh, whatever it was he was doing. We're simply dropped into an alternate universe with rules seemingly invented to favor nerds of any stripe —almost impossibly similar to the one in The Matrix—and told to hold onto our hats, because here\u0085 we\u0085 go! Except we're not actually GOING anywhere, or at least not anywhere we haven't been a thousand times before.\n\nSorry to rain on the parade of everyone that's ready to lionize C. Nolan as the great white hope of modern blockbuster cinema, but from my vantage, there is no there there. If you want a lesson in basic existential philosophy, take a class at your local community college. You'll get more out of it, and you can keep your textbook as a souvenir. If it's great car chases you're after, rent \"The French Connection,\" or \"Ronin.\" In other words, keep your high-octane action movie out of my high-concept art film. These are two tastes that do not go great together. Meanwhile, if Inception somehow does \"become a religion\" in another five years, than I'm reconsidering my continued faith in Hollywood as some kind of egalitarian oracle, where the huddled masses can go to get their myths, and feel the true power of redemption. If this is the kind of movie that will be worshipped from now on, than the god of blockbuster cinema may truly be dead."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "whatever-tanveer",
        "review_rating": "5",
        "review_title": "Unique but not good",
        "review_detailed_main": "Look I am a fan of Chris Nolan or at least I used to be. His movies are always different and I liked them. Prestige was the first movie that I watched of him and I loved it. The Dark Knight was the movie that I had the highest expectations and it did not let me down. I know there are 10 things not to like The Dark Knight but for me there were 1000 things to like. But this time I AM disappointed. Inception is like the cutest car that can't run very fast. It has its good looking but no good plot and a million questions about the concept.\n\nThere are a few simple rules about a science fiction movie or story. When you watch one there are things you feel right or not. You can use your wildest imaginations but at some point they have to make sense. This film certainly did not feel right. This was like a low budget science fiction which starts well but loses it after a while except for this was a big budget movie!\n\nWell there ARE a few things to like about this movie. It has a good concept, good graphics and good acting. If the plat was better and a few more things made more sense this could have been the masterpiece everyone thinks it to be."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "sandover",
        "review_rating": "",
        "review_title": "Let's tax the exclamation marks",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "3xHCCH",
        "review_rating": "8",
        "review_title": "A Mutli-Layered Dream World",
        "review_detailed_main": "What drew me to watch this film on the very first day of theatrical showing was the cast, which was an incredible array of some of the most intense actors in Hollywood today. We have Ken Watanabe, Cilian Murphy, Marion Cotillard, Michael Caine, Tom Berenger, Pete Postlethwait, and in the lead, none other than Leonardo di Caprio. The director and writer Christopher Nolan also comes with a very impressive oeuvre behind him, with \"Memento,\" \"The Prestige,\" and most recently, \"The Dark Knight.\"\n\nThis film is one of the most complicated films I have seen. A fair summary is almost impossible to put into words. It is challenging to follow all the jumping into and out of dreams, in dreams within dreams. I won't be surprised if you do not completely understand everything that was going on by the end. However, the visual experience of being in this multi-layered dream world is unmatchable in any recent films.\n\nI thought of \"The Matrix,\" and even Leo's latest (excellent) work \"Shutter Island,\" as this film proceeds to disorient you about what is and is not reality. However, \"Inception\" goes several levels higher in the hierarchy of convolutions in film. There are at least four levels of simultaneous dream upon dream happening at one time at one point. Amazing film editing work!\n\nThen there are technical aspects which were mind-boggling indeed, as Nolan's bizarre script required. The audience is brought inside buildings, rooms, elevators, even entire cities where you lose the sense of space, time, gravity and logic. It is a dream world--you need to see it to fully appreciate what I just wrote. The musical score of Hans Zimmer was strong and dramatic. These are definitely contenders by Oscar time.\n\nThis film is not for everyone. There are those who would dismiss this as impossibly pretentious and pointless. But for me, \"Inception\" was very stimulating and challenging -- a film well-worthy to spend two and a half hours of our valuable time. Be ready to face this challenge when you go watch it. I won't be surprised if you feel you need to watch it all over again."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "phatdan",
        "review_rating": "8",
        "review_title": "Better than average 'Dream Gimmick' movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "PhoenixSon7",
        "review_rating": "10",
        "review_title": "Masterpiece of the Year",
        "review_detailed_main": "It is the rare film that can completely immerse you in its experience to the point where it is hard to speak afterward. Inception is one of those films - beyond breathtaking, an incredible mind-bending tale full of action and suspense which takes us in to the world of dreams and back.\n\nInception is not only the most intelligent film of the year, it makes the rest look like a finger painting. Christopher Nolan has again manufactured a masterpiece of cinema, the story beyond intricate and full of psychological twists and turns through the mind of dreams which turns the action on its head - sometimes quite literally. The acting is exceptional, with Joseph Gordeon-Levitt standing out and proving again that he has more than enough acting chops to tackle bigger and better roles. What is really incredible is how Nolan manages to carry such an epic film with such a huge scale and yet maintain strong, well-rounded characters. Leonardo DiCaprio's Cobb is at the center of the story and the focus is never taken off of him. Through Leo's performance and through sitting in Cobb's dreams, Inception manages a new way of getting us to feel what the film's characters feel.\n\nHans Zimmer's score perfectly compliments Nolan's actions on screen to create an experience films rarely give us anymore. Both epic and serene, Zimmer adds to the dream-like quality of the film and makes the action set pieces that much larger.\n\nThe set pieces of Inception are amazing. Not only is it refreshing to see so many special effects without the use of CGI, but the implementation of these special effects are the best I've seen. I only wish I hadn't seen any trailers for this film, as going in to this movie with a blank pallet would have given the movie even more exceptional moments, instead of hoping or waiting for \"that moment\" or smiling when a humorous line from the trailer showed up in the film. I could talk about the one central fight scene of the film for hours, which is nothing short of a benchmark of set design, camera-work and cinematography. I could watch this scene on loop for hours just to be knocked out over and over again by the sheer scale of it.\n\nI cannot describe Inception as anything short of a masterpiece. Especially in the dredge of summer cinema, Inception reminds us why we go to films in the first place, giving us an intelligent film which doesn't fly over our heads (not that I'd recommend stepping out of the theater for ever a minute during the movie)."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "new-old1",
        "review_rating": "10",
        "review_title": "This movie should be named \" Exceptional !!!! \" not \" Inception \"",
        "review_detailed_main": "I watched the first day first show of the movie, it was amazing !!!\n\nFirst of all the story was brilliant and unique. It is actually very difficult to implement such complex story because there are so many characters and so many explanations of how things are going on and so many levels in the movie.\n\nThe concept of dreams and dreams inside dreams was unique. All the action sequences were very well done.\n\nI think such complex stories only great directors can tell because there were so many small pieces in the movie which needed to be connected.\n\nI expect this film to be nominated for Oscars because of being unique and very well made movie\n\nOnly the directors like Christopher Nolan would dare to implement such unique concepts .VERY GOOD !!!\n\nI would give this movie Rating : 10/10 , and it is a MUST SEE !!! ( Please watch it in theaters )"
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "streetcar1951",
        "review_rating": "9",
        "review_title": "Christopher Nolan has outdone himself yet again...",
        "review_detailed_main": "I walked into the theater knowing relatively nothing about this film, and I walked out...knowing even less. From the moment it begins to the moment it ends, you will be wondering what is going on. These initial questions are simply because those trailers we've been watching all year have hardly prepared us for what is about to happen. Most of us just buy a ticket on our faith in either Christopher Nolan or Leonardo DiCaprio. (In my case: both.) As the movie progresses, your questions grow deeper, more layered, just as the dreams you are viewing excavate the furthest reaches of the unconscious. It's an absolute ride, and in IMAX, it's astounding.\n\nIt's easy to see how this is the product of Nolan's work in Memento. It deals with the same issues of our narrator's reliability and questions of reality. Both main characters have a tragic self-awareness that seems like a plus in the beginning of the movie, but by the end, you'll wonder if what they trusted to be true and what you trusted to be true is even true at all. Like the dreams themselves, the plot lines and characters begin to fall apart, but our Architect, Christopher Nolan, is the one pulling the strings. This is a film that moves beyond its medium and pulls you in. I'd almost say it breaks the fourth wall without even trying to.\n\nIt goes without saying that the special effects are one of the highlights of Inception. This will probably be The Matrix of our time, but in a much subtler way. As Dom says, \"It's only when you wake up that you realize there was something strange.\" This strangeness is embraced and pulled throughout the film. However, the mazes, infinite staircases, and alternate realities these special effects create are not limited to just providing an aesthetic wonder, but they serve to symbolically reinforce many of the main issues of the film. The paradox of an infinite staircase will be itching your brain for a few hours after you finish watching.\n\nThe performances are pitch perfect. I initially thought that the characters were a bit one- dimensional and not incredibly developed. Don't be alarmed though. Nolan hasn't lost the touch that created his Batman and his Joker. I believe there are deliberate reasons for this lack of background, which will surely feed into the theorists that will begin sprouting all over the internet after this weekend. Leonardo DiCaprio and Marion Cotillard provide the emotional and narrative center of the film. Being the Oscar winning and nominated actors they are, these roles are played beautifully. It's as if they don't even realize they're the ones we're all focused on.\n\nI would've given this a 10/10 if it weren't for the excessive use of Hans Zimmer's music. I'm a major fan of Zimmer's work, but I believe music in a film is instrumental when trying to give your audience some sort of cathartic release. At the moment I needed that from the score, it had already been playing non-stop for an hour, so it really made no difference in my emotional response. That's my only complaint, but I'm a film score nerd so don't worry about it.\n\nI'll end this now before I start confusing myself even more. It's a privilege, though, to see an auteur like Christopher Nolan working today, using the summer blockbuster as his medium. You'll leave the theater feeling as if you just \"witnessed\" something."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "jemps918",
        "review_rating": "10",
        "review_title": "Inception is movie perfection!",
        "review_detailed_main": "Super blown away by Inception! I can't get over how Christopher Nolan can keep topping himself with each flick. At first I was so scared to see this fail because of the curse of the stellar cast but i should have had faith in Nolan all along. This is just unbelievably good!!!\n\nHe takes his time telling such a complicated story without dumbing it down or complicating it too much. All the actors play their parts well that even Leo DiCaprio, in a rare way, fades into the character and you forget his celebrity. Everyone and everything is just amazing; from the ominous soundtrack to the sets to the acting and cinematography...all I could say at the end of the flick was, WOW!"
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "numenorsniper-66396",
        "review_rating": "10",
        "review_title": "Nolan's best",
        "review_detailed_main": "I first started watching Nolan movies with Memento like 20 years ago when I was a teenager, then went to the cinema to see all three of his Batman movies, The Prestige, Inception, and Interstellar.\n\nI really think that it can be hard to decide which of his movies truly is his definitive best, as he has a few that hit the mark just right. But from re-watching them a bunch over the years, I do feel that Inception hits the hardest, even though Interstellar and The Dark Knight have their own weighty effect different from Inception.\n\nI watch movies for the magic and emotion, and even though The Dark Knight is technically excellent and brilliantly acted, the strengths of Inception edge it out slightly I think.\n\nI love the cast of Inception; especially the incredible performances of Joseph Gordon-Levitt, Cillian Murphy, Marion Cotillard, and Ellen Page.\n\nThose four actors in this movie are pure magic, especially accented with Leo DiCaprio, Tom Hardy and Ken Watanabe, along with everyone else.\n\nThe holy trinity of Nolan in my mind at least, are Inception, Interstellar, and The Dark Knight, with The Prestige and Memento not far behind.\n\nI can't wait to see Nolan make an even greater magnum opus, one to dethrone Shawshank Redemption from its imdb number 1 spot. I feel that if any living director can do it, it would be Nolan."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "Christian_Dimartino",
        "review_rating": "10",
        "review_title": "A dream come true.One of the greatest movies i've ever seen,",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "yj-c-70356",
        "review_rating": "6",
        "review_title": "Convoluted..I cannot believe that the majority of the general population could reasonably follow the plot of this film",
        "review_detailed_main": "Convoluted..just too convoluted and complicated.\n\nInterstellar is a beautiful film, but this .. is an incoherent jumble and muddle of ideas and concepts. Though they'd have been theoretically very interesting and thought provoking if manageably used.\n\nIts basic premise is intriguing and thought provoking, but I was annoyed and eventually bored by its overambitious and confused plot.\n\nPeople who liked it must be very patient, willing and/or able to make sense of it much better than I do, though I don't consider myself unintelligent..\n\nFilms like this make me think..are people too shy or lazy to post reviews/ratings that go against the majority?? Because I cannot believe that the majority of the general population could reasonably follow the plot of this film.\n\nThough it has been years and I will give it another watch to try and make better sense of it."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "tortoiseman_526",
        "review_rating": "4",
        "review_title": "Perception of inception",
        "review_detailed_main": "It has taken me 9 years to get round to watching this and during that time I looked forward more and more to seeing it. Was it worth the wait....NO.\n\nI find it difficult to find anything positive to say, but the premise and idea of the film is interesting. That sadly is all, its an overblown mess of a movie with no place for a connection to the films characters. A collection of choreographed fight scenes connected by dream science mumbo jumbo and accompanied by a bombastic score does not make an interesting movie. Mr Nolan should have spent his time focusing on a coherent story and some character development, less time on trying to shoehorn in pointless action.\n\nA bitter dissapointment of a movie."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "chaos-rampant",
        "review_rating": "",
        "review_title": "Impeccably constructed mechanics of hazy blurs",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "cadillac20",
        "review_rating": "10",
        "review_title": "Anything Is Possible",
        "review_detailed_main": "If there is anything that Inception has taught me, it's that anything is possible with films. There are very few films that I have seen that deliver this message. Star Wars delivered a galaxy full of imaginative creation. The Matrix showed us a world where rules could be broken and people could dodge bullets. Avatar took us to another world the likes of which we have never seen. Now, Inception takes us to places we can only dream of.\n\nI will start by saying two things that may contradict each other. The first is that this film has something for everyone. There's plenty of action, drama, noir, suspense, and mind games for those who like to be intrigued. At the same time, this will not be a film for everyone. The nit-picky will find all the little tiny things to question, most notably the logic involved in the whole subconscious sneakery and 'whose dream are we in?' logic. But quite honestly, any possible holes are completely forgiven. Not only is this the best written film of the year, but this is one of the most imaginative films in years.\n\nI really have to applaud Nolan for taking a chance. Few filmmakers would dare to go out on such a limb and not only try and create such a complex web of dream logic and rules, but also make sense of so many things going on at once. At one point in the film there are four different realities occurring at the same time. There are only a few filmmakers I can even think of that would dare try and create such feat. Even fewer I can think of that make it work. And Nolan does. At first, all the dream logic had my head buzzing, but it mattered little once we hit the dream world. While dizzying, the exposition fits. It's so fascinating and so far from anything that we have seen that the first hour, which is mainly made up of explanations of how things work, is rather welcome as opposed to frowned upon.\n\nNolan's writing shines here. He does what The Matrix once did and bends rules, even breaking some to shape a wholly different reality where cities topple and even gravity gives way to a change in the rules of reality. It's completely fascinating and suspenseful. I even found myself exhaling out loud. And while it may seem like nothing much more than a whole bunch of pretty images and special effects, this is all supported by a strongly written main character and well acted supporting cast. Although the only really deep relationships here are between DiCaprio's character Cobb and his wife and Page's character, the cast as a whole is enjoyable. Joseph Gordon Levitt is the action heavy, doing a lot of the physical fighting, while Tom Hardy is the comic relief (when comedy presents itself). There are a few a members who could be called one note. Watanabe's character is a fairly one note evil corporate head type and Cillian Murphy plays the gullible victim. But even these characters have moments of humanity which shine through.\n\nWhile the film deals in reality defying moments, there are some very entertaining, more practical elements, like the shootouts and the heist planning. These play out like their subsequent genre staples, and I'm very thankful for that. The shootouts are practical and exciting. The heist elements will be familiar to anyone who is familiar with the heist sub-genre, but in this case it's all about people who deal in cerebral elements and must plan their actions around mental manipulation and subconscious trickery.\n\nI don't think I could say enough about my enjoyment of this film, but I will say that it is truly one of the best film events in recent memory that I have enjoyed. While this summer has been filled with disappointment at the theater, Inception was worth it. If this film doesn't grab your imagination by the balls, then I don't know what will."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "RichardSRussell-1",
        "review_rating": "9",
        "review_title": "You May Never Sleep Again",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "mr_congenialityng",
        "review_rating": "10",
        "review_title": "This is one of the most brilliant films ever made.",
        "review_detailed_main": "I won't describe the plot, I won't describe the characters, I won't describe anything about this movie. You've seen advertisements for this movie. They are freaky, complex, mind-bending, but nothing in these advertisements make sense, and they won't until you actually see the film.\n\nNevermind the visuals of the film. They are not even the most effective thing of this film. Granted though, they are a spectacular sight, and I never thought for one second I was looking at actual CGI. That's SUPER effective. Nevermind the acting in the film. However, I never once thought I was actually watching people act, I actually thought I was looking at something real. The most effective point of the film is an idea, an idea that takes our brains for a wicked little spin. This idea entertains us, intrigues us, and plays fun little games with us. It's a sheer delight.\n\nA lot of people are going to ask \"Is this film better than Nolan's The Dark Knight?\" In my personal opinion, yes. This is his best film, and it is better than \"The Dark Knight\", which was a masterpiece itself. I'm proud to say that \"Inception\" is a step up. For those who are looking for something simple, something plain, and something that won't require a grand extent of their brain power, they will get bored with \"Inception\". This is an adult film in the regard that it requires your full attention, and your brain must be plugged into it, or you are going to miss it ALL OF IT.\n\nI believe that this film definitely deserves a place for the \"Best Picture\" nomination at the Oscars this year, along with more recognition to Nolan as a director and a writer, for he has made the most original film I have probably seen in a very long time. His writing is impeccable. His direction is brilliant. His movie is the ultimate masterpiece.\n\nInception is the smartest $160 million dollars that a studio has ever spent to make a film. It was also the best $7.50 I have ever spent. Bravo."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "shankarganesh",
        "review_rating": "10",
        "review_title": "A religious experience",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "sidbhati",
        "review_rating": "10",
        "review_title": "Amazing!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "RobTheWatcher",
        "review_rating": "9",
        "review_title": "Masterpiece",
        "review_detailed_main": "This movie has everything. The production and cinematography is exceptional. The story line is original and forces you to think and challenge your thoughts. It's a perfect balance of imaginative and complex. The acting lives up to their names to deliver top notch performances."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "taruntrikhanews",
        "review_rating": "10",
        "review_title": "In My Free Time I Liked Too Watch This Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "jamesturner25",
        "review_rating": "10",
        "review_title": "Thought provoking unlike any other",
        "review_detailed_main": "As a long time lurker on IMDb, I've slowly been working my way through the top 250. I can honestly say that this film has surpassed anything I have ever seen before, despite the hype.\n\nI was gripped from start to finish. An amazing concept backed up with emotion and even some groundbreaking action scenes. I spent the entirety of last night trying to get my head around what could have actually happened, such is the depth of the story. Never before has a film had such an impact on me - I woke this morning to the realisation that I had several dreams last night which were very uneasy, for the first time in years.\n\nThis film is the reason I've finally signed up to this website. I'm a massive fan of films such as 'The Shawshank Redemption' and 'The Godfather', but in my opinion, this raises the bar. And that's coming from somebody who is generally not the biggest Sci-Fi fan.\n\nIf there's ever a film that the masses should rush out to the cinema to see it is this, before it's too late. An absolute must see, and it would be a travesty if it did not make its way to its rightful position in at least the IMDb top 10."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "Doylenf",
        "review_rating": "6",
        "review_title": "Dream invasion is the focus of a strange and ambiguous film...",
        "review_detailed_main": "I'll be the first one to admit that INCEPTION is the kind of thinking man's thriller that has something going on every second of its two-hour and 28 minute running time. But only director Chris Nolan knows what it's all about and I don't believe I'll find out all the explanations until I get the DVD commentary.\n\nIt's a heady mixture of sci-fi, comic book stuff and fantasy and all of it is focused on the mastery of dream invasion in order to gather secrets held in the human mind. Foremost among the players is LEONARDO DiCAPRIO, playing his role in a very authoritative manner with no shortage of barking orders and furrowed brow, all highly intense, as he gathers a team around him to investigate the dreamscape.\n\nThere's plenty of action along the way, interspersed with quieter moments of explanatory dialog so the audience has at least some semblance of what's going on. But the whole concept of the story lacks the kind of credibility that would have made the film more engaging than it really is.\n\nCredit the actors with doing their best despite the fact that none of them have roles that are fully fleshed out. And this includes Joseph GORDON-LEVITT, ELLEN PAGE, TOM HARDY, CILLIAN MURPHY, KEN WATANABE and TOM BERENGER.\n\nIf you're a MATRIX fan, you'll love this one. If not, you may wonder what all the fuss was about.\n\nFrankly, I had more fun exploring dream invasion in NIGHTMARE ON ELM STREET, less intellectual but a lot more fun."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "neil-arsenal",
        "review_rating": "3",
        "review_title": "Like dangling a shiny toy in front of a cat.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "tedg",
        "review_rating": "",
        "review_title": "Insides of Emma (The Fall of Angels)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "JuanKaius",
        "review_rating": "10",
        "review_title": "Action,Suspense,Comedy... Nolan knows it all",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "razor-mp",
        "review_rating": "10",
        "review_title": "Christopher Nolan is the god of film making",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "KellyRyan14",
        "review_rating": "9",
        "review_title": "If You Don't Pay Attention, It will be Confusing",
        "review_detailed_main": "All of the complaints that I have seen about this movie were ones explaining how viewers did not understand the movie. Honestly, the movie is really simple to follow, if you pay attention. I've only seen it one time and I understood everything. Many are saying that they want to see it twice in order to grasp everything, but one viewing is enough if comprehension is all you want to get out of the second viewing. This being said, I would love to see this movie a second time. The acting is outstanding and the chemistry between the actors makes the movie so pleasant to watch. You instantly forget that these are actors. The chemistry between Ellen Page and Joseph Gordon Levitt is phenomenal. Also, Leonardo is unbelievable as always, and no one can look better in a suit. The topic is so engaging and I would recommend this movie to anyone. It has been my favorite movie so far this year, and I will definitely be purchasing it as soon as it comes out onto DVD. Spend the money, see the movie, pay attention, and everything will be great."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "ajayhooda",
        "review_rating": "10",
        "review_title": "The best movie of the world so far",
        "review_detailed_main": "The first movie that I saw of this guy was Memento and I was so much thrilled that I couldn't sleep the whole night and then Batman revival follows through Batman Begins.... and I was wondering how can one get lucky all the time... but he again proved me wrong with Prestige. Then again i felt that this would be last.... but Dark Knight as the world knows overshadowed everything that the world had seen so far... And I said to myself wait a minute... this seems to be too much.... too good to be true... so I went to see Inception in fear mingled with excitement that this has to be a flop.. but my heart wanted it to be a good movie...and oh! my dear I couldn't believe what I saw... what I heard.. and what I experienced... and was so tremendously elevated by this supreme intelligent movie that i pinched myself to check if I'm in a real world or a dream world.... Simply the most magnificent movie of his era.. and the best was not the way Christopher Nolan thought.... but the way he could somehow managed to show in form of cinema... Truly a super class act... a Masterpiece.... Hats off to Nolan and brilliant acting by Leonardo-de-Caprio, Ellen Page and other supporting folks....."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "raj504",
        "review_rating": "10",
        "review_title": "One of the best and one of the most complicated movies ever. Nolan is a F***in genius.",
        "review_detailed_main": "I m waiting for this movie like since an year....i finally watched it.....I always say this thing. Christopher Nolan is a f***ing genius......nd i m sure gonna keep his portrait in my room....within a few days......i loved it....this f***in movie is simply f***in brilliant nd awesome....this is one of the best films i've ever seen.....this movie is a complete mind game....this movie has a typical screenplay....if u miss 10 sec....u miss a lot....it was like a puzzle.....all the time i m watchin this movie...i m completely immersed into it....i m thinking a lot trying to understand it perfectly.....this movie gives a lot of work to ur brain.....by the time the movie finished, every thing look different for some time......the screenplay is damn great.....and Leonardo DeCaprio did a gr8 job.....he had his two best movies this year.....\"Shutter Island\" nd now \"Inception\"......nd he really deserves them.....i loved this movie.......in fact, i liked this movie more than \"The Dark Knight\".....this movie is a must must watch."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "radoslavpeev",
        "review_rating": "10",
        "review_title": "The most grappling movie",
        "review_detailed_main": "This movie is the one with the most original screenplays. I've watched it two times and one of which was in a cinema theater and I can say that this was one of the best movie expierences i've had ever."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "Sakher_Sammour",
        "review_rating": "10",
        "review_title": "perfect film",
        "review_detailed_main": "So perfect mental ideas , the timeline is perfect , nolan you are brilliant"
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "socrates99",
        "review_rating": "8",
        "review_title": "I'm sorry to say this is not as 'great' a film as they think",
        "review_detailed_main": "But it's got its heart in the right place. First it's too long by at least a half-hour. Second it relies too much on frenetic activity to cover up its more grievous shortfalls. And third it's not really sci-fi, it's more a psychological thriller. But despite all that it is what it is portraying, an attempt to implant a notion, and that's highly commendable on several levels. Also a few of the scenes are both memorable and essentially flawless.\n\nThe acting's all there too despite what some critics claim. DiCaprio is capable and fully invested. Joseph Gordon-Levitt's performance is especially engaging, but the casting of Ellen Page was a near fatal mistake if you ask me. I can see why she made sense to the director and producers, but she's a drag on the movie as is Ken Watanabe who I could barely understand half the time. Still I like his acting and I can tolerate his pronunciation here. Page I don't like for some reason. Perhaps it's just too distracting and/or annoying to see her exude an almost pre-adolescent lack of experience again. If they needed an 'innocent', and I don't really agree, I would have preferred Dakota Fanning. Marion Cotillard does the exact opposite, she's worldly and knowing, but her I'd like to protect and get to know personally.\n\nI would have liked to see a slower more moody treatment of this topic. Though at least one of the chase scenes is masterful and hair-raising, the real pay dirt would have been imagining trying to enter another person's mind. In fact the separation between our minds is the bedrock on which most of our problems lay. A 'shared dream' as portrayed here would have been several notches more paradigm breaking than depicted here, I think, and that's no small flaw in this film."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "daniel-ire",
        "review_rating": "7",
        "review_title": "Gimmicks For Sale",
        "review_detailed_main": "Brilliant technical wizardry. Heady, at least apparently so. A ride more than a movie but a movie none the less. Chris Nolan is rapidly becoming the director of his generation and I'm longing to find out what is he trying to say. He has established his technical power again and again but if I think of \"Memento\" for instance I remember the gimmick but not what the story was really about. I suspect the same will be said of \"Inception\". I'm not putting down, I'm just wondering. I left the theater full of questions and nobody could actually give me any answers. I'm not talking about the plot but at the way Christopher Nolan chose to tell the story. Leonardo Di Caprio is acquiring some extra gravitas as an adult presence on the screen.Loved Cillian Murphy, I always do. Riveted by Tom Hardy. Enchanted by Marion Cotillard. Amused by Joseph Gordon-Levitt and delighted by Ellen Page. I wonder what Mr Nolan will do for an encore."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "Zyxyzmusic",
        "review_rating": "4",
        "review_title": "Expensive drivel",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "giren-ismaya",
        "review_rating": "8",
        "review_title": "a complex looking movie with a simple concept underneath",
        "review_detailed_main": "Inception is a movie that works outside our logic. We feel like our mind had been played all along, it's like the movie contains some puzzling, undeciphered codes scattered all over places. The moment we walk out theater, our mind process the movie, we interpret things, looking for many many possibility of answers over the questions we've just experienced. And this is why Inception works outside our logic; because no matter how hard we think and discuss this movie, we won't go anywhere. It's a decent analogy of a tricky labyrinth.\n\nLike a discourse that some elements - I would say some key - had gone missing, or simply were not even there at the first place, Inception is a piece that Christopher Nolan as a director creates and how he wanted it to be: To create questions in our head. While I think these questions aren't supposed to be vital, but this makes Inception special on a very intriguing level.\n\nDom Cobb (Leonardo DiCaprio) is a thief who works with stealing another person's mind. He used a special method by letting himself into a person's dream, hence explored those dreams while in the same time took a very important information that those persons won't share to any one. Once, a billionaire named Saito (Ken Watanabe), whom supposed to be his victim, offered Cobb a very interesting idea about doing his work differently. Instead of stealing thoughts, Saito asked Cobb to plant idea, to incept something in a person's mind. The logic is - according to this movie - if it's possible to stole any thought, it would also be possible to embed a whole new idea into a person's subconscious.\n\nTo make it all happen, Cobb needs to recruit a bunch of people with their specialty. There're Arthur (Joseph Gordon Levitt); a guy who always worked with Cobb all the time, Adriane (Ellen Page); a brilliant architecture student whom able to create dream's environment, Yusuf (Dileep Rao); a chemist whose drugs are able to provide a powerful sedative, and Eames (Tom Hardy); a forger who stands like an actor on every person's dream. These experts has one objective: to incept an idea into one mind: Robert Fischer Jr (Cillian Murphy).\n\nThe film rolls with how these experts trying to deliver this inception. Later on the movie, we would have a perception about how complex and intricate this inception method is, and how dangerous a dream could be. Apparently Cobb is keeping a dark thought on his deepest subconscious, this one includes Cobb's two children and his former beautiful wife, Mal (Marion Cotillard). Mal has been disturbing Cobb's mind, it's almost impossible to get rid of her from his dream. Every time Mal appears, his work and life are in a great danger.\n\nWithout giving too many spoilers, I would continue my review concentrating on how I perceive Inception holistically. Inception goes in a way that it looks very complicated and confusing, and it'll makes us believe that we have to think hard in order to understand anything this movie delivered. While the truth is, in my opinion, Inception is a complex-looking movie with a very simple concept underneath it. The movie looks very confusing at some point, and then later on it'd become clearer, and then it looked like it's very surprising and mind blowing at the ending scene, it's something that Nolan creates on purpose so the audience would think like they'd been mind-tricked.\n\nAnd that preceding paragraph would come to my early statement: Inception works outside our logic. No matter how 'ambiguous' the ending is, no matter how detail the script looks like, we as an audience simply won't solve this puzzle because Nolan won't let us do so. It's impossible to conclude a research if we miss some data, so to speak. I'm not implying that Inception is a waste of time, or saying that this is a movie that doesn't have a true meaning. On a contrary, Inception is a work of genius. Instead of making a movie that goes over every one head, Christopher Nolan produced something simple that would be taken very seriously with the audience.\n\nI believe, on the first 30 minutes of Inception, lots of people are trying too hard not to get lost. While the story is going to automatically solve its puzzles on the next two hours, we as the audience is preparing ourselves hard to understand it. Once the ending came, the movie ended, we felt satisfied and intrigued. We felt smarter. We opened our interpretations, threw some insights and reasons, while the truth is actually been there all the time. I myself don't count the ending as ambiguous, since to be ambiguous the story needs to support its ambiguity. And in my opinion, while there are hints here and there, it's not enough to make it ambiguous.\n\nWe don't need an extra intelligence to understand this movie. What we need is to relax, throw away our preconceptions, and let the next two and half hours entertaining you on its own tricky way."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "apunasatapulobin",
        "review_rating": "8",
        "review_title": "This movie blew my mind on so many levels",
        "review_detailed_main": "Leonardo DiCaprio is on a 'good movie' streak. The Departed 9/10, Blood Diamond 9/10, Body of Lies 8/10, Shutter Island 8/10, Inception 10/10.\n\nI went to the midnight showing of Inception at my local theater, and it was jam packed. I had been waiting for this movie ever since I saw the first preview a few months back, and now it was finally time. The lights dimmed and a wave of \"shh!\" swept through the room. I prayed silently that Inception wouldn't disappoint. The movie began to play.\n\nThe ocean. That's the first shot of this movie, and the last thing you see before Inception literally destroys every other movie that's come out in the past 10 or 15 years.\n\nEvery actor in this movie is brilliant and no one is miscast. Every shot, every angle, every sequence of this movie is absolutely stellar. Every plot twist, every line of dialog is sheer genius. The pacing is perfect, and the story is destined to become a classic. Honestly, I have never been in this much awe of a film. The characters were engaging and had depth. You feel like you know each and every one of them, the suspense was awful (but in the best way possible). If I had to put the title of 'prefect' on any film, Inception would be it. It is literally flawless.\n\nI have never seen a movie that actually made me sit on the edge of my seat sweating and sipping on my Coke like a nervous wreck. I have never seen a movie where I literally wanted to jump into the screen and save one of the characters, I have never seen a movie that could make me want to cry one second, shout out in anger the next, and rejoice the next. That was the power of Inception.\n\nTo say that this movie was good, or even great is a enormous understatement. This move was without a doubt the best movie I have ever seen in a cinema. Quite possibly the best movie I have ever seen. I am going to see it again today. I recommend you do the same.\n\nFinal Word: Simply Perfect. 10/10."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "notwrongopinions",
        "review_rating": "10",
        "review_title": "Best movie I could ever dream of",
        "review_detailed_main": "Best movie ever made. Period. Not for small-brained people. You need to really think hard to fully understand the concepts and details in this movie. Layers deep, it covers every emotion throughout watching. 10/10 acting and the casting was flawless. Leo portrays a desperate protagonist you never stop rooting for despite his flaws. The concept of planting an idea into anothers sub-conscience that they assume to be their own original idea... 10/10 mind-bending mind-altering, mind-incepting greatness. This is a movie you must pay attention every second of every scene otherwise you'll be confused. Nolan's best work by far, took over a decade alone to write. Not sure a movie of this depth will ever be matched. By the end of the film if your not completely blown away in awe, chances are you're lost. Though it takes place in a near future where dreams can be infiltrated, it remained completely believable throughout. Enjoy and remember: pay attention 😉"
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "rhtjagan",
        "review_rating": "10",
        "review_title": "I love this movie",
        "review_detailed_main": "This movie is the best film made by Nolan. MANY PEOPLE relate this film to Matrix.. I dont get it.. Both these films are different.."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "bkoganbing",
        "review_rating": "9",
        "review_title": "Dream Team",
        "review_detailed_main": "Watching Inception with its futuristic emphasis on getting inside people's heads through dreams, especially hearing Leonardo DiCaprio explain the pitfalls to newbie Ellen Page, I couldn't help thinking about Forbidden Planet and that warning about monsters from the Id. Did earth manage to conquer what the Krells could not?\n\nChristopher Nolan wrote and directed Inception and though it gets a bit heavy at times, it still is an unmistakable masterpiece. Leonardo DiCaprio stars in this and he's essentially a cat burglar of the mind. His mission usually is to invade people's dreams and steal ideas which makes him an invaluable espionage agent. But Leo's also a wanted man.\n\nSome problems Leo has relating to his Id have forced him to rely on others to create dream worlds. He was working against Japanese billionaire industrialist Ken Watanabe and got caught, but then Watanabe likes his style and hires Leo and his team to do a job on the young heir to a communications conglomerate, Cillian Murphy. It's not to steal anything, but to plant an idea in his brain with the dream team. The film is essentially how DiCaprio and his crew go about this job with Watanabe incidentally along for the ride. And its how Leo has to deal with some real demons involving guilt that force him to rely on others.\n\nVery nice computer graphic generated special effects characterize Inception and it will probably earn an Oscar nomination next year in that category. Director Nolan gets his talented cast to read writer Nolan's dialog with verve and conviction.\n\nI truly hope this technology is not in our near future that would be a frightening thought."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "jan_kalina",
        "review_rating": "10",
        "review_title": "\"You Are Not Prepared For This!\"",
        "review_detailed_main": "That's what Leonardo DiCaprio was shouting at me for months from all those trailers and previews (there wasn't many of them) and he was right I wasn't prepared for this awesome, mind-blowing experience.\n\nFinally I have seen the most anticipated movie of this year (for me) and I know you are all excited for this movie so I try do describe the movie without giving away too much of the plot. The story tells of Cobb who is a extractor, someone who enters human minds through their dreams he and his team create and steals valuable information from the subject's mind. He is a wanted fugitive in the U.S.A, which is a problem for him, because he's got kids there and coming back home to them is what he most desires. During his last assignment he meets a mysterious Japanese businessman, who doesn't ask him of extraction but an inception, planting an idea in someone's mind and that is much more complicated. So Cobb sets out to recruit a team and finish this last job alive.\n\nAll the actors here do an outstanding job; Leonardo Dicaprio is at his best in this movie, Marion Cottilard does an excellent job as \"The Shade\", Ellen Page, one of the prettiest young actresses of today, is always great. Tom Hardy plays here the character with the right bad-ass attitude, they should offer him more roles like this.The biggest surprise for me was Joseph Gordon-Levitt as Arthur, never seen a movie with him he surprised me how charismatic he is and how great he pulled off the role of Arthur.\n\nIf you think the soundtrack from Hans Zimmer in The Dark Knight was unbelievable then wait for this one, I have to go and call this The Best Soundtrack of the Year.\n\nThis movie features one of the best movie fights ever where Arthur is fighting one of the subconscious' defenses and the gravity is always changing. That fight is just so breathtaking and suspensive. It's just a like Ariadne says \"It's pure creation\".\n\nThe movie is just so brilliant, it works on many levels. It's suspensive, mysterious, filled with action, the visuals are breathtaking, there is the typical blockbuster/Nolan humor in it too. Christopher Nolan is once again playing with the mind of the audience and until the end you don't know what's going to happen and you don't even know after the end. That's the beauty of it Nolan lets the viewer interpret the ending by himself. Nolan made this masterpiece, this modern day classic and it's a one hell of a ride and it's one hell of mind-blower.\n\nIf you think about it, Nolan has planted an idea in your mind which you will be thinking about for months."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "ammar456",
        "review_rating": "9",
        "review_title": "Wow...",
        "review_detailed_main": "I haven't done a 'movie review' in a while, basically because we've had quite a lot of rubbish recently. Well, either rubbish, or clichés. Gone are the day's of the 90's, with great movies that were actually intelligent, like Fight Club, Pulp Fiction, Sixth Sense, and so on. Now all we seem to get is more of the same dumbed down movies, over and over again, and so on for the past decade (sure, there have been a few good movies here and there, but that's all they are, a 'few').\n\nThis year seems to have made a comeback, though; is this decade going to be a good one for movies? Shutter's Island at the beginning of the year with it's crazy multiple psychological twist, trailers for Salt showing a clever WTF plot line, and just yesterday, Inception.\n\nWow. It's not often I sit and watch a movie in the cinema gripping the edge of my seat, dreadfully anticipating the next few seconds. Not often that a movie ends and everyone in the cinema starts clapping.\n\nSo what is this Inception business? Well, to actually review the movie without spoilers is kinda tough, and even though it's kind of immune to spoilers (telling you the ending would not take away from the story, as it's the point of 'how they got there', and even if I tell you 'how they got there' it would probably make you more confused) so if you haven't watched it yet, read until the ---Spoilers--- tag below. The movie has a cast that basically drove it to perfection; Michael Caine, Joseph Gordon-Lewitt, Marion Cotillard, and stars the lovely Leonardo DiCaprio, who got famous from the cheesy \"I'm the King of the World\" scene in Titanic (well, that and getting it on with Kate Winslet in the back of a steamy car). Let's just say back then he was a little, what's the word, soft.\n\nBut over the years, he's gone from some young and pansy romantic actor into my top 10 list (along with Al Pacino, De Niro, Brad Pitt, etc), and again that's partly through his mind blowing performances in movies that again, blow your mind; from Gangs of New York, to The Departed, to the recent Shutter's Island, and now this? I must say, we're far off from that little kid back in Titanic.\n\nInception is basically about dreams, how you can actually enter someone's dreams (through a physical connection while you both sleep), and from there steal hidden ideas and thoughts from their subconscious. DiCaprio plays an expert thief at that game, and along the way is forced to take a pretty tough mission (details of which I can't discuss, see spoiler part below).\n\nThe acting was high quality, graphics amazing without making it seem over-done, and the plot-line way above anything you've seen in theatres over the past few years. This being said, it's not a movie most people won't get, but if you are a dumb viewer who can't grasp more than your typical straightforward storyline, don't bother watching this. I counted at least 8 people leaving the cinema half way through the movie. Many others would probably want to watch this a second time due to the complexity and number of levels this movie hits.\n\nI've always had a fascination with dreams, and how the dream world works in comparison to the real world; dreams within dreams, the time aspect of it, controlling your own dreams, or even being aware that you're actually in a dream - I wrote about this a while back, read it here (http://www.ammaro.com/2007/08/dreams-reality.html)\n\nIt does raise multiple questions about your life, dreams, what is real and what isn't. I would go as far as say that it brings about that same feeling you get when you first watched 'The Matrix'. Everything in the real world seems kind of blurry for a while. And this movie makes you think, oh yes it makes you think. I couldn't find much to fault with it, except that even though the whole thing lasts about two and a half hours, I felt a few parts were rushed, and probably needed a little more development, while others dragged on a little. Overall, this didn't deter much from the enjoyment, I give this a 9/10, a definite must watch and so far the best movie of the year!\n\nContinued with spoilers at http://www.ammaro.com/2010/07/inception-2010.html"
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "MGabbard",
        "review_rating": "9",
        "review_title": "Don't walk - RUN to see this film!",
        "review_detailed_main": "Many people are saying that Christopher Nolan may be the best film maker of his generation. I thoroughly enjoyed Memento, thought Batman Begins was great, thought The Dark Knight was fantastic, and after watching Inception I think the man is a cinematic genius and can't wait for his next project. But I will have lots of enjoyment watching Inception many times over until then.\n\nHe supposedly honed this script for 10 years and it definitely shows. The story is quite complex and has not a plot hole in it that I was able to observe. It has everything - loss, redemption, amazing action, great character development, mind-blowing effects that serve the story and not the other way around as many films do nowadays, and at the core is a love story not too unlike Orpheus and Eurydice. But unlike the myth the underworld is a damaged soul. And when it looks like the story is wrapped up, there's a last second twist that will throw you for a loop.\n\nWhat the Matrix did for virtual reality - Inception does for dreams and takes it even deeper. This is a film where spoilers might ruin your sense of wonder and discovery watching this film for the first time so I won't give you any. But what I will say is that if you took What Dreams May Come, crossed it with the Matrix, Mission Impossible, and threw in a good measure of a Phillip K. Dick quality science-fiction story - you would be heading in the right direction.\n\nThe hype is real. You will not be disappointed. Go see this film!"
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "dharmendrasingh",
        "review_rating": "6",
        "review_title": "Intellectual or Unintelligible?",
        "review_detailed_main": "Christopher Nolan's sci-fi thriller might well have been called 'Deception', or better still, 'Multiple Deception', such is the effect the film has. The concept is original, no question. However, it does borrow from classic American films such as 'Citizen Kane' and 'The Matrix'.\n\nMany film geeks – and ordinary punters – have described this film as 'very complicated'. The truth is it's just tremendously detailed. For his job, Cobb (Leonardo DiCaprio), while in a dream state, steals ideas from people ('Extraction'); however, the film concerns itself with him implanting an idea into a person's mind, i.e. 'Inception'. That's the plot in one crude line.\n\nHowever, to reduce the plot, which took a modern master nearly eight years to flesh out, to one purely about mental thievery would be unfair. It is the minutiae which are meant to dazzle.\n\nBusiness tycoon, Saito (Ken Watanabe) needs Cobb to perform the inchoate process of Inception on another businessman's son, Robert Fischer (Cillian Murphy), to prevent his father's energy company from becoming a monopoly. After Fischer Snr passes, it is believed that he will betroth the business to his son, so the idea Cobb and his team must implant is for him to repudiate his father's will.\n\nThe technology used to carry out the subconscious subterfuge is never explained. When we catch glimpses of it, it looks like a child's primitive science-kit thrown into a briefcase. But this is not meant to be the focus.\n\nFor all its cerebral conceit, at the film's core are two emotional stories. One is of Cobb's wife, Mal (Marion Cotillard), who spends her time stalking Cobb's subconscious mind and thereby sabotaging his missions. The other is between Fischer and his father, whose relationship is strained.\n\nWe saw DiCaprio mature in Martin Scorsese's 'The Departed'. Here he permanently loses the schoolboy image and becomes a man. The ensemble acting is good, however, most of the main characters seem far too young to do anything let alone steal and implant ideas, and Michael Caine's turn as yet another sage is fast becoming trite.\n\nThe computer-generated imagery is, as expected, top-notch, though the action scenes would be clichéd if they were not embellished by Hans Zimmer's superbly suspenseful music.\n\nUltimately, Nolan asks us to absorb too much gobbledegook too quickly. Perhaps he was being pretentious, perhaps not. Either way, I lost interest somewhere in the second half.\n\nWithin days of the film's release, thousands of cinema-goers cast their votes on this venerated website, ensuring that the film became, at least in their minds, one of the top five greatest films of all time. So much for polls.\n\nwww.scottishreview.net"
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "gbghykwg",
        "review_rating": "2",
        "review_title": "The definition of overrated",
        "review_detailed_main": "Nice looking VFX for its time.\n\nBut pointless, because they just serve to hide that the story is actually pretty dumb.\n\nNever understood the hype around the complexity of the story or the need to draw maps how it all fits together. It's pretty standard stuff if you've seen one or the other TNG episode. What's confusing are the special effects because in the dream world they don't have to make physical sense anymore. That's what maybe causes a feeling of disorientation. And honestly this plot is so empty, that it feels it was written around the idea of creating special effects of this kind.\n\nI think people pretend to like this movie because all the eye candy makes it look like there should be more to the plot, and people don't want to admit that they could find anything deeper in it. So they make excuses about the complexities and great visuals and add meaning to unimportant scenes so keep the feeling alive that this is really deep stuff, because everybody else also says it's deep , so nobody wants to be the dumb guy that doesn't get it. But imma say it: there's next to nothing deep about this."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "Zando777",
        "review_rating": "",
        "review_title": "Horrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "mcmua002",
        "review_rating": "10",
        "review_title": "Overall a very good film, some minor problems and many unexplored ideas",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "LeightWinst",
        "review_rating": "9",
        "review_title": "Stunning",
        "review_detailed_main": "Don't read a single iota of plot about this. Watch it. What I will tell you is that DiCaprio may not have been better and is getting better the older he gets, the rest of the cast are amazing (especially Tom Hardy and Gordon-Levitt), the cinematography is at times breathtaking, Hans Zimmer's score is intoxicating (with Johnny Marr on guitar), and it travels across continents like a Bond movie. Oh yeah, and it's really, really loud in parts. But this is about Christopher Nolan again. He has crafted a serious adult thriller that happens to have exhilarating action sequences that, importantly, don't detract from the emotional content and a plot you will have to sit and think about. It's amazing that in a time of remakes and sequels that a director is given carte blanche to do what he wants and returns something as gratifying as this. Stunning. Why are you still reading this? Go! Watch! Now"
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "L-l-7789",
        "review_rating": "10",
        "review_title": "I could watch it a million times",
        "review_detailed_main": "Amazing... Every time I watch Inception I find something new! This is a stunning sci-fi film with lots of suspense and plot twists. The action begins in the first minute of the film and keeps you captivated until the end. I was absolutely blown away the first time I watched this film and every time since! This is a film about a man named Cobb (Leonardo DiCaprio) and a team of people who are tasked with invading Robert Fischer's (Cillian Murphy) consciousness through his dreams. The physiologically thrilling story is perhaps Christopher Nolan's greatest film and will amaze you! The sensational story, stunning visuals, amazing effects, and mind blowing ideas make Inception a must-see."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "pavis22",
        "review_rating": "10",
        "review_title": "How does Christopher Nolan do it???",
        "review_detailed_main": "I went into this movie with low expectations and once this film started, it took my expectations, strapped it to a rocket and took off. This film was by far one of the most creative, mind-blowing, drama driving, thrillers that I've seen in at least 5 years. The acting was very solid on all parts when it came to fear, solving problems, chemistry, and action. The score was magnificent, dark, deep, suspenseful, and very escalating. You find yourself at points of the film on the edge of your seat hoping that all the characters make it through okay, especially with their own unique talents and the actors made these characters seem so real that you'll have to pinch yourself and make sure that you are not the one that is in the dream world. I will see this movie at least 2 more times and I will not be surprised if it wins one or two Oscars at least."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "zurdulla",
        "review_rating": "9",
        "review_title": "Classic movie by Nolan",
        "review_detailed_main": "Specific and unique plot. Excellent cast and soundtracks. Interesting special effects.Nolan knows how to create a tense atmosphere in films.Something was missing in the movie..."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "poovendhan07",
        "review_rating": "10",
        "review_title": "This Movie Deserves 10 and The NO.1 Spot.....",
        "review_detailed_main": "This is not only the best movie ever made about dreams, it is also one of the best films of 2010, and certainly one of the most entertaining pictures I've seen in a decade.\n\nA groundbreaking, intriguing, exhilarating and brilliant sci-fi thriller that's destined to become a timeless classic. Mark my words: It will be remembered for years to come. Inception is elegantly realised.\n\nDiCaprio powerfully embodies a tortured soul while Gordon-Levitt has all the fun in the best action sequence. This is a drama built around ideas and images; it is a cinematic maze that Nolan makes his audience traverse in order to follow, understand and appreciate his world.\n\nIt makes 'The Matrix' look like a Dick & Jane book. The final half-hour alone is a miracle of clockwork-precise showmanship.\n\nIF you are going to vote less than 10...too bad......I'm really disappointed. This Movie Deserves 10 and The NO.1 Spot....."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "ivaylo_tsalta",
        "review_rating": "10",
        "review_title": "This is not Sci-Fi Movie It's REAL",
        "review_detailed_main": "This is not Sci-Fi Movie It's REAL and the director of that movie know this very well. Its Dream Walking State. And what is funny that This happened to me before 5 years. The Dreams are not just Dreams. this is My DRAM Short:\n\nI dream very interesting dream before around 5 years So what i dream exactly is I was in one place with my Uncle and my Father. And we speak different things, also after a while i quarrel With my Father and after this i just Wake up.\n\nSo when i wake up drink some coffee and after few minutes i was going on my Uncle Home to see what they do etc.. like normal. When i come at his Home.. he look at me and told me.. \"What you dream Ysterday\" and looking me strange, for few seconds i just was totally shocked and i was sure that he know about my dream. After this he explained me without to know anything before, he told me what i TOLD to him and what i told to my Father every single word.. and also he remember the position of everyone.. like you was here i was there you told me this, he told me that and etc..\n\nSo its very wired that he was on the same time, on the same place in the Dream and also know what exactly i told to him and remember it.. i remember the whole dream also..was like real i can feel the air the bird everything. And that not all after around 4-5 days later I saw my Father and YES he had absolutely the same DREAM and yes he remember too every word what i told to him what he told me and the position of eveybody...\n\nHow is possible 3 Peoples to dream exactly the same Dream on the same time and also to have conversation of this dream and everybody to remember the conversation and etc!?\n\nThats it.\n\nIs well know as Dream Walker and the therm mean that for example YOU can conect with everybody you want no matter how far is he/she and to do whatever you want with them u can talk with them you can take them with you and create a different world.\n\nAfter the dream one day i watch \"Inception\" and i was shoked because everything inside the movie was like my dream i mean they just show in the movie that they are Dream Walkers and i was sure that the producent of that movie know very well for what about is this movie is not just a Sci Fi movie its a real deal but the people will not understand it only the few who know and have this experience already. And all the people say well super stupid movie we don't understand anything at all how to explain them that this is REAL and the movie is not a Sci Fi and the same happened to me in the real life."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "timucin_savas",
        "review_rating": "10",
        "review_title": "Inception! The Grandest Film of All Time!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "GHarlow-897-186408",
        "review_rating": "7",
        "review_title": "Interesting but overrated",
        "review_detailed_main": "I was keen to see this film given the high IMDb rating, as I agree with nearly all ratings I've seen on the site, but I appear to be one of the minority who think it is overrated. I couldn't emotionally engage with the characters for some reason, and so was not too concerned on the outcome for them.\n\nWhilst there were some complexities to the plot, it is reasonably easy to understand. I agree with some other comments I've seen that many characters accepted the quite fantastical premise very readily, and were prepared to place themselves at considerable risk for no real reason. So some reactions were not what you would expect for the situation.\n\nHaving had time to reflect I would watch the film again, but do not think I will keep coming back to this unlike the Matrix which has a similar feel but is a much better film."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "mcw2112",
        "review_rating": "4",
        "review_title": "If this is brilliance, then we are so screwed!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "Lord_Squinty",
        "review_rating": "",
        "review_title": "9.1!!?? Hmmm..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "vinayakk87",
        "review_rating": "10",
        "review_title": "It is unfair. No one has the rights to play with the audience's mind like that! Nolan continues to amaze us.",
        "review_detailed_main": "This movie must quite literally be a DREAM come true for many.\n\nFirst, for Mr.Nolan himself. If he is by any chance watching the screening of the movie amongst general public, he must be delighted with the fact that: 50% of the audience would be simply spellbound, 40% must be scratching their heads till they start balding, 10% would be shouting \"I hate Mr.Nolan\", for he took them into a maze that lasted for 150 minutes and did not tell them the way out of it. Sheer genius! Is he a human being at all? Then, for the cast. If they ever had dreams of acting in roles that are so complete and original in every possible sense, then they can stop acting now and retire, for all they can dream of has been achieved in a single movie. Hats off to the entire cast! Last but never the least, for us - the audience. This is what we secretly hope when we buy a ticket for a movie, that we get our money's worth, for every cent we pay for. I am pretty sure most people wont even hesitate to pay for the second time to watch the masterpiece that is Inception.\n\nAnd oh by the way, Spoilers? Ha-ha! If you have not watched the movie, do not worry a jot. No amount of spoilers can reveal the actual story. This movie is beyond all that. Just make sure you go in with a open mind, because when you come out of the theater, I bet you would have thousands of ideas running around in your head like headless chicken!\n\nIt is a movie experience unparalleled! We doff our hat in respect Mr.Nolan, for your Idea has been etched onto our mind, probably forever. You Sir, have achieved Inception."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "nmalik-99759",
        "review_rating": "9",
        "review_title": "An HONEST review",
        "review_detailed_main": "Inception is a resplendent cinematic experience that had me hooked from the opening scene till the very end. As a viewer, I was enthralled by its intricate plot. The characters in Inception are deeply nuanced and expertly portrayed by a remarkable ensemble cast. The chemistry between the cast members is palpable.\n\nVisually, Inception is a feast for the eyes. Inception demands your full attention to grasp its intricacies; it requires active engagement and a willingness to navigate its twists and turns. Some may find its complexity overwhelming.\n\nInception is a cinematic marvel that pushes the boundaries of storytelling. Does it qualify as what is known as a \"masterpiece?\" Yes. However, SOMETHING, just something, held me back from a 10/10 rating. I'm not quite sure what, but there's just something small missing to get it to that perfect rating.\n\nIn conclusion, would I watch it a second time? Yes. Would I recommend you to watch it for the first time? Yes."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "mom_ash",
        "review_rating": "9",
        "review_title": "WARNING : Nolan is putting an idea inside your mind !!!",
        "review_detailed_main": "When I first saw the early 2009 trailer of this movie I was intrigued because I knew this time Nolan will not repeat himself in a brilliant breathtaking action movies like he made before in his new Batman or the deep thriller he represented in \"The Prestige\" or the mind-blowing \"Memento\"\n\nNo, This time Nolan will make his crown jewelry his own masterpiece.\n\nThis time Nolan will teach us how to make a thriller-action-psycho-mind blowing with intelligent science tricks movie .\n\nAnd when I saw \"INCEPTION\" yesterday I wasn't disappointed. In the first few minutes you will be bolted in your chair trying to get the grasp of what is going on around you. I can only describe it as the same reaction when you first saw \"The Matrix\". There is certain rules going on you can't understand, which will begin to reveal its meanings after a while.\n\nCobb \"Dicaprio\" is a strange character-reminds you of \"Teddy Daniels\" at his last \" Shutter Island\"-his job is stealing the ideas from the industries' pioneers by tricking them in their dream state to reveal their secrets.\n\nThis is the main character the film is all about, around him a clever cast of Joseph Gordon- Levitt, Ellen Page, Tom Hardy, Ken watanabe, Dileep Rao and Michael caine to support him in his new \"mission impossible-like\" job.\n\nThe job is instead of stealing an idea is to put a new one in the mind of a rich industry heir \"Cillian Murphy\" by putting him in a deep three level dream in order to reach to the core of his mind to plant this idea.\n\nDuring the film you will discover the danger they put themselves into by doing so, and that Cobb \"Dicaprio\" is hiding a secrets of his own. Also a several shift between different dreams happening in the same time away from what is happening in reality with a time perspective change which was a surreal experience.\n\nA twist of brilliant camera,visual,action & science tricks is the main theme of this movie, you can't trust any of your senses, you can't make the difference between dreams and reality, you are caught up in-between all the time. I can't describe it really only by that you don't know if you took the blue pill or the red one as like in \"The Matrix\", and maybe it is much worse because during the movie you won't know whether you are dreaming or watching a movie in a cinema - or maybe its just me - :)\n\nThe final words that Nolan has answered the question of why the cinema won't die, by showing us that there is still a huge creative space waiting to be discovered."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "tykjen-1",
        "review_rating": "10",
        "review_title": "My life changer",
        "review_detailed_main": "Dear Christopher Nolan.\n\nLike Lenny feels compelled to search for the murderer of his wife in Memento considering even when he realizes the truth, as compelled have I been to write to you about a personal catharsis I've had and still am going through that you indirectly have contributed to help me define and following changing myself after immersivly enjoying Inception on a level I never thought possible.\n\nThe playful ending with the top in Inception and the following endless discussions is simply reminded me of The Prestige; \"They want to be fooled\" and the mass audience are showing some weird and funny theories of reality and dreams regarding Inception. Incredible how a movie can mess with someones mind. Shame is that people don't discuss the brilliance of the movie as much as its ending. But perhaps thats what you aimed for, I have a radical notion. In some years to come perhaps the mass audience will look past the top and truly recognize the simple, yet powerful truth.\n\nLife now feels like a dream, I gotta be asleep to believe it. These past 9 months..so much have transpired. And I've been on and off about sending this letter. I could write a novel about what more has happened, and I think I will end up doing that someday. Its just hard as hell to remember where to begin. Im most happy my sister returned after living abroad for 10 years. And she and my mom have been my Ariadne's in the wake of this awakening. My sister reminded me of SO much from my childhood, helping me put a lot of the puzzles back and see the real truth.\n\nThe Batman trilogy has ultimately led to me understand that my brother has truly been a father to me more than my father ever was. He has been my superhero through my youth. I just did not understand the value in that he was carrying a mask to protect and shield his dearest ones. And am forever grateful for him, and I cannot delve into his soul like Bane did, because taking his mask off will most likely be catastrophic for everyone around him. I believe firmly he will endure it, and be the same protector and father for his son.\n\nThank you Christopher. Im looking forward to a new beginning to this old soul.\n\nYou are for me, the Tesla of filmmaking.\n\n-Kjetil."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "Shzh-demaoong",
        "review_rating": "10",
        "review_title": "Novelty, tension and excitement",
        "review_detailed_main": "The director is a real genius. The point is, he's young. This is a film that is close to perfect in every detail, from the writers to the actors, from the cinematography to the score."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "joachimvnilsen",
        "review_rating": "10",
        "review_title": "Masterpiece",
        "review_detailed_main": "This movie is an absolute masterpiece. The story is incredible paired with amazing acting, unforgettable music and beautiful cinematography. This movie really deserves everything. Easily one of the best movies of all time."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "and_mikkelsen",
        "review_rating": "9",
        "review_title": "Just like a dream... this is pure creativity on display!",
        "review_detailed_main": "This movie never gets old! Of Christopher Nolan's movies, it is the one i have watched the most outside of The Dark Knight! This really feels like a movie that only he could make! A mind bogling mix of ideas and creativity, as the concept of dreams are told to the viewer in a way, so that it never becomes too much! This is one of those movies that hooks you from beginning to end!\n\nThe plot is engaging and you never know what to expect as the movie builds up and becomes more and more intense and thrilling! This is also a journey of guilt, confronting yourselves and learning to move on! Directing is amazing with some truelly iconic scenes such as the hallway fight which is expertly made and filmed! Soundtrack is equally great and iconic!\n\nGreat actors who all does a great job! Lots of talent! The ending still remains one of my favorite movie endings of all time! This is a once in a lifetime experience that you dont wanna miss!"
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "gilmanwalker",
        "review_rating": "8",
        "review_title": "I thought it was overdone.",
        "review_detailed_main": "It went too big. Personally there was just something wrong with Nolan's interpretation of the whole dream thing. I got uber bored and i thought most of the stuff was too predictable. People were freaking out saying this was the best film ever and it was mind-blowing and all that jazz. i FELT THERE WERE TO MANY PLOT HOLES AND GOT SICK OF THE FILM ABOUT HALFWAY THROUGH. It was truly not even remotely as good as it was made out to be. 1. It wasn't as good as it was supposed to be. 2. I didn't end up liking any of the characters that much. 3. Nolan's fan-boys get on my nerves. 4. I have a friend who obnoxiously is obsessed with Nolan, and that makes me biased. 5. I had higher expectations based on Nolan's previous films."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "aagibbons",
        "review_rating": "6",
        "review_title": "Overrated, over-hyped, over here",
        "review_detailed_main": "Read the films ranked below Inception in the top 250...and weep. Have people lost their critical faculties? Yes, Inception is clever, multi-layered, complex and intellectually challenging. It is also heartless. It struggles to stimulate emotion. Cleverness replaces impact. Di Caprio's one-dimensional acting reinforces this sterility. From the first shot of a grim face we get the whole range of grim faces in a grim performance. He is grim about his kids, grim about the folding graphics, grim about his team, grim about the task in hand. Of the Matrix- plus effect I did like the folding city, but the ending was portentous to the point of tedium. One very good litmus test of the quality of a film is to analyse how many times the main protagonists have to explain the plot and at what length they have to explain it. Several characters explain the rules of the dream within a dream within a dream construct at the heart of the movie, with increasing loquaciousness and qualifications. This isn't plotting and it fails to create a genuine narrative drive. Compare it to so many of the films that come below this one in the rankings, Twelve Angry Men, Seven Samurai, Goodfellas, Casablanca, Once upon a time in America, Citizen Kane for goodness' sake. Don't even mention films like Shawshank and the Godfather which rank above it. This is a good film, possibly one of the better films of the year. It is a very long way from a great one."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "mancuniangr",
        "review_rating": "1",
        "review_title": "What are you drinking??",
        "review_detailed_main": "Inception rated 12 of all films,above for instance of ALL OF HITCHCOCK'S FILMS.The problem and it isn't about rating movies only ,but let's say ,discussing who is the best footballer of all time ,or which is the best musician etc,IS that young people ,who are the majority of those who are familiar to the internet and go and write reviews ,haven't seen great people in their lifetime and can't comprehend what their real value was.It's different to listen from other people about Pele or Maradona than actually watch them ,when they were in their prime.It's different to listen from other people about the Beatles ,than actually understand what was going on, when they performed in the 60's.So OK,i won't be surprised if Justin Bieber on an online survey is higher than the Beatles ,because the teenagers are 70-90% of all internet users.So that leads to unbelievable PERVERSED results,like this above.In 10 years time the DVD version of this \"masterpiece\" might be selling 20-30 copies all over the world(not thousands).I think it's the only film ,that IMDb shouldn't care about spoilers,because you can't spoil a storyline that doesn't exist. Ridiculous ,shockingly bad,laughable but clever(clever in that they succeeded, in taking money from my pocket, for watching it).When i have watched over maybe 5000 films ,i used to gloat that i can smell from kilometers away the \"potatoes\"(a phrase that means really really bad films).Not any more.Maybe when i reach 10000 films, i will have the power to save my self from the next Inception."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "Michael_Elliott",
        "review_rating": "",
        "review_title": "Not Your Typical, Brainless Summer Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "greenbeavervideo",
        "review_rating": "8",
        "review_title": "Is this a very entertaining movie? YES!! Is this a masterpiece? Nooooooo!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "chiragrathod19",
        "review_rating": "10",
        "review_title": "**A Mind-Bending Journey Through Dreams**",
        "review_detailed_main": "Christopher Nolan's *Inception* is an exhilarating sci-fi thriller that challenges the boundaries of reality and perception. Released in 2010, the film has since become a landmark in contemporary cinema due to its intricate plot, breathtaking visuals, and thought-provoking themes.\n\nAt the center of the story is Dom Cobb (played by Leonardo DiCaprio), a skilled thief who specializes in extracting valuable secrets from the subconscious of his targets while they dream. Cobb is offered a chance at redemption when he is tasked with the seemingly impossible mission of \"inception\" - implanting an idea into someone's mind without their awareness. To accomplish this, he assembles a talented team of specialists, each bringing unique skills to navigate the layered and often treacherous landscapes of dreams.\n\nThe film's structure is both innovative and complex, as it unfolds across various dream levels, each with its own rules and physics. Nolan expertly balances action and exposition, ensuring that audiences remain engaged without feeling overwhelmed. The pacing is meticulously crafted, leading to a crescendo of tension and excitement as the stakes heighten.\n\nVisually, *Inception* is a feast for the eyes, featuring stunning special effects that reimagine reality in inventive and surreal ways, from bending cityscapes to zero-gravity fight sequences. Hans Zimmer's powerful score complements the visuals perfectly, enhancing the emotional weight and urgency of the narrative.\n\nBeyond its technical achievements, *Inception* raises profound questions about dreams, memory, and the nature of reality. The film invites viewers to contemplate the complexities of the mind and how our perceptions shape our experiences. Each viewing offers new insights, encouraging deep reflection long after the credits roll.\n\nOverall, *Inception* is a groundbreaking cinematic experience that combines intellectual depth with gripping entertainment. It engages audiences on multiple levels, making it a film that rewards those willing to dive into its labyrinthine plot. For anyone who enjoys a thought-provoking thrill ride, this film is a must-watch that redefines the possibilities of storytelling in cinema."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "Adriti_chakraverty",
        "review_rating": "10",
        "review_title": "Inception is not a film, it is an experience!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "Apemangalore",
        "review_rating": "9",
        "review_title": "A film that is, in and of itself, a puzzle",
        "review_detailed_main": "From Memento, to The Prestige, to The Dark Knight, Christopher Nolan is quickly becoming one of the premiere directors of intellectual, yet crowd-pleasing entertainment. Now, just to jump right in, Inception continues this trend, while demonstrating more creativity than perhaps any of his other films.\n\nIf there's one complaint that I can imagine people having over this film, it's that the plot can be particularly difficult to follow. And while I feel that this is true to some extent, that's because Inception is, in and of itself, a puzzle. All of the pieces are presented to you, and solving it depends not so much on intelligence, but on whether or not you find that sort of element appealing in a movie. It's a film in which much of the dialogue is spent simply explaining the rules of this complex dream world, and therefore demands that you be wide awake.\n\nEven so, there had still better be an endearing cast of characters to follow, especially with this being a two-and-a-half hour experience, and thankfully, Inception delivers. While none of them, outside of DiCaprio's character, have much back story to speak of, they all feature exceptionally likable personalities, so by the time that the stirring climax hit, I was concerned about the fate of each and every one of them. Joseph Gordon-Levitt's performance as DiCaprio's right-hand man, Arthur, blew me away in particular. The guy doesn't have a ton of screen time, but damn, does he leave an impression!\n\nUltimately, however, Inception is the story of DiCaprio's character, Cobb. Now, I won't say much, as giving any plot details outside of the synopsis would be a crime, but suffice it to say, it's some pretty engrossing stuff, and DiCaprio definitely brings his A-game here.\n\nAlso, as expected, Hans Zimmer proves once again that he is the boss when it comes to musical scores, as each scene is enhanced tremendously by his material. He's the sort of musician who can make even the simplest of actions seem more important than anything else that's happened in human history. If only you, sir, could score my life.\n\nWith its challenging narrative structure, likable characters (if somewhat lacking in depth), and sheer visual splendor, Inception is easily among my favorite movies of the year, second only to Pixar's latest classic. It's been a rough summer movie season, and while we've still got quite a few weeks left before it's officially over, Inception succeeded in reminding me why I dig this medium so much."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "chintusrikanth-58753",
        "review_rating": "10",
        "review_title": "Mind blowing movie",
        "review_detailed_main": "Until now it is no 1 in my list. I want share experience after watching this movie. I feel different no movie got this feeling for the first in my life .I can't explain my feeling but I know my mind can't think for few minutes.i see this movie in regional language that why I understand in first watch after watch in english.then I more understand about movie first time I watch I went with the story at end I feel like mind blowing experience in my mind."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "kirityk",
        "review_rating": "10",
        "review_title": "an exceptional Inception from Christopher Nolan",
        "review_detailed_main": "even if you go in with high expectations you will come out astonishingly praising the director and the crew in mind.yes,Chris Nolan has done it again.\n\nyou wont even take an eye or your mind even for a second till the end.once again Nolan has proved that not every thing depends on how great the story was but the way you present it.with an exceptional directing skills,good casting,haunting music by Hans Zimmer and a brilliant editing and cinematography,inception blew you minds off and special Thanks to the outstanding performance's from DiCaprio and Gordon-Levitt.\n\nThe reason for loving this film is that its not a kind of rubbish meaningless high budget action flick.you have to keep your memory in mind to watch this movie from the very inception.\n\nA must watch movie worth's your every single penny spent on it.cheers to Chris Nolan 10/10 for his dreams.don't miss it in theaters\n\nin one word \"Inception is Exceptional\"."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "taylorann1",
        "review_rating": "10",
        "review_title": "Wanted to read reviews of people who didn't like it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "dbborroughs",
        "review_rating": "7",
        "review_title": "Good but over long and not that clever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "bennyhagen",
        "review_rating": "4",
        "review_title": "Perception",
        "review_detailed_main": "You have this basic idea and the story, they are very good. And boy did the have money. And the CGI is spectacular, yes.\n\nFurther on this:\n\nInception is constantly VERBALLY explaining what is happening, why it is happening, how it's relating to things explained earlier and so on. The rules, the plot, the inner conflicts. Even at the 2/3rd of the movie, they are still explaining basic rules. I don't see why this was necessary as most of it is repetition. You get the same stuff over and over again, supposed you didn't get it for the first time. And again: VERBALLY. Exactly like in your average, random Venezuelan soap opera.\n\nInception does almost not have any scenes. As far as I'm concerned, movies are about scenes. Here, you'll only be able to remember certain sequences, because it's all just one big a montage of sequences. It's the montage of the master-plan from Oceans 11 for 150 minutes and it's exaggerating.\n\nThe score is non-stop blaring, all the darn time, even when people are just talking to each other, music is building up constantly to give you the perception, that there are serious things going on. It's just annoying, painful for the ears and pointless. Generally important scenes are in no contrast to basic scenes. It's one big video clip.\n\nCharacters. I don't remember a single name, as there is no kind of character development going on here. It's just some well dressed people. All the dialog is used up, for basic explaining like \"for dummies\", rather then building character, relationships, or just being generally cool dialog. Occasional tries sounds like tag-lines or slogans while being just plain unintelligent. Also, this is leaving the actors no space to - well - act... which is a waste of the great cast.\n\nNow all these things are very amateur scriptwriting mistakes, or if you prefer: it's a stupid movie. But no one seems to notice as Nolan does everything to convince you that you are watching something meaningful.\n\nThe blaring music and the hectic editing, the fact that there are permanently 3 scenes of action cut together into one sequence underlined by an incredibly severe score, it's just there to distract. Because in fact the movie has nothing new to show us. Separate the sequences and you have the most basic and outdated action b-movie there is. Car chase. Fire fight. Explosion. Present it confusing enough so it seems complex. Same goes for the plot. The rules of the dream world are not complicated at all, you are absolutely able to sum it up in two sentences, just try. The Matrix set up it's world with a 10 minute sequence and we all got it where the whole theme is about equally, or more complex. Now Nolan is either deliberately confusing people for effect or simply because he doesn't have the skills as a scriptwriter to set up a movie. Neither of the versions seems too noble, but I guess it's a combination of those.\n\nNow the fact, that no one really seems to have noticed ALL THIS this is just a total riddle to me. Even famous film critics praise this movie as ground breaking and brilliant and I just can't see, where I am totally stupid, or why I'd construe all these mistakes into the movie, when in reality, they just weren't there.\n\nIt's just malpractice, as what you have here is basic movie making rules ignored in the most inelegant fashion possible and then compensating for it with - well - money. Don't get me wrong, it's not knowing the rules and then breaking them, it just looks like not knowing the rules. It's what you could expect a first year student at a mediocre film school to do where his teacher then asks him to start all over again, with the first book. And it's just so \"in your face\". For most of the time, there is really nothing more then cutaways, the characters describing what is happening and Hans Zimmer smashing while you see expensive CGI and explosions.\n\nBut everything just seems so damn serious and exclusive and the music is really dramatic. How could this movie not be good, right? But it's a trick. It's the concept of visceral over-stimulation brought to a new level and I'm shocked that it works to the point where after almost a century of film making THIS is regarded as one of the best movies of all time.\n\nIMDb TOT 250 #8. With The Godfather. Pulp Fiction. Schindler's List. The Shawshank Redemption. One Flew Over the Cuckoo's Nest. 12 Angry Men. Inception.\n\n4/10"
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "simulox",
        "review_rating": "",
        "review_title": "If you didn't watch it yet; Don't Even Get Curious About Inception... Cause its a Bullshit...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "pjolter77",
        "review_rating": "10",
        "review_title": "This movie is not complicated",
        "review_detailed_main": "This movie is not complicated. This movie is not complex. This movie is an excellently acted excuse to put the most astounding weaving together of action sequences ever performed on film.\n\nIt's mind-numbingly beautiful and if you ever saw an action movie you liked, this movie is close to perfection. This movie is literally a movie that will make you edge forward on your cinema seat and if you feel you have outgrown action movies, then this flick will make you 12 again.\n\nThe actors are good and they close together the gaps in the action effectively and quickly. The cutting is probably the finest I have ever seen, and the music orchestrates the events perfectly.\n\nSee it!"
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "monty_lnct",
        "review_rating": "9",
        "review_title": "the most complete grand-scale entertainment movie ever.............",
        "review_detailed_main": "Without exaggeration,i can say I had never waited for anything in my life like i waited for Inception.I was keeping update of every single development and news about the movie,i can say i was getting hysterical ,and the reasons are quite clear as both my favorite actor and director of my generation ,Leonardo Di Caprio and Christopher Nolan come together ,my favorite newcomer actors Ellen Page and Joseph Gordon Lewitt they are all together in one movie,it is like a dream come true and the movie itself explores the world of Dreams,the boundless world of dreams where you are free from any limitation of real world to imagine and create anything you want.It is action,sci-fi,romance,you find everything here,every grand scale entertainment that we experience from watching different movies brought in a single movie(as Chris Nolan said),a movie we all dreamt about and Christopher Nolan made it real.\n\nWhen the movie released and after reading dozens of reviews,i came to decision that i will not see this movie till the hypes get over so that i could make own point-of-view on the movie.But i was unable to control myself.Now,the movie has released in my city,the dubbed version actually,in Hindi and they also renamed it in Hindi as \"Chakravyuha\" which means \"Labyrinth\" which also seemed quite sensible to me.The dubbing was perfect,with brilliant translation and synchronization, and the selection of voices for actors were also fantastic.In short,they didn't spoiled the movie like they did to Harry Potter and Avatar .We watched the movie in empty cinema hall(there were only 40-50 peoples present in the capacity of 300) which was not surprising for me,as no one care much about Christopher Nolan movies here,except few movie aficionados like me.\n\nWatching Inception was the experience like seeing a miracle from you own eyes ,a entertainment for your mind, body and soul.This movie satisfied me completely from every point of view,like i said before this movie is a complete package,this movie makes us think deeply and explores subconscious of human mind and make us realize the power of it.The completely original and personal work of Christopher Nolan with some inevitable influences of other movies like Matrix but this doesn't make this movie unoriginal ,the idea of traveling into the subconscious of human's mind and steal his idea or even seeding an idea in his subconscious is completely new,mind-blowing and ground-breaking concept,the brilliant action and chasing sequences maintained adrenalin rush in your body,and also a very heart-touching love story that doesn't seemed out-of-place but the vital part of the movie.This brilliant concept get the full support from Warner Bros. who can take such a high risk and give full freedom to their director,grand scale production which made the sets and special effects looks so real. Brilliant performances from every single cast as they were portraying the beautifully created characters with such depth that made their work very challenging.The soundtrack of the movie is mesmerizing and added great feel to the movie.\n\nInception may not be the best,may not be the most perfect and flawless movie ever made but certainly it is the most complete grand scale entertainment movie,so far."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "priyankamutsuddi",
        "review_rating": "10",
        "review_title": "Its something you want but you never know if you can find a way home..",
        "review_detailed_main": "I loved it. OK, I am a huge Christopher Nolan fan and I love dark movies with great twists. I loved Memento..Prestige, I had to watch it twice to understand it.\n\nI have seen dreams inside dreams inside dreams, so I got the movie from the moment it started. I will not spoil it too much but everything in the movie are explained clearly. The mystery of the movie is inside the mind of Cobb. He is hiding his subconscious guilt and still playing the game of inception with his team members. This is the most difficult job he has to do and all the time he is haunted by his wife. The movie is understandable. Leonardo Dicaprio's one of the best performance after The Blood Diamond. Ellen Page is absolutely the character Nolan wanted from her. She is a brilliant architect and also curious about all the mysteries that goes around Cobb's life. This is the first movie I have seen of Joseph Gordon-Levitt. I loved his character, balanced and funny sometimes. This is the first movie of this summer that I am going to watch a second time and may be third."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "metalgearsolid719",
        "review_rating": "10",
        "review_title": "Dream On, Dream Until Yore Dream Comes True!",
        "review_detailed_main": "Inception is the most innovative and creative film I've ever seen. THIS REVIEW IS SPOILER FREE! In fact, telling anyone a thing not known from a trailer ... well I'd feel like a jerk. Inception is about technology that can invade peoples mind for numerous reasons. Christopher Nolan ( Writer and Director ) goes above and beyond exploring the process, exploring the mind, and exploring the concepts, possibilities, and well... dreams.\n\nEveryone praises James Cameron as the master of visual effects and whatnot. After seeing Inception I'm inclined to believe that from everything but a technical standpoint, James Cameron can only dream of making visual effects that come even close to evoking the type and magnitude of emotions that Inception can. Inception is absolutely awe-inspiring in scope. it's not a summer blockbuster thrill-ride, or an emotional roller-coaster, it's the absolute best aspects of both.\n\nThe script and acting are all phenomenal. Dicaprio gives not an only an Oscar worthy performance but his best performance ever. it's not all about Dicaprio though as he is surrounded by an ensemble cast with names such as Joseph Gordon-Levitt, Cillian Murphy, and many more. More importantly, their performances too are incredible. The original score by Hans Zimmer is as usual outstanding and amplifies the intensity and emotion within every scene.\n\nWith and outstanding creative and innovative plot that's massive in scope with substance and a number of eye popping visual effects that will be forever planted in your mind, amazing direction and acting, and an amazing score, there is no reason not to watch Inception. Yes the story is very complex but at the same time everything that's important is easy to grasp. 2 views isn't necessary but it's worth it. hell, 10 views are worth it.\n\nChris Nolan is no longer chasing directors like Kubrick, Tarantino, or Scorcese. Chris Nolan is now #1. Between Memento, The Dark Knight, and Inception, Chris Nolan is the greatest director of our time, one of the best ever, and one of the most important directors ever.\n\nInception is simply one of the best films ever made and one of about 5-10 movies i'd ever give an absolute perfect\n\n10/10"
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "bebop987",
        "review_rating": "9",
        "review_title": "The Diamond of Summer 2010",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "utpal_das",
        "review_rating": "9",
        "review_title": "This is a'Maze'ing movie",
        "review_detailed_main": "The moving is a'Maze'ing and you will come out of the maze (read cinema) in just a tad less than 2 and half hours, fully refreshed and satisfied. Watched the first show of the day at 12 noon (India Time) which I guess means it is yet to be released in US while I am writing the review.\n\nAnother DiCaprio thriller after Shutter Island and that too in the same year. DiCaprio has done just 11 movies since Titanic came out in 1997 and probably you can name them all, he is that selective). Too good to be true. Actually it is too good as although you cant and shouldn't compare, Christopher Nolan has matched Martin Scorsese and has probably outdone himself compared to TDK. Forget the complexity about the plot of a dream within a dream within a dream, what will linger are the amazing visuals caught in slo-mo. Everything seems to fall in place like a Swiss watch that by the end of the movie all your questions and 'how did that' gets answered.\n\nThere is a lot of similarity between Inception and Shutter Island and the similarity is that they are like North and South Poles. That different yet nonetheless they are poles, right.\n\nI do not want to give the story one bit because that is the beauty of this movie's concept, the story unfolds with almost every scene and there is always the suspense that the story just might take a dramatic turn in each frame and does it take the turn or turns? Well, go watch for yourself and you will feel like writing a review yourself.\n\nAll the actors are good and plays to the character, but the thing is the movie is so damn brilliant, I guess Nolan could have just about cast anybody and it would still have turned out a'Maze'ing."
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "iller1234",
        "review_rating": "8",
        "review_title": "Good idea but crushed ms by poor acting",
        "review_detailed_main": "Saw it in cinemas a week after opening night or so. I couldn't keep off the 8 vote though i feel its a bit high.\n\nShort about the movie before i review it. Cobb - the main character, played by Leonardo Di Caprio, is a former architect and accused for throwing his wife out the window - literally, is trying to clean his record with the police by doing a job for a powerful acquaintance(Ken Watanabe - Saito) that involves dreamexorcism and the like. While struggling with the mystic relationship with his former wife he puts together a team of specialists to handle the job. Ellen Page plays Ariadne, the gifted young architect. Tom Hardy plays Eames, the 'impersonator' if you will. Joseph Gordon-Levitt plays Arthur, in charge of the technical aspects. They are all there to trick Robert Fischer (Cillian Murphy) big time. By taking him through three levels of dreaming they hope to alter the very core of his motivation and change his future plans as a result. You will have the rest explained to you, don't worry about that.\n\nI've heard people saying they have to watch the movie 3-4 times before understanding the story in full. In my opinion you have almost everything explained to you just as it happens. This comes through in discussions among the characters or with the camera itself. To clarify, if you have to think about something for a moment because you didn't understand it fully the characters in the movie interrupts your thought process by explaining exactly what just happened. I don't mean to sound arrogant at all but I have this problem with movies that tries to reach out to everyone at once. If the aim is to include every watcher they obviously have to explain things over and over in different ways. I totally get that but it doesn't fit well with a movie like this one, it takes all the thought provocation and mysticism out.\n\nI don't know if it was the overall Hollywood-humorous-mood of the movie that made it difficult for me to take the characters seriously or if it was just poor portraiting from the actors. It seemed more of a kindergarten with Leonardo, the grownup, running around trying to calm down the kids - Ellen and Joseph. More of a Harry Potter cast feeling to it Im afraid. Im also disappointed to say that Leo had his worst performance in a long time, if not ever. I'd think the manuscript was aiming for a very emotionally moving struggle for the main character. However Cobbs little misadventures wasn't moving me one inch. Leos acting felt empty and almost fake.\n\nNolan tries to feed the watcher with a bit of everything, romance, humour, action, sci-fi and psychology all at the same time but falls short in every area. The actionscenes and animations are great though, in line with almost all new movies from Hollywood these days. This to me unfortunately makes Inception more of a hardcore actionmovie than the thought provoking masterpiece I was hoping for.\n\nNow if you are one not particularly annoyed by areas discussed above you wont be disappointed with Inception, you wont be anyway. The ideas behind it are new, very interesting and thought provoking. I think people will start investigating and experimenting with their dreams just a bit more after seeing Inception.\n\nI know I do, and I like it :)"
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "probez",
        "review_rating": "6",
        "review_title": "Totally over-hyped movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1375666",
        "movie_name": "Inception",
        "movie_rating": "8.8",
        "review_username": "maratonrunner",
        "review_rating": "5",
        "review_title": "boring",
        "review_detailed_main": ""
    }
]