[
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "planktonrules",
        "review_rating": "3",
        "review_title": "Not quite #63 bad.",
        "review_detailed_main": "\"Captain America\" (1990) was just added to IMDB's infamous Bottom 100 List....the one hundred worst rated major release films of all time. This is unusual, as this film did not (until now) have enough votes to make it elegible to join the ranks of awfulness. However, with the release of the latest Captain America film (\"Avengers: Endgame\"), apparently increased attention has been on this poor movie...hence it's inclusion. However, there is one huge problem with this....while \"Captain America\" is clearly a bad film, it is ridiculous to consider it's among the 100 worst ever. I wouldn't even place it in the bottom 1000....let alone 100.\n\nThe first portion of the movie is actually pretty good. You get the creation of the Captain as well as Red Skull....and up until Captain goes into suspended animation in the ice of Alaska, I thought I'd probably give the film a 4 or 5...maybe even a 6. But the final portion was just terrible. First, the Captain was saddled with a stupid sidekick who looked like an extra from the film \"Valley Girl\". She was weak and silly...and totally out of place. Second, the climactic final battle was terrible. If Captain America is a superhero....why was he so wimpy...not only in the final battle but all the ones leading up to it?! Third, while he tried hard, Matt Salinger was a dull Captain America...very dull. Add to this, fourth, a weak script with weak dialog. Overall, one of the worst superhero films I've seen...but nothing like truly godawful films like \"Plan 9 From Outer Space\" or \"Robot Monster\" (which, oddly, didn't even make the list).\n\nSo would I recommend this movie? Probably not...unless you are intensely curious or like seeing all of the Bottom100 films."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "kluhyarg",
        "review_rating": "4",
        "review_title": "Weak movie",
        "review_detailed_main": "I remember watching this movie once when I was a kid, it was on TV and I \"watched\" while playing. Some days ago I was looking for something to watch on Netflix and found this movie, so I decided to re-watch this. I wasn't expecting much since some years ago I watched a negative review of this movie, but it was actually worse than I thought it would be.\n\nThe script is weak with the story having a lot of inconsistencies. The villains can travel really fast from one location to another and always know were to go. Captain America's powers seems to be almost nonexistent and he fails a lot in the movie. Also most of the action scenes aren't very good.\n\nWith that said, this movie is at least watchable. On the positive side the Red Skull make-up is very good and the Captain's uniform is very accurate to the comics."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Squonk",
        "review_rating": "2",
        "review_title": "Comic fans beware.",
        "review_detailed_main": "I've never read a Captain America comic book. But I don't have to to know that any fan of the comic won't be too pleased with this film. Matt Salinger does his best with a lousy story. Captain America doesn't even finish one mission before he's frozen in ice, only to be thawed out 50 years later. The Red Skull is the villain, but in most of the movie he looks like a guy with acne problems. However, we do learn that the Red Skull had a hand in the JFK assassination. How Oliver Stone missed that lead is beyond me. The Captain's super powers seem to be limited to throwing his shield and faking car sickness. On the positive side, at times the film does have the feel of a 40's serial. I would've liked to see that carried out, but the film never decides whether to be serious or kind-of-corny. Instead it just ends up being boring."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Dando83",
        "review_rating": "",
        "review_title": "Salinger treats it seriously",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Climinator",
        "review_rating": "5",
        "review_title": "WARNING!!! It's not quite what it seems!!!",
        "review_detailed_main": "Back in the mid-90s I watched this film and thoroughly enjoyed it as a child even though Captain America wasn't my favourite superhero. However, out of intrigue in the last few years, I have found out that this movie got a lot of the characters and settings completely wrong. For example when was Red Skull an Italian Fascist? He's always been a Nazi. Still, after watching the excellent 2011 Captain America movie with Chris Evans (not the former DJ) I set out to purchase that film. Picked the DVD and it turned out to be this one instead. Don't get me wrong, it's not as bad as some say however there was a lot of potential wasted. One big problem the film suffers from is that the writers tried to cram every single major moment of Captain America's history into a 90-95 minute film. It dosen't work successfully. Another problem is that the film obviously had severe budget constraints as you can often tell that actors are facing backdrops. Some actors have to even play multiple roles. On the plus side the acting is watchable with a very dark opening (on par with the opening of Xmen). The actor playing Captain America (Matt Salinger, son of author JD) gives a pretty believable performance as does the actor playing Red Skull (Scott Paulin).\n\nIts not a bad comic book movie, that title goes to Green Lantern for me. This one just should've stayed close to it's original resource material and not include every major moment of Captain America's history in 90 minutes. Having an ending where it could've been left open for sequels might've been a better idea.\n\n5/10"
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "ReelCheese",
        "review_rating": "3",
        "review_title": "A Disappointment",
        "review_detailed_main": "Superhero movies are again a hot property thanks to the big screen adaptations of Spider-Man, X-Men and Superman. As such, many film buffs who know little or nothing about Captain America have no doubt been picking this one up at the video store. Too bad nothing but pure crapulescence awaits them.\n\nWhere to begin? The movie has a dim look to it; the acting is second-rate; and the action and battle scenes are few and far between. It will disappoint most die-hard comic book fans, perhaps as much as those silly 1970s Cap films were. On a positive note, the action scenes aren't awful when the viewer finally gets to them. As well, the characters stay pretty true to their illustrated roots, and kids aren't going to be nearly as fussy as adult moviegoers about this one."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "tavm",
        "review_rating": "5",
        "review_title": "This 1990 version of Captain America can be pretty entertaining despite some noticeable flaws",
        "review_detailed_main": "Okay, so after watching the Republic serial from 1944 in which Captain America's alter ego was Grant Gardner, district attorney, and then two TV movie versions starring Reb Brown as Steve Rogers, occasional painter, I finally watched this 1990 version from Menahem Golan's 21st Century Film Corporation starring Matt Salinger as the super soldier from World War II that gets frozen for several decades before being thawed out. I liked the beginning where we find out about both his and The Red Skull's (Scott Paulin) early lives and there was a quite entertaining fight between them during the WWII sequence though it would have been nice to know what dastardly thing the Skull did that lead to that battle. But then we're abruptly taken to the present day to when Cap finds himself waking up to and it takes a little time to once again find some momentum. That said, having Ronny Cox and Ned Beatty as a couple of old pals now serving as president and reporter, respectively, was a nice treat for anyone who remembers them from Deliverance not to mention Beatty for his previous superhero encounter in the first two Christopher Reeve Superman movies. And how awesome it was to finally see the CA costume done right this time with both the wings on the cowl and the shield just the right size and color. Even more so was all the hot women that abounded though I have to wonder how any of them could realistically be daughters of the disfigured Red Skull! So in summation, this filmed version of Captain America may be a little on the underwhelming side concerning story logic but the action for the most part makes it worth it for at least one viewing though I probably wouldn't mind watching it again. Can't wait for Chris Evans in Captain America: The First Avenger later this summer."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "mnmus",
        "review_rating": "5",
        "review_title": "Semi-camp melodrama",
        "review_detailed_main": "Major B movie. (That's a good thing :-) Not a complete waste of time if you appreciate melodrama with some scene-chewing hamming. I do. Quite a few fun continuity issues to have fun spotting. No more or less unfaithful to the comic book Captain America than any of the other superhero movies/TV shows. Much better than the 1979 made-for-TV movie and (mercifully) short-lived series and a little better than the 1960s animated TV show, IMO.\n\nWhat raises this above a \"B-\" movie level is the \"seriousness\" of the melodrama. Fun. Watch it on cable, if it comes around or on a dollar rental. Have popcorn ready."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "JamesMovieGuy_117",
        "review_rating": "4",
        "review_title": "Bad but not irredeemable",
        "review_detailed_main": "Steve Rodgers becomes Captain America and must fight against the Nazi super soldier Red Skull. Captain America is however frozen in time until he awakens in 1990. Red Skull still wishes to fulfil his plan of world domination by becoming the president of the United States.\n\nI went into this movie expecting to hate it since that seems to be the general consensus. What I saw was bad on many levels but not what I would call irredeemable.\n\nOn the positive side the production isn't too bad. The editing is passable except for those awful montage sequences. The cinematography and lighting is not what I would call inept. The acting is okay but the terrible writing makes for some awful line deliveries.\n\nHowever, this movie has quite possibly the worst superhero costume of all time, rivalled by the motorcycle helmet wearing Captain America from the 1979 TV movie. He seems to have prosthetic ears attached to his head and the wings makes his appearance seem comical.\n\nThe tone is also all over the place. You have Nazis and Germans executing people and at the same time you have a running gag where Captain America pretends to be car sick and hijacks cars.\n\nIt's bad in a cheesy way. I would say the Fantastic Four 1994 movie was miles better in being faithful to the source material while having an extremely low budget. However, as I said, I did find some little things enjoyable like the action, special effects and even production qualities.\n\nI think you will either hate it or find it as a harmless bit of cheesy entertainment and fun."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Hey_Sweden",
        "review_rating": "5",
        "review_title": "Uninspired, but watchable.",
        "review_detailed_main": "After the Nazis have developed a process to turn an innocent boy into a super human entity, the Americans likewise experiment on average American youth Steve Rogers (Matt Salinger), who has polio. Steve develops incredible strength and resilience, is given a costume and shield, and is rechristened Captain America. The Cap fails spectacularly in his first mission, which is vanquishing Red Skull (Scott Paulin), the adult version of that Nazi experiment. He ends up frozen in Arctic ice for 47 years, reemerging in 1990 to do battle with the Red Skull once again.\n\nIt may be that this initial feature film vehicle for the legendary comic book hero (after two TV movies in the 1970s) will appeal more to casual viewers than longtime fans of the character. As it is, it lacks the spit and polish of major American product, and it will come off as cheesy and tacky to many viewers. Also, the scenario requires Steve to spend more time in civvies than in costume.\n\nBut this viewer didn't find it completely worthless; it's not without some amusements. Like the sight of the President (Ronny Cox), who'd glimpsed the Cap as a child, engaging in fisticuffs with various bad guys. Paulin is not a truly great villain, but he's a mild hoot anyway, and his minions include some very sexy (if inept) female assassins, including Red Skulls' own daughter (Francesca Neri). The action scenes won't blow the audience away, but they're adequate.\n\nThe main draw is a remarkably sincere Salinger, who makes for an appealing hero. Kim Gillingham, who gets an \"introducing\" credit, plays both Caps' lady friend and her daughter, and comes off better as the older lady. A variety of familiar faces - Ned Beatty, Michael Nouri, Darren McGavin, Melinda Dillon, Bill Mumy - are kind of wasted here, although McGavin at least gets a chance to be somewhat funny (it'd be a shame if he didn't).\n\nKids will likely be less judgmental than their adult counterparts, and might have some fun with it.\n\nFive out of 10."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "jl_downing",
        "review_rating": "4",
        "review_title": "Cheesy But Not as Bad As Batman and Robin",
        "review_detailed_main": "im not gonna sit here and justify this movie cus it cant be its crap...however if you like cheesy film (and i do) then its so cheesy its actually quite good....the effects are weird the acting is terrible and the story is poor and really weird and full of plot holes, however for some strange reason i cant fully comprehend i enjoyed it....i love these cheesy films....that aren't delibertly bad....but just cus they were cheap and couldn't afford better actors and sets...the film goes in a strange direction and i like films like that for some strange reason i cant comprehend, it isn't a movie i can really recommend but if your a fan of movies such as \"Plan 9 from outer space\" then this is your movie you'll love this....if you hate movies like that and your a fan of transformers and modern action movies then i'd probably avoid this one i think"
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "hannahbolecter",
        "review_rating": "10",
        "review_title": "so bad it's good",
        "review_detailed_main": "to say it lightly, i loved this movie. it's one of those cheesy types that is so poorly done that you can't help but smile. if you're the type who likes dumb movies like bring it on, the mummy, and chicken run, this could be the one for you!"
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "cLoNe",
        "review_rating": "7",
        "review_title": "Ah... It's not that bad...",
        "review_detailed_main": "The movie is quite bad, but not that bad. It has its good moments. If it plays on cable TV and you have nothing better to do, it's a nice way to waste a little time. Captain America deserves a better treatment, but what's done is done..."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "subxerogravity",
        "review_rating": "4",
        "review_title": "No. it's so bad it's good. enjoy it to laugh at it.",
        "review_detailed_main": "I'm confirming it is lame. It suffers from the same issues as the 1994 Fantastic Four, but unlike FF I can give it a, it's so bad it's good stamp (And I'm very happy about that).\n\nCaptain America is a pretty easy comic to adapt to the big screen, it's just an action adventure war movie about a guy who sometimes wears a mask. They did take some liberties with the character that make my Fanboy radar point up, but it's superficial.\n\nSteve Rodgers is now a boy from Southern California who has polio and offered himself up to the super soldier experiment headed up by a woman who escaped from the Nazis (The idea of a woman creating the star spangled avenger was cool, not enough female brainiacs in the comic book industry ).\n\nShortly after Steve Rodgers becomes Captain America the doctor is killed making Steve and The Red Skull the only one's like them. After stopping the Red Skull from destroying the White House he is trapped in Ice for 60 years and wakes up having to stop the Red Skull, who has formed an underground crime unit that basically is Hydra without saying it,again.\n\nProving how well Cap works as an action movie, Matt Salinger who plays Steve Rogers, wearing some sort of padding to make it look like he's got more than he does, barely wears the cartoonish suit they made for him (of course wearing the uniform makes him Captain America, duh)\n\nIt's got that 80s swagger to it. The Red Skull has his daughter do all the heavy lifting for most of the movie with her small army of rich Nazi brats who drive the fastest cars and wear the hottest fashions but more than capable with the guns.\n\nThey took some liberties with The Red Skull's origin too, I think this was to save money and film the entire movie in Italy (I'm also guessing that certain places in Italy look more like Southern California than New York City)\n\nI am being harsh on the movie because I've grown to like the character more now than I ever did when I was a kid and saw this, but like I expressed before, the movie does have a so bad it's food quality that makes it real enjoyable.\n\nhttp://cinemagardens.com"
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "comic207",
        "review_rating": "",
        "review_title": "I'm just glad he wasn't a surfer dude or a crusading D.A.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Uriah43",
        "review_rating": "5",
        "review_title": "Lacked the Special Effects of the More Modern Captain America Films",
        "review_detailed_main": "This movie begins in Italy just prior to World War 2 with government soldiers breaking into a house to kidnap a young boy and then murdering his family in the process. The reason for the kidnapping is that they need a test subject for an experiment which might allow them to create super-soldiers for their army and dreams of conquest. Yet, even though the experiment is a complete success, the doctor involved in it becomes horrified by the ruthlessness of those she works with and manages to escape to the United States with all of the secrets required to continue her work in her head. She then continues her research in the United States which eventually concludes with the making of a super-hero named \"Captain America\" (Matt Salinger) to counter the super-villain created in Italy who goes by the name of the \"Red Skull\" (Scott Paulin). Unfortunately, her success is short-lived as she is assassinated by Nazi agents and the secrets she had dies with her shortly afterward. But with war breaking out both Captain America and the Red Skull soon clash with each other and the story becomes even more pronounced after that. Now rather than reveal any more I will just say this the particular movie lacked the special effects of the more modern Captain America films which clearly resulted in an inferior picture by comparison. Even so, I didn't think the movie was necessarily bad as it still managed to entertain to a certain degree. That being said, I have rated this movie as about average and recommend it to those who enjoy films of this type."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "gavin6942",
        "review_rating": "3",
        "review_title": "Not a Good Film, But Enjoyable in its Badness",
        "review_detailed_main": "Steve Rogers is turned into a super soldier to fight the Red Skull during World War II. He loses and is frozen for fifty years. When he comes back, he finds the Red Skull has assassinated Kennedy, King and has become one of the world's most powerful supervillains and businessmen. Can he stop the Skull now?\n\nThis film is fun if you like seeing a guy in a bad costume run around and throw a shield, while a man who looks and acts like Jimmy Carter is a crime-fighting president (and protector of the environment). It's light on plot, light on character development and even the action comes off as more cheesy than anything. But to be honest with you, this was more fun than almost any of the modern comic book films. (For example, \"Batman Begins\" is a phenomenal film -- but it's not as easy to sit back and laugh at with a beer.)\n\nWhy is the Red Skull Italian? As I recall from the comics, he's quite German, and there was no real reason to change this for the movie. I mean, if you're fighting the Nazis, isn't it just more logical to have the villain be German? Where did he get a daughter from? This remains unanswered. Other things seemed fishy... and even the decoder ring, which was important to the story, never paid off as fully as I would have liked (and what exactly did it decode?).\n\nIf you get a copy of this movie, keep your expectations low and your supply of Busch Light very high. Not a good movie, unless you love ripping apart such films. I do, so I loved it. But I wouldn't foist it anyone... but maybe the old \"Punisher\" film..."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "aesgaard41",
        "review_rating": "1",
        "review_title": "Batman Has Nothing To Worry About",
        "review_detailed_main": "You really have to be a fan of............oh what the heck, this movie just plain stinks! The costume looks horrible, too many liberties were taken with the characters and the plot lurches forward badly. It basicly starts out with a few minutes in one place, a few minutes in another, a few more elsewhere......you get the idea, and then all these separate incidents gradually and slowly lead to one single plot. MST3K's Pod People was easier to follow ! Few good things about this, Matt Salinger looks enough like Steve Rogers should, but is hampered by the lousy script and implausible plot. The culture shock he has returning home after too many years is done fairly well, and the Red Skull seen at the top of the movie reminds me of a cross between Freddie Kruger and Jason Voorhees. This movie could have been so much better set entirely in WW2 with the opening scene of Hitler screaming at his generals, \"I could make that bellboy a better leader than any of you !\" That is from the mythos of the comic book. After the opening credits, we should have seen the process of Rogers becoming the hero who goes on to fight the Red Skull, who through most of the movie should have been spoken of and referred to, but not seen. This movie needed that sort of impact, the indication of the sort of evil the Nazis represented, but as it is, it's just one big car wreck on the \"to-do\" list at MST3K."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "benjaminweber",
        "review_rating": "2",
        "review_title": "An early failed attempt to start the MCU",
        "review_detailed_main": "This is something that is often overlooked about this film. A couple of throw-away lines of dialogue between the future president and his friend after spotting Cap strapped to a rocket indicate there may have been plans to start the MCU with this film, as two other Marvel characters are directly name-checked. Sadly, these plans were put on hold, due to this disaster that involved Cap stealing cars by feigning car-sickness, walking away from the car, then running back and driving off when the driver went to check he was okay. Other than a few laughable moments like this however, this film is extremely dull. It's worth watching if you're a die-hard Marvel/Captain America fan, or a lover of bad film, but otherwise don't bother."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "SkullScreamerReturns",
        "review_rating": "4",
        "review_title": "Below average fun fest",
        "review_detailed_main": "Watching this movie was mildly entertaining, I was not really bored. But when it was over I was like \"man, that was a dumb movie\". Started to realize the plot was not good, acting was not good...\n\nWell, the beginning is kind of good, it sets a darker tone with the origin of Red Skull. I liked how the movie goes straight to action and does not waste too much time on explaining every detail. Things start to happen, and I'm ready for a great fun action flick. But on the latter half the plot starts to stagger and not much interesting happens. I'm glad I finally watched this weirdo movie but I hope I don't have to watch it again anytime soon.\n\nBut if you think this is bad, then watch \"Three Giant Men\"..."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "spiggyspic",
        "review_rating": "1",
        "review_title": "There is no God!!",
        "review_detailed_main": "As the planet whirls toward the devastation of floods and earthquakes, famine, disease and war, I will remember the horrible onslaught this movie defacated into my memories and nightmares. This... \"film\", will utterly lower your I.Q. It is an assault on your intelligence and dignity as a human being. The Red Skull is not even the Red Skull!! It's the Red Skull after plastic surgery to make him look human. I wonder if there is a category of movies that is BELOW low budget. If even ONE actor in the movie could act, this film might be able to pass for a piece of crap. When all is done and I lay on my death bed, I know these are 2 hours of my life I will never get back."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "willnuts",
        "review_rating": "3",
        "review_title": "Cheap but descent",
        "review_detailed_main": "For starters, Matt Salinger is the best captain America, he has the same looks as the comic. And he looks likable to be someone who want to save the world.\n\nWith that said the rest of the movie feels lazy, but still entertaining enough specially for the kids.\n\nNot the worst movie, it is what it is."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "nathanno",
        "review_rating": "10",
        "review_title": "I don't understand how anyone can dislike this movie",
        "review_detailed_main": "I was a child when I first watched \"Captain America,\" and I loved it. So, when I saw that it was on Hulu.com, I decided to rewatch it and relive some of my childhood. I also wanted to see how I would evaluate it as an adult. Did my childhood naiveté color my perception of this movie? Did I only think it was great because I was too young to understand it? My conclusion- absolutely not! THIS MOVIE IS GREAT. It has a solid story, good action sequences, a great pace, and Matt Salinger is perfect in his role.\n\nSome people may criticize this movie because it lacks CGI and modern effects, but I think that this is an area in which the current generation is spoiled. CGI is used way too often nowadays, and I much prefer traditional special effects. None of the special effects in this movie looked fake, and the fight sequences in it were much superior to modern films where the camera is so zoomed in and shaky that you can't tell what's happening.\n\nThis movie also has a good message and heart. It's not just flashing lights and oohs and aahs- it has a story. I highly recommend it to anyone, and I seriously doubt that the upcoming Captain America film will surpass this masterpiece."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "ersinkdotcom",
        "review_rating": "7",
        "review_title": "\"Captain America\" gets way more flack for being cheesy and low budget than it deserves",
        "review_detailed_main": "Before 1998's \"Blade,\" Marvel Comics couldn't seem to catch a break when it came to movie versions of their different properties. In the wake of \"Iron Man 3\" and \"The Avengers,\" I know that's very hard to believe. There was a serial for Captain America released in 1944 through Republic Pictures. George Lucas executive produced a live-action adaptation of \"Howard the Duck\" in 1986.\n\nThe next few years up to Wesley Snipes' take on the legendary vampire slayer were plagued with low-budget versions of the comic book publisher's characters. Dolph Lundgren's \"The Punisher\" couldn't even muster a theatrical release in the U.S. Roger Corman's \"The Fantastic Four\" never officially saw the light of day anywhere, although bootleg copies float around.\n\n21st Century Film Corporation released \"Captain America\" straight to video in the middle of those two disasters. For many years, the movie was hard to get a hold of and only released on VHS. Shout! Factory released it on DVD and made it widely available to those who sought it out for so many years as a sort of Nerd Holy Grail.\n\nSeveral years after being caught by Red Skull and left for dead, Steve Rogers is found frozen in the ice and thawed out. He discovers Red Skull received plastic surgery to hide his true identity and is heading up a group of world leaders set on kidnapping the President of the United States for their own diabolical ambitions.\n\nIs \"Captain America\" filled with cheese? If you judge it from a modern standpoint, of course it is. If you look at it as being a piece of World War II propaganda filmed in the 1940s, you'll find it totally hits its mark. That's the standpoint I choose to view it from.\n\nMy only real issue is that we only get about 5 minutes of face time from the real Red Skull. The rest of the film features actor Scott Paulin in flesh-colored make-up topped with scar lines. It's a real letdown for fans of the Red Skull who wanted to see the character the way he looks in the comic books.\n\nI still think that \"Captain America\" gets way more flack for being cheesy and low budget than it deserves. Is it on the same quality level as \"Captain America: The First Avenger?\" No way! However, it has an inviting and personal flavor to it that still works 23 years later. Real comic book fans will find value in this adaption and appreciate it for what it is."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Platypuschow",
        "review_rating": "3",
        "review_title": "Captain America: About on par with the 1979 outings",
        "review_detailed_main": "Captain America returns after over a decade on the shelf with a shiny new shield and somewhat less ridiculous costume but is it any less cheesy?\n\nWell, yeah but it's no better.\n\nCaptain Americas origin story is told and after thawing out he goes after his nemesis the Red Skull.\n\nMuch like the 1970's movies Cap is in civilian clothes for the vast majority of the film which I find a strange decision, the action sequences aren't as frequent but a tad more realistic.\n\nCosting over 10 million this was considered a big deal but despite a star studded cast this was actually somewhat of a bore and the leading man seemed out of his depth.\n\nOutside of the modern Cap movies I'd recommend the 70's movies over this or the 1944 classic.\n\nThe Good:\n\nRed Skull actually looks quite good (For the brief moments he's in it)\n\nThe Bad:\n\nMatt Salinger is such a goofy looking guy and the mask just makes it worse\n\nIncredibly boring for an action film\n\nThings I Learnt From This Movie:\n\nMarvel actively declaring one of their heroes is inferior to a DC one seems a bit foolish"
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "KrowbOy",
        "review_rating": "",
        "review_title": "U may hate me for this!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Elijah_Chandler",
        "review_rating": "3",
        "review_title": "For fanboys and girls only.",
        "review_detailed_main": "First of all, who knew that famed reclusive J.D. Salinger even had a son, let alone a B-Movie actor son? That's right, the actor who plays Steve Rogers/Capt. America is Matt Salinger, son of the aforementioned author of \"Catcher in the Rye\". About the movie though. I wouldn't rate this as a horrible movie, but it sure wasn't good. Salinger did an OK job as the Cap but his acting prowess wasn't quite good enough to pull off the 50's guy coping with the 90's lifestyle the script called for. And the Red Skull? How do you mess that up?! He's one of the scariest freaking villains in all of comicdom, how could you go wrong? Oh, buy making him a Caucasian Greek mob boss, that's how. I would only recommend this film to die hard fans of the cap or true movie geeks. I happen to be both so I made myself find some good qualities (but it was really, really hard).\n\nAs for those of you who share my affinity for comics and bad movies but can't seem to get their hands on this gem, I can only tell you that it's been out of print for more than a decade now and your best bet is to find it at the next comic con in your area or at a flea market that sells bootleg tapes (ditto that for the Fantastic Four movie from '94)."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "ironhorse_iv",
        "review_rating": "3",
        "review_title": "Shield your eyes from ever watching this film! It's really, really bad. Unless, you like torturing yourself.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Ai-Fan",
        "review_rating": "3",
        "review_title": "Captain America's superpower:",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "invisibleunicornninja",
        "review_rating": "4",
        "review_title": "Good for a laugh.",
        "review_detailed_main": "Sights and Sounds - The cinematography for this movie is pretty bad. The camerawork isn't all the great. The visual presentation is below average and makes this movie even more boring. There aren't a lot of effects, but for the most part they are hideously bad.\n\nCharacters - All the characters are actually somewhat decent. The acting is ok. Some of the actors are worse than others. This movie tries to have several very dramatic and sad scenes that are a bit undercut by the subpar acting. If the actors were better, I'd probably have been closer to tears but as-is I was laughing.\n\nGeography - For some reason the people making this movie didn't take into account the world when they were making it. Germany, Washing DC, Alaska, and California are nowhere near as close to each other as they seem to think. Also, you can't drive a car from California to Italy (which I'm assuming is what they did. There is no implication that they flew, and I'm pretty sure that Captain America doesn't have a valid passport).\n\nPlot - The plot is ok, but the problem is that its executed very sloppily. If you're not paying very close attention, nothing is going to make any sense. Overall, the sequence of events in this movie are pretty random.\n\nLanguage - There are a few scenes where people aren't speaking English. For some reason, only about every other line is subtitled. Just random parts of the conversation are translated. I don't care if the Germans are speaking German, just make up your mind wether or not you want us English-speakers to understand.\n\nOverall, this a poorly made, boring movie. Its not really worth to watch as a so-bad-that-its-good movie because its not even that funny except for a few \"wtf\" moments."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "filipemanuelneto",
        "review_rating": "1",
        "review_title": "Terrible.",
        "review_detailed_main": "Looking at this film, and then comparing it to the latest superhero films, is like watching a football match of the third national division and trying to compare it to any European Champions League match. It is almost unfair to make this comparison, which, despite that, is almost inevitable.\n\nIn fact, in 1990, we were a long way from the visual spectacle that CGI got used to us, and which revolutionized cinema at all levels. That, and also cinematography, would be enough for this film to look primitive. However, this film has a bad plot, poorly developed and badly played by second-rate actors, directed by Albert Pyun, a name that instantly transports us to the universe of B and \"trash\" films. The result, therefore, was predictable. Rather than a third national division football match, this film is closer to an inter-school soccer tournament.\n\nSurprisingly, the film even starts well: without wasting time with introductions, it reveals the creation of the two rivals: the Red Skull and Captain America, whose origins are linked, a thing that the film reasonably reveals and explores. However, the script, by Stephen Tolkin, did not prove capable of developing the plot that, from some point, becomes irritating, predictable, uninteresting. The ending is so anti-climatic that I don't think it's worth talking about it.\n\nMatt Salinger is not a bad actor, but he was not born to be a protagonist nor is he particularly talented. He seems to struggle and tries to take himself so seriously that he sounds forced. Perhaps it would have been better if he tried to have a little more fun with his character and make the film sound funny. He didn't, and it became horrible, and it helped a lot to take the fun out of a movie that otherwise might at least have been funny. It is a pity."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "ThunderKing6",
        "review_rating": "1",
        "review_title": "this only deserves a verdict from me",
        "review_detailed_main": "Verdict: this was really awful. It was bad. Everything about it sucked really bad. It was very boring. I mean its useful if you want to use it as a sleeping device."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "dasa108",
        "review_rating": "5",
        "review_title": "Good B class movie.",
        "review_detailed_main": "The recently deceased Albert Pyun offered us great class B films that with barely a budget at least fulfilled the function of entertaining. The key was to have some history, a cast immersed in the story and not rely on special effects (on that issue we barely have a couple of sequences that stand out). Although it cannot be compared to the later works, it is a decent film that offers us the classic heroes in their confrontation with their nemesis Red Skull while the fate of the free world hangs in the balance. It has rarely been possible for an action film made by a specialist in exploitation cinema to remain in the memory of moviegoers. This is one of those rare cases."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "OliverPage547",
        "review_rating": "10",
        "review_title": "Still one of my favourate comic adaptations",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Bored_Dragon",
        "review_rating": "7",
        "review_title": "I loved it",
        "review_detailed_main": "I cannot say I had no expectations from this movie, because I did. I expected it to be unwatchable crap that I'll give up on after ten minutes or so. I mean, it has rating 3,3/10 and it's bashed all over the internet. What can one expect from superhero B production of 80's anyway... But I was in for a pleasant surprise.\n\nThe movie is shot at Adriatic sea, which guarantees a beautiful scenery, and chases in Dubrovnik are a real joy. I was worried because it's produced in Yugoslavia in cooperation with Jadran Film, but from the result I suppose 21th Century Production and Marvel Entertainment had most of the work done. Movie is pretty much faithful to comics and Captain America's costume is just as it should be. Acting is decent, action is few, but when it comes it's well directed, and movie has nice comic-book atmosphere. There's no nudity, vulgarity or explicit violence, except for gunfights and common fist-fighting, so it's whole family friendly. There are few nicely done emotional scenes and just a bit of humor. I enjoyed it very much.\n\n7,5/10"
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "SnakesOnAnAfricanPlain",
        "review_rating": "1",
        "review_title": "Captain America (1990)",
        "review_detailed_main": "Back in Marvel's early 90's days. This God awful, pathetic, cheap, and cheesy film plagued the world. It's horrible. Not just the cheap costumes or poor make-up, which goes so far as to give Captain America plastic ears to stop chafing. Captain America is the worst hero of all time. His greatest technique is pretending to be sick so that people get out of their cars. Very confusing, especially when the Red Skull is revealed to be Italian for some reason. It's also poorly shot, with one segment lit entirely with blue lights, like some dodgy porno. The shield throwing soon gets old, and even it's camp charm couldn't keep my attention. I'd accept this from the 60's, but after the release of Burton's Batman, comic films should have known better. If this wasn't bad enough, some terrible song numbers are used to cause you to vomit."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Hypno-2",
        "review_rating": "",
        "review_title": "This is the Best B-movie i've ever seen!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "covington_c",
        "review_rating": "1",
        "review_title": "Exceptionally AWFUL!",
        "review_detailed_main": "Acting... horrible! Latex rubber cap suit... horrible! Plot & story... horrible! There is absolutely nothing redeeming about this pos movie! The 70's Nicholas Hammond Spider-Man movies are even better!"
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Dock-Ock",
        "review_rating": "4",
        "review_title": "Lukewarm, but nostalgia gets you",
        "review_detailed_main": "I remember when this movie came out in 1990. It was released in Cannon Cinemas in Great Britain. Captain America himself was there on the opening night handing out shields,flags and a big ol' slice of moms apple pie. I was expecting typical Cannon material, cheap and cheerful, and looked forward as the movie started. Then the lights went out, the movie started and i had to sit through 90mins of the most uninspired trash. The problem lies first and formost with the script. It has awfull dialougue weak characters and worst of all no humour. How can we laugh along with the movie if there are no laughs?. Albert Pyun is the best director to be expected for such a project, both Cyborg and Sword and the Sorceror were half decent, but he has a really difficult time handeling this movie. Aslo, Mat Sallinger is TOO bland as Captain America. Maybe if Cannon had forked out for someone like Dolph Lundgren or Miles O'Keefe [both had worked for Cannon before], we'd have sympathised with Cap more. Worst still is Scot Paulin as The Red Skull. A character as unbelievable as that needs a little humour. Just as Frank Langella was a good choice as Skelator in Cannon's earlier Masters of the Universe, Paulin is bad. Thank god for Ned Beatty and Ronny Cox, who just about rescue this poor film from dying. Also there is half decent special effects and a good version of Caps suit, sheild. Overall though, a disappointment. Possibly the most unrememborable film in history"
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "bensonmum2",
        "review_rating": "4",
        "review_title": "\"If we don't take this medicine now, we'll all die. Slowly... but we'll die. Thank you.\"",
        "review_detailed_main": "During WWII, a brave, patriotic young man undergoes a series of painful experiments that turn him into a super-human. He takes the persona of red, white, and blue wearing Captain America and heads to Nazi Germany to do battle with a character known as Red Skull. Red Skull is a similarly enhanced man. Captain America loses the battle and ends up frozen in ice in the wilds of Alaska. Fifty or so year later, Caps body is found. After he's un-thawed and regains his senses, he discovers that his old foe, Red Skull, has taken a secret identity, but is still up to his old tricks. His latest plot involves kidnapping the President of the United States so he can implant a controlling device in his head. Cap will once again try to stop Red Skull.\n\nWhile not a total disaster, the 1990 version of Captain America isn't what I'd call a \"good\" movie. My main problem is with the script. It's what I'd call lazy. There is no logic behind much of what happens on-screen. I'm going to limit this to two or three examples of what I'm talking about. Otherwise, this could go on forever. First, Cap is thawed in Alaska. As he's walking through Canada, a reporter from Washington, driving a pick-up truck, just happens to be in the right place at the right time and almost literally runs in to Cap. Yeah, sure. To stretch believablity even further, a gang of baddies from Italy, who are also searching for Captain America, miraculously discover his whereabouts at almost the exact same moment. What are the odds that these people would find a lone man on foot in the wilds of Canada at the same time? It's just stupid.\n\nThe second example of poor, lazy writing and a lack of logic involves the \"crew\" Red Skull sends to take out Captain America. You'd think that a real bad dude like Red Skull would have an army of henchmen at his disposal. But for some bizarre reason, he doesn't. Instead, he sends his 20-something daughter, her model friends, and their boyfriends to deal with his mortal enemy. I can't think of a less threatening looking group of supposed killers.\n\nFor my third example, I'll mention the aftermath of the Preident's kidnapping. Captain America and his little girlfriend are looking for the President, but they appear to be alone. Where in the world is the Secret Service? Where are the Italian police? Where is the military? If the Preident of the USA were to actually be kidnapped, almost everything in the entire world would come to a complete halt. Instead, things in Italy, where the President was kidnapped, seem to be going on as if nothing happened. Not very likely and, again, stupid.\n\nAdd these problems I have with this dog of script to some pretty bad acting, poor special effects, a mind-numbingly ineffectual Captain America, and lame fight choreography and you've got a bad movie on your hands. While I did enjoy bits and pieces of the film, the whole is so bad I cannot give Captian America a positive rating."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Achoo42",
        "review_rating": "1",
        "review_title": "The Captain's capers will cause caustic catastrophic cringe.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "alexanderdavies-99382",
        "review_rating": "3",
        "review_title": "Dire and alarmingly bad!",
        "review_detailed_main": "Even the 2011 Hollywood movie is a bit better than this dreadful mess! It's no wonder the Americans weren't that fussed about releasing the film. \"Captain America\" made no money at all with the limited release it was given. It disappeared without a trace. The plot is incomprehensible most of the time. I can't imagine why Ronny Cox bothered with appearing in this rubbish."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "daltonml-1",
        "review_rating": "1",
        "review_title": "Don't Waste Your Time On This Piece Of Trash, Pal!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "adamscastlevania2",
        "review_rating": "4",
        "review_title": "A curiosity piece for fans only",
        "review_detailed_main": "(38%) Just before the days of mega budget, effect ridden, super blockbuster Marvel comic book movies, the world had this, and compared to the brilliant Batman movie released around the same this is pretty weak. What this rather forgettable movie does show though is how far these movies have come in quite a short period of time. The most notable aspect of this is how old and dated it looks. Its release was delayed and it really shows as this feels more like an early 80's movie than an early 90's one. Matt Salinger as the title role gives a dull performance throughout, particularly for a man that not only was given super powers, but frozen in time for decades, as he may as well be doing his taxes. Couple that with a plot that is very loose around the edges and your left with a movie that can only be enjoyed as a curiosity piece and nothing more."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Bykrscout",
        "review_rating": "10",
        "review_title": "Costume costume costume...",
        "review_detailed_main": "Say what you will about this movie, the Captain America costume in it and the shield was amazing to watch. the costume designer faithfully recreated the costume and did a wonderful Batman like thing with the cowl. I own the Matt Salinger cowl and tunic from the movie and I assure you they are works of art. The movie? Well, thats another subject. I think if I didnt have pieces or props from the movie it wouldn't seem as interesting to me....but some of the eyeball candy in the movie is worth it. I just despised the physical depiction of the Red Skull...they could have done so much more with the make up...instead it looks like a bad Darkman rendition."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Topher007",
        "review_rating": "7",
        "review_title": "So Bad It's Good",
        "review_detailed_main": "This is one of the great bad movies of all time. The thought that someone even made this movie makes me laugh. I love it. Don't look for any greatness here just dumb dumb fun. A movie to laugh at not with. This movie had such a cult following that although it's not listed here, and I have yet to see it, there was a Captain American 2. I really must get my hands on that."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Fewox",
        "review_rating": "1",
        "review_title": "A prime example of what a \"1\" vote should be reserved for.",
        "review_detailed_main": "This is without question one of the worst films I have ever seen. It fails in so many ways that I feel it is a perfect example of a what a film should be to rate a \"1\" on the IMDb Vote.\n\n1. It fails as an adaptaion of a comic. Captain America is not a great hero who is frozen and thawed in this film. He is a ill prepared looser who gets his butt kicked in his first ever fight. Then we don't even see the red white and blue and shield again until the final fight. Captian America was an \"action\" comic folks. A film about Captain America should have lots of action!\n\n2. This is somewhat related but even if you decide to give the film maker a break on the lack of action the rubbish in the middle is so boring that you will wear out the head on your VCR as you fast forward looking for something that looks promising.\n\n3. I don't care what the apologists for this film say the acting is not good in this film.\n\n4. The plot is terrible. Come on. Even if Cap could have diverted the rocket launched at the White House by kicking the fin, and even if he could have survived the impact I really have trouble figuring out why a rocket that is supposed to only have to travel to Washington DC has enough fuel to get to Alaska.\n\nOver while the beginning and ending of the film show flashes of what this film should have been like the incredibly boring middle of the film and the lame plot make this one of the few films I feel really deserve a \"1\". For other \"1's\" see \"Superman 4\" and \"Hudson Hawk\""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Indyfan82",
        "review_rating": "",
        "review_title": "One of the best Captain America movies yet!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Alberto-7",
        "review_rating": "2",
        "review_title": "Not worth your time.",
        "review_detailed_main": "This is not the worst comic book adaptation as many have said. It is a dull movie with almost no special effects and a story that has no delivery whatsoever. Most of the actors sleepwalk through this film(the Red Skull's daughter for example looks particularly sleepy) and there is hardly any adventure to speak of. Matt Salinger is OK as Captain America but even he can't shake the boredom out of this movie. The only positive is the costume and shield. Too bad Captain America is in costume for so little screen time. The least said about the Captain's modern day girlfriend the better.\n\nDon't waste you time on this one. It makes the 1944 Captain America serial look like a masterpiece in comparison."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "RobTheConqueror",
        "review_rating": "1",
        "review_title": "Let's just forget this one",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "ericstevenson",
        "review_rating": "3",
        "review_title": "As bad as it gets for Marvel",
        "review_detailed_main": "I realize that almost all of the bad superhero movies I've seen (\"Catwoman\", \"Steel\") were all based on DC properties. I knew I simply had to watch this movie if only because it's the lowest rated film based on a Marvel comic on this entire website. I think my old worst Marvel movie was \"Daredevil\" and this is easily worse. At least it's a step up from \"Killer Tomatoes Eat France!\". There are simply so many things wrong with this movie and I am so glad they made a good movie with \"Captain America: The First Avenger\". While that personally isn't one of my favorite Marvel movies, it's great to compare the two and how the new one is so much better.\n\nThis one makes the mistake of having a third of it set in World War II, instead of the whole movie. This was set up much better in the recent movie. The special effects are quite poor, with Captain America's shield looking like a giant Frisbee. They couldn't even get the Red Skull right. He has a nose in this movie for some reason, even though it's obvious skulls don't have full noses. He didn't have ears, so why did they get that right but not his nose? There's a scene where Captain America grabs him and the Red Skull cuts off his own hand. Why not just cut Captain America's hand off? The Captain himself is weak and a jerk in this movie. He steals a good guy's car and just leaves him alone on the road!\n\nLater, he steals another car. He's easily beaten by the Red Skull when he first appears. This is one pathetic superhero. The Red Skull even forgets that he read a newspaper that the Captain was frozen for decades! He spends most of this movie not even as a skull. They could have at least said he wore a mask instead of some insane plastic surgery. The movie goes on too long and its climax is boring. The Captain was supposed to have polio before the experiment, but he's a perfectly capable tall human being before! This fails on all levels and I have never seen a great comic book company go so low. There's a reason superhero movies are so popular nowadays. They're actually good! *1/2"
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "lisitsinnick",
        "review_rating": "2",
        "review_title": "That wasn't captain America....that was USAgent",
        "review_detailed_main": "This film is bad.....just bad it's may be watchable but I don't recommend it, the acting is bad, the camerawork gives you a seizure, and the pro environment message is pandering, while it's not \"supergirl bad\" it's still pretty bad."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "undeadhaiena",
        "review_rating": "1",
        "review_title": "n/a",
        "review_detailed_main": "The Super Soldier Serum didnt do anything. The hand dryer scene was like if a normal human being destroyed the wall with the hand dryer from the exact place and there was already a crack from when Steve tore it out. And he is slow as a snail,So the movie would be the same without the Serum."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "bkrauser-81-311064",
        "review_rating": "3",
        "review_title": "Just Kind of Forgetful",
        "review_detailed_main": "Not to be confused with Captain America: The First Avenger (2011), Captain America is a cheaply made adaptation of the now famous Avenger, executive produced by the actual Stan Lee. Given a limited release years after it was initially made, Captain America is about the titular hero's (Matt Salinger) early years fighting the Germans and Italians during WWII. After attempting to sabotage Nazi rocket experiments, spearheaded by arch-nemesis The Red Skull (Scott Paulin), Cap is put on ice and is unfrozen in 1990s. He then is caught up in an assassination plot involving the American President (Ronny Cox).\n\nCaptain America is a lazy, inept, structure-less low-budget film that never truly reaches the dubious heights of \"so bad it's good\". Unlike the audaciously ridiculous Fantastic Four (1994) film that was supposedly the last straw for Lee, Captain America is just benignly boring. The film is even more painful when you consider that Matt Salinger is actually trying here. He's not strictly speaking bad as Captain America, he's just out of his depth and undermined at every turn by director Albert Pyun's unflattering visuals. Well at least Captain America finally got a real debut in 2011 thus allowing fans to all but ignore this cheap and boring film."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "aparnavigneshwaran",
        "review_rating": "2",
        "review_title": "Good acting but major wardrobe malfunction",
        "review_detailed_main": "It wasn't a bad movie but it was really annoying to watch a movie with Captain America wearing a mask that makes him look cross eyed. With so little attention being paid to the costume of the protagonist, it was irksome thing that just bothered me the whole time. But both stars for the movie goes to the actors who despite the ridiculous costume worn by the Captain managed their dialogues and emotions very well rather than ridiculing the costume and director."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "The-Canadian",
        "review_rating": "8",
        "review_title": "Captain America: The True Comic Film",
        "review_detailed_main": "To many people bash this movie, and personally, I think it is one of the most faithful adaptations I've ever seen from anything to screen for this time period.\n\nTHE BAD: The red skull's look at the end of the movie wasn't really all that crappy... it just wasn't the red skull... I have to admit they did take their time to get where they were going in the middle of the movie.\n\nTHE GOOD: The good greatly outweighs the bad in this film. Matt Salinger does a perfect rendition of Steve Rogers/ Captain America in his childish \"gee whiz\" kind of way. The Red Skull's make up in the first half of the film is breath taking, and Scott Paulin (with a great assist from the script) gives more character depth to the Red Skull than I've ever seen in the comics. The opening half hour rushes by with grace, ending with a fantastic battle inside a Nazi stronghold, and the climatic battle between Cap and the skull at the end is also unbelievable. And don't get me started on the \"Pull over. I feel sick.\" parts of it.\n\nOVERALL: One of the best comic films out there, even after seeing some of today's, it's the perfect adventure for the whole family!"
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "johnc2141",
        "review_rating": "7",
        "review_title": "not bad",
        "review_detailed_main": "i know many will disagree with me but i thought 1990s captain America is not a bad movie,true it could've been better but so far it fares better then the others.as far as the new one i don't know yet but having seen the serial and the TV movies its better.there's a good cast including Bill Mumy,Micheal Nouri,Melinda Dillon,Ned Beatty,Darren Mcgavin,and Matt Salinger as Steve Rodgers aka;captain America.and character actor Scott Paulin as the red skull.there is some great fight scenes and the shield throwing was done well.and there is a sexy beautiful femme fatale played by Francesca Neri.many marvel comics fans bailed on this movie which bombed at the box office and went to video.the budget was low but the movie is a 7,which means it was not bad,but not great.the forth coming one should be good.i don't want to give away any spoilers but its really worth a viewing.not sure its on DVD yet but i know its on hulu.com."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "MentosMan",
        "review_rating": "1",
        "review_title": "Bwah-ha-ha-ha",
        "review_detailed_main": "\"Stop calling me your brother!\" Hey, stop calling this a movie! I could have made a better film with a VHS camcorder and the cast of an elementary school Christmas program! Anyway, here's my big question: Why wear a mask? Everyone knows his secret identity, and if they don't, he takes it off at the end anyway! Just leave the mask at home!"
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "cwhipple",
        "review_rating": "",
        "review_title": "A fun movie based on a classic comic character!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "EazyE-3",
        "review_rating": "1",
        "review_title": "how can anybody have ever allowed this to be released!",
        "review_detailed_main": "This is by far the worst movie I have ever seen. It was plain and simply a horrible film. Some awful films are great to watch and bring genuine excitement to the viewer as he/she laughs hysterical at the awful development. This movie had none of that and in fact made me cry. Have you ever watched a movie and felt uncomfortable watching it because it was so awful? Well, if you have, then you know what i'm talking about. If you haven't, watch this movie and you'll quickly realize what i'm talking about."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "SunTsu",
        "review_rating": "1",
        "review_title": "Godawful comic adaption",
        "review_detailed_main": "You haven't known mental anguish until you've seen this movie. In hindsight it is a major miracle that any studio would have touched any Marvel franchise with a ten foot pole after this stinker. Production values hover near zero, the dialogues make you cringe all the way through the movie and the whole story is beyond nonsensical, even for a comic.\n\nThe only upside are a few female Italian bad guys in the latter half, but the price to suffer through to see them is not worth the admission. Watch this movie with a couple friends so you know just how great straight to video stuff can be in comparison. Give Eddie Murphy a copy for his birthday so he'll feel much better about Pluto Nash."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "TheDuck-3",
        "review_rating": "1",
        "review_title": "Could They Have Made This Film Any Worse?",
        "review_detailed_main": "It's obvious that the people who made this have no feel for the characters or the comics. The story is full of holes, lacks logic (why did the Red Skull cut off his own hand to escape Cap instead of plunging the knife into Cap's chest? And why was there no blood gushing from the Skull's wrist?) While they did some things right (they did manage to make Matt Salinger look scrawny before the experiment), overall it was another attempt to take a character with a long history in the comics and put the filmmakers' own spin on it to poor effect. Captain America is a great character, and I'd love to see him done right, but after two poor TV movies and this wasted effort, I just don't think there's anyone in Hollywood who's willing to take the chance and make movie about a straight arrow superhero."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Captain_Couth",
        "review_rating": "3",
        "review_title": "Revenge of the 80's: Bad comic book adaptations! (this movie was made in 1989).",
        "review_detailed_main": "Captain America (1991) is a lame attempt to bring one of Marvel Comic's cornerstone characters to the silver screen. Whilst it's better than the mediocre t.v. movies, the end results are still the same. I wish that the filmmakers would have bothered to spend a half hour of their time and picked up an old issue of Captain America. They changed too much of the original story for this to have worked. I mean they had all the right parts to make a decent film but it winds up missing a few cogs and gears. The final product is a lemon. It has a nice body but the engine is totally trashed.\n\nDude, my advice is if you're going to make a movie about a comic book hero please read it first. Because if you don't, you're going to wind up with a real stinker.\n\nI would recommend this movie for die hard Captain America fans only. This movie had a chance but the filmmakers blew it! They dropped the ball big time. Oh well, maybe next time."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "utgard14",
        "review_rating": "3",
        "review_title": "\"It's bad medicine...and nobody said the medicine was going to taste any good.\"",
        "review_detailed_main": "During WWII, Steve Rogers (Matt Salinger) volunteers for a government experiment to become the ultimate super solider, Captain America, and finds himself facing the evil Red Skull (Scott Paulin). After stopping a missile launched at the White House, Rogers is frozen in ice for fifty years. When he's thawed out, he discovers the Red Skull is still around and causing trouble, although now part of a conspiracy involving mafia and military industrialist types who want to stop the President because he's an environmentalist. Oh, brother!\n\nThis is the kind of crap comic book movies used to be, with a few notable exceptions. It's directed by schlockmeister Albert Pyun, probably best remembered today for the Jean-Claude Van Damme \"classic\" Cyborg. Pyun made a lot of low-budget garbage over the years. You can count on one hand the number of times he made something approaching good. And I'm talking about a hand with several fingers missing. Anyway, Pyun directs this with his usual lack of talent. The cast is poor, led by wooden Matt Salinger (son of author J.D. Salinger) who has the unfortunate duty of trying to act while dressed up in a costume that appears to be made of rubber, complete with padding and fake abs. Scott Paulin plays the Red Skull (an Italian fascist here instead of a German Nazi, for some bizarre reason). He treats the role as camp and plays it up as the joke that it is. His accent is a mix of Super Mario and the Count from Sesame Street. The Red Skull's mask is slightly less embarrassing than Captain America's costume but only because it looks like something left over from a horror movie rather than something true to the source material. He spends a large amount of the movie without the Skull mask because he had plastic surgery to hide who he is. He still looks grotesque and I found it hard to believe he could fool anybody looking like that. The rest of the cast includes familiar faces like Ned Beatty, Ronny Cox, Darren McGavin, and Michael Nouri. McGavin and Nouri both use hammy Texas accents because they're generals and all cornball movie generals sound the same\n\nThis stinks, plain and simple. Several times in the movie Captain America, our big hero, uses the \"feets don't fail me now\" approach to battle. In other words, he runs away like a scared little girl. The action scenes are unexciting. The script was written by someone recovering from brain surgery. The direction and editing are inept. The music score is forgettably generic. The whole production is laughably cheap. It does have camp value and some appeal as a curiosity for comic book fans who might want to see how far we've come. Just prepare yourself for the awfulness."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Lexx-2",
        "review_rating": "2",
        "review_title": "Poor Cap",
        "review_detailed_main": "Talk about a letdown. Is it just me or is there some kind of jinx on Marvel Comics screen adaptations. Look at the evidence.....Spiderman, The Incredible Hulk, The Punisher, the (still unreleased) Fantastic Four movie, and this travesty. Hadn't Stan Lee seen what Menehem Golan did to the Superman series when he sold Cap's screen rights?\n\nMatt Salinger is earnest enough in the lead, but isn't given anything decent to do, Scott Paulin is awful as the Red Skull and his cheesy make-up doesn't do him any favours, Michael Nouri is hilariously miscast as Cap's WW2 C.O. and fine actors like Ronny Cox, Ned Beatty, Darren McGavin and Bill Mumy are all grossly wasted.\n\nAnd whose bright idea was it to let Z-grade hack Albert Pyun near this one? This movie features some of the most incompetantly staged and edited action scenes off all time, but anyone expecting directorial flair from the man behind garbage like \"Cyborg\" and \"Brain Smasher\" had better wake up and smell the Coffee\n\nAwful. Awful. Awful."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Aaron1375",
        "review_rating": "3",
        "review_title": "Captain America falls flat.",
        "review_detailed_main": "I am like the other reviewer who saw the poster of this in a theater, oddly enough I think I was there to see Batman Returns. The poster was a picture of his shield and I said that might be cool, but alas this movie would never make it to the big screen. The problem is they apparently ran out of money after the first scene. Captain America goes after the Red Skull beating up Nazi soldiers then totally gets beaten up by the skull that doesn't look like a skull, but it is still creepy. Cap gets tied to a rocket which is launched at the White House then he diverts it to Alaska. After this the budget runs out and the middle is just the guy without his costume running around in modern America. The skull is still around and he now looks like a guy with a bad sunburn and he is trying to kidnap the Pres. There is a little action at the end, but it is not as good as the promising beginning. Cap does get to beat up the skull at the end too, but the guy has to be pretty old at this point so it isn't really a fair fight.\n\nThe costume is pretty good and the guy looks like Captain America, but he is kinda whiney. This film isn't very good, but a worse Marvel movie is The Punisher, they couldn't even get the costume right in that one."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "chucknorrisfacts",
        "review_rating": "8",
        "review_title": "Not bad for its time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Skeletors_Hood",
        "review_rating": "6",
        "review_title": "Could have been much worse; luckily, no Lundgren or Clooney!",
        "review_detailed_main": "Let me start by saying that I am not a die hard Captain America fan, and I think it's because I remember the made for TV movies from the late seventies that scarred my for life. At least they made the costume right this time!\n\nHowever, my fiancee is a Captain America fan, and I rented it for her, but I couldn't help myself, and I popped it into the VCR, just to see Cap on the screen. And I really got interested in it. I watched it all the way through, and enjoyed it all the way. Sure it has flaws in it, and its cheesy in that Adam West/Batman sort of way, but I have seen worse movies, we all have. And I guess I'm proof that you don't have to be a Captain America fan to enjoy the film, so long as you aren't looking for Shakespeare. Just sit back and enjoy it...don't question it, just enjoy it, and you might see it in a better light."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "onelegobuilder",
        "review_rating": "1",
        "review_title": "This Film is Living Proof That \"Batman and Robin\" is No Longer The Worst Superhero Movie Ever!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "bob dove",
        "review_rating": "",
        "review_title": "sorry,folks......I liked it!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "MichaelMovieLoft",
        "review_rating": "1",
        "review_title": "Yuck",
        "review_detailed_main": "The reason why Marvel can't get a decent box-office hit is because they don't have a big motion picture corporation backing them like DC does (DC is owned by Warner Brothers). Even though Men in Black was a success, Marvel has had more hits than misses: The Spider Man TV movies, The Punisher (a guilty pleasure of mine to watch), and The Fantasic Four (I remember E! making a big deal about it, but I never saw it in the theatres or the video stores). Captain America is also another Marvel movie miss. Talent like Matt Salenger, Ronny Cox, Ned Beatty, Bill \"Don't call me Billy\" Mumy, and Darren McGavin are wasted in this 97 minute disaster. You don't get to learn much of the characters and the storyline is bouncing all over the place. Kim Gillingham shows promise as she plays a duel role as Cappy's girlfriend back in the 40's, and his girlfriend's daughter in the 90's. There is some songs by Southside Johnny and one of the Neville brothers on the soundtrack for what it's worth. Still, this looks like a thrown together production of a super hero film that deserved better treatment. What a tragedy."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "cougar18",
        "review_rating": "1",
        "review_title": "Truly, Truly Awful....",
        "review_detailed_main": "This film is so bad, that there isn't even one good thing to be said about it. It's not even unintentionally funny. Well, at least it isn't as bad as Steel, because they at least tried to get Captain America's costume right."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "darknite125",
        "review_rating": "1",
        "review_title": "Jack Kirby is spinning in his grave",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Zucco",
        "review_rating": "1",
        "review_title": "Terrible.",
        "review_detailed_main": "This is a very sad excuse for a movie if I ever saw one. Very boring and very badly done."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Rectangular_businessman",
        "review_rating": "2",
        "review_title": "The 2011 film was so much better",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "hippiegal",
        "review_rating": "2",
        "review_title": "HUH??",
        "review_detailed_main": "As my wonderful finance wrote in his review below I'm a huge Cap. America fan. Heck I love marvel comics period. That is why I can say this is yet another example on how most marvel comics simply do not make good movies. It's could be worse in the sense it's not Batman and Robin. But I put this movie somewhere between camp and what-on-God's earth-where-they-thinking -when-they-made-this ? Things that really bugged me\n\n1. Not staying very faithful to the comic story line. Not important for enjoying the movie. But as a comic fan it's something silly I just wanted to mention.\n\n2.The red skull seems like he should in the Dick Tracy movie. He's not a evil, cruel Nazi. He's a smooth Itialan gangster type. One of the reasons that the red skull my favorite comic book bad guys is he's a scary guy. This red skull well, he's not all that scary.\n\n3. For a movie called Cap.America most of the movie takes place in Italy.\n\n4.Matt Salinger spends most of the movie seeming totally clueless. It's like he's waiting for the director to tell him what to do. Or he didn't read the script. Most likely both.\n\n5. Kim Gillingham is so annoying as the valley girl in this movie. I just wanted to smack her all through out the film.\n\n6.The fact that the president gets kidnapped and nobody on the planet seems to care.\n\n7. Campy dialogue and situations. Such as the red skull's daughter's big insult to Sharon is that she'll get lines. SO! The bad thing is that I think of that stupid scene every time I put moisturizer on in the morning. Or Steve faking car sickness to steal a car. Or well, half the movie.\n\nSo the movie is garbage. But I will admit it's not the worst comic book movie ever made. Howard the Duck, Batman and Robin, the Punisher, the Fantastic Four and TV's live action Spiderman stink much worse. so it's the worst, but hardly recommended."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "fmarkland32",
        "review_rating": "2",
        "review_title": "More like Captain Crunch...",
        "review_detailed_main": "Matt Salinger stars as Captain America, the super soldier from the 1944 comics that was popular because of WW2, however the 1991 revival brings Captain America out of suspended animation, to face off against his old foe the Red Skull. Captain America is really lame for a couple of reasons. 1)If Red Skull has dominated the market of the world for so many years, why is it not so bad. 2)If Captain America is so heroic, how come he gets his ass kicked so many times? 3)Is it necessary to provide exhausted fish out of water jokes? I have no idea of the answer, however Captain America is a bomb. What is most interesting is that there is little heroic activity going on. Many people dislike The Punisher made in 1989 (It's my personal guilty pleasure) but at least there Dolph Lundgren always came off as a guy you wouldn't want to meet in a dark alley. So did Christopher Reeve and Michael Keaton in the Superman and Batman movies. In Matt Salinger though, one gets the impression that he belongs doing gymnastics instead of giving out the old fashioned passionate ass beatings that the role requires. Also the movie is awkwardly directed by Albert Pyun, who directed Cyborg, Kickboxer 2, Bloodmatch and Kickboxer 4. I think right there explains the problem, wonder needs to be given to the concept of a superhero. He's not like some kickboxer who aimlessly wanders through life until forced in battle, Captain America needs to explode into action and deliver a hero worthy of excellence. Captain America would be bearable if the action sequences were any good but without surprisingly Pyun mishandles these guaranteeing that Captain America comes up super lame.\n\n* out of 4-(Bad)"
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Tin Man-5",
        "review_rating": "10",
        "review_title": "Best film variation of a superhero yet!",
        "review_detailed_main": "Many critics have panned this film, and I think it's a sad fate for such a well done and thought-out movie. It doesn't rely on over-the-top special effects and overblown action scenes. Instead, this is a thinking man's superhero movie, focusing on the power of the characters to show what true heroes are.\n\nCaptain America and the Red Skull are counterparts, both representing the pride of their countries, America and Germany, respectively, back in WW2. Both have been shot with a super-serum which transforms them into world-class athletes. They fight, Cap loses and is tied to a runaway rocket, which crashes into Alaska. He is preserved there until the 1990's, when he get resurrected and he realizes Red Skull is still alive and healthy, because the serum has allowed him to last this long. He is responsible for the deaths of several historic figures, including Robert Kennedy, John Kennedy, and Martin Luther King. And his next target is the newest U.S. president. Cap must stop him before it is too late, and at the same time, he must come to grips with the fact that he is in a strange new world and everything he has ever known in gone forever, and that if it hadn't been for him failing to defeat Skull the first time, many people would still be alive.\n\nThe Red Skull, also, hates what he has become, and Captain America resurfacing represents a part of him he wishes was dead. He therefore takes all measures to make sure Cap is killed. The way they constantly pursue each other is both exciting and moving.\n\nAs someone mentioned, this is a great deal like \"Forever Young,\" especially the way Cap comes back to life and finds his girlfriend extremely old. And \"Cap\" is the better of the two movies. It has a government-conspiracy plot worthy of a Dean Koontz novel, and it also throws in a lot of comic-book silliness. The balance works, and combined with tremendous acting and a moving theme song, \"Home of the Brave,\" I will proudly state that this is the best variation on a comic book super hero that has ever been put to the screen!"
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "T-ZER0",
        "review_rating": "7",
        "review_title": "Pretty funny if you don't take it seriously.",
        "review_detailed_main": "Despite my rating. I'm not saying this movie is great. It's pretty laughably bad. But compared to other classic Marvel movies (Which are so bad I'm not gonna mention) It's watchable. Obviously DC had better classic movies around the time this came out, but at least Matt Salinger's Captain America has that classic costume.\n\nThe action and the plot could use a lot of work, and the whole thing seems like they did it on a really small budget. But watch it if you want a good laugh. Or if you want to remember all those really awful Marvel cartoons made from the 40s - 90s."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "70shoe",
        "review_rating": "4",
        "review_title": "A few small pros and many cons",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Slick-25",
        "review_rating": "",
        "review_title": "Decent movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "jamesbourke59",
        "review_rating": "2",
        "review_title": "Bad Medicine",
        "review_detailed_main": "You know when you really want to like a movie, even after all the bad press and all the negative reviews that gather muster when a movie is really really bad! Well regardless of all that was said and done, I was adamant that I was going to check out the Menachem Golan produced and Albert Pyun directed big screen version of Marvel's first avenger Captain America.\n\nNow I knew going into the movie that Albert Pyun's track record in making decent movies was few and far between and sure enough was in the words of Ronny Cox's who played the president in the movie, it's all bad medicine! Granted the major highlight for me was the villain The Red Skull, essayed in the movie by Scott Paulin, a longtime favourite of Pyun's if you ever check out Paulin's filmography, curiously Paulin also doubles up as an army doctor near the beginning of the movie.\n\nAs for the Matt Salinger playing Steve Rogers/Captain America, he tried, but wearing that goofy looking suit and spouting Stephen Tolkin's rigid dialogue, made his task nigh on impossible.\n\nThere is so much wrong with the movie, one such problem was the suggestion that the Red Skull was to the forefront of all the major assassinations throughout history, and the other was the environmental message running throughout the movie, I don't want to preached to whilst watching a superhero movie, I just want to enjoy the marvel of it all.\n\nIs it a good thing that this movie is seriously hard to find, perhaps! and I must say that whilst watching the movie it reminded of Superman 4 - The Quest For Peace, and what that was trying to do, try less to entertain and strive more for force feeding us the viewer an environmental message.\n\nYou do have to wonder if this movie was made to keep the copyright alive, much like the Roger Corman produced Fantastic Four movie, which was also somewhat on the dreadful side.\n\nAll in all, this version will be consigned to the vaults of history and by doing so we will all feel very thankful.\n\nMy rating is 2/10, why 2? because it's Captain America, plus Albert Pyun directed the movie. With Pyun, you will never know what to expect, for every Sword And The Sorceror, we get Crazy Six!"
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "lfjeff63",
        "review_rating": "2",
        "review_title": "Dreadful, thy name is Captain America!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "lost-in-limbo",
        "review_rating": "4",
        "review_title": "\"God bless you Captain America\"",
        "review_detailed_main": "It's very low-budget might not do its larger-than-life plotting any favours, but still I found \"Captain America\" to be somewhat enjoyable comic-book madness by film-maker Albert Pyun. Its b-grade camp, which looks much older than it is\u0085 like something out of the 70s. While ambitious, the half-hearted execution seems to stumble through it and really does hold it back. Some familiar names turn up in the cast\u0085 some you wonder why; like Ronny Cox and Ned Beatty. Matt Salinger as Captain America is a little stiff, but Scott Paulin lives it up as his disfigured arch-criminal the Red Skull. Also popping are Michael Nouri and a lively Darren McGavin. The formulaic plot is just as bumpy, as the film's pacing. More interest lurks within its early sequences (setting up the origins of our hero / villain), before the narrative's structure actually finds itself in modern times. At times it can meander (especially during the mid-section where Captain America is coming to grips with the situation he finds himself in) and the melodramatics are particularly dull, but the confrontations between the Red Skull and Captain American are colourfully staged. Also there are one or two decent action set-pieces. However some moments are truly under-lit. Pyun's direction is limited, but he makes good use of locations especially when it hits its European setting. Special effects come off completely hokey with their daft delivery. No way is it successful in making it work, but I expected much worse and came away quite diverted by this blotchy b-grade superhero fare."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "nythawk68",
        "review_rating": "4",
        "review_title": "Ehhh",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "pvdps2",
        "review_rating": "3",
        "review_title": "I expected more.....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "RealLiveClaude",
        "review_rating": "4",
        "review_title": "Knew it was bad...",
        "review_detailed_main": "I just expected this movie to be bad, reading the reviews, so I saw it in a different perspective...\n\nWhat went wrong in this movie is simple: Cap was not involved in a worldwide mission to save the universe, he was just there to quest for his origins and of course find the Red Skull...\n\nHowever, turning this from a WWII perspective into a contemporary story was the big mistake. Hoping Marvel learned from that mistake when they released X-Men in 2000 (and not only from that, but also the Fantastic Four and The Punisher, the latter being released this Spring 2004...).\n\nAnd worst, it was produced by Menachem Golan and Yoram Globus, the same who did a mess out of Superman 4 !!!!\n\nSee it for curiosity, but die-hard Captain America fans should wait for a better story out of Mr (Avi) Arad or Stan \"The Man\" itself...\n\n(BTW: The 2011 version does justice to Captain America and the Red Skull and did in 2012 in the Avengers... 2014 is the next Cap Movie, and Chris Evans is way better than Reb Brown or Matt Salinger !)"
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "MagpieLU",
        "review_rating": "2",
        "review_title": "Oh my god.",
        "review_detailed_main": "I don't even know where to start.\n\nThe writing was so awful I literally had to rewind because I fell asleep a couple times. I mean the villain lines were just so bad I felt bad for the guy like who would fear him with lines like that.\n\nThe acting wasn't amazing, but it was definitely better than the literal fecal stain they called a script for this movie. I mean I have never been so bored, and I have watched my fair share of bad films. It is one thing to have a corny, poorly written film but to be a corny, poorly written and lifeless film that is just rough. If I could gain back the two hours of my life this movie stole from me I would. Not even Colin Robinson would be able to sit through this movie.\n\nFinal judgement: Plot: 3/10 Writing: 1/10 Acting: 4/10 Special Effects: 4/10 Personal Enjoyment: -5/10.\n\nTotal: 2/10."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Movie Nuttball",
        "review_rating": "10",
        "review_title": "Captain America!",
        "review_detailed_main": "Captain America is good movie. All of the cast was good and the characters were used properly. It was funny that Melinda Dillon and Darren McGavin were in another film together. Matt Salinger played Captain America very good and Scott Paulin played the Red Skull excellently! It was unusual to see Ronny Cox as the president and Ned Beatty in yet another superhero movie! Very good directing by one of the most underrated directors Albert Pyun. I really don't know what is so bad about this movie. Sure its not like the current Marvel movies but this was made a long while ago. If you like Marvel Comics, Captain America, and the cast mentioned above then I recommend you watch this movie!"
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "chlodowech",
        "review_rating": "6",
        "review_title": "Honestly, it's not all that bad.",
        "review_detailed_main": "Seriously, when the new Fantastic Four movie can become a success, while this isn't even possible to get your hands on, something is wrong. I think the opening sequences are promising enough, but I can understand that many were disappointed that you don't see Cap and Skull square off in character more than once - in the beginning of the movie! But I think they really wanted to make a sort of \"what would happen if Cap was alive today\", and since I thought that both Cap's and Skull's costumes were silly in the first place, I didn't mind. It's more of a detective movie than a superhero movie, and kind of serious compared to any other of it's kind."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "BandSAboutMovies",
        "review_rating": "3",
        "review_title": "Cannon Captain America",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Georgenorrie",
        "review_rating": "",
        "review_title": "It is what it is!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "LW-08854",
        "review_rating": "3",
        "review_title": "Horribly dated.",
        "review_detailed_main": "This movie is probably a contender for the worst superhero movie ever made, though Elektra or Catwoman would beat it to that dubious honour, or even Supergirl. The costumes in this movie are disappointing, the action scenes are not well filmed at all, the plot of the film is also extremely disappointing and low budget. The movie was released after great movies like Superman and Batman had come out, how this hoped to compete with them I really don't know. The film was surely dated when it came out and looks even more so now. The climax of the movie includes the villain throwing a chair, it's really Lacklustre."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "gzqwbf",
        "review_rating": "1",
        "review_title": "Oh goodness me.",
        "review_detailed_main": "The opening 20/30 minutes arent bad. Actually funny, in a good way thanks to the poor crafting and cheesy nature of the film but when cap lands \"somewhere in alaska\" the movie drops off a cliff. Red skull is awful. Captain america is a blank slate and everything around it is either boring or ludicrous. His wooden sheild and spandex sum the movie up perfectly. It's probably one of, if not the worst movie I've ever watched. It feels like a movie made in the 50s but every now and then I See something that reminds me of the late 80s. (VHS)\n\nOh the acting is god awful at worst and blank/bland at best. I cant give it more than a 2/10. 2 points for the opening and nothing else."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "psionchronicles",
        "review_rating": "4",
        "review_title": "Still Evolving",
        "review_detailed_main": "Marvel has struggled ever since the end of WWII to make Captain America relevant, and even the.2011 update missed some marks. This 1990 attempt had both pluses and minuses.\n\nConcerning the Red Skull's backstory. Here, it's presented that he is an Italian and the result of Italian fascism. This is grossly irreverent to the generation that saw him as an American icon in opposition to the NAZI regime in Germany, and for reasons unknown they decided to omit that it was Hitler himself who took the Red Skull under his wing (the 2011 rendering failed here as well). This can be considered a goof anyway because for the Red Skull to be a master of espionage during WWII he would have needed to be at least 25 in the mid 1930s, so for him to have been a young boy at the time he began his indoctrination would have meant it started well before the Nazis even came into being; even the comics never explained this.\n\nCaptain America's cowl and costume didn't look that great in this one; it seemed rubbery and as though it would tear under the slightest stress. That said, it could have been worse (see the TV movies from the 70s).\n\nAll that said, the story itself in this one wasn't awful. They just made some changes from the source material that didn't need to be made considering \"political correctness\" hadn't even happened yet. The casting worked. Given where Cap '90 was for its time, we can expect them to finally get it right about 2035... maybe."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "trevorwomble",
        "review_rating": "5",
        "review_title": "What did you seriously expect this film to be?",
        "review_detailed_main": "Most on here who has written really damning reviews are perhaps been a little unkind and need to put things in perspective.\n\nFirstly this film came from the remnants of the B movie empire, Cannon films (the company who brought Jean Claude Van Damme to fame and made lots of forgettable films with Chuck Norris and Charles Bronson). Secondly it was made on an incredibly tight budget that wouldn't even cover the catering bill of a modern Marvel film.. Thirdly this was made in 1990, so pre-CGI days where unless you were making a Star Trek movie or the original Total Recall film, then you had to do everything the old fashioned way without computer help using practical effects and without the backing of a major studio.\n\nWhilst director Albert Pyun may have been desperate to make this film because he was a Marvel comics fan, his experience at the time consisted of a handful of low budget action films for Cannon flms. He does the best with what he has but the limitations are evident.\n\nThe film is a Captain America origins story and is surprisingly close to its source material. Matt Salinger tries his best in the lead role but is hampered by cheesy dialogue, a terrible looking costume and limited acting ability. He's not terrible but he lacks the charisma of Chris Evans version. However the film is seriously let down by its action sequences (Pyunh concentrates a lot on close ups and edits). Making an action film on a $3 million budget certainly isn't easy and it comes at a cost!\n\nPyunh does actually have a semi decent supporting cast including Hollywood names. Ronny Cox, Ned Beatty and Melinda Dillon who give the film a bit of gravitas but it is still a comic book adaptation from the pre-Marvel studios era. And whilst we'd already had well received adaptations of DC characters Superman and Batman by 1990, those had budgets that were 10 times the budget this film has (although the car crash that was Superman IV was also produced by Cannon films).\n\nI'm not saying you should love this film, but take it with a pinch of salt and try and view it through the eyes of a child from 1990, when studios weren't queueing up to make Marvel films. In a way this was one of the first attempts to do so and had a big studio backed it i'm sure it would be more highly thought of. It's a better film than the 1994 version of The Fantastic Four as at least this film feels like people took it seriously. In the15 years after this film the landscape and respect surrounding comic book film adaptations changed dramatically so don't be too harsh on it. And even if i can't convince you otherwise, at least be grateful that Cannon films intended Spider-man movie from 1986 never got made as that would likely have made this film look like Citizen Kane."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "erminahotmail",
        "review_rating": "2",
        "review_title": "one of the worst superhero films of all time",
        "review_detailed_main": "So I do the review of captain america 1990 So at the time I didn't know this film at all and neither did the other people in the world until the internet was created So this film had been the beginning of the years90 to make a superhero film given that last year Tim Burton's Batman film was a success and they decided to make Captain America films but I haven't seen the other previous ones so I can't make any comments. And what what do you think of this film My God how bad it isI swear to you, I swear to you, bad films like these can't really be seen, they would always be seen, but not like this type of superhero, I swear to you, because this is truly suffering and it shouldn't have even existed then all the things and I can tell you one thing it doesn't suit me at allI liked the film Justice League of America 1997 but I gave it an extra vote because this Captain America is much worse. So let's talk for a moment about the main character. For me it was a really bad adaptation. He should be the great character of all of America instead. Thethey treated a complete idiot I swear this character is a real idiot worse than Shazam in the second film and so who why because he doesn't realize that he has ended up in another year or that he had been invented a lot of years but he's just an idiot anddo you want to know how he finds out he discovers when his love has become an old woman And let's not talk about the costume someone will say But it was a film from the past To tell the truth It was also disgusting of the time and all the characters are terribly badly written but the tall but the other character she wasbadly adapted it's really the Red Skull I swear this is really worse than the film And then his appearance is really horrible and then he's not even a German he's Italian and then when he appears in the present he has completely changed his appearance therefore bad just worse and then the ultrasoundaction films are really bad and I don't understand why they made a blu-ray edition of this film. Please, I'll do you a favor, don't ever watch this film. Just watch the one from the Marvel Cinematic Universe to conclude, rating 2."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "jared-25331",
        "review_rating": "1",
        "review_title": "Where is this Director's Cut?",
        "review_detailed_main": "Captain America (1990) was the first theatrical released movie based on the Marvel Superhero character of the same name, but sadly the movie wasn't very good.\n\nPositives for Captain America (1990): The Captain America suit and Red Skull's face makeup look good. Ronny Cox's presence adds a bit of legitimacy to a movie that doesn't deserve it. I would like to see the Director's Cut of this movie. Unfortunately, that's all I can say for the positives.\n\nNegatives for Captain America (1990): This movie was a complete dumpster fire. The movie looks like it was made with only $10. The acting from the cast is horrible. The movie drags through its plot. And finally, the action scenes are lame.\n\nOverall, Captain America (1990) is easily the worst movie with Captain America as the lead character and one of the dumbest superhero movies ever made. Thankfully, I can now move on to the Chris Evans Trilogy in the MCU."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "bullseye1-1",
        "review_rating": "3",
        "review_title": "For Die Hard Comic Fans Only",
        "review_detailed_main": "When a summer film gets hyped, then mysteriously gets banished to a direct-to-video release, there's a problem. That's pretty much the backstory for Captain America--hyped as Marvel's answer to Batman in 1990, set to celebrate the character's 50th anniversary, and.........well, just vanished. After a few abortive theatrical release dates, it was snuck into video stores 2 years later. Not that it really mattered, anyone who had any desire to see it got their bootleg copy long ago.\n\nOn the bright side, the beginning is pretty good and the end is pretty good. Unfortunately, there's just this hour in between that's rather dull. Steve Rogers is rarely in costume, and spends a lot of the film looking like he had his brain surgery done by the paperboy. Ned Beatty is pretty decent in the film, but after his love scene in Deliverance, anything's a step up for him.\n\nIf you're like myself, and are a die hard fan of comics, check it out. But just don't go in with high expectations."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "sethn172",
        "review_rating": "10",
        "review_title": "This Captain Will Save America!",
        "review_detailed_main": "Yes! Another superhero film comes and goes! What I love about these kinds of films are that we have the hero. We have the villain. We have a damsel in distress. Heck, we even have a problem in the world, like a shortage of cows, or that we need help opening a nasty carton of milk! This movie, \"Captain America,\" does all of that. No, there isn't anything in this movie that has to do with cows or opening milk cartons or anything. However, there is the hero, Captain America, and the villain, The Red Skull, and so forth.\n\n\"Captain America\" is a superhero movie that may not be as exciting as \"Spider-Man,\" but believe me, if you are lucky enough to find a copy (and they are extremely difficult to come by nowadays!), then you can watch this movie and see what all the buzz is about."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "misbegotten",
        "review_rating": "7",
        "review_title": "A startlingly revisionist examination of an American icon and the country he serves",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "ShotgunHemingway",
        "review_rating": "3",
        "review_title": "Oh, Captain...my Captain....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "dudeicon",
        "review_rating": "",
        "review_title": ".........rrrrrright.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Torgo_Approves",
        "review_rating": "3",
        "review_title": "Bottom 100 Marathon, Episode II: \"Captain America\"",
        "review_detailed_main": "Gee whiz, what a flick! It's so stupid it's almost funny. Almost. But not really. Mostly it's pretty dull, but still somehow quite watchable. The music is fantastically awful in its eightiesness. Who better to play Captain America than Matt Salinger? Yes, you read that right. THE Matt Salinger. What? You've never heard of him? Me neither, and considering his performance in this movie, it's no wonder.\n\nSerious mindf-ck occurs at the very start of the movie. The blue, red and white title \"Captain America\" unceremoniously appears on the screen - but we're in 1936 Italy! Some Italian dialogue makes me wonder if I have accidentally gotten hold of a dubbed copy, but my fears are thankfully never confirmed - although I doubt that the Italian dubbing mafia could've done a worse job at characterization than the American cast. Anyway, we see a little Italian dude playing the piano. Some anonymous military bad guy smashes a window and sends his henchmen to blow Italian dude's parents to pieces. It takes a while before we understand what the hell this has to do with anything - no, it's not a scene from \"The Godfather\" which was accidentally spliced into the film during production - because we quickly cut to:\n\nSEVEN YEARS LATER\n\n(as an afterthought) 1943\n\nWorld War II is running full throttle and dazed-looking Steve is mugging his way through a tearful farewell to his family and girlfriend, Bernie (and here I was thinking this was a guy's name!). We are treated to such wonderful dialogue as: \"It's just that... I love you and I can't stand thinking that I won't know where you are or what you're doing!\" Sparks fly, chemistry's high (or maybe it's the scriptwriter) and Steve leaves his old neighbourhood... never to return... OR WILL HE?\n\nIt turns out Steve signed up for some lab rat work for the accent-ually challenged military. Before he can say \"no paycheck is worth this!\", he's strapped to a chair, attacked by flashing colours, and Captain America is born. There's no time for celebration, however, because an evil nazi bastard shows up and starts peppering everyone with a prop. What I love about this scene is that the military is carrying out this secret, important experiment in the basement of a bar and it's free for anyone to just drop in! Oh, that and the flashy colours, of course.\n\nCaptain America is hit and we find out that he's immune to bullets. The accent-ually challenged military guy sends him to stop Red Skull - the Italian dude from the beginning of the movie - a bad guy with a really awful case of acne who thinks the concept of jokes about English lessons is the best thing since spaghetti bolognese. Steve arrives at the bad guy's hideout, some bland action occurs and Captain America shows that he's a complete loser by actually letting this walking advertisement for Clearasil get the better of him. Suddenly strapped to a nuclear missile, Steve grabs hold of Acne Man's wrist and the latter makes the only sensible thing: he uses a knife to slice off... his own hand. That's truly brilliant thinking there, buddy.\n\nThen we cut to a poor child actor telling his mum that he's going to be president of the USA when he grows up (FORESHADOWING!). The kid goes outside for some reason and sees Steve America and the nuclear missile in the sky. This is so inspirational to him that he has to rave about it to his blonde-haired snob of a friend, who touches his shoulder in a very disturbing way. I'd just like to point out that this is the WORST CHILD ACTOR I'VE EVER SEEN, EVER! And I've seen The Omen 2006, Santa Claus Conquers the Martians, and Stephen King's version of The Shining.\n\n50 or so years pass and - voila! - poor child actor #1 has indeed become president of the United States. A lot of boring stuff happens as Steve America is carved out of a block of really authentic-looking ice in Alaska; meets Bernie who's now supposedly 66 (I must say she ages extremely well!), married and has a seriously hot daughter; and has to cope with the cultural changes of the US since 1943, sort of like in \"Austin Powers\" only less touching. We also find out that Acne Man has magically transformed into Incompetent Plastic Surgery Man (whom I will refer to as IPSM from here on).\n\nSome filler scenes, filmed as an excuse for the cast and crew to go to Italy, ensue until we finally get to the climactic showdown between IPSM and Steve America. Now Steve finds himself in a situation where he has to stop IPSM from blowing up Europe (!), but can't because... I.P.S.M. is armed with a machine gun?? What the hell? I thought he was immune to gunfire? Whatever. My brain hurts now.\n\nI wouldn't want to spoil the film's ending for you so I'll just leave this already too long plot summary now. Add to what I've just said porn movie actors, a very eighties soundtrack, overly ambitious action with none of the budget it needs to not be a complete joke, and Matt Salinger's... um... original performance as the Captain himself, and you have a film which is actually pretty watchable in an F-movie kind of way.\n\nIn conclusion: It's exactly stupid and unintentionally silly enough to keep your attention to the bitter end (unlike something like \"Bloodrayne\", whose stupidity bored me to tears) and really all you could ask for from a good bad movie. It's pretty mean to call it one of the 100 worst movies ever. Remind me never to write a review this long again. My next stop is also an early nineties cheese-fest, this time about vegetable-lovin' freaks: \"Troll 2\". Pray for my sanity."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "kyleball-51328",
        "review_rating": "5",
        "review_title": "It's not that bad!",
        "review_detailed_main": "You know, it's really not THAT bad. It's definitely not as good as the MCU films but it's some decent early 90s cheese. I hadn't seen this movie since I was a child and I expected I'd get bored and spend the whole movie scrolling my phone but I had a decent time watching it."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "filmreviewer11",
        "review_rating": "4",
        "review_title": "Could have been excellent!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "buckeyes-05926",
        "review_rating": "1",
        "review_title": "This is what Marvel use to be. Never forget.",
        "review_detailed_main": "This is what Marvel use to be, Never forget. Back when marvel was selling their properties to any studio will to write any type of check. They were making this. A movie's that were terrible. Movie that look terrible, acted terribly, and written terribly. The film has nothing going for it unless you have a couple of drink are down to make fun of captain america, or if you want to admire how fare marvel and the superhero genre has come for this pile of garbage. Unless the Steve Rodgers in the MCU this film captain america give the audience nothing to cheer about when the hero is cheerless and apathetic."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "gregopego12",
        "review_rating": "8",
        "review_title": "Confusing but Amusing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "kersus",
        "review_rating": "6",
        "review_title": "Is it a B movie or a C movie?",
        "review_detailed_main": "The first time I saw anything about this movie was a poster in a magazine. Besides the rubber suit (which should have been more of a light chain mail type thing) the most glaring thing I noticed was that the ears are part of the costume and not the actor's ears at all! This was the first sign of the level of budget we were looking at.\n\nI mean, his ears were rubber, and they got folded up and weren't even fixed for a promotional poster! So, given that we're now rating this on the B movie scale, it really wasn't too bad. It was an enjoyable flick that could easily be replaced by a decent remake, but is on par with the old Captain America movies.\n\nIf you're a fan of the older comic book adaptations, you'll enjoy it. It's an above average B movie. I'm glad I own it."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "TLey",
        "review_rating": "",
        "review_title": "I liked it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Tin Man-5",
        "review_rating": "10",
        "review_title": "A re-evaluation of a previous review",
        "review_detailed_main": "With a new \"Spider-Man\" movie due out this May, an upcoming sequel to \"Blade,\" and \"X-Men 2\" to start filming soon, I thought it would be appropriate to review some of the previous attempts that Marvel Comics has made to get their characters onto the big screen. It's no questions that their films have never been as successful as their arch rivals, DC Comics, especially in the nineties. While there was a successful TV Incredible Hulk series in the seventies, a never-released, low-budget \"Fantastic Four\" flick, and an *ahem* film version of \"The Punisher\" that is not even worthy of mention, at the end of the day, the only cinematic interpretations of their heroes that are worth commenting on at all are \"Blade,\" \"X-Men,\" and \"Captain America.\"\n\nIn an earlier review, written back in my naive, less-educated-in-Cinema-days, I stated that \"Captain America\" was the greatest super-hero film ever made. This is not a true statement, and it was one I made having not seen the film in a few years, and the flaws were less-apparent in my mind. Yes, there are many flaws in this film: Some of the dialogue is cheezy, many of the characters are underdeveloped, and there is simply not enough time spent with Captain America in costume. However, in the heart of this film there is a very sincere, very respectable tribute to the golden-age superhero, and I feel that the movie is still very much worthy of praise.\n\nWithout going too much into detail about the nature of the plot, I will say that it successfully sums up sixty years of comics into one movie. Both the characters of Captain America and his facist counterpart, the Red Skull (brainchild of Hitler in the comics, created by Mussolini and sold to the nazis here) are depicted as much more tragic than in the comics. Both characters are well-constructed and sincerely acted by Matt Salinger and Scott Paulin, and the film is basically a tribute to old 1940's serials with two strong characters taking center stage.\n\nWhen I say a tribute to 1940's serials, this is exactly what I mean. Every plot point, every character save Cap and the Skull, serve nothing more than to move the story along from action scene to action scene. Many things happen that make little sense- for example, upon being revived in the nineties after being frozen in ice for fifty years, Captain America is found by a conspiracy theorist who has been piecing together his story for years. How does the guy find our hero? He just happens to be driving through Northern Canada and stumbles upon him. Once the Red Skull realizes that Cap is still alive, he determines that the hero must be out to destroy him. Now, Cap has been out of commission for fifty years, and the Red Skull is now a mysterious, Corleone-esque kingpin. In this film, they only encountered briefly in the 1940's before Cap was frozen in ice. Why on earth would Skull jump to the conclusion that hey! Cap is thawed out, and his first objective will be to stop the Red Skull? In another part, realizing that the Skull is hiding in Italy, Cap jumps on a plane fro the U.S. and flies there. Um.....how did he get on board of that plane? Surely his passport wasn't perserved with him in the ice?\n\nBut nevermind....these plot holes, and many like them, are irrelavent to what this film is trying to do: Put our hero in a series of spectacular action scenes and watch how he gets out of them. It is not trying to tell a serious story, it is simply trying to give us some silly, comic-book action in a movie-serial kind of way, and the movie does just that. Our hero is strapped to a German rocket headed toward the White House, dodges nazi villians in Northern Canada, is amazed in some cleverly-written scenes how many American products are made in former enemy lands of Japan and Germany, fights the Red Skull's henchmen in Italy, and finally has an explosive showdown with the Skull himself in the kingpin's castle, where the villian threatens to blow up all of Western Europse with an atomic bomb which he receives from a piano. All this combined with the fact that the Skull is responsible for the deaths of JFK, RFK, and Martin Luther King, and now he plans to use a brain transplant to make the new economically-aware U.S. President his slave.\n\nIt is impossible to take this film any more seriously than you would take an old serial or a four-part issue of the Cap comic book, and this kind of treatment is exactly what a Captain America movie needed. As a result, the low-budget, occasionally hammy acting, and confusing storytelling only add to the film's effect and heighten director Pyun's well-choreographed action sequences. There is just something grand and, dog-gonnit, patriotic about the President of the United States leaping from a tower in order to keep the Skull from using him in is experiments, only to be successfully caught and saved by Captain America, who is crawling up the wall vigorously. In real life, this would have ripped both their arms out of their sockets, but in this movie, what difference does it make? It's such a well-shot scene!\n\nThis said, Cap and Skull are well-developed, and they hold the film together when it threatens to go over-the-top in its comic-book silliness. Cap fights the Skull and fails to defeat him in the 1940's, only to be frozen in ice and thawed out in the nineties, where he learns that, because he failed to defeat the Skull, his arch villian is responsible for the deaths of many historic figures. Feeling he has failed his country, plus realizing his old girlfriend is now old with a family of her own, Cap is a determined, meloncholy hero with nothing to lose. There is a sincerity to the part that Matt Salinger brings, and with his niavity and his boyish-good looks, it looks as if Cap is truly a hero from the 1940's, who has stepped out of his time and into ours and is truly amazed at the changes that have come (though attempts to give him lines featuring old 40's terms such as \"Gee-wizz\" and \"holy mackeral\" don't come off so well). The Red Skull watched the slaughter of his family as a small boy in the 1930's, and this tramautizing event that led to his transformation into the monster he now is has bittered him over the centuries. In a film which emphasized overacting, he probably has the sublest role, yet he still has the film's best over-the-top lines (\"Assassination isn't worth the trouble. It took two years to find Sir Hans. Three to find Oswald. The King job alone cost us over twenty two million dollars. What do we get for our troubles? Saints. Martyrs to the cause.\") Must like Michael Corleone in the \"Godfather 2\" (though on a much smaller level), in the film's final scenes, he builds himself up as a great, powerful crimelord, but to the viewer, he simply comes across as pitiful.\n\nIn the end, \"Captain America\" is a fun, low-budget, patriotic, feel-good action flick which works in a Saturday Matinee sort of way. While never released to theaters here in the U.S., it made the theaters, perhaps ironically, overseas and, as a result, built the bridge for the bigger-budgeted, more-serious Marvel Superhero movies that came years later and are still to come. Certainly worth watching, certainly worth owning, certainly a tribute to sixty years of \"Captain America\" comic books.\n\n*** out of ****"
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "l_arne",
        "review_rating": "6",
        "review_title": "a mixed bag",
        "review_detailed_main": "This movie is truly a mixed bag.\n\nThere are several elements colliding here. On the one hand we have a...yes...ambitious script. The origin story of Captain America, his first mission ending in partial failure (he fails to defeat the red skull but at least manages to avoid the destruction of the white house back in 1943). The culture shock Steve Rodgers has to deal with when he reawakens in the 1990's. A touching scene when he finds his old, dearly and sincerely loved girlfriend as an old woman. The feeling of guilt Captain America has to deal with when he learns that his failure to stop the red skull during WWII indirectly caused the assassination of John F. Kennedy, Robert Kennedy and Martin Luther King. The personal tragedy of bringing danger and death to his old girlfriend's family. And then, as the current president of the united states is kidnapped, Captain America sets out to save the president and finally defeat the red skull...redeeming himself.\n\nIt is a big story. But it is hampered by low production value, an uneven direction by \"trash-auteur\" director albert pyun and irritatingly edited action-scenes.\n\nOn the other hand there is the strong performance of matt salinger as captain America, playing is part with honest sincerity. Solid performances by Ronny Cox, Ned Beatty and Scott Paulin. And, I think, and endearing and under-appreciated performance by Kim Gillingham in the \"triple\" role of captain America's young and old girlfriend bernice and her daughter sharon.\n\nAll in all this movie represents good intentions hampered by a low budget. Take the same script and the same actors and give it a decent budget and a competent director and you would have one of the finest feature films based on a comic book EVER!"
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Joseph_J_Bellamy",
        "review_rating": "",
        "review_title": "See it with a bud!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "AnnaPagrati",
        "review_rating": "8",
        "review_title": "Great!",
        "review_detailed_main": "I like this version of Cap. It's one of my favorite classic Captain America movies!"
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Eoraptor02",
        "review_rating": "7",
        "review_title": "An under-rated action romp",
        "review_detailed_main": "The 1990 Euro-American Captain America really gets a lot of bad press that it doesn't deserve. While it definitely has some flaws, playing fast and loose with some plot points (honestly no more so than the modern Marvel Cinematic Universe), it does stay true to the spirits of its main characters, and includes the same sorts of sly call-backs that those of us raised with RDJ's Ironman and the more modern Cap have since come to expect.\n\nWhere the movie really struggles in its budgeting choices, lavish location shots and action sequences definitely thrill the eyes, but the money probably would have been better spent on costumes and lighting/camera quality, where interior shots often come off dark and grainy. (you'll see many reviewers complain about cap's spandex, which compares poorly to Keaton's 1989 Batman, and even Christopher Reeve's final turn as Superman) Another point where the movie probably failed to compete is in tone... it's not quite as dark or as cartoonish as the contemporary 1989 batman, but likewise it's not as comedic or uplifting as the 80's superman movies, making it an awkward fit for audiences of the day expecting one or the other. And its largely European villains and themes would have probably have failed with an American audience had it gotten a US theater release.\n\nBut make no mistake, the movie is chock full of good points. By the standards of a 1990 movie, the physical stunts are impressive, relying more on physical talent than on wire-work or camera tricks; and the exotic localities serve to impress the spy-thriller tone of the story very well, giving feel of the dying days of the cold war and European espionage. The cast fit their rolls very well, even when those roles seem a bit ill defined by a script that cuts to different settings quickly with a spy-novel's sensibilities. It has all the flair and bombast you'd expect of a movie written in the late 80s/early 90s action piece with a slight kung-fu twist.\n\nWhile this flick certainly shows some of its age and budgetary constraints to a sophisticated 21st century audience, it's worth a watch for any fan of capes movies or action film buffs."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "DarthBill",
        "review_rating": "",
        "review_title": "What could have been the start of a potentially great franchise",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "robecuse",
        "review_rating": "10",
        "review_title": "Imperfect but authentic. Give it a try!",
        "review_detailed_main": "With all its flaws (of which there are many) and its budgetary shortcomings, I would rather watch this movie again than the \"cut and paste\" swill that Disney and Netflix try to impose on us today. I rented it at the video store in the early 90s, and watching it is one of my fond memories from childhood/early teens. Let me be clear: yes, this is a B-movie directed by an untalented filmmaker. Still, it is a REAL MOVIE made by people with personalities who love movies, not the bunch of cheap officials that abound nowadays. I give it a 10 as a form of rebellion against today's cinema and in defense of films that, regardless of their quality, were made from the heart."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "clh-1",
        "review_rating": "6",
        "review_title": "Not as bad as some say",
        "review_detailed_main": "I guess we can get the bad out of the way; the production is very cheap, the hero's costume and the makeup on the main villain (and a few other important characters) are not very convincing. The plot is more than a little condensed from the source material, which makes Captain America seem like a not very good hero. Even a short montage of his exploits in World War II could have helped set him up as a better hero. Also a lot of the cast really overact. The Good: Ronny Cox and Ned Beatty DO NOT simply phone in their performances, and they carry their scenes exceptionally well. Matt Salinger, as the titular Captain America and his altar ego, does have an \"aw shucks\" likability that helps him fit into the \"All American\" nature of the character. The script does not give him much to work with, but he is likeable and sells the \"man out of time\" aspect really well. Lastly, despite being mostly shot in Yugoslavia, the filming manages to sell a variety of locations very well. The silly fun: some of the editing and special effects will illicit (presumably unintentional) laughs, and those laughs will up the enjoyability factor. Despite some actors' overacting not being very good, Darren McGavin and Scott Paulin are both clearly having a blast playing deliciously evil characters. On the whole, Captain America 1990 is not a great film, but it is enjoyable. And if you are in the right mood, will make for a fun Tuesday night in front of the TV."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Elvis-Del-Valle",
        "review_rating": "8",
        "review_title": "Cheap and bland, but true to the vision of the source material",
        "review_detailed_main": "This adaptation of Captain America stays true to the vision of the character despite its production and somewhat amateurish appearance. The suit looks cheap, but it's pretty respectful of the suit Steve wears in the comics. Red Skull's makeup is quite bizarre and even terrible. The plot is simple, but good at taking elements from the character in the comics. Steve Rogers' story arc is well embodied and is an acceptable adaptation. Sure it's a simple action movie of the period with a tempered violence, but it manages to be entertaining. It is by no means one of the worst Marvel adaptations, although its quality is unprofessional. Marvel failed in trying to bury this movie and it is a film that deserves to be known by Marvel fans. My rating for this movie is 8/10."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "zmanjz",
        "review_rating": "6",
        "review_title": "Better than Previous Captain America Movies... But that's not saying much.",
        "review_detailed_main": "This movie was made in the early 90s before Marvel had a true understanding of how to make a good transition between comic and screen.\n\nThis movie does have a few benefits. First it does follow some of the generally accepted Captain America story background. (A great improvement over previous movies where the Captain America Character had nothing to do with the Comic Version (see the 70's era movie with the Captain with the clear plastic Shield.)\n\nThis is a piece of fluff and a step in the right direction. Hopefully sometime in the next decade Marvel will attempt a definitive Captain America Movie using the same style and control that allowed X-Men, Spider-Man, and Dare Devil to succeed. If the upcoming Hulk movie is as well made, then this movie should be forgotten and replaced."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "13Funbags",
        "review_rating": "6",
        "review_title": "The 3rd best Captain America movie,so far.....",
        "review_detailed_main": "I never knew this movie existed and that's surprising.It's a good comic book movie even though they change Cap's origin.I'm sure kids watching it today would think it's cheesy after seeing the newer Marvel movies but this movie is just like a comic book from that period.The origin is a bit strange.The Red Skull is an Italian who was given the same treatment that Steve Rogers was given.Some type of weird electrocution thing invented by a woman created them both.After Cap is created he is sent to fight the Red Skull.He ends up being strapped to a rocket pointed at the White House.He tries to take Red Skull with him but Skull cuts off his own hand.All the way to the White House Cap can't do anything but at the last second he makes the rocket turn.It goes to Alaska and gently lands in the snow.Fast forward to 1990 and Steve Rogers is running around Europe with some woman getting into hijinks with the Red Skull.All of a sudden Captain America is Vince Vaughn in a romantic comedy.Did I mention Skull has gotten extensive plastic surgery and is just a little red now?That's weird.All that aside, it's still a decent movie.It just helps if you don't already know anything about Captain America."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Leofwine_draca",
        "review_rating": "6",
        "review_title": "Not bad",
        "review_detailed_main": "Despite its forgotten status today - especially in the wake of the recent mega-budget revamp - CAPTAIN America isn't bad for what it is, which is a low budget, cheesy, superhero family adventure film. Okay, so the director is Albert Pyun, who I have to say is one of my least favourites, and the paucity of budget is evident throughout, but other than that this is surprisingly watchable.\n\nI think it's fair to say that Matt Salinger is one of the more wooden superhero actors to be seen on screen, but the supporting cast makes up for that. THE HIDDEN's Michael Nouri shows up as a military man, good old Ronny Cox is the President no less, Ned Beatty ISN'T a bad guy, and there's even a part for TV's one time Kolchak, Darren McGavin.\n\nIt's a fast paced little movie that takes in Steve Rogers' origins, sends him through time to the modern day and then involves him in a plot involving an old enemy. Not much of it makes too much sense, but there's plenty of action and scenes of our hero battling the bad guys. Pyun's direction is horrible, but I was expecting the worst when I sat down to watch this and I didn't get it."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "samjoelf",
        "review_rating": "7",
        "review_title": "Good film",
        "review_detailed_main": "I know it's not an amazing film but it's quite good for the time.\n\nIt's good to see sin in a film as she is not used in the mcu and its a different twist on the red skulls story.\n\nOverall the action scenes aren't too bad and the ending is pretty good.\n\n7 out of 10 for giving us a good film."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "lukem-52760",
        "review_rating": "7",
        "review_title": "MATT SALINGER MADE A GOOD CAPTAIN AMERICA & I LIKE THIS VERSION OF CAPTAIN AMERICA.",
        "review_detailed_main": "First off i am a big fan of the wild & wicked Director ALBERT PYUN, he has created some great Gems within the low-budget B-movie genre such as my favourite film of his, Van Damme's CYBORG (1989) it's also one of my personal favourite films that i grew up watching & loving. Anyone that thinks Pyun only made crud films needs to go watch the excellent, powerhouse & superior sequel Kickboxer 2 (1991) that film is excellent & you could tell that Pyun put his heart & soul into that film & created the best film in the Kickboxer franchise!!! For top tier Pyun films go for Cyborg, Nemesis & Kickboxer 2, those are his greatest cinematic achievements.\n\nNow Albert Pyun has done some too weird crud too but more often than not he creates something bizarrely fun & watchable & he does that on a tiny budget so it's impressive.\n\nThis Captain America movie feels like a globe-trotting spy Thriller more than a glorious, explosive action-packed comic-book movie, & i can't help but like this approach. My unpopular opinion is a this is my favourite Captain America on screen & i like this movie.\n\nI would've loved to have seen Pyun's take on SPIDER-MAN, which he was gonna make in the late 80's but it got scrapped as did the sequel to the cult classic \"He-Man & The Masters of the Universe\" & the sets that was already built were reused to create CYBORG (1989) which became Albert Pyun's Cult Classic for which he will always be remembered for. I can only imagine a cool Pyun take on Spider-Man in a low-budget gritty version of New York City!!!\n\nThere's an optimistic quality to Pyun's scrappy Captain America movie that you can't help but enjoy, or atleast i do, there's a good adventure story here even if the budget wasn't there to go really Big. Honestly this super hero flick doesn't deserve all the hate it gets, I've seen way worse with mega budget movies that are truly horrendous wasted junk (Terminator Genisys, Terminator Salvation, Battleship, Teenage Mutant Ninja Turtles (2014), Batman vs Superman, the first Iron Man film, The Marvels, Black Adam, Bloodshot & many more.\n\nAlbert Pyun's CAPTAIN AMERICA is not terrible like many have said, i like it, i do remember seeing this on t.v as a kid so it's remained an image in the back of my head for years. I got the dvd now & it's rated a \"PG\" but to be honest it's too dark & grim to be a \"Kids film\" it's opening of a family being slaughtered by Nazi machine-gun fire is very dark & that sets the dull tone for the rest of the film really, everything is dull & gritty & nothing is colourful or bright not even Captain's superhero costume, well its not too brightly coloured but it does look good. There's some goofy humour-bits but it's mainly humourous because of some of the cheesy acting but we do get some classy veteran stars amongst the cast with Ronny Cox (Deliverance, Beverley Hills Cop 1&2, Robocop, Total Recall) & Ned Beatty (Deliverance) & Captain America himself Matt Salinger, who made a good Cap. I did like Matts look, cool suit, & he did a good acting job & was decent in the role & his costume was decent too. Now this was a fairly low-budget production so it's not gonna look all slick & Amazing like today c.g.i Marvel films but it's limited budget actually works for it's dark look at the world & it's atrocities such as Assassinations & murder, like i said the film has a dark tone even when it's not trying too. This super hero film feels scrappy with it's low quality production & restricted from really going full-on explosive action, because of the miniscule budget they couldn't go-all-out with big set-pieces & it's a shame. Red Skull looked decent enough & was evil enough & made a cool villain.\n\nRemember this movie had most of its budget cut during production so what we get is actually damn good considering. This Captain America movie has that dark edge like other first comic-book films of the times, such as Tim Burton's Batman (1989) & Teenage Mutant Ninja Turtles the movie (1990) & The Punisher (1989) & The Guyver (1991) those fantasy films had a real world darkness about them that made them feel dangerous even though they are super hero movies.\n\nThe film has a grainy look to it probably due to a the low-budget or just because it's an old relic of it's time, there's a very European texture to everything (it was filmed in Europe) but still shows it's Americana when Cap is on home territory & the film has an old skool Cold-war spy Thriller feel. This Cap is very different from what we all know & love from Chris Evans version of the character in the MCU, here Salinger's version is a very lost guy who seems to not be hugely heroic or action-packed & comes across traumatised by everything (as you would be) & he's actually quite enjoyable & goofy at times like when he pretends to feel sick so the person pulls over & he quickly runs back to the car & drives off leaving them behind lol he does it twice!!!\n\nBut all in all, Matt Salinger's performance as Steve Rogers is good, even heartfelt at times as he has a bewildered & sad look in his eyes, especially when he wakes up decades later & is basically an alien in a work he doesn't know anymore. The scene where Steve goes bk to his old house to find his once beloved girlfriend there is actually acted pretty perfectly & gave me tears in my eyes!!! To see his face so shocked & saddened & by seeing her there so old was an emotional moment & realisation of how much time has passed. Put it this way, i like this Captain America movie more than the 2011 Captain America: The First Avenger movie.\n\nMatt Salinger really does the lost-& lonely-man from another time really well & one scene is actually emotional, a scene where Cap runs from the beach to his old neighbourhood street & to his old house where the love of his life lived with him before the war, he bumps into her daughter & then she comes to the door & it's quite shocking & sad!!!\n\nThe action scenes are pretty decent but the first half is pretty boring & dull, but served its purpose to explain stuff, right up until Cap gets defrosted in 1993. This old scrappy super hero movie is a little low-budget gem in my opinion. Very unpopular opinion but i liked this movie & this version of Captain America.\n\nRed skull looks really good. The music is dreary & too slushy & often the movie feels like a t.v period drama but all in all it's solid enough in it's cheesiness to enjoy sometimes. Along with the drab bits there's stuff to enjoy & to be honest the dim look & dark tone actually works because the film is set in the older war-torn times of WW2 for the starter anyway.\n\nAlso i have seen some far worse garbage movies that had mega Blockbuster studio budgets!!!\n\nLook at this 1990 Captain America as a dark spy thriller/dim period piece fantasy adventure with a comic-book character mixed-up in that world & it doesn't seem as bad in my opinion.\n\nActually, yeah i like this Albert Pyun version of Captain America, & hey atleast he tried with what he had to work with.\n\nI really liked Matt Salinger's take on the character."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "ccthemovieman-1",
        "review_rating": "",
        "review_title": "'Disgusting' Is A Mild Word To Describe This Garbage",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "HabibieHakim123",
        "review_rating": "7",
        "review_title": "Captain America Is Still A Better Movie Than Two Of The Previous Marvel Character Adaptation Films Before This, Howard The Duck And The Punisher",
        "review_detailed_main": "While it's still far from perfect, and the overall product was still just ok, Captain America is still a better movie than two of the previous Marvel character adaptation films before this, Howard The Duck and The Punisher, the movie have a better performances by the cast, a better story, and for my personal experience, i have a better one too."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "tfrizzell",
        "review_rating": "",
        "review_title": "Silly Ploy to Capitalize on Super-Hero Craze of Early-1990s.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "crazyferret-03421",
        "review_rating": "7",
        "review_title": "Not bad",
        "review_detailed_main": "Captain America 1990 is not a bad movie, sure it has a low budget much like the unreleased 1994 fantastic four . But this version I found interesting and enjoyable and accurate to Joe Kirby's comic . Matt Salinger plays the red white and blue super soldier who must fight the red skull ( Scott Paulin ) Also on hand is an impressive cast Ronny Cox , Ned Beatty , Micheal Nouri , Melinda Dillon and Bill Mummy. Stan Lee was an executive producer.the special effects are not that great by todays standards. The movie was directed by Albert Pyan and produced by méneheim Golan. I enjoyed this movie and gone it 7 stars."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "coltras35",
        "review_rating": "7",
        "review_title": "Not bad at all",
        "review_detailed_main": "Given enhanced strength and stamina, sickly Steve Rogers became Second World War hero Captain America, but apparently died at the hands of the Nazis. However, over 40 years later, just as the US President comes under threat from a mysterious conspiracy, a frozen body returns to life in the wilds of Alaska - and a legend lives again!\n\nHaving read mostly negative reviews of this film, I expected a stinker, but to my surprise I quite enjoyed it, finding it well-paced, with sporadic amounts of well-staged action sequences (real physical stuntwork with no high wire or CGI) and a very sincere performance from Matt Salinger as Captain America. He captures that all American, lost in another era confusion very well, probably better than Chris Evans.\n\nHowever, with all that said, there are some weak moments such as some dodgy dialogue and underdeveloped characters/plot points. Red skull's daughter and her gang are inept and not at all menacing. I like this version of Red Skull, even though he's Italian, and he's got some cracking dialogue; he's a very suave, menacing.\n\nA much bigger budget would've improved this film much more (which would mean more rewrites) but for what it is, it's a good effort."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Big Movie Fan",
        "review_rating": "",
        "review_title": "A MISSED OPPORTUNITY",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "auskooper",
        "review_rating": "7",
        "review_title": "Alright Film",
        "review_detailed_main": "1990's Captain America is the last film to be about Captain America before his first appearance in the MCU in Captain America The First Avenger (2011). I find it is an alright film with a pretty simple plot, though I do prefer the MCU films. The MCU films came in a time with better camera quality and CGI is readily available for anything that seems harder to do in live action. Though we might not have gotten the MCU version of the character if this one wasn't made and if it was made more readily available in theaters and then on physical media and became successful if it was. How one version of a specific character from comics does should affect future adaptations in at least one way or another. I would like to have it be more readily available, like having it on Disney Plus, where everyone is more able to watch this piece of Marvel history if they want to even if it doesn't have the best ratings. Maybe even bring this version of Cap back through the multiverse."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "bob the moo",
        "review_rating": "",
        "review_title": "Endlessly cheap in almost every regard",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "jimjo1216",
        "review_rating": "",
        "review_title": "Can't live up to the promise of its first 25 minutes",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "zitajohann",
        "review_rating": "6",
        "review_title": "Low budget but not bad",
        "review_detailed_main": "People watching this post avengers need to take a breath. This movie was made for nothing and when you look at other movies around the same period for the same budget its actually pretty amazing what they achieved. The captain America costume is basically 100% comics accurate for the time. However, the character other than having a squared jawed likable actor has zero development. The makeup on redskull in the first act is really good and the actor is having alot of fun playing him. But that doesnt dismiss the fact that the main thrust of the story is Cap trying to figure out redskulls real name, which for an action movie is pretty lame."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "nils-33",
        "review_rating": "",
        "review_title": "depends on what you expect",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Raja79",
        "review_rating": "6",
        "review_title": "The Red Skull, lol...",
        "review_detailed_main": "The Red Skull was my favorite part of this movie, just because of how funny the makeup looks. This version of Red Skull is my favorite as I just cannot stop laughing when I see it.\n\nThe Captain America of this movie is boring, though, nothing interesting going on with him."
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Bellybub",
        "review_rating": "",
        "review_title": "Is a waste of film!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "MonsterVision99",
        "review_rating": "6",
        "review_title": "Not high Pyun but worthwhile comic book film.",
        "review_detailed_main": "Very Pyun-esque. I can only imagine how this would read to someone who isn't aware of him as a director. The focus on dynamic shootouts and the spy plot line instead of superpowers, the heroic yet flawed and distressed protagonist, the odd sci-fi additions, the prominence of women, the bizarre aspect of the villain, it's all there very much reconfigured into the superhero movie formula. I also liked the expressive shots that tried to resemble comic book storytelling, those profile close ups that alternate between the villain and hero that united them in their similarities (\"We are both tragedies\") are pretty cool. The climax overall was great.\n\nThe montage was wild, with lots of discontinuity (a few heterogeneous inserts and reverse shots) and it became too frenetic at times but only occasionally.\n\nStill, not nearly as bad as people make it out to be. (Insert comment about how the newer superhero movies are duller and less interesting)"
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "culwin",
        "review_rating": "",
        "review_title": "This is da bom! Er.. I mean a bomb",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Craig JS",
        "review_rating": "",
        "review_title": "Does he do childrens parties though.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "masterbrain_27",
        "review_rating": "",
        "review_title": "Sucks as a Movie but great as a comic book",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "AlbertV79",
        "review_rating": "",
        "review_title": "Please...remake this and make it better!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Torgo-8",
        "review_rating": "",
        "review_title": "Funny for the wrong reasons.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "col_rutherford",
        "review_rating": "",
        "review_title": "A Total Piece of Cap",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "ctomvelu1",
        "review_rating": "",
        "review_title": "Ugh",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "tcbinaflash",
        "review_rating": "",
        "review_title": "I don't usually walk out of a movie, but ...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "grendelkhan",
        "review_rating": "",
        "review_title": "Fourth time's the charm, right?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "magellan333",
        "review_rating": "",
        "review_title": "A waste of film!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Athanatos",
        "review_rating": "",
        "review_title": "Stan Lee Will Spend Eternity in the Pit",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "silas-26",
        "review_rating": "",
        "review_title": "oh good lord- trite sh***",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Chiron1987",
        "review_rating": "",
        "review_title": "Not even a double dose of super soldier serum could've saved the Star Spangled Avenger...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "lor_",
        "review_rating": "",
        "review_title": "Modest adaptation",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "calaan@sfsu.edu",
        "review_rating": "",
        "review_title": "\"This has set the cause of freedom back 40 years\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "lavashack",
        "review_rating": "",
        "review_title": "not too great",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "COMICBOOKSTOREGUY",
        "review_rating": "",
        "review_title": "Were the producers trying to insult Captain America?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Pat-88",
        "review_rating": "",
        "review_title": "The Worst Comic Movie Ever!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "Robert_duder",
        "review_rating": "",
        "review_title": "Is this for real? I know the story behind this.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0103923",
        "movie_name": "Captain America",
        "movie_rating": "3.2",
        "review_username": "AndyEN",
        "review_rating": "",
        "review_title": "Time Passer",
        "review_detailed_main": ""
    }
]