[
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "vatsalpitliya",
        "review_rating": "3",
        "review_title": "Wastage Of Money And Time",
        "review_detailed_main": "Please don't waste your money and time on such baseless movie ! Another bakwas lovestory from karan johar 😒"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "aiswaryapradeep24",
        "review_rating": "5",
        "review_title": "A bad copy of Sanjay Leela Bhansali's film",
        "review_detailed_main": "The trailer was amazing. I think I had too many expectations, which weren't met . The actors have done their role beautifully. The settings and costumes were too good . For a second it felt like a SLB movie . But then the screenplay lags at various times . Logic in some scenes were clearly missing . Songs and dancing were great , but those can't clearly improve the story of the movie . Do go it a miss if you don't want to see another cliched Hindu - Muslim lovestory along with a love triangle ."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "aj-04056",
        "review_rating": "4",
        "review_title": "SAME OLD LOVE STORY OBSESSION AND AVERAGE ACTING",
        "review_detailed_main": "Same og bollywood love story , no body impress with acting just pale and boring revenge saga . Some props are good location and production , btw doesn't worth wasting money . Save it for Endgame second ticket :) ."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "trinka_trinka_mahadeva",
        "review_rating": "1",
        "review_title": "Predictability thy name is Kalank!",
        "review_detailed_main": "Story: You know it already from the trailer.\n\nMaking: It's very grand and huge in scale.\n\nActing: Only Alia Bhat acts in this whole movie.\n\nDirection: There was no need for director since there is no story.\n\nOverall: Waste of time and money."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "CineRenaissance",
        "review_rating": "",
        "review_title": "Wastage of time and money.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "soumi_11",
        "review_rating": "1",
        "review_title": "Worst film of 2019 so far.",
        "review_detailed_main": "A typical Bollywood film to make appeal to Pakistani audience. This film is the same old \"religion\" vs \"humanity\" , where Zafar is of other religion. my question is why cant Zafar denounce his religion for his loved one?And there is no character development for Zafar. Direction wise the movie is really bad, probably one of the worst direction of all time.No plot.No character Development. Only Melodrama. Director is wannabe SanjayLeelaBansari. Music is forgettable and Pritam's worst movie as music director. Like other review says, the film is extremely boring."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "kapoor-vibhu",
        "review_rating": "1",
        "review_title": "Avoid at all costs",
        "review_detailed_main": "This Movie should only be watched if you want to punish yourself by sitting through 3hours of torture. Bland movie, extremely slow, boring,monotonous with weak and predictable story with dose of overacting"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "paritoshfzd",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "I can't even sit for two hours totally waste of time and money"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "adityabhatt-52579",
        "review_rating": "1",
        "review_title": "Hit & Miss",
        "review_detailed_main": "This movie brings nothing new to the table apart from the great sets and costumes. Typical Hindu-Muslim story which I guess everyone is probably sick of now. Can't the writers come with something original or innovative, Movie is very predictable and has very little to offer. What a waste of talent of the star power in this movie."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "rohantaneja-43258",
        "review_rating": "7",
        "review_title": "Why is there so much hate!",
        "review_detailed_main": "Why is there so much hate towards this film! I am really annoyed and disappointed with all the negative reviews and people who are finding faults and criticising this outstanding well made film.\n\nThe acting all around was incredible, the set of the film was amazing as well as having a great story line.\n\nMadhuri Dixit, Varun Dhawan, Alia Bhatt, Sanjay Dutt, Sonakshi Sinha, Aditya Roy Kapoor---- I'm really speechless for the wonderful roles they played and whatever role was theirs, they did absolute justice to it.. The roles of Madhuri, Varun and Alia are highly highly commendable..My big appreciation and admiration to such stars who played the characters soo well and put life in them as real..\n\nThe cinematography was also very amazing.\n\nWill definitely watch this film again once it comes to Amazon Prime!"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "sharedkumar",
        "review_rating": "1",
        "review_title": "Nepotism...ka thekedaar karan joker",
        "review_detailed_main": "Only one word for it \"KALANK\" I WANT MY MONEY BACK😪😪"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "riishighetia",
        "review_rating": "8",
        "review_title": "DID I WATCH THE SAME THING???",
        "review_detailed_main": "THE FILM WAS AMAZING, BIG BUDGET, ASTHETICALLY PLEASING, AMAZING ACTING, AMAZING SONGS AND PERFORMANCES, AND GOOD STORYLINE WITH TWISTS AND TURNS TO KEEP YOU ENETERTAINED?? WHAT IS WITH ALL THE NEGATIVITY THESE DAYS JEEEEEZHUS"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "mohammedsulemanbalwar",
        "review_rating": "7",
        "review_title": "Love or Kalank",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "krunalpatel11127",
        "review_rating": "1",
        "review_title": "Wtf was that",
        "review_detailed_main": "Disaster attempts ....capturing history with some cheap tricks and nepokids!!! I guess that's obvious.mentioning here in the comments doesn't change the fact that this guy(KJ)truely support nepotism"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "abhinav-dec27",
        "review_rating": "2",
        "review_title": "Spoiler alert",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "vimalrana29",
        "review_rating": "1",
        "review_title": "Total bakwas.",
        "review_detailed_main": "Everything is bad..in this film. Acting, direction, story, music, editing.. Please save your time, money, energy and mental peace by not watching it. OMG ! Ye Kya bana dala karan tuney? \"Maansik pratadna\". Ye movie to sachmuch Hindi cinema ki \"kalank\" nikli."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "gopilal-09835",
        "review_rating": "1",
        "review_title": "Kalank 👎🏿👎🏿👎🏿👎🏿",
        "review_detailed_main": "Tittle defines movie \"Kalank\" Yesss This movie is Kalank, Don't waste your money. Save it for your breakfast 👎🏿👎🏿👎🏿👎🏿👎🏿👎🏿"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "charanjeet1506",
        "review_rating": "2",
        "review_title": "#Kalank : 2/5* Boring Film, Baaki Sab First Class hai 😂",
        "review_detailed_main": "Plot: Cliché Drama of Love, Relationships and Life\n\nGood : Alia outshines everyone. Looking ravishing, beautiful and delicate from start till the end, all thanks to her amazing costumes, make-up and poise! Rest, all are manageable! Nothing extraordinary!\n\nProduction design has done wonderful job at creating a complete city from scratch! Costumes are fabulous! Especially Alia and Aditya's costumes are worth a mention!\n\nBad: Music is very average, never works in favor of the film! At times, it breaks the continuity of the film too. Like all are sobbing and abruptly Kriti Sanon barges in with Saiyya Mera with zero expressions and lame dance moves, the city is on fire, relationships are getting tested and Madhuri can't stop dancing on Tabah Ho Gaye etc). Even, the only manageable song \"Kalank\" gets wasted and poorly utilized and no emotions gets translated to the audience!\n\nOverall writing is too bad, being set in Year 1945 won't give you a licence to tell a lame and lazy story!!!\n\nDialogues which would have been the strength of this kind of \"Period Drama\" are so bland! I can still enjoy \"SLB's Devdas\" for that fact!\n\nYou can get the lame \"references\" from other hit films like HDDCS Aishwarya's entry Patang Wala Song - Alia Entry Song, HDDCS Aishwarya's Look - Alia Look, HDDCS Salman-Ajay getting drunk, talking about their love, singing Dholi Taro- Varun - Aditya scene, even HDDCS Chandelier (Jhumaar) reappeared here, DDLJ's train climax - yes, it was hanging here too, and many more....)\n\nStrictly any emotion get conveyed to the audience! I had no emotional connect at all, neither in the start, nor in the end! I can feel no pain of what these characters are going through I was just waiting it to be over!\n\nLength is 2Hours 48 Minutes long! Be prepared, as it feels a decade inside the theater!\n\nAnd yes, the story is so predictable that you can guess that in the start only, I got it right after only 8 Mins into the film, literally, 8 mins!!!\n\nAll in all, paisa Bachao, Avengers Endgame Dekho next week! Baaki sab first class hai"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "payalts",
        "review_rating": "1",
        "review_title": "Give it a miss",
        "review_detailed_main": "1 just for the sets and costumes Movie has nothing else. Weak story line, acting, direction. Walked out after the interval, that should say it all."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "kingkass",
        "review_rating": "7",
        "review_title": "It's nowhere near as bad as some are saying!",
        "review_detailed_main": "This film should and could have been a lot better with some more rewrites but a lot of the film works. The dialogue is extremely over the top to the point where every sentence uttered by a character is a metaphor at times. Although I feel some lines do come together at the end successfuly. The songs are fantastic. It looks and sounds brilliant. 10/10 in that regard. It's just the story doesn't really hook you until near the end. I feel the acting was quite good overall but the standouts were definitely Varun Dhawan and Madhuri. It ends on a good note which makes the whole experience worth it for me. I wish more effort was put into the story though."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "sharedkumar",
        "review_rating": "1",
        "review_title": "total bakwaas film...pls dont watch it",
        "review_detailed_main": "So much slow motion effects with ugly sets and costumes, very poor vfx. very loose story and and poor acting. (-10/10)"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "cdcrb",
        "review_rating": "8",
        "review_title": "love and sacrifice.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "aadilmoosa27",
        "review_rating": "7",
        "review_title": "Performances are Top Notch",
        "review_detailed_main": "Bahaar Begum is the life of Kalank, had her back story been more meated out, the emotional quotient of the movie would have been on another level. Madhuri Dixit, you are a treasure to this Industry. Superb Musical score!"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "salmaniac-26688",
        "review_rating": "",
        "review_title": "Epic disaster",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "nikhiltech",
        "review_rating": "1",
        "review_title": "What a waste of time",
        "review_detailed_main": "I am sure this movie has been a waste of time for everyone. For viewers, for makers and for actors. Such a disappointment."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "vipulvyas-03165",
        "review_rating": "",
        "review_title": "Wicked man",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "aasripoolsolutions",
        "review_rating": "2",
        "review_title": "A DISASTROUS ATTEMPT.",
        "review_detailed_main": "Hence again bollywood proved us that It can do anything for a film, add star cast, grandeur sets, too much of graphics and songs with numerous actresses without a proper stroyline. The screenplay is so slow at one time you'll surely decide to leave the theatre, this film is not worth your time and energy, it can also be titles as \"Thugs of Hindustan-2* as both of them come under the same category of remaining a flop. Alia bhatt is one of the reason you can give this film A TRY, but nothing else captivates you. Weak and cofusing characterizations are another disastrous element to talk about in the film. Songs can be tagged as \"just fine\" stuff and breaks the boreness of the film. Karan johar need to take a damn break from his career so that we no more receive movies like \"Kalank\" and \"student of the year 2\".🙏🏻 What's good? 1. Few here and there performances 2. Alia bhatt 3. Grandeur sets 4. Few songs What's bad? 1. Storyline 2. Screenplay 3. Half-baked script 4. Proceedings 5. Douzy writing 6. Running time. 7. Improper narration I guess the director guided the cast without giving them any script, cause he himself had got none. Final bottomline- A disastrous and unworthy attempt from the team."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "gautamradadiya",
        "review_rating": "1",
        "review_title": "Waste of money",
        "review_detailed_main": "Save your money for end game. Poor acting , boring and old story"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "nishasuperboy",
        "review_rating": "4",
        "review_title": "You can skip this !",
        "review_detailed_main": "Fetch your tickets only for it's amazing visuals and great music especially the BGM . Couldn't feel much impact in the story because of its slow paced narration , but the climax will definitely satisfy and will define the movie properly."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "onlypawan-20024",
        "review_rating": "1",
        "review_title": "Kalank",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "winak",
        "review_rating": "3",
        "review_title": "Useless melodrama with no real story !!",
        "review_detailed_main": "If you notice for every dislike or negative review there is 2 to 3 (9-10 rated review). Paid staff who scour reviews to balance negative response to ensure future viewership online or on television ?? Strange you decide. Getting back to the movie. You needed a heavyweight actor to play Varun Dhawan's character and the last time viewers checked he is not. Sanjay Dutt didn't have much to do so was wasted overall. You blink and miss Sonakshi Sinha in the movie. Madhuri was good. Alia was decent too. Most of the characters were underdeveloped, so they just flat-lined. Story would be ok for the 70s, however for this era not enough material to keep it interesting. Sorry I recommend missing this movie."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "creedreaper",
        "review_rating": "7",
        "review_title": "Hmmm really baffled by these Reviews???",
        "review_detailed_main": "I went in with the lowest possible expectations for this movie after seeing the reviews ripping this movie apart. Afterwards I just couldn't understand as to why it was rated so badly??\n\nIt was actually a pretty decent movie and a storyline. Yes it wasn't no masterpiece but still pretty good. Only scene which was bad was the bull fighting but I really loved watching Sanjay Dutt and Madhuri I'm the same frame after such a long time. Alia Bhatt did pretty decent and Varun Dhawan and Aditya Roy Kapoor was really good. Loved Arjit Singh and Shreya Ghoshal voices. Storytelling was done really well and there were some really emotional scenes.\n\nI don't know if Indian audiences have lost their minds or was it because there was a Muslim angle in this movie and politics kicked in around elections? I just don't know but to me this movie was worth my money!!!"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "nitejoker6",
        "review_rating": "3",
        "review_title": "Revisionist Undertones",
        "review_detailed_main": "It is a visual spectacle, yes. But the story and songs are rehashed from so many sources and have been recycled so many times before also that by 10 minutes in I knew exactly what will happen - and it happened exactly as predicted.. the movie was also used as a vehicle of historical revisionism. Very poor. Everyone, except, Aditya Roy Kapoor was misfit, miscast and seemed uncomfortable in his/her role. I give it a 3 for the effort. It's not worth 165 minutes of your life."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "kknkn-20823",
        "review_rating": "10",
        "review_title": "Fake review those r...but film awesome",
        "review_detailed_main": "Who the hell give so much low rating...it's awesome film"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "sulemanfazli",
        "review_rating": "7",
        "review_title": "Decent!",
        "review_detailed_main": "This movie is not that bad as other reviewers make it seem. Sure it has some faults from having unnecessary long scenes and background music. The movie could have been cut short by 20 minutes. Also, the story was cliche and a bit weak. It's unmatchable to Sanjay Leela Bhansali's work so don't go in with such expectations. What kept me hooked was everyone's acting as well as the sets, costumes, and cinematography. The songs were good too. The climax was surprising with a lot of emotions. Alia was superb and Varun did a pretty damn good job. Aditya and Sonakshi stood out too. I appreciated Sanjay Dutt for his efforts as well. But most importantly, Madhuri was just breathtaking! People are not giving credit to where it's due and are bashing the entire movie. It's not that bad!"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "rehmankhilji",
        "review_rating": "1",
        "review_title": "Horrible is a small word",
        "review_detailed_main": "Yes, horrible is a very small word for this movie. There was nothing right in it from the very start. First of all when you merge the film with history, one has to show at least the history as real, you can amend the future, hence Sci Fi. There are no mountains near lahore for miles and bull fighting, in Indo-Pak, which wrong history books have the writer read. Then it was Alia Bhatt and Varun in the movie and their God father Karan producer so there are expensive sets, expensive clothes and expensive everything but anything near to a sane movie. Sanjay Dutt was credit as Special Appearance but he is having more screen time then Sonakshi sinha. Madhuri, well there was and there will be only one Devdas and one chandramukhi, a fail attempt to recreate that magic. Alia entry song over inspired again from Sanjay Bhansali movie hum dil chuke sanam picturized on Aishwarya Rai. Dont watch it at all"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "satishmeghani-59311",
        "review_rating": "1",
        "review_title": "True to it's title 'Kalank' of Bollywood in 2019.",
        "review_detailed_main": "Kalank is worse than Thugs of Hindustan and Zero. Don't ever watch it. It's an epic disaster."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "arvind_maher",
        "review_rating": "1",
        "review_title": "Biggest kalank of 2019",
        "review_detailed_main": "Very bad direction and director is not having the idea where to take it up. These people have to understand that big sets and costumes can't get you footfall. It's only and only acting which is missing."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "sahilaggarwal-32578",
        "review_rating": "2",
        "review_title": "2 star only for set and costumes",
        "review_detailed_main": "Trailer looks pretty good but the movie is totally different... Extended shots. Weak script, never expected this from such big actors like alia and Varun"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "stugicwb",
        "review_rating": "1",
        "review_title": "Worst movie 'Kalank'",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "flash-10497",
        "review_rating": "1",
        "review_title": "Worse movie ever of Karan johar",
        "review_detailed_main": "Meaning less movie.... Madhuri has taken wrong decision to work in this movie....movie was just made for Alia Bhatt and Varun......worse vfx effect s, worse story line, except Arijit title track ..nothing is in movie"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "shobhanadv",
        "review_rating": "6",
        "review_title": "Excellent !!!",
        "review_detailed_main": "Very good movie ..different story then usual love stories nowadays... Excellent performance by all actors. I reccomend everyone to go and watch it then give verdict. well done all cast and crew.!!"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "akashtaker001",
        "review_rating": "1",
        "review_title": "Boring film by one and only Karan Johar",
        "review_detailed_main": "So the torchbearer of Nepotism is back. This time with a boring and pretentious movie. Starring mostly starkids. We have overacting gareebo ka Govinda Varun Dhawan son of David Dhawan, most pretentious actress in Bollywood Alia Bhatt daughter of Khujli master Mahesh Bhatt. Overacting ki dukan Sonakshi Sinha, daughter of Shatrughn Sinha. Just decent Aditya Roy Kapoor brother of Siddharth Roy Kapoor. And we also have way past hua prime Sanjay Dutt son of Sunil Dutt. And amid all the Nepotism we have Madhuri Dixit. The story also has no real sense of what is happening. Most of the film is filled with visuals and characters in good looking costumes. Which is the only place where filmmakers have decided to spend most of their budgets. A total avoid of a film."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "majumdertapas",
        "review_rating": "10",
        "review_title": "Magnificient!🔥",
        "review_detailed_main": "People are so full of hate these days....everyone is going and enjoying the film...dont have any idea why imdb has so low ratings and full of haters....it was one of the best movies till date"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "vikaskumar-90884",
        "review_rating": "7",
        "review_title": "It's a good one...",
        "review_detailed_main": "I like this romantic,heart- touching story.... It wonders all the love to make one a great humanity person..really it is full of realistic."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "sahyamchakraborty",
        "review_rating": "1",
        "review_title": "Kalank",
        "review_detailed_main": "Title justifies the movie It was absolutely a kalank Over drama, nonsensical music Save your money for endgame Most worst movie of 2019"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "abhijnv",
        "review_rating": "1",
        "review_title": "Horrible",
        "review_detailed_main": "This movie is a Kalank for bollywood. Very pathetic, Slow nd boring Movie.. Totally misuse of actors like Madhuri nd sanjay.. Sonakshi Sinha is nothing but burden for this movie.. Story is missing, screenplay is scattered..Very disappointed 😡😡😡"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "nitin_raj1989",
        "review_rating": "1",
        "review_title": "Not enough to take star",
        "review_detailed_main": "Sonakshi is getting worst day by day she should be with her dad on roadshow, with whom she was dreaming about. Movie is getting low rating coz of her. Rest name itself says it's kalank not love"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "Taranarana",
        "review_rating": "1",
        "review_title": "Wastage of time and my money.",
        "review_detailed_main": "I loved the trailer. I loved those songs but the movie was real bad. The songs trapped me. I thought the movie would be next bajirao mastani or padmavat with the great sets and mind blowing cinematography alike Sanjayji. I was disappointed. The story doesn't progress. Varun dhawan is some kind of Superman fighting bulls. Stop with this types of movies. Don't watch this movie. Save your money and time everyone"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "BollyButler",
        "review_rating": "1",
        "review_title": "Brain dead",
        "review_detailed_main": "Excruciatingly slow, mind-numbingly inane and utterly boring. Can't believe this is 2019 and this is what mainstream entertainers of today are churning out.\n\nThe plot makes zero sense, the setting is highly improbable (snow-capped peaks in the background while everyone is silks, a gladiator-style bullfight scene with cringe-worthy effects (Kangana's leaked dummy horse video pales in comparison), lavish sets, robotic background dancers and what looks like Tropicana juice at the breakfast table!! Please, we want substance, not a soulless opera masquerading as a magnum opus.\n\nSeriously want a REFUND - for the tickets and for the coffee (even the extra shot of espresso didn't help revive my dying brain cells) I had to buy during interval to suffer through the second half. Karan Johar has clearly lost it but I'm mad at myself for not waiting until the reviews were out. What a contrast between my last time at the movies (Gully Boy) and this senseless, meandering, exaggerated mess...and what a WASTE of a holiday! Should have stayed home and watched Netflix instead."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "rajpootaman",
        "review_rating": "1",
        "review_title": "Wastage of Time and money",
        "review_detailed_main": "I have lot of expectations but it's has been such a disappointment.The movie is too boring.you have to put a lot of effort to atleast watch it till end .watching this movie is like a punishment."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "swastikghosh-94734",
        "review_rating": "6",
        "review_title": "Average",
        "review_detailed_main": "I haven't found any story in this movie. I don't know what actually the director wanted to tell the audience.. Otherwise the songs, acting of each role, some close shots are very nice... All the characters played their roles quite beautifully.. specially Alia Bhatt.. she was brilliant throughout the movie... I am giving it 6 out off 10.."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "rohitkrmehta",
        "review_rating": "2",
        "review_title": "Mere me kalank lag Gaya",
        "review_detailed_main": "Such a pain in the a** sitting and watching this movie for more then 3 hours . Bollywood cinema ke history me ye movie Sach me kalank hai.. Except the costumes nothing else is good in the movie.. Big disapointment.."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "dufi-23355",
        "review_rating": "10",
        "review_title": "Superb Movie",
        "review_detailed_main": "This movie has a great message in it.... Every people should watch this movie once"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "buntusingh-42062",
        "review_rating": "7",
        "review_title": "It's really not bad at all.",
        "review_detailed_main": "This movie is getting a lot of hate and I can imagine some reasons why. It's a decent movie, but has several scenes that are scripted over the top and seem wholly unnatural. But a reason that I think is unwarranted for giving this movie hate is it's pace. It's a slow movie, but it doesn't lack substance or drags things out excessively. It is what it is, a decent effort in terms of acting and storytelling. The truth is most audiences can't sit through movies patiently anymore."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "manthan-18708",
        "review_rating": "2",
        "review_title": "justifying its title \"KALANK\"",
        "review_detailed_main": "Not much gripping story at all its like indian television drama serial got picturised into a ridiculous 3 hour movie."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "gangulymoulli",
        "review_rating": "1",
        "review_title": "Terrible",
        "review_detailed_main": "Very bad film with plastic over the top non realistic locations and production value for no reason"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "aanchaliitd",
        "review_rating": "1",
        "review_title": "Shoddy mashup of Bhansali movie scenes",
        "review_detailed_main": "Storyline, scenes, everything are just copy pasted from other movies. No coherence. Tedious to watch. Madhuri Dixit wasted. Kiara advani has far more screen presence than alia Bhatt. Wasted again while the audience has to laboriously watch Alia. This movie is basically nepotism and mediocrity staring in your face."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "JPEI64",
        "review_rating": "1",
        "review_title": "A clear example of over rated stars attempting to 'act'.",
        "review_detailed_main": "Do any of these top billed stars even care they are part of this drivel? No! Cos they get paid to go on their next foreign holiday, wedding, buy a luxury car or even for their next nose job. The fact that none of these so called 'superstars' were even apologetic for letting the public be subject to such nonsense, third rate 'acting' scripting and storyline (even lack of,) shows nobody really cares in Bollywood. As long as they r paid, all's good. Karan and the rest should start living in reality and stop insulting the audience intelligence. Madhuri can now go on Italian holiday with her family, Alia can zip to NYC cos..well...she just feels lije it. Varun can add to his bank account a few more crores for his upcoming wedding. Sanjay, well he just needs to refill his coffers again. Sonakshi, a sad 'has been' who just needs money to well... continue enjoying her high life...till her marriage...and why not?\n\nWatching your goldfish swimming lazily in your fish tank is much more enjoyable and informative.\n\nA bottle of Xanax, super dark sunglasses with matching ear plugs, mandatory when watching this - if you dare!"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "santropy",
        "review_rating": "1",
        "review_title": "There is a reason for so many bad reviews",
        "review_detailed_main": "When you see so many bad reviews and low ratings, there is definitely a reason behind it. It's not a conspiracy, but concern for fellow movie lovers. When you ignore advice of people trying to save you 3 hours of life and hair pulling, you pay dearly and so did I.\n\nSo let me warn you, which has been already done thousands of times in the other reviews, save the precious 2:45 hours of your life. Watching paint drying or drinking your Nana's bath water is more enjoyable than watching this movie. All this movie has is huge eye-catching sets and good costume design, rest all is dud. It's still mind boggling to see these producers and directors think just having huge sets, big budget and a huge star cast makes a hit film. Making fun of marriage and testing it's boundaries which many consider holy is not new to Dharma production, but when you want to test the boundaries at least tie it with good story line where it feels like a literature and not a regurgitation of crap that the producer swallows from a leather funnel."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "dibeyendu",
        "review_rating": "7",
        "review_title": "Part of an established genre",
        "review_detailed_main": "A lady with terminal cancer (Sonakshi Sinha) tries to fix a second marriage for her husband before she dies. They live in a small town near Lahore and she finds the girl she wants in a Hindu village in India. But the girl (Alia Bhatt) won't agree to wait till the first wife dies and says she'll enter the house only as the second wife. But she soon finds herself lonely and unloved as her new husband (Aditya Roy Kapur) loves his first wife only and says so. He's obviously into mature women and not wispy young girls. And the wispy young girl is not into serious, intellectual men. Left to herself, she falls for a young blacksmith (Varun Dhavan). It is soon revealed that the two men share the same father (Sanjay Dutt). One is his illegitimate son by a brothel keeper (Madhuri Dixit). The other is the highly educated editor of the local newspaper. After all this is established, the film drags slowly to a fairly predictable resolution. The sets are unrealistically opulent, with the brothel resembling a five star heritage resort and the rich man's house resembling the White House. Kalank is part of a now established genre in Bollywood, which includes films like Vidhu Vinod Chopra's Eklavya: The Royal Guard."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "stugicwb",
        "review_rating": "1",
        "review_title": "'Kalank' is Only 'Kalank' don't watch...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "harmeet_banwait",
        "review_rating": "10",
        "review_title": "Great film",
        "review_detailed_main": "I loved the film, great story line, awesome cast! Music was phenomenal and the outfits were beautiful!"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "shiksanuckched",
        "review_rating": "7",
        "review_title": "Go watch it if you love dramas and epic sets",
        "review_detailed_main": "I almost didn't watch this movie in the cinema following the reviews! I can assure you that it's not as bad as the reviews are alluring to. Beautiful sets, even more beautiful costumes and good acting by Alia, Varun, Aditya and Maduri. Storyline is a bit weak but enough to keep you interested as the plot unfolds. I like the new and unique love angle portrayed in the movie. It might feel slow if all you are after is a comedy or some masala but if you like dramas then go watch it. You will not be disappointed."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "nitibassi-1",
        "review_rating": "5",
        "review_title": "Wasn't sure what rating to give",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "khansahar-85320",
        "review_rating": "2",
        "review_title": "Aditya Roy Kapoor!",
        "review_detailed_main": "Only person watchable in the movie is Aditya roy Kapoor not because he is a good actor but he is good looking! And sanjay dutt should quit acting.."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "varunshinde7",
        "review_rating": "1",
        "review_title": "Request people to stand up agains this drivel by not watching it",
        "review_detailed_main": "This movie surely must have been made to torture the audience. It has to be a sadistic experiment by a Bollywood Moghul to see how far he can stretch the Bollywood&glamour obsessed Indian audience's tolerance. There cannot be any other reason to make such a movie. The director probably worships the ground that Sanjay Bhansali walks on and tried to make another Devdas. We may all become alcoholics if we have to take any more of this drivel. Please do not watch it, if only to discourage Karan Johar and Abhishek Varman from making anymore like these. A special mention to the excruciating background score, it's insulting. Mr. Johar will do well to notice that the audience has evolved. I hope he understands the results of his cruel experiment."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "ShitizSays",
        "review_rating": "1",
        "review_title": "If you haven't seen the film, then consider yourself lucky.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "SAMTHEBESTEST",
        "review_rating": "4",
        "review_title": "A LOVE SAGA TRAPPED IN LUKEWARM VISION AND TORTOISE SPEED SCREENPLAY",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "myvoice-07677",
        "review_rating": "2",
        "review_title": "Waste of money",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "geervani-31923",
        "review_rating": "7",
        "review_title": "Engrossing a visual treat",
        "review_detailed_main": "His movie is being bashed too much. It was quite engaging and entertaining for me. Special mention to the music and costume/jewellery."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "Vikky0007",
        "review_rating": "1",
        "review_title": "O my god what crap",
        "review_detailed_main": "KJo bhai if you have too much money to waste, please send some over to me too. What utter crap were you trying to make? Really bad story. Average songs. Movie is undecipherable from the start. Were you trying to fix your black money?? I do not understand what the hell was this movie? Bull fight in India? Really? Heera mandi? Is this based in Pakistan or India? Only aesthetics and optics and zero essence."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "ryanwright-92497",
        "review_rating": "10",
        "review_title": "Unbiased review",
        "review_detailed_main": "Strong acting by Varun and Alia. Good to see Sanjay Dutt acting his age! Story does seem to be slow but very passionate for strong hearted people. It is very realistic and touches every human with that sense of dilemma in life! A must watch movie!!!"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "hannahmiley11",
        "review_rating": "7",
        "review_title": "Ignore the biased reviews. It's not that bad.",
        "review_detailed_main": "The first thing that comes to mind when I think of Kalank is the cinematography and the acting. It was so beautifully shot and the sets were gorgeous. It was very grandeur. And the acting by everyone was really well done. I didn't expect Varun to be so good but he was. Everyone was. Now the story isn't the best out there but it's not terrible. It made logical sense but there were some choices that I disagree with especially in the end. It is a slow paced movie but I was intrigued all throughout. I felt the movie was more about the people than the partition and it was a side thought even tho it's supposed to be a love story during the partition. The partition only came to center stage when a conflict needed to arise. The story could've been better. But go watch it for the direction and the imagery on screen and the amazing songs. Arijit and Sherya killed it like always. I give it a solid 7/10."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "ankushgoyal",
        "review_rating": "1",
        "review_title": "Kalank nahi Maha Kalank",
        "review_detailed_main": "Ye movie Kalank nahi Maha Kalank hai .Waste of time ."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "jayrajjpatel",
        "review_rating": "1",
        "review_title": "bad movie",
        "review_detailed_main": "A typical Bollywood film to make appeal to Pakistani audience. This film is the same old \"religion\" vs \"humanity\" , where Zafar is of other religion. my question is why cant Zafar denounce his religion for his loved one?And there is no character development for Zafar. Direction wise the movie is really bad, probably one of the worst direction of all time.No plot.No character Development. Only Melodrama. Director is wannabe SanjayLeelaBansari. Music is forgettable and Pritam's worst movie as music director. Like other review says, the film is extremely boring."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "adithehunk-pikul",
        "review_rating": "1",
        "review_title": "Complete napotism. No storyism.",
        "review_detailed_main": "Script was bad. So the movie. Only star kids. Bla bla bla. Someone take the rust away from my mind. After watching the movie."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "shyam-uthaman",
        "review_rating": "1",
        "review_title": "Garbage. Absolute garbage",
        "review_detailed_main": "Annoying movie that bursts into random songs every 10 minutes. Did I say this movie was garbage? Because it is"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "OnjiMooteDaMarle",
        "review_rating": "1",
        "review_title": "Torture of an Unbelievable Kind",
        "review_detailed_main": "The first 30 minutes itself made me shift around every minute on my chair. The acting is mediocre by nearly everyone. The vfx for the animal was horrible, a shame. The music is meh - utterly forgettable. The dialogues are 'I have no clue'. Exquisite sets is all the film is about yet falls very short of the grandness Bhansali brings to his sets. And the story is so cliche.\n\nThe last dialogue of this film is a laugh. In short, Disgusting."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "acgug",
        "review_rating": "1",
        "review_title": "What a waste of talent.. such a crappy movie",
        "review_detailed_main": "Beautiful sets and talented actors cannot save this horrible crappy movie. Could only handle 30 minutes of this unbelievable choppy script . Absolutely no heads or tails in this supposedly absurd and strongly unbelievable love story Shame on the actors and producers to make such crap and fool the audience"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "AIOS-Reviews",
        "review_rating": "7",
        "review_title": "The Cinematography hooks you despite the bad screenplay",
        "review_detailed_main": "Much awaited Kalank was a special film because of its cinematography and performances. And at the same time over dramatic. But that hardly matters. Because as the film is a story of eternal love then drama requires. The movie is overlong too. But above all your time might be waste because of this movie but not your money.\n\nWhen score, performance and cinematography combines audience can't move their eyes from that. Kalank create such moments many times. One can visit the set of this movie on their mind while watching this.\n\nAbhishek Barman may not be still on the position of Sanjay Leela Bhansali but the effort he made is great. Varun Dhawan's as always same body language but he stole the show. Alia Bhatt never failed to amaze and finally Aditya Roy Kapoor after a long time did something promising.\n\nThe movie can get boring at moments but you need to be a film lover to watch this movie. Because in Bollywood we hardly get good techniques in movies. And Kalank is one of those. Where everything was near good, but Kalank failed to reach average film watcher because lack of salt on everywhere."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "jczgal",
        "review_rating": "2",
        "review_title": "Boring and pointless film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "sachmap",
        "review_rating": "9",
        "review_title": "Magnificent",
        "review_detailed_main": "Magnificent, excellent screenplay and direction, Slow moving, well connected roles and superb acting by everyone. A grand Music and Dance festival."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "hirakhatri",
        "review_rating": "7",
        "review_title": "I liked it",
        "review_detailed_main": "I'm not sure why everyone's so averse to this movie. I went into the cinema prepared to hate it but was actually quite engrossed throughout. I think everyone did well in terms of acting too."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "nandanioriginal",
        "review_rating": "1",
        "review_title": "Absolutely horrible movie!",
        "review_detailed_main": "Where do I start on how absolutely ridiculous this movie is?! Whose horrible idea to do a period drama around partition with costumes and sets that belong to some 16th century fantasyland merged with an 21st century over the top Indian wedding fashion show?? The totally non-period clothing, hair, and dance moves combined with dialogue that no one near Lahore would be speaking are staged with cardboard sets built for tacky eye candy rather than giving you a sense of the period. On how many points can you insult one of the most horrendous historical moments in Indian history? I haven't even touched on the absurd and predictable storyline that borrows from every cliche dialogue and scene for movies that have enjoyed success. What a waste of time!"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "neetabora",
        "review_rating": "1",
        "review_title": "Horrible!",
        "review_detailed_main": "Pogo cartoons have more sense. It's a horror. Very boring, fake, false, non sense, terrible, no logic and stupid. Not even for a single minute we were entertained. 0/10"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "mcoats-71101",
        "review_rating": "1",
        "review_title": "Cheap Bhansali rip off",
        "review_detailed_main": "Visually this tries its hardest to be a historical blockbuster in the style of Bhansali's beautiful films. It's much cheaper looking though and the acting is appalling. No idea what's going on with the storyline too, it's bizarre. Makes a mockery of the partition and had so much more potential. Terrible film."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "Tejas_Vinda_AITS",
        "review_rating": "5",
        "review_title": "Its a KALANK for Bollywood 😡,,,Good production Values & Good music BUT Story Bores and is Slow at times.",
        "review_detailed_main": "---\n\nSanjay dutt : Balraj\n\nMadhuri Dixit : Baahar Begum\n\nAditya Roy kapoor : Dev\n\nAlia Bhatt : Roop\n\nVarun Dhawan : Zafar\n\nSonakshi Sinha : Satya\n\nA complex love story set during India's Partition era (1940s), where the young Roop (Alia Bhatt) is torn between respect for husband Dev (Aditya Roy Kapur) and her newfound love for Zafar (Varun Dhawan). The history of India takes an epic turn, from where there is no coming back.\n\nAs the name suggests, Kalank is a story that questions the high morals of society, especially when it comes to love and family ties.\n\nThe film focuses on how eternal love goes beyond the norms and rules of society, the trappings of religions, and all other physical and man-made boundaries.\n\nAt a dramatic moment in the film, Aditya Roy Kapur's Dev remarks that if someone's wife is in love with another man, then what is the point of the marriage at all.\n\nThe story is based in a town called Husnabad near Lahore, a few years before the Partition of India and Pakistan. It's a town populated by blacksmiths and a majority of them are Muslims.\n\nDev and his father Balraj (Sanjay Dutt), who also run a liberal newspaper called The Daily News. Dev's life takes an sudden turn when under strange circumstances he gets married to Roop.\n\nRoop meets Zafar, the local blacksmith and they fell in love, The story is predictable.\n\nWhat's fresh about Kalank is the sets, the costumes, everything about the film.\n\nThe other high points of the film are the problematic equation between father and son, Dev and Balraj as well as the fragile teacher-student dynamic between Bahaar Begum and Roop. But all thiiz are presented in very bored manner. 😐\n\nAn epic love saga 🙄based during the 1940s ,,is too away from reality. (Like Movie Saawariya 2007)\n\nMusic by Pritam is good, performances of all actors are intense.\n\nAt 2 hours and 48 minutes, with a tighter edit the story could have wrapped up much sooner though.\n\nMovie makes u feel bored at times,,Characters are strange and looks serious always unnecessarily.\n\nFunny points are as follows:\n\n1. Madhuri lives in a palace and one has to travel by boat to reach her.\n\n2. Bull fight is funny. Bull is intelligent and returns back when crowd thinks it is over.\n\n3. Kuch rishte karzon ker tarah hote hain unhe nibhana nahi chukana padta hai. Key dialogue of movie.\n\n4. A lot of extra in dances but only two person in the funeral of sonakshi. Why..none knows..!\n\n5. Siddhart Roy Kapoor : Ajay Devgan from HDDCS\n\n6. Varun : SRK from Devdas\n\n7. Sanjay Dutt : BigB from KANK\n\n8. Madhuri : Madhuri from Devdas\n\n9. Alia : Aishwarya from HDDCS\n\n10. Sonakshi: New character\n\nThis time Karan Johar dsnt excel.\n\nRatings: 5/10 for big starcast, music & production values..!!"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "prisminfocomm",
        "review_rating": "1",
        "review_title": "Want to waste your time than please go watch and regret for your life..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "saurzj",
        "review_rating": "2",
        "review_title": "As the name goes",
        "review_detailed_main": "The name totally matches with, truly a Kalank on in Indian cinema."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "manvendrasiwach",
        "review_rating": "7",
        "review_title": "A bit too long",
        "review_detailed_main": "A period dram that is high on production and individual brilliance by Sanjay Dutt, Madhuri Dixit and Aliya Bhatt\n\nAt least 30 minutes of the film length could hsve beeb reduced. The sequence of bronco cum bullfighting with a bison for example was a comic waste of time. Mediocre editing and couple of continuty glitches mar this otherwise well msde movie.\n\nMusic, Cinematography and period replication are the high points. The plot is sbove average and does not entirely unravel or lose grip at any point.\n\nA decent one time watch movie"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "riazmuradd",
        "review_rating": "2",
        "review_title": "Pathetic",
        "review_detailed_main": "A typical Karan Johar film with lehengas instead of t shirts. A generous sprinkling of anti-muslim propaganda & unrealistic scenarios to seal the deal."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "alishasingh-53334",
        "review_rating": "10",
        "review_title": "Loved love loved it",
        "review_detailed_main": "Kalank is a must watch don't read the negative views but more watch it for yourself. The cinematography and dialogues were exquisite. Madhuri Dixit slates ad Bahaar Begum truly no one would have been able to pull of Begum like Madhuri Dixit. Varun did a tremendous job as Zafar. Sonakshi following though she had a short role she left an impact. Alia is a wondeful job and so did Aditya. I repeat please watch the move for yourself and enjoy it"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "lalithadevi-07704",
        "review_rating": "7",
        "review_title": "Love Story With Out Vulgarity",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "satishmeghani-59311",
        "review_rating": "1",
        "review_title": "Worst than Race 3. Save your time and money.",
        "review_detailed_main": "Kalank is the worst and disastrous movie of 2019. If you have extra time and money then watch it otherwise simply avoid it. It's not even worth to watch at home. God Please save others from this disaster!"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "mohithiphop",
        "review_rating": "2",
        "review_title": "Kalank - Worst Bollywood Movie of 2019 MOHIT DHAWAN REVIEWS",
        "review_detailed_main": "I wonder where the hell bollywood is heading.The movie Kalank is a perfect example of how a large scale movie falls down and collapses if it doesnt have a story line.The story is hopeless and is not at all engaging. The talent of legendary actors like Sanjay dutt and Madhuri Dixit have gone in vain.I cant express how bad this movie is i am still in shock.Varun Dhawan is good only when he does his dance moves Alia Bhatt is ok.Actually its the fault of the director and the script writer for not concentrating of the storyline they were more focussed on making items songs and large scale sets.\n\nMY RATING 2/10\n\nMOHIT DHAWAN REVIEWS"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "ashishbhatt20",
        "review_rating": "1",
        "review_title": "A failed attempt to make Sanjay Leela Bhansali film",
        "review_detailed_main": "SPOILER FREE REVIEW Although the story had lots of potential and all the actor were genuine in their effort the movie simply did not worked. The movie was clearly an attempt to make blockbuster period drama like bajirao mastaani or Ram leela but movie neither had content nor grandeur treatment. There were no bright large sets, amazing dressing and period specific language/atmosphere. Another problem was the length of movie. This movie keep on drag for nearly 3 hour, which made climax dull (easily predicted from trailer/song already). It could have easily been an hour less and be more entertaining. There was nothing novelty in this movie. It is just disappointing and OVERPRICED TOO. SAVE YOUR MONEY FOR AVENGERS...SKIP IT."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "msbornpretty",
        "review_rating": "1",
        "review_title": "Had a good sleep",
        "review_detailed_main": "I want my money back! Please avoid at all cost. Varun and Aaditya were good! Sonakshi did great! Madhuri wa treat to eyes so giving it a 2 star! Else it deserves a moon, I mean a '0'."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "samrendra1263",
        "review_rating": "1",
        "review_title": "Extremely Boring movie bad acting ,poor story",
        "review_detailed_main": "In one sentence this movie is Bad acting in Good Clothes . Unbearable same old boring story .When will bollywood learn to invest on good story writer n director . Stylish Actor n costly dress cannot run a movie.even madhuri dixit is wasted , sonakshi is her usual Bad in acting"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "greysky-10644",
        "review_rating": "2",
        "review_title": "Waste",
        "review_detailed_main": "Now I m confused. Which one wears the Crown for Worse movie of the decade. Will it be Kalank or Thugs of Hindostan.."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "kunalnair1",
        "review_rating": "6",
        "review_title": "Well directed movie!",
        "review_detailed_main": "Kalank is a not a great movie but it's still a sensible movie. It's a little slow but I thought that was because the director wanted to take the time to develop the characters and portray their emotions. The only unnecessary sequence to me was the bull fight which I thought was a cheaper version of vfx from bahubali and perhaps the Kriti Sanon item number could be edited. The actors have acted well, the songs are great and the sets are amazing. The sets actually left me in aw. It's a one time watch and I would recommend this movie for a mature audience who understand the art of cinema."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "msunando",
        "review_rating": "5",
        "review_title": "When form scores over content",
        "review_detailed_main": "KALANK - Caught in a hopeless marriage with nothing to expect from it, Roop (Alia Bhatt) meets the flirtatious and mysterious Zafar (Varun Dhawan) and there begins her journey of a forbidden love in the backdrop of communal disharmony, riots and an impending partition of India. Her husband Dev Chaudhary (Aditya Roy Kapoor) runs a newspaper that propagates the theory of \"one nation\" that attracts the ire of the majority Muslim population of Husnabad, further complicating matters. Throw in the twist of Zafar having a sinister other agenda of vendetta regarding his lineage, Kalank assumes a complex labyrinthine plot that you know must end in a tragedy, albeit unpredictable.\n\nI know that the aforesaid appears riveting but in reality the story actually is rather shallow to be stretched for 166 minutes. Laboriously slow, this is yet another case of form overtaking the content where the objective appears to be one of a demonstration of opulence and grandeur in everything and the story playing a mere second fiddle to gloss. Unfortunately the sets appear artificial and unconvincing and the characters aren't allowed to achieve significance, other than the lead pair. Aditya Roy Kapoor is wooden as usual, Sonakshi Sinha has precious little to do, Sanjay Dutt and Madhuri Dixit could have gotten meatier presence, but the director Abhishek Varman remains besotted with Varun and Alia only, making the experience rather monotonous. The climax where the train to Amritsar virtually strolls out of the station is so prolonged that one could steal a couple of winks in between.\n\nHaving said the above, Kalank makes for an experiential watching for several reasons - both Varun and Alia are outstanding in what they do, the grandeur is indeed spellbinding, Madhuri is grace personified and Pritam's music is ace. \"Kalank nahin ishq hai kaajal piya\" is a haunting melody that refuses to leave you, and \"Ghar more pardesiya\" is art sublime, in every form."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "randybatistarodriguez",
        "review_rating": "10",
        "review_title": "EXCELLENT movie",
        "review_detailed_main": "Loved the outfits, the music, the drama, the actors. Loved everything."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "suki-bains-London",
        "review_rating": "6",
        "review_title": "Kalank isn't so bad!",
        "review_detailed_main": "Everyone is being too harsh on this movie. Movies are art and not about achieving 100 crores club (unless you've personally invested in the movie!?).\n\nDon't compare Kalank with a masterpiece from Sanjay Leela Bhansali for a start. 4 of the 6 leads are not mature actors and are still on their journeys. They will develop over time for such movies and Varun, Alia, Aditiya and Sonakshi have done what the makers asked of them. Madhuri is amazing ...acts her age, looks beautiful and dances like a dream. Love her in tabaah ho gaye song. Deserves credit. Sanjay dutt again does what he's been asked to do. His character flaw is that he is a stubborn man who doesn't know how to express love or fix his mistakes. So that's how and why he acts expressionless.\n\nThe film could have cut out the Alia song at the start plus the Kiriti song...if people have such an issue with the length of the movie. The bull scene and 2 others I can recall (car drive & carriage at the end of the movie) had poor special effects for such a big movie.\n\nThe title track is so beautiful. I think it could have been used much better.\n\nThe ladies outfits are beautiful. Aditya looked great. Even Sanjay Dutt looks good.\n\nI rate this movie 3/5 6/10. It's not awful. Had some nice moments. There are some strange moments in the script and direction that I didn't like. I think some of the characters would have taken different actions too in some scenes.\n\nThe story didn't make me feel happy or sad. Didn't make me hold back tears. The box has been ticked. That's something for what feels like an experiment movie from Karan J. Go watch it to simply sit back and take in the scenery. Not every movie will leave you thinking wow and it'll make you re-appreciate the ones that really do ; )"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "akkidragon",
        "review_rating": "1",
        "review_title": "kalank of the Bollywood",
        "review_detailed_main": "Worst cgi effect i ever seen even video games have better graphics"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "nairtejas",
        "review_rating": "3",
        "review_title": "Little India Directory Review: Kalank (3 Stars)",
        "review_detailed_main": "The interesting thing about Abhishek Varman's Kalank (Blemish) is that it introduces almost all its characters in the initial minutes and then starts narrating the story, an ambitious period drama that asks its viewers to judge its moral at the end. Unfortunately, that is one of the few interesting elements in this otherwise nondescript tale of love and partition.\n\nSet in just a few months before the Partition of India, Kalank tells the story of a young woman (Alia Bhatt) coaxed into marrying the husband (Aditya Roy Kapoor) of her dying friend (Sonakshi Sinha). Tied into this unwanted union to show her loyalty to her friend, this woman now questions the status quo of a nearby place that has a potential for conflict, a communal one, with the help of her husband's newspaper press (another interesting element). And in her exploration is where she finds a calling for her talent in perhaps the most popular dancer-for-hire (Madhuri Dixit) in the locality as well as a ray of hope in her chained life in a womanizing blacksmith-cum-daredevil (Varun Dhawan). No prizes for guessing what happens to some of these characters because Varman seems confused with writer Shibani Bathija's story as he weaves and explores the relationships between these characters with an unusual degree of unpreparedness. In a way, it surprised me that there is some uncomfortable storytelling happening here, sampling characters that are not too far from realism. But then come the hidden messages and twists that rob the fun out of this drama that is only good at displaying its grand budgetary wealth.\n\nTrying to make sense of the plot and why the characters do what they do, especially in the second act, is what turns Kalank into a tedious affair. Its transition from a romantic drama, struggling to disseminate the sounds of the aching hearts of its characters, into a retelling of the disastrous butchering of the Indian state, with communal rioting as the highlight, further dislodges the film's construction. There is no closure between these transitions and characters seem to act without preamble to keep their audience guessing, which becomes tiring for them especially after having witnessed heavy sequences of singing and dancing that are visually extravagant yet sometimes detached from the plot. There is also a dance sequence involving Dixit in the second half which I think was made solely for the purpose of highlighting the actor's dancing chops and nothing more. And to make it classic Bollywood, Kalank also has an item dance towards the end, which just adds into the many reasons for a lot of people to skip the rest of the film.\n\nHowever, Kalank does stand high in departments that would see it win come awards season: the dialogues, the production setup, and the costumes. It is evident, if it was not already from the marketing, that Kalank has put all the resources into making its characters look like advanced versions of the people living in that period. If you like looking at attractive people wearing glitzy ornaments and threads, Kalank will be more than worth the money you spend on the ticket. Add to that the lavish production design, which makes me want to go back in time despite the circumstances, and the film manages to attract and entertain the doe-eyed viewer who is in the hall to take in the grandeur and nothing else. Unfortunately, all this display does stand out like a sore thumb. Not that I am a historian, but I strongly believe there have been anachronistic slips in these exotic, ethnic costumes worn by the characters throughout the film, even as they jump and dance in background adorned by some good CGI that couldn't really be extended to scenes where it was needed the most. The film is also terribly too long, which gives me ample reasons to complain about.\n\nThe chemistry between the characters is surprisingly effervescent, largely because of the heavy, shiny dialogues written by Hussain Dalal. There is a lot of philosophical talk in here, that might enthuse some people in the audience, but then again it is overkill when characters speak beyond their assumed intellect level. Everyone in Kalank tries to set a precedent and that is probably its biggest issue.\n\nThe cast performances are tried at best. Kunal Khemu, thanks to his well-written character, stands out as he plays an acquaintance to Dhawan's. Bhatt is sweet-looking yet fumbles a little towards the end to maintain her character that is made up of multiple layers. The shuffling between her fierce and submissive traits is lost both because of Varman's direction and Bhatt's unenthusiastic air, which she shares with Sanjay Dutt (who 100% does not want to belong here). I am not impressed by Kapoor's performance either as he fails to move multiple muscles of his face on a single try. His interactions with Sinha's character are ridiculously inorganic, almost making me head for the exit. But Sinha manages to keep the decorum of these scenes as she struggles to play a woman affected by cancer. Dhawan has the meatiest role in Kalank and his efforts (read chiseled body) are very clear both when he courageously gets into a ring with a bull to play a harmless matador and seduces every woman in the locality including Kiara Advani's laughable character. Dixit has this much screen space.\n\nThere are plenty of things wrong with Kalank, starting from the tepid writing to a lack of clarity in the proceedings. As mentioned before, all of its characters want to come first in this race conducted by Varman who forgot to add soul into this beautiful-looking, tasteless recipe. It is ambitious yet uninspiring, grand yet hollow, and unworthy of your attention save for a view or two of its dance sequences. TN.\n\nOriginally appeared in the Little India Directory (Singapore)."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "ketgup83",
        "review_rating": "2",
        "review_title": "Kalank is a perfect medicine to make you fall asleep",
        "review_detailed_main": "Never understood till now that if the makers of a film are willing to spend humongous amount on the production values including grandiose sets, expensive costumes and locations, why can they can't spent more time and effort on the content of the film. I am going to write a story on a fantasy world which can be used to put you in a sleeping mode.\n\nSet in 1944, Kalank tells the story of a blaclsmith, Zafar ( Varun Dhawan) who wants to avenge the rejection by his father, Balraj Chaudhary (Sanjay Dutt), by marrying Roop (#AliaBhatt), second wife to Balraj's legal son, Dev (Aditya Roy Kapur). Inspite of his mother, Bahar Begum (Madhuri Dixit), not supporting him, Zafar hatches the plan.\n\nDirected by Abhishek Verman, who made the disappointing 2 States, Kalank is even worst than that. The film opens with some colorful song (will remind you of the opening sequence of Aishwarya Rai from Hum Dil De Chuke Sanam) and then slowly each characters comes into the picture. You can only breathe for first 30 mins and then the suffocation begins. Believe me, even if you walk out of theater or scroll through social media on your mobile, you will not miss anything as the film hardly moves. The story is similar to any melodrama you watch on TV and the screenplay (also written by Verman) is traumatic. There is Gladiator like battle scene between Varun Dhawan and a raging bull a poor CGI and horrible action scenes. The story by Shibani Bathija is as confusing as the plot while the editing is poor with film length touching 169 minutes long. Music is passable with \"Pardesia\" being pick from a lot.\n\nThe silver lining is the visual appeal the film carries. Sets are indeed gorgeous and full marks should be given to Binod Pradhan. I liked the climax scene which was shot at the background of the Partition riots. The performances by the actors have been fine, especially Varun Dhawan who emotes through his eye brilliantly. Alia Bhatt does well but gets limited due to lack of strong character. Aditya Roy Kapur is good while Madhuri Dixit, Sanjay Dutt and Sonkashi Sinha does not get much scope.\n\nOn the whole, Kalank is a perfect medicine to make you fall asleep."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "rishikaishrajput",
        "review_rating": "1",
        "review_title": "BBB",
        "review_detailed_main": "Big budget Big banner Bakwas Movie\n\nToo slow and unrealistic story. Waste of.Money"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "emeraldlucky",
        "review_rating": "2",
        "review_title": "Boring movie",
        "review_detailed_main": "With the star cast, one would expect the 'Kalank' will be an amazing movie with a great story.\n\nUnfortunately, the movie fails to tell a new story to the audience. The star cast fails to portray their characters which is boring. Alia Bhatt's and Varun Dhawan's character fails to make an impact on the movie. But the movie is visually appealing. The clothes, the background (the set) and music are amazing.\n\nBut if someone wanted to watch a good movie with something different don't watch 'Kalank'"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "farazdiana",
        "review_rating": "1",
        "review_title": "Karan johars kalank for real",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "agasi999",
        "review_rating": "7",
        "review_title": "Not half as bad - A good one time watch",
        "review_detailed_main": "In short - It's a one time watch especially for the visuals which is mesmerising. The story doesn't engage you emotionally but don't think I was bored watching it. Ignore the bad reviews, keep in mind it's a glossy musical and watch it for what it is."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "anilchalamasetty",
        "review_rating": "2",
        "review_title": "Not entertaining: Waste of time to watch",
        "review_detailed_main": "Lead roles are weak in action. Shahrukh Khan and Kareena Kapoor might have pored life to the roles."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "nolatrader",
        "review_rating": "8",
        "review_title": "Not as bad as some of you have written",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "anandjeys",
        "review_rating": "6",
        "review_title": "Old stuff! Nothing New!",
        "review_detailed_main": "Well. All actors were good looking. No big story. Twists were not twisting enough. Everything was point blank. No suspense. Except Aditya, everybody looked negative. Climax was dreamy. Songs were the only salvation. Mostly boring. Liked here and there. Aditya Roy Kapur deserves better."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "nagbhushan-88059",
        "review_rating": "1",
        "review_title": "Please don't go by recent reviews",
        "review_detailed_main": "If you have lots of time waste and its been a while that your brain didn't secret stress harmones, please watch it. Highly pathetic and non-sense stuff is stuffed in every scene. The story sucks to the core. Why there are no ZEROES in rating system?"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "rimaasm",
        "review_rating": "1",
        "review_title": "Dud!",
        "review_detailed_main": "No story. No script. No rhyme or reason. The only things to look forward to are Aditya Sonakshi and the sets(which did nothing for a real timeline being portrayed in the movie). Someone's eyebrows are getting bushier with acting skills getting reduced to memorising lines and merely saying it, Aliya Bhatt by far was one of the most out of place awkward casting. Madhuri Dixit, mam, with all due respect don't wanna spell it out but was redundant. Varun Dhawan is definitely a versatile actor but I despised him. And the things not mentioned are not worth mentioning as I'm angry to have wasted my time and money already."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "gautushah",
        "review_rating": "1",
        "review_title": "Shockingly disappointing",
        "review_detailed_main": "What was this movie all about? Pathetic script, pathetic direction, pathetic locations. All good talents sheerly wasted. Every scene has exaggeration. Every scene looks so artificial. Very very disappointing"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "karanall-82506",
        "review_rating": "1",
        "review_title": "To worst movie.. totally waste of time.. Don't Ever think to watch",
        "review_detailed_main": "Worst.. Worst... Worst.. The people who are saying it gud are too worst. They are that not knowing anything and self jugded people who gets shocked by big plot.. and flat by big stars.. These high rating giving peoples are those who likes any movie without any cause. Totally pathetic movie with no sense. No story. No people rythm just waste of time."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "esharma-66783",
        "review_rating": "1",
        "review_title": "DISASTER!!!!",
        "review_detailed_main": "Please don't waste your time on this pathetic garbage of cinema. Bad acting of ALIA and Varun. Finally people will see how bad they are."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "shougalawadi",
        "review_rating": "1",
        "review_title": "Wanna fall asleep?",
        "review_detailed_main": "One word to sum this whole experience... BORING. Wanted to fast forward to the end to know what will happen and when I reached the ending, I did regret watching the movie from the beginning."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "gurukiwadali",
        "review_rating": "6",
        "review_title": "A watchable entertaining film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "shivanisharma-95643",
        "review_rating": "3",
        "review_title": "Story with no essence",
        "review_detailed_main": "No story line ....... But a big star cast and huge sets does not make a movie. Why cant some people in Bollywood get this, gone are the days when people went to watch movies for star power. This movie is not for intelligent cine goers . Just keep your brain at rest and prepare for the mindless ride."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "vivekchaudhari-66007",
        "review_rating": "9",
        "review_title": "A Must watch movie",
        "review_detailed_main": "Must watch movie unless u want just entertainment and comedy in movies. Kalank is the multi-starrer big hit with a huge potential starcast, story line and great dialogues which makes u stick to to movie"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "parasbali-48278",
        "review_rating": "7",
        "review_title": "Good film",
        "review_detailed_main": "Acting was good of all actors; sets were good; songs were good all was going well but according to me the root cause of problem was Roop she should have been killed"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "gokul0801",
        "review_rating": "3",
        "review_title": "Borefest... Dont waste your time",
        "review_detailed_main": "The bad reviews have it right and the box office verdict was a flop. This is one long movie, with a razor thin storyline, all style and no substance. Even with fast forwarding on amazon prime, it felt like it was never ending. The climax scene at the train station dragged on an on (also a copy of the climax from DDLJ). It was somewhat interesting till the half way mark and then it completely fell apart with unnecessarily painful dialogues and long song and dance sequences. Varun, Aditya, Sonakshi were ok, with the material they were given. Alia bhatt still cant act nor does she have the personality to carry a role like this. Madhuri repeating the same dance and acting from her Devdas days, just tiresome."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "shreshthmay",
        "review_rating": "5",
        "review_title": "Not as bad , Not as good",
        "review_detailed_main": "The story could have been great if they didn't add the bollywood drama in it , VFX are really poor and it looks like a fake movie , the cast was just not fit for these roles , too many songs, none of them were pleasing to hear or relevant to the story The dialogues are great though and even writing is good but the Direction, set management and VFX are so bad, there were many shots which could have been taken for real but they used VFX , which were clearly noticeble and looked cheep , I should add Aditya Roy Kapoor has done a great job and has fit the role perfectly, even alia seemed good too.\n\nIt's worth a watch but don't set your expectations, view it from your eyes and experience it for yourself!\n\nFor good VFX and realistic plot , do watch The pianist(2002), you'll understand what I'm talking about."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "fahadsfurniturewala",
        "review_rating": "1",
        "review_title": "Kya bavasir banaye ho",
        "review_detailed_main": "10/10 if it's a comedy movie. Rolled over laughing at the stupidity"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "dassmi",
        "review_rating": "5",
        "review_title": "Not bad, not good enough",
        "review_detailed_main": "Well, honestly the movie was not as bad as I had expected after the reviews. It's has got some decent acting by Varun, Aditya & Alia. Few of the emotional scenes were done well. It could have been a good movie but the point is the film got bogged down by its ambition to become this classic epic tragic period love saga. There is not enough depth in the romantic track between Alia and Varun for you to feel for them. Screenplay is a confused mess, no solid plot. Good actors like Madhuri, Sonakshi & Sanjay Dutt are wasted. Idiotic bull fight and useless item numbers and unwanted scenes make the movie slow and dragging. There is no humour and the mood is always like a tragedy being played out. It's like a wannabe SLB movie gone all wrong. Obviously no one would want to waste their time and money over this. So understandably the movie flopped big time.\n\nNow that the movie is on Amazon Prime, watch it if you have the time and patience to go through it."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "fahmid-05104",
        "review_rating": "5",
        "review_title": "Wasted resources",
        "review_detailed_main": "The movie is all over the place with way to many unrealistic incidents... It was great visual treat but nothing was in place... The songs, sets and acting were excellent yet I can't rate higher than this"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "s-akshen",
        "review_rating": "1",
        "review_title": "Horrible movie. Please do not die watching it.",
        "review_detailed_main": "As usual a multi-starrer flop. Horrible story line, idiotic romance concepts. You'll probably die of boredom."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "diyaurbaatihum",
        "review_rating": "6",
        "review_title": "A good attempt",
        "review_detailed_main": "One of the main reasons I went to watch this film is because it has an amazing cast such as Madhuri Dixit , Sanjay Dutt , Varun Dhawan , Alia Bhatt , Aditya Roy Kapur and Sonakshi Sinha. Despite having such an amazing cast it failed to meet my expectations. If I would have to talk about the music I would say that most of the songs were really good. Remo d souza done a really good job at choreographing the songs. The film at the beginning is extremely boring. I honestly think I slept through the first 35 minutes of the film. I think what would have changed the experience for me is if Sanjay Leela Bhansari directed the film. There were some scenes in the film which was stupid to add. Overall , I think the story line could have been a lot more better."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "mayursalunke-28393",
        "review_rating": "1",
        "review_title": "Worst movie of the year",
        "review_detailed_main": "One of the worst movie. How come producer and director have rights to change the Indian history. I don't want to say anything but I must say I saw one of the worst movie in my life."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "vaibhavsiitkgp",
        "review_rating": "10",
        "review_title": "Great drama",
        "review_detailed_main": "Just go there to watch the amazing acting of all the characters with madhuri and Sanjay dutt back after decades together in a movie. Great to see Varun dhawan maturing as an actor. Do not expect a great story, but enjoy the crispness of each scene and also some great sets. Movie can be slow in the first half but revives itself in the second half. Definitely not a movie for the masses but a no miss for acting/sets enthusiasts."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "noonoonomore",
        "review_rating": "7",
        "review_title": "why this much hate??",
        "review_detailed_main": "I really don't know the reason behind people's hostility towards Alia, she's gorgeous, she can act (Highway, Raazi, Udtaa Punjab) and can compete with the actresses from the past generation like Deepika, so who cares if her dad's a director? People use the word nepotist for only a small group of such actors including Alia, even though everyone knows Deepika's dad was a famous badminton player so don't tell me he didn't pull some strings for the future of his daughter!!! As for this movie it was beautiful, the pace was slow, but the cinematography and acting were great. Don't listen to people who hate such a great movie because they hate Alia (or other actors) for no apparent reasons."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "sanjit_pandit2002",
        "review_rating": "3",
        "review_title": "Same old story",
        "review_detailed_main": "The setup, actors , all are beautifully presented by the camera and people who brought the set into life. But... the story is same as Bhansali use to put. New is expected."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "singhsonal-55629",
        "review_rating": "1",
        "review_title": "Chhadhi chhape actor and dumbest actress",
        "review_detailed_main": "Actor best suited in advertisement of chhadhi............ Actress is so dumb she doesn't know who her father is........ They are headache..... Nothing else.... Avoid them to be happy."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "riddhimaakaritu",
        "review_rating": "1",
        "review_title": "Most cliche story.",
        "review_detailed_main": "Apart from beautiful set there is nothing to appreciate. It tries to create epic scenes but fails at every attempt. There are no good moments. Dialogues feel like 'dialogues' only. Not able to create any attachment to any character. Songs are also underwhelming. Even the morals it tries to propagate are flawed."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "vshlmr",
        "review_rating": "1",
        "review_title": "Worst Movie of Decade",
        "review_detailed_main": "Depressing story, screenplay, Direction. Dead face sonakshi sinha, over acting varun dhavan. Pathetic and Irritating Movie. It's a torture"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "Abhishek_Chaudhari",
        "review_rating": "3",
        "review_title": "Visual Appeal",
        "review_detailed_main": "The movie has a huge cast but the story was stretched. Amazing visuals and good song but 2nd half could have made quicker. Great value for costume and production design."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "pujanano",
        "review_rating": "1",
        "review_title": "Disgusting movie due to acting of Alia bhat and Varun Sawal did terrible acting and there is no logic Tittle kalank also match with the movie, It's suit.",
        "review_detailed_main": "Acting was terrible and illogical movie. Actors did a terrible acting especially Varun Dhawal and Alia bat."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "goelshipra1",
        "review_rating": "7",
        "review_title": "Did I watch a different version than everyone else??",
        "review_detailed_main": "I'm baffled by the ratings on here for this movie. I mean Bollywood constantly produces sub standard classless movies with 0 acting, direction or dialogues and they still get by just because of a lucky release date close to a festival. And this unfortunate MASTERPIECE that probably bombed at the box office because of a few flaws here and there like its length, ott setting and an unhappy ending gets only hate from people? Pathetic!! This movie setup, costumes, dialogues, acting were all breathtaking even if story not so great or new. It tugged on my heartstrings in some places (varun's charactr."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "seorashmi",
        "review_rating": "3",
        "review_title": "Kehna kya chaahtey ho????",
        "review_detailed_main": "If only fine actors and lavish sets could make a movie work, this one would have been a blockbuster. The confused story line moves at a snail's pace. How many times is one to admire Alia Bhatt's innocent smile or Varun Dhawan's fire-in-my-eyes expression? Doesn't a movie need something beyond those? The costumes are lovely. The dialogues are reminiscent of the good old times when Urdu and Hindi were spoken; yet, not one of them delivers a punch. It was a delight to see Kunal Khemu after so long. He does justice to his role. Unfortunately the same can't be said about the script which does no justice to his character. The computer graphics in the bull scene lacked finesse - Bahubali 2 had a realistic bull scene, though it was made two years ago. The music was pretty forgettable. All in all, a wasted expense - of your time and of the multi-star cast ."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "maggieamin",
        "review_rating": "9",
        "review_title": "Must watch!",
        "review_detailed_main": "What a great performance by Alia Bhatt!! Just can't take off ur eyes from this girl. Varun has also given one of his best performance.. with his first class entry.. and a classy love story.. I feel it is a must watch.. a beautiful chemistry between alia and Varun as Roop and Zafar.. do watch the movie"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "dhruv-shah61",
        "review_rating": "6",
        "review_title": "One time watch",
        "review_detailed_main": "Slow movie ... But great sets, costumes and good dialogues."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "bhatnagar-abhishek",
        "review_rating": "2",
        "review_title": "Kalank",
        "review_detailed_main": "Movie is Kalank on Bollywood. Avoid it. Very bad direction and songs."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "shumailzafar",
        "review_rating": "2",
        "review_title": "Bad",
        "review_detailed_main": "Flop movie.Directors need to know that a good movie needs good script not good sets...movie is way to long and plot is confusing between the love story and devide rule."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "arunpaul_",
        "review_rating": "5",
        "review_title": "Boring",
        "review_detailed_main": "Such a boring film. It took 3 days to completely watch this movie. Unnecessary songs made this a worst one. There were a lot of shots which was not necessary at all. Was it a romantic film ? I didn't felt that romance in it. This is not 'mohabbat' , this is absolutely a 'kalank'."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "farhanfaheem-49509",
        "review_rating": "5",
        "review_title": "Screenplay and Direction - worst",
        "review_detailed_main": "Story is good if screenplay was better then it will be successful movie. Only aditya roy kapoor and sonakshi acted well otherwise varun is like comedian."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "WasiReviews",
        "review_rating": "",
        "review_title": "Napoleon Would be Proud of the Nepotist Cast",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "rishabhnagoriam",
        "review_rating": "5",
        "review_title": "Slow-Bad storyline-Worst editing-Good cinematography-brilliant acting",
        "review_detailed_main": "Kalank is a one-time watch film which is slow and you need to have patience to survive through this film.I am amazed by the cinematography and brilliant sets.Actors did very well.Kunal Khemu made a beautiful impact in the film. If you want to watch something usual in Bollywood but a big star cast and high budget this film is okayy."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "xscenex",
        "review_rating": "1",
        "review_title": "WANNABE SANJAY LEELA BHANSALI",
        "review_detailed_main": "Dharma the Star kids launcher, just like NASA launches rockets.. karan johar.. Hes fond of making big budget crap / high society movies, like student of the year.. that was somewhat tolerated because it was a youth film, but here for a serious script and story Dharma can never ever match the grandeur of Sanjay leela bhansali films.\n\nWell Money and vast sets and props cannot ever make a good art necessarily. One can make an oscar winning film with a mobile phone camera. So putting in big money and starcast won't bring you money and applause back..\n\nAnd the biggest flaw i saw or heard in the movie is the Background music.. It was a worst imitation of Titanic..! The composer copied the notes and tried to imitate the same score, but it was Horrendous to hear.. Also the it was unnecessarily put into the movie here and there, overloaded when it was not required, some scenes are better quiet.. all n all the movie sucks."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "parasbali-48278",
        "review_rating": "7",
        "review_title": "In film Roop should have been be killed",
        "review_detailed_main": "Good film but in this root cause of trouble is Roop she should have been killed. She want ladoo in both of her hands in actual she is greedy lady want a rich husband and casanova boyfriend."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "sudeepbiswas-05495",
        "review_rating": "1",
        "review_title": "TOTALLY GARBAGE",
        "review_detailed_main": "If you love your money, time, brain. Please Don't watch this garbage."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "bollywoodking987",
        "review_rating": "10",
        "review_title": "Don't listen to the hateful reviews",
        "review_detailed_main": "The movie was so interesting and like definitely worth the watch. The whole cast was amazing and proper acting. It was kind of slow and the ending pissed me off but it's okay definitely worth the watch"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "akriti-79113",
        "review_rating": "6",
        "review_title": "Just a one time watch!",
        "review_detailed_main": "Flamboyant sets and fancy costumes only Alia Bhatt n varun have only justified their role by acting. Rest everyone is just present in movie. It's Rightly said in movie \"kuch rishto ko nibhana ni chukana pdta hai\", that shows finding love is the core value of any relation and if not achieved, you try finding love outside it. One time watch"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "tulikachatterjee",
        "review_rating": "1",
        "review_title": "Can I give 0.1/10?",
        "review_detailed_main": "No soul, no story... average performance. Thumbs down...double 👎🏻"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "hariblack-59927",
        "review_rating": "1",
        "review_title": "Painfully boring",
        "review_detailed_main": "The movie is slow and very dry. The most painful 3 hours I had to spend in a theatre. Very very boring. Skip this one."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "apurbamondal-52391",
        "review_rating": "1",
        "review_title": "Really Bollywood",
        "review_detailed_main": "Nowadays karan produces film only to earn money and to promote nepotism ..logicless same old theory .i wish i could avoid it"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "chshewatabh-51268",
        "review_rating": "1",
        "review_title": "A 3hr long jewellery advertisement.",
        "review_detailed_main": "Character development - zero Plot - zero Acting - Barring Alia, zero. Director - Since there's hardly any story, what's the point. Predictability - The trailer shows it all. Nothing much left to know. It's just another disaster."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "surajthefighter",
        "review_rating": "1",
        "review_title": "Refundddddd",
        "review_detailed_main": "I want refundddd of my money better to save and watch Netflix.."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "harsh-73-846569",
        "review_rating": "1",
        "review_title": "A Very boring movie, should have skipped",
        "review_detailed_main": "Boring, Boring Boring, I want my money back, Varun Dhawan superlatively boring, so is Sonakshi, like 60s melodrama"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "IPyaarCinema",
        "review_rating": "7",
        "review_title": "Why so hateful Comments",
        "review_detailed_main": "Only Haters give 1 nd 2 star ratings, movie was good, all actors performed well. Yeah Starting 30 min of movie was slow"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "vineeta-pillai",
        "review_rating": "1",
        "review_title": "Braindead and mindnumbing",
        "review_detailed_main": "Bad, awful, ridiculous!\n\nWhat were the makers of *Kalank* thinking ? From colour coordinated rioters, to colour coordinated dushehra , from fake giant lotuses , to wooden faces of Alia and Aditya , from a dozen men dressed like blue Ram doing an arial act and about 50 men dressed like monkeys for dushehra to a mujra to celebrate ID! No semblance of history, no semblance of geography , and they even have the weather all wrong . And the locales move from desert to snow capped Himalaya to a Ladakh type place to a horrendous set supposed to look like the bazaars of Lahore . The lead actors sit in a fake car and fake horse carriage where they have zero body movements , and everyone is always colour coordinated.\n\nVarun Dhawan is a man who makes swords for a living in Lahore who suddenly becomes a matador in a gladiator type scene. Yes, the bull is fake too.\n\nAlia is a village belle in Ghaghra choli in one scene who is suddenly wearing shararas after she gets married and is a \"highly educated woman \" in another scene.\n\nMadhuri sleepwalks in her scenes like she's waiting for the director to say \"cut\"\n\nAditya looks like a wooden doll with facial hair and no expressions.\n\nAchint Kaur is a woman who nobody knows who she is but she is the only one who knows what's happening in everyone's lives , alas she is killed.\n\nSonakshi seems happy to be bumped off midway during the film, at least her character is spared the insanity.\n\nAnd the Madhuri Alia duet has the same playback singer singing for both ... and Madhuri saying \"timhare awaz mein namak ki kami hai\"\n\nVarun and Aditya's lakeside scene looks like the ghats of Ujjain or Banaras where the two men discuss how many women they have slept with . Ughhhhh\n\nAnd the movie ends with the ghosts of Sonakshi and Madhuri miraculously appearing like Banquo's ghost, only these two ghosts wear white designer shararas.\n\nI want to know what the filmmaker Abhishek Varman was smoking during making this film.\n\n#beyondbizarre"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "aarikto",
        "review_rating": "10",
        "review_title": "Slow but amazing",
        "review_detailed_main": "Though the film is slow. Still I loved it,decent performance from the star cast,specially varun,aditya nailed it."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "surendraguptamail",
        "review_rating": "7",
        "review_title": "One time watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "amanbidhan",
        "review_rating": "1",
        "review_title": "Fear from God",
        "review_detailed_main": "Ye sab milke pagal bna rahe h hume bhopdiwale 😡. I want my money back. Worst picture of Varun Dhawan. If I had option to give 0 rating,I would have rated it without hesitation."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "ashishmanekar-58204",
        "review_rating": "1",
        "review_title": "Waste of money and time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "sarangdeshpande",
        "review_rating": "1",
        "review_title": "Casteism....",
        "review_detailed_main": "One star only for cast taken.... Those who love Mugleaazam can bear this movie but also not for long time... Dialogue writing is too old not for today's trendzzzz...."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "ankushvermaggc",
        "review_rating": "1",
        "review_title": "KALANK OF THE YEAR",
        "review_detailed_main": "Movie 3rd class hai, baaki sab 1st class hai, KALANK nhi ye mahakalank h Bollywood ka😂😂"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "vik_rant07",
        "review_rating": "1",
        "review_title": "Worst movie I have ever seen!",
        "review_detailed_main": "Worst story telling, screenplay! Only chaos and mess without knowing the purpose of the story or where it is heading to.Extremely slow paced. 1 star only because of Alia."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "ammarmunir-24374",
        "review_rating": "1",
        "review_title": "Varun is overrated nepotism star",
        "review_detailed_main": "This is film same of his name...undoubtedly it's kalank on Bollywood films"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "wfazal9",
        "review_rating": "7",
        "review_title": "beautiful",
        "review_detailed_main": "Cant fault the varun alia combo.. its a hit maker... dont read the negative reviews.. they have there obvious reasons lol my only negative point is not enough screen time for aditya roy or sanjay aka baba.."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "anoopshuklasgi",
        "review_rating": "1",
        "review_title": "Waste of time ... And money",
        "review_detailed_main": "Don't have word for saying that its nit a movie its a joke in the name of movie"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "stardust1394",
        "review_rating": "10",
        "review_title": "Beautiful love story",
        "review_detailed_main": "This movie was beautifully written and and the actors were phenomenal. It's the kind of movie that you get lost in, feeling like you are one of the characters, and forgetting that you're in a movie theatre. I don't understand the negative reviews, maybe because it's over a controversial topic. I definitely didn't see the ending coming but I loved this movie and will see it again soon. The clothes were amazing and so was the music and choreography"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "anshumania",
        "review_rating": "7",
        "review_title": "Visual treats make it worth a watch",
        "review_detailed_main": "The movie is set at scale, visually and aesthetically magnificient scale. Kudos to all those involved in some real breathtaking visual pieces tied together with decent background music ( not the usual kj nonsense). The mlvie did have its dose of the usual kj nonsense though, the wierdish gladioric bull scene and the ddlj train just had to be there. Apart from that the performances from the leads were pretty good. The story could have done with a bit better storyline ( there isnt much new there) but oh boy the visuals are awesome !"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "nitin_raj1989",
        "review_rating": "1",
        "review_title": "Not even good to take the star",
        "review_detailed_main": "Not good movie to take star even one. Movie is another big failure after bombay , karan johar.. Treat for eyes, grand sets. Leave your brain at home though as the story has no content. At no point I felt any connection to the plot. 100% missable."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "soma-98013",
        "review_rating": "1",
        "review_title": "Worst movie....",
        "review_detailed_main": "Bollywood is producing some of the worst movies of all times.... Recent is KALANK... This movie trying to portray wrong history and to promote non sensible idealogies. It's a utter waste of money. It's a KALANK in the name of movie. Please do not waste your money on this KALANK."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "akshayscreambiscuit",
        "review_rating": "1",
        "review_title": "I was playing ludo during film.",
        "review_detailed_main": "My ludo game was more interesting then the movie........."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "greeneyes-4242",
        "review_rating": "5",
        "review_title": "What to say",
        "review_detailed_main": "Not good and not bad, little boring, kind of disappointed at the end"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "kashifmehmood-27311",
        "review_rating": "1",
        "review_title": "Very poor story and acting",
        "review_detailed_main": "Very poor screen play. Acting is even worst. Movie promote just hate. Movie deserve 0 rating"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "heartplucker",
        "review_rating": "1",
        "review_title": "The Worst Directed Movie with Such a big Budget",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "tejaswinikarki",
        "review_rating": "",
        "review_title": "One of the best movie of Bollywood!! Loved it😍",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "smaitri-75651",
        "review_rating": "6",
        "review_title": "Nice",
        "review_detailed_main": "One time watch movie. Songs, set and costumes are great. And acting is top-notch by every actor especially aditya roy kapoor."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "rdaks-51699",
        "review_rating": "5",
        "review_title": "Talent Wasted",
        "review_detailed_main": "The Film Is Too Slow Paced... Lots of unwanted songs... Due to which movie never makes a connect... Powerful Performances by everyone... But the most powerful performance was by Aditya Roy Kapoor as Dev... His Expressions n eyes n body language speaks it all... Its visually stunning film of 2019 coz of its grand sets, costumes... If you love drama you may watch it once... 5/10 for kalank"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "shivamkumarsh",
        "review_rating": "10",
        "review_title": "Superb movie",
        "review_detailed_main": "Superb movie when I watch this movie in theatre when tears in my eyes."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "mannuskyhigh",
        "review_rating": "6",
        "review_title": "Good performances alone can't salvage a film",
        "review_detailed_main": "Watched it in theaters finally and it's not as BAD as it is made out to be. Surely, the minuses for me are the same - length, hardly any story, only costume designs and huge sets on display. The film's mediocre considering the budget however, what saves the film to a major extent are the performances. I'm no Varun Dhawan fan but would still say he has done a nice job. He has intensity in his eyes and revenge on his mind. His character has layers but they all crumble in the second half. Alia looks beautiful, but here she is not Impressive as her role does not allow her to show histrionics. It's all there but doesn't come out totally. Aditya Roy Kapur is fine but his character runs on one single narrative. Sanjay Dutt, despite a short role looks convincing in his part but he doesn't have much to do. You could expect the makers to show his weakness, motivations, guiltyness but that doesn't happen. He's a talented actor and they wasted it totally. Ditto for Madhuri Dixit, its a pleasure to see her onscreen and her character has a lot in herself like pain and anguish but again, it's all inside..nothing surfaces on the screen which is why you feel cheated and disappointed.\n\nBut the biggest problem in this film is lack of Romance. Varun's character has been shown a casanova but once he falls in love there's hardly any romance. It does blossom but does not reach a conclusion. The same story we might have witnessed in so many movies earlier. The Audiences have become smarter and Impatient.\n\nAnyways the plusses of the film are music, some dramatic moments and the climax. Its a one time watch but you don't need to go to a theater and buy ticket for it. Can be enjoyed on digital. But it's a lesson for the filmmakers out there to not compromise with the content any longer"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "myvoice-07677",
        "review_rating": "2",
        "review_title": "Varun is a terrible actor with no stardom",
        "review_detailed_main": "Worse film with no real superstar to carry the movie ... varun is a kid he can not carry the film on his shoulder and its proven ... madhuri wasted and Sanju in guest apperance... disaster and waste or money."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "aniruddhawaghmare",
        "review_rating": "1",
        "review_title": "worst movie by karan johar again",
        "review_detailed_main": "This movie is the flopest bakwass third class movie i have ever seen don't waste your time watching this movie"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "sanjubabafan",
        "review_rating": "1",
        "review_title": "Full bakwaas movie",
        "review_detailed_main": "Itni bakwas movie ke time nhi kata isse achcha avenger chala jata 🤣 flop flop"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "yashzade",
        "review_rating": "4",
        "review_title": "Editors are \"Kalank\" for sure",
        "review_detailed_main": "Okay so here's a quick review of the movie.\n\nThis Movie is basically an old wine served in pair of glasses without ice in it.\n\nMovie is so big and slow that you keep yawning throughout the movie and just wait for it to end.\n\nThings that save this movie are Performances of Varun Dhawan, Alia Bhatt, Madhuri Dixit, Backgrounds, BGM and Music.\n\nI really feel bad for Sanjay Dutt because his portrayal of a father doesn't even adds magic to the movie but irritates us.\n\nAnd the editors of the movie have completely wasted a great opportunity for sure. The movie is almost a three hour movie. Do you wanna go and watch a movie that's three hour long and slow?\n\nDisappointed by the movie but loved the performance of Varun Dhawan, Alia Bhatt and Madhuri Dixit."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "heenad-85136",
        "review_rating": "1",
        "review_title": "Kalank of Bollywood",
        "review_detailed_main": "Another thugs of hindustan level film. Anti hindu propaganda. Shame on Karan Johar. Boring and non story line. Chutiya karan."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "abhishek12345",
        "review_rating": "1",
        "review_title": "Yet another flop by star kids",
        "review_detailed_main": "Worst movie of the millennium. These star kids need to learn acting first They think that public is fool. These star kids need to come out of their big daddy's pocket."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "heetvarma",
        "review_rating": "",
        "review_title": "-_-",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "shreyasmit",
        "review_rating": "6",
        "review_title": "Visually stunning but has very little heart",
        "review_detailed_main": "Roop, a young girl whose father owes a debt to Satya's father is asked to marry Satya's husband because she is suffering from cancer. The movie goes on to introduce other characters who form an integral part of the story but there is nothing tying the story together. The story moves in twenty different directions with the only common thing being the bond of love between different characters. Character development is poor and you don't understand most of their motivation as well as you should. Unnecessary songs just add to the woes of the audience. Sonakshi and Madhuri are the only ones who feel like they are playing their patts naturally. The rest of them even with their great acting/emoting skills fail to pack a punch when it comes to dialogur delivery. It feels like you are watching a school play at times. Kunal Khemu is the saviour in this mess with his natural portrayal. All in all, forward the songs and watch this movie for the visuals. The most bizarre and silly sequence is one that involves a bull fight. It adds nothing to the narrative and I couldn't understand why it was put in."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "heenad-85136",
        "review_rating": "1",
        "review_title": "Maha bakwas movie.Dont waste your money and time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "akshayaravi-56735",
        "review_rating": "10",
        "review_title": "A classic Bollywood movie after a long time",
        "review_detailed_main": "A movie which touch my soul Anyone who understand the movie couldn't control their tears at climax Electrifying chemistry of zafar and roop Varun and Alia nailed it Adi and sona carried away Madhuri mam and sanjay sir fan Cinematography next level Visual treat Kalank nahi ishq hai"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "thegamegkht",
        "review_rating": "7",
        "review_title": "True Labour Of Love.",
        "review_detailed_main": "Lets talk about first the performance of the cast which is really top notch and not even a missed opportunity to see what a magnificent story is being told.\n\nWhat the critics failed to see is that this movie is a well crafted and beautifully shot movie in its own right.\n\nI don't know how can anyone call this movie a \"soulless\" movie??\n\nThis movie is not just beautifully shot but it is really well crafted too.\n\nNot just the music but direction,plot and storyline is simple yet nuanced.\n\nThe only thing that this movie lacks might be the pacing and screen time which is lengthy of course.\n\nIt can be edited even more sharply because some scenes were not needed in this one.\n\nI bet if the editing was crisp the movie would have been a blockbuster at box office!!"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "aryasmriti",
        "review_rating": "5",
        "review_title": "A pure 50-50 movie",
        "review_detailed_main": "Well the graphics were excellent just like in bahubali but the story the way being portrait somehow misses the mark its awesome and not so awesome at the same time."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "mitrta",
        "review_rating": "1",
        "review_title": "Extreme Melodrama",
        "review_detailed_main": "I would have given this film negative stars had there been an option. Too melodramatic; that too in a weird & creepy manner."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "davindergrover",
        "review_rating": "2",
        "review_title": "It is a Kalank",
        "review_detailed_main": "The two stars are for the production desigbn, costumes, sets. Amazing. Each scene has a color theme matching with the background and mood. What an eye for perfection.\n\nI wish that was enough for a movie to succeed. The direction, story, logic, continuity, everything is sooooo horrible. It's lengthy, it's really really bad."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "sonigourav",
        "review_rating": "1",
        "review_title": "ALARMING SITUATION",
        "review_detailed_main": "Guys! Whoever is reading this is definitely a film lover, that's why you are here on IMDb. This means you love watching films and appreciate the human tendency to tell and listen to the stories which makes us able to feel emotions. So it becomes as important for us to watch good films as much it is to eat good and to live good life. This film should not be called a film. This is an act of fraud with people. This review is not about this particular film only but about the status of films those are being made by so called big film makers and banners of Bollywood. They are making disgusting films which should not be called films at the very first place. Today when we have option to see Hollywood, Netflix, Japanese, Irish, South Indian, Regional Indian films with great stories and approach, why do we need to see such soulless films which are nothing but a pain. Guys! Follow you instincts and start avoiding such nonsense, masala, films. They can never feed your soul. And please stop going to theatres for them. In fact go for those films which are not being able to get their money back just because we didn't watch them despite of having great stories and emotions in them. Until and unless you won't stop watching these films, until and unless you'll help these losers gaining back their money spent on useless scripts and teams, they will keep making such pathetic films and you'll keep getting suffered. As you chose your meal, your house, your leader by using brain, chose your films wisely."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "DaRaja01",
        "review_rating": "3",
        "review_title": "Anti Muslim film",
        "review_detailed_main": "Making the Muslims the bad guys as always. Bollywood sinks to new low."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "sharmaankur-78102",
        "review_rating": "1",
        "review_title": "Stupid plot, lazy writing and mundane drama",
        "review_detailed_main": "So because Sonakshi Sinha was dying in movie she thought of making the life of everyone around her miserable by forcing some girl to marry her husband, where no one but the person with least stake ( dying Sonakshi Sinha) wanted it. What a crappy plot. And besides a beautiful set there is nothing much to watch in the movie. You will desperately wait for this boring drama to finish whole of the time you are in theater. This movie is new low baseline for me.\n\nThe 2 stars are for the beautiful set used."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "ranjana_mehra",
        "review_rating": "7",
        "review_title": "Watch Kalank",
        "review_detailed_main": "This is a positive review of the 2019 movie Kalank. I don't know why this movie is being panned by people. It is a very watchable movie with some good hummable songs and images that stay with you. Kalank is a stylized love story set in the backdrop of the times leading to the partition of India. The sets are amazing, as are the Cirque du Soleil like stunts in the operatic style presentation of Ramayan and 'bullfighting' or Jallikattu. Sonakshi Sinha did not have much of a role, but she looks and acts stately. Aditya Roy Kapur looks handsome and acts well, in an understated way, well suited to his role. Kunal Khemu also does justice to his role. Madhuri Dixit, looks good, delivers her lines well, emotes even better. She shows that she should be given serious roles. Sanjay Dutt did not have much of a role, but he is all right. Alia Bhatt acts well, her eyes and emotions conveying the unfulfilled promise of her life, and looks pretty especially in the first song. Varun Dhawan is the one who surprises. He has evolved in this movie, his emotions as a romantic hero are credible. He looks right as a blacksmith with a muscular physique and tough mannerisms. He can evolve further into a crowd pulling heartthrob especially in the hands of a good director like Abhishek Varman. Varun Dhawan, however, needs to work on his diction, his style of speaking, so it sounds cultured and pure and not like a person trying to say his lines in a hurry or in a street style. If he improves his diction, he can be one of the top heroes of the Indian film world. So why should one watch this movie which is being given a very poor rating across the forums? Watch it for its good opera like feel, its larger than life cinematography by Binod Pradhan, its costumes and camerawork. It is somewhat like Saawariya, but much better; it is also like Devdas, but lighter in its touch. Watch it for the choreography of its songs, songs by Pritam and Balhara team, not to forget Arijit Singh's singing, that hitch a ride with you and stake a space in your brain."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "creationsshubham",
        "review_rating": "1",
        "review_title": "Expensive long duration Crap!",
        "review_detailed_main": "This movie is slow af! And the tickets prices are hiked so much. Boring and predictable storyline. Similar 80s story of two sons, one legitimate and another illegitimate. Alia is playing role of a dumb but beautiful girl, similar to what she's playing in half of her films. Sonakshi's expressionless face is intolerable. Sanjay and Madhuri are given least Screen space! Also, SPECIAL MENTION to that Bullfight scene of Varun. The CGI of chhota Bheem level deserves an applause!"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "shyamgarg-48958",
        "review_rating": "10",
        "review_title": "Must Watch",
        "review_detailed_main": "A very good movie with great storyline, grand visuals and stunning Alia Bhatt"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "dhariasr",
        "review_rating": "7",
        "review_title": "Actually a really great story and movie",
        "review_detailed_main": "If you ignore the random songs, bad cgi, and some historical inaccuracy, Kalank is actually a very well written and acted movie. I was by far impressed by Aditya Roy Kapur's performance... maybe his best performance yet. Everyone acted wonderfully and the narrative was addictive. Plot twists when you didn't see them coming. Not sure why the movie got as much hate as it did. I never rate movies (this is my first) and I felt the need to rate it because it was indeed a good movie."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "utsavs",
        "review_rating": "1",
        "review_title": "Kj..uve lost it",
        "review_detailed_main": "Doesn't dharna know anymore what people want ?? They want stree, badla, etc. Engaging movies that make sense.\n\nThis one is soooo outdated it doesn't make sense. U watch the movie and u feel it's fake. Such a waste of money.\n\nI can't even tell u what happened finally, bcos I left the theatre after interval. And I have a high threshold for tolerating crap..I sat thru October !!"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "mayurgodase",
        "review_rating": "1",
        "review_title": "Really a Kalank",
        "review_detailed_main": "This film is really a Kalank on Bollywood. Sloppy work, dont waste your money for this crap."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "subhakanta",
        "review_rating": "1",
        "review_title": "Bad adaptation of Sanjay leela vanshali creation",
        "review_detailed_main": "Movie is boring, plot is not good. You'll leave the thaeter in interval only"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "AP_FORTYSEVEN",
        "review_rating": "3",
        "review_title": "Artificial Melodrama.",
        "review_detailed_main": "My Rating : 3/10\n\nVisually-rich, content-poor 'Kalank' is an unnecessary exercise in Sanjay Leela Bhansali-style of opulent cinema.\n\nThis is a bad, bad tribute to SLB's legacy of period drama films.\n\nNice visuals though, I'll give them that but no real depth is a real bummer."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "oazam",
        "review_rating": "4",
        "review_title": "The \"Kalank\" of watching this film will haunt the audience for a very long time",
        "review_detailed_main": "Yash Johar conceptualized an idea for a film in hopes of something new for Dharma Productions 15 years ago but due to his demise, this idea was pushed until 2019. Abhishek Varman who received fame for his debut film 2 States was roped to handle this conceptualized idea by implementing the direction and screenplay.\n\nAnticipating factors of Kalank 1) Multi-Starrer Seeing Madhuri Dixit & Sanjay Dutt back together after 3 decades 2) Alia-Varun's chemistry 3) Majestic feel\n\nHusnabad is a city that lies between Pakistan & India near Lahore which was set in 1945. The city is known for breeding blacksmiths who produce swords for a living and an influential family with a power known as the Chaudhury's which consist of Balraj who runs a newspaper business and his son Dev whose wife is dying and is told by her to marry Roop. Zafar is a Muslim blacksmith who falls for Roop and their chemistry and their stigma is what forms the story\n\nThere is a saying that \"all style and no substance\" and that is exactly what this film did. A film that had the chance to dodge that bullet but turned out to be a headshot. The screenplay was very inconsistent in terms of its predictability and just messing up the film with such high hopes and aspirations that the audience had for this film by the commonality of religious love with already predicting the outcome of it. The dialogues were very new and it didn't fit that historical culture.\n\nThe acting in this film was somewhat lackluster.\n\nVarun Dhawan's role as Zafar, a blacksmith with daring instincts wasn't that bad but he did overcomplicated while introducing his character during the 1st half of the film. The point where the action scenes started to emerge, that is when his role managed to do justice.\n\nAlia Bhatt's role as Roop, a middle class married to Dev and Zafar's love interest with the passion and endurance of dancing was boring and bland at the same time. Her role didn't have that energetic brilliance that we were expecting.\n\nSonakshi Sinha should seriously get a new acting agent and maybe better roles that fit because the dress she wrapped up in was a wrong fit and that's how I can describe her acting.\n\nAditya Roy Kapoor's roles are all about drinking and getting drunk \"beware\" and that is exactly what Dev did throughout\n\nSanjay Dutt's look was fantastic but his acting was too underwhelming and he was on standpoint throughout.\n\nMadhuri Dixit's role was like a repeat performance on how she acted in both Devdas and Dedh Ishqiya just dancing and little miss \"begum\".\n\nAesthetically it did have that wow factor in terms of its set design and somewhat there was that historical feel to cling onto even with the grainy screenplay.\n\nMusic was a headshot and seeing Pritam just messing up was just obliterating although Ghar More Pardesiyan is a good song.\n\nOverall, potentially wasted and too baseless beyond belief.\n\n2/5"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "pratyush2611",
        "review_rating": "1",
        "review_title": "Epidemic",
        "review_detailed_main": "Movie is very slow paced and full of songs. Actually it is a song compilation, which has lines in between those countless songs. I feel, I was extremely lucky enough to survive through 1st half of the movie. During the intermission, I had a choice either to leave the theater or suffer through another half of the movie. I think I've made the right choice to leave theater midway."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "aravindstvm",
        "review_rating": "6",
        "review_title": "One time watchable flick with grand songs and sets",
        "review_detailed_main": "A typical sanjay leela bansali movie with good story.Every character acted really well.Safar named character acted by Varun dhawan will remains sometimes even after the movie.The title track was really great.Each frames of the movie is like a painting very well picturised.Except the bull fight cg that was really awful.I surely don't know why this movie receives this much low rating.It deserve much better.Varun dhawan, Adithya roy , Alia bhat ,Sanjay dutt,Madhuri ,Kunal khemu all done their role best.Kiaras role can be avoided.Overal i give 6/10. Watchable flick."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "ranjanjktyr",
        "review_rating": "1",
        "review_title": "Disaster Written All Over",
        "review_detailed_main": "I was a Fan of Varun and Alia , And then came this Crap called Kalank.Why the Hell Dharma wasting Fox Studio Money on Movies like this ,Rather then spending on Marketing and Big Sets Get some good Writers and write some good Stories. It's a Big Bore"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "arhamrizwan",
        "review_rating": "10",
        "review_title": "Beautiful film!!",
        "review_detailed_main": "Guys it's a beautiful film with outstanding acting larger than life sets brilliant music which makes it a must watch.Don't go after these negative reviews this film is a must watch.It is easily a one time watch.Each shot is beautiful! The film has many twists that just engages u till the end.A brillant effort by Abhishek varman!The climax will surely surprise u.Just keeping the negative reviews aside Do watch it for once."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "kalaivanicuteheart",
        "review_rating": "7",
        "review_title": "Poignant love story",
        "review_detailed_main": "It's an absolute treat to the eyes. A beautiful historical drama that's absolutely worth watching. Acting by the leads was good. Go for it."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "shubhfalke",
        "review_rating": "1",
        "review_title": "Another movie from bollywood garbage",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "arogantankit",
        "review_rating": "1",
        "review_title": "Old and flop story",
        "review_detailed_main": "Just another superstar movie with a flop also old story"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "mohitu-78161",
        "review_rating": "1",
        "review_title": "Showing Love jihad in movie smartly",
        "review_detailed_main": "Bakwas movie only 1st song is good Don'tpay for it even a single rupee."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "wwwrajsangham",
        "review_rating": "1",
        "review_title": "waste of time and money",
        "review_detailed_main": "Just fill all the spices or soil in your eyes before watching the movie because that will be feel even better then watching these kind of movies which has poor acting skills slow storyline"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "sunnyshnkr",
        "review_rating": "1",
        "review_title": "As bad as thugs",
        "review_detailed_main": "Review-You don't need it.Dont watch it.Save your time and brain cells."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "aryanbhatia-33879",
        "review_rating": "1",
        "review_title": "Basically a boring version of Titanic",
        "review_detailed_main": "A bit too dragged for no good reason. They tried to include a lot of things but couldn't check even 1 box."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "ariantalvar",
        "review_rating": "7",
        "review_title": "Poor script",
        "review_detailed_main": "It is true that this film was weak in terms of script, but it is not the actor's fault, Varun Dehavan showed his best role in the role of Zafar and all the actors worked for this film. In my opinion, the only person who had the most influence in this film was Varun Davan. I have never seen such facial expressions in the Varun Dhawan. If Varun Dhawan was not in this movie, it would not be worth watching. I wish the script was written in such a way that two lovers would get together and Mr. Do Chaudhry would die and reach his late wife in that world. They made the appearance of friendship horrible and worthless. I did not understand all this hatred of Abdullah from Zafar. If he killed Dev Chaudhry, everything would be fine, and at that time I watched this movie ten times instead of once. It is true that the script had a problem at the root, but I am still happy that Varun Davan played in this film. Among his comedies, I liked the movie (I am your hero) the most. I wish we felt a change, at least in his comedy films. Like this movie"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "ajinkyagite",
        "review_rating": "1",
        "review_title": "Kalank",
        "review_detailed_main": "It is worst movie I don't want to say anything I just save you from disaster"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "najmaalmashjary",
        "review_rating": "10",
        "review_title": "Masterpiece",
        "review_detailed_main": "Ignore the negative reviews , this movie is a must watch. Good s riot snd great cinematography , so worth watching"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "mat-20548",
        "review_rating": "7",
        "review_title": "Classic Bollywood",
        "review_detailed_main": "I'm part of the group that doesn't understand the negativity towards this movie. I'm not Indian, but I've watched many many Indian films... Both Bollywood and other kinds. I really enjoyed this movie! It's a beautifully shot film, with great acting and a decent story. And any movie that has Madhuri Dixit in it is going to be good. If you like classic Bollywood, with great costumes, dancing, music, and a decent story, I think that you'll like this movie"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "atriraha",
        "review_rating": "1",
        "review_title": "Pathetic !",
        "review_detailed_main": "Guys, save your money for Avengers. This movie was utter disgust, with a very boring storyline, overly melodramatic acts. It's like you are watching big screen version of typical Ekta Kapoor's saas-bahu drama. I was so frustrated that I can't able to bear it till last and left the hall."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "manjit_prashar",
        "review_rating": "1",
        "review_title": "Wastage of time and money .",
        "review_detailed_main": "Still shocked wtf was that, watched Netflix at the end."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "sankhasahapc",
        "review_rating": "1",
        "review_title": "Worst Movie Ever.dont waste your money and time",
        "review_detailed_main": "Worst movie ever.I waste My Money and time. . .. .. . ."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "soniapawar7",
        "review_rating": "1",
        "review_title": "Utter Nonsense",
        "review_detailed_main": "This movie is a waste of time and money. Pathetic screenplay, dialogues just sound meaning less and emotionless. While watching the movie and listening to those dialogues you just want to say SHUT UP! In the first half an hour, camera movements gives you headache.\n\nnot every director can attempt periodic dramas, Karan Johar do not ever attempt something like this again its not your cup of tea!!"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "ranaankitt",
        "review_rating": "1",
        "review_title": "Don't waste your hard-earned money on this movie",
        "review_detailed_main": "If imdb had provided the option of giving 0 star rating i would have given it 0 star coz this movie here doesn't deserve to get 1 star..........some body in the comments section said truly.....it is literally a kalank in the history of indian cimema........."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "kkush-64945",
        "review_rating": "1",
        "review_title": "Kalank on screenplay & direction",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "gandhibrar",
        "review_rating": "7",
        "review_title": "Not that bad",
        "review_detailed_main": "I mean i dont know why ppl hate this movie it wasnt that bad. One time watchable"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "manthenarocks",
        "review_rating": "3",
        "review_title": "Love story on slow track",
        "review_detailed_main": "After so long...I felt a movie like that of a serial Very boring & slow.. But the movie does good with the production design & values. The movie looks very colorful & clean through out,the cinematography is really extraordinary so does the costumes."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "mukherjeesomadip",
        "review_rating": "9",
        "review_title": "Amazing one.. 😍",
        "review_detailed_main": "The dialouges, music, costume and set all these were amazing.. A bit lengthy.. But overall it was worth watching the movie.."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "knowallage",
        "review_rating": "7",
        "review_title": "Much more complex characters and emotions than you realise!",
        "review_detailed_main": "It's a different kind of movie so, Don't judge this movie by the ratings. This film is really UNDERRATED considering that many worst of the worst Bollywood movies have higher ratings on IMDB so, 3.5 is really low for a movie like this.\n\nIt is just the Bad acting by some actors and few editing mistakes, and yeah definitely the direction could have been better, it's a missed opportunity for a great memorable movie.\n\nThere is very thin line between what makes a movie great to watch and otherwise. Just a few mistakes can ruin a great movie, despite having Everything else excellent.\n\nThe story could have been more complicated, it was emotionally complex no doubt about that, very few movies achieve this level of complexity of emotions, but few good dialogues were not enough to redeem the shortness of this story in full duration of almost 3 hours.\n\nIt definitely gave us a nice visual treat with marvelous music, grand designs which really felt like a work of art.\n\nIt's a good movie nonetheless, 6.4 in my opinion, it had a potential of being 8.2 but missed.\n\nI absolutely love the meaning it conveys, that Kalank Mohabbat ko nahi, nafarat ko hona chahiye. (It should be HATERED that should bring DISGRACE and INFAMY not love!)"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "ani_mitm2005",
        "review_rating": "1",
        "review_title": "Tainted Stain on Cinema",
        "review_detailed_main": "Well the movie opens in 1940s. Big actors, huge budget, larger than life sets and by the time you realize there is no story in it you start wondering - Why was it allowed to release or why did the WWII bombs not fall on these dumb characters randomly dancing and crying. That could have saved a lot of lives. What remains by the time movie is finished, is your body strongly questioning your minds decision making ability and your soul searching dor another body to live in. And dare I call it Pathetic, because that word too has its dignity. Do yourself a favor, do not watch this KALANK on movies. But if you do, do not blame anyone, even the makers had warned us with its name - KALANK (which meaning taint / stain)"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "susheethkundar",
        "review_rating": "1",
        "review_title": "Worst movie",
        "review_detailed_main": "Worst movie ever.... Don't waste money on Kalank..."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "rajgaurav-05766",
        "review_rating": "1",
        "review_title": "Bakwaas",
        "review_detailed_main": "Waste of money n time. They have made this movie so that people can forget Zero and Race3, a tough competition to these movies.🤣😂"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "prabhatprashantranjan-67520",
        "review_rating": "1",
        "review_title": "bakwas movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "sharanhb",
        "review_rating": "1",
        "review_title": "Waste of money and time",
        "review_detailed_main": "I stayed hardly for an hour in the theatre couldnt get whats going on in the theatre so got out. One of the worser karan johar type movie"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "gunjandabral",
        "review_rating": "1",
        "review_title": "Ridiculous movie",
        "review_detailed_main": "Why did the producer spent so much money on such a stupid storyline..?"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "wkhan-48701",
        "review_rating": "7",
        "review_title": "Battle between different Ideologies",
        "review_detailed_main": "Very good cinematic experience. Don't listen to bad reviews this time."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "bithilabasher",
        "review_rating": "1",
        "review_title": "warning",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "Magow-Intermean",
        "review_rating": "8",
        "review_title": "KALANK REVIEW",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "purohitabhinav",
        "review_rating": "1",
        "review_title": "Worst acting",
        "review_detailed_main": "Large than life potray and no story. Worst acting. Aaaaakkk thu"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "ssapkota-13781",
        "review_rating": "3",
        "review_title": "Stretched",
        "review_detailed_main": "Waited this movie for long because of interesting star casts. Went theatre with full excitement, return back with a BIG DISAPPOINTMENT. Seriously, after the failure of Race 3, Thugs and Zero director and makers should have known that length must be below 2:20 min. Directors and Editors must know that they can't put all the things whatever they have shot. You need to edit and cut. If you can't do that then don't make movies. I guess Writer and Director lost their script in between. Screen play is very slow and boring. Ignore this one."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "satyamchouhan",
        "review_rating": "1",
        "review_title": "total garbage",
        "review_detailed_main": "Really bollywood is getting worse day by day... now its good that they are already saying their movie kalank ..."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "shreyasashok",
        "review_rating": "1",
        "review_title": "Kalank itself is the movie name as well as it's description, extremely booooooring movie ..",
        "review_detailed_main": "Worst movie, it's elongated too much, waste of money, time, energy, it describes an imaginary depressing love story with no malasa to it, ppl go to watch a movie for entertainment, and not to go n experience your fictional sad love story, n this movie has surely failed to give u entertainment, but yeah if u r someone who doesn't have enough sad stories in his or her own life and would like to go n experience someone's else's fictional n extremely elongated sad story too, then my friend u pls go n watch, this movie is then for u, unlike most ppl who already have enough sad stories in their own lives, they wouldn't like to go n waste their bl..dy 3 hours watching this piece of .... I can't speak anymore about this movie....."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "bindalmayank",
        "review_rating": "1",
        "review_title": "Why do they make such movies",
        "review_detailed_main": "This movie has a boring plot and story line. Can't believe that even Dhawan acted so bad. Wish I could unwatch this movie somehow."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "jayeshbhutiya",
        "review_rating": "1",
        "review_title": "a worst condition of india they spend 21.50 crore for the film like a kalank",
        "review_detailed_main": "A film like kalank can collect approx 21.50 crore then end is near"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "pmaniakmani",
        "review_rating": "1",
        "review_title": "Shameless",
        "review_detailed_main": "Worst movie ever seen in Bollywood with multi-starrer"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "wasisaleem",
        "review_rating": "10",
        "review_title": "Best movie of the decade!",
        "review_detailed_main": "There was only one aspect of the movie I thought could have been better - the skewed portrayal of the Muslim-Hindu riots. Other than that, the movie is top notch from start to finish. It's intense, emotion provoking and gripping from start to finish. A phenomenal movie on the level of classics like Devdas, but with a different tone and flavor. All 6 actors have given their best performances. The cinematography and sets are out of this world - worth seeing it alone for those 2 things. The dialogues were some of the best I've ever heard and the costumes and visual details make you want to watch it again and again. The story was very unique and very good, secrets continue to unfold throughout the movie and best of all, the climax and ending were not predictable! All in all, loved it and can't wait to see it again in the theater!"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "harshitbhatia-99178",
        "review_rating": "1",
        "review_title": "Worst Movie",
        "review_detailed_main": "Very poor story lineup.Very poor story lineup Very poor story lineup Very poor story lineup"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "rushabh-89319",
        "review_rating": "2",
        "review_title": "Hindu married woman affair with Muslim boy_TOI REVIEW",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "askmynk",
        "review_rating": "1",
        "review_title": "Garbage is better than Kalank",
        "review_detailed_main": "Do the directors apply brain before making such stupid and slow film. After watching this, all I want is refund."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "hassanjammy",
        "review_rating": "1",
        "review_title": "Some nice visuals, lack of any substance",
        "review_detailed_main": "The set/actors/costumes seem to be visually appealing and that's all there is to this movie.\n\nLacks any substance in terms of story/direction/acting. Over the last couple of years Alia Bhatt has established herself as a good actor and does justice to her role here once again. Varun Dhawan overacts (with bad pronunciation for the character he plays, as usual) and his overly greased body takes center-stage instead of his acting. Other actors/performances in the movie are somewhat mellow and don't deserve a mention in a good/bad way.\n\nSave yourself some money and time by skipping this one. Watching the trailer is about as much time you should spent on this movie."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "souravbid-09285",
        "review_rating": "1",
        "review_title": "Pathetic",
        "review_detailed_main": "The most third class movie!! Don't watch it; never! Don't download it, don't buy it. Just rate it 1* before watching even!"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "paularjyarishi",
        "review_rating": "1",
        "review_title": "A poor SLB copy with a poorer script.",
        "review_detailed_main": "Standing true to its name, Kalank is a manifesto on how not to make films."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "adipurohit-26327",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "Torture for some hour. Money should be return back"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "pinelliah",
        "review_rating": "10",
        "review_title": "Enjoying Visual Feast",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "ashishnair-18736",
        "review_rating": "3",
        "review_title": "Not worth your time!!",
        "review_detailed_main": "I am a big fan of everybody involve in this film.. especially Alia but this is not the movie anyone wanted to be a part of. It's a 2 hrs 48 minutes movie..I am sure one can trim many scenes to save little more time, movie is veryyyyyyy slowww..means sometimes I felt that pls complete your dialogues little faster man...I have given three stars for few dialogues between alia and Varun and for title track sung by Arijit and for the effort of trying to make this movie grand."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "kesharwanipiyush",
        "review_rating": "1",
        "review_title": "The movie name describes its review.",
        "review_detailed_main": "One of the worst movie I have seen in my life, believe me, there is no story in the movie, just in the name of revenge they have screwed the whole movie. I was tortured by 6 songs in the movie! Yes you heard it right, it has 6 boring songs! Because of Fox at least cinematography is good. But movie is not even worth 3 hours of your time forget about money!"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "shivinsearch",
        "review_rating": "1",
        "review_title": "The most pathetic movie ever seen",
        "review_detailed_main": "Complete flop and full of artificial talent movie. No story no feel nothing only sets and heavy costumes which is looking very dramatic. Only Varun and Aliya did justice with their character rest all cast was popping in movie. Madhuri seems as she is trying to be next Sridevi who's comeback was boon to industry but unfortunately Madhuri looks good on stage shows, dance and reality shows. Better not to try to become another female superstar of indian cinema like Sridevi... Over all Kalank is kalank in Bollywood cinema..."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "barnwal-usa",
        "review_rating": "1",
        "review_title": "Torturous movie",
        "review_detailed_main": "This movie is an exercise in metal torture. Only the sets are good, rest is there to torture your endlessly."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "shamanths45",
        "review_rating": "1",
        "review_title": "Movie Ke naam pe \"Kalank\" hai ye!",
        "review_detailed_main": "Baseless and boring movie, Please avoid to save time and money."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "collect-81133",
        "review_rating": "1",
        "review_title": "Movie is exactly what the title says.",
        "review_detailed_main": "Boring AF, just a normal Bollywood love story. Don't waste money, go watch avengers end game."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "artiahuja",
        "review_rating": "1",
        "review_title": "Watch only to KILL TIME; NO new CONTENT",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "sanny53",
        "review_rating": "10",
        "review_title": "Beautiful movie!",
        "review_detailed_main": "I can't believe this movie scores so low. I didn't think this movie would be that good and I was skeptical. Kind of forced with my friends. But, from the first moment I was enchanted and I really really really enjoyed until the end. Varun was great! 10 points for him! Greetz from Amsterdam"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "swamimayank",
        "review_rating": "1",
        "review_title": "Dont go just rewatch avenger in case you want to watch movie",
        "review_detailed_main": "Super boring and literally Kalank on Bollywood, i hope Bollywood stop making movie on love stories only. wtf is with 99/100 bollywood love story movies? may be there mind stop developing after getting love story as a topic."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "sindhoo-kv",
        "review_rating": "3",
        "review_title": "Music & dance is good but you can always watch that on Youtube",
        "review_detailed_main": "One more overly hyped movie with no content to offer. The sets are beautiful, the costumes are amazing, the soundtrack is great. However there isn't much of a story... It goes everywhere without any point. The actors mostly look bored. Madhuri and Sanjay are wasted. Alia and Varun are not good as leads. Aditya and Sonakshi are a great pair but have not much to do. This one is definitely missable. Very disappointing. Not worth sitting for 3 hours straight. It was torture."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "theanoopk",
        "review_rating": "3",
        "review_title": "Big \"star\" , Cliché scenes , hugly disappointing",
        "review_detailed_main": "This movie is typical case where big production houses think audience is fool who came to theater only to watch the costumes and makeup. From starting scene the induction of characters were totally unreleted and just show off. As , the story progresses, director forgets the story and too much focus on big setups and costumes. The final scene of chasing train is just extension of DDLJ, unnecessary with boaring end. Director Abhishek Varman, may be crushed under big production name of Karan Jauhar to show unrealistic setups. He forgets that he needs to tell the expression for scenes. Every characters emotion is flat even though story took the turn. With series of big flops like Zero, Thugs Of Hindostan now soon Kalank join the club. Big produk houses need to think and bring good movies. It's been years they are keep serving the old rotten story of pointless love story and showing as eternal love."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "atiyaahsan",
        "review_rating": "2",
        "review_title": "James Cameron called....he wants the scenes from Titanic back!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "TheNonSmoker",
        "review_rating": "1",
        "review_title": "The name really suites itself",
        "review_detailed_main": "The pilot is the same boring kind of generic Bollywood production, created to waste valuable time and money of common Indians."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "abzahidab",
        "review_rating": "5",
        "review_title": "Boring",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "ajithbm",
        "review_rating": "1",
        "review_title": "Three hours of torture, plus headache",
        "review_detailed_main": "How many more movies they want to make about partition. Get it over with it. Movie is so much melodrama and cringey. Songs that cannot be listen to. And of course star kids casting."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "jasmineosmani",
        "review_rating": "10",
        "review_title": "Don't listen to the bad reviews",
        "review_detailed_main": "Everyone must go watch. Amazing songs, Varuns best movie yet"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "sahil_shah-53365",
        "review_rating": "1",
        "review_title": "Vahiyat",
        "review_detailed_main": "Do not waste money on such kind of films. Pathetic movie and not worth watching."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "ankster_rocks",
        "review_rating": "5",
        "review_title": "The title: suits the song DANCE of envy the best",
        "review_detailed_main": "Turmoils of the people who wanted to get away from the term pupil went onto create a mockery of the best love story that still remains in the history of Indian Cricket: Sir Sachin Tendulkar can stop time; and without a knock of challenge, even the type writer could, and he did.\n\nThe story unfolds in the second half when he unfolds the torrid reasons of people/pupil moving from their towns to other towns, and undoubtedly is the best character who framed this story.\n\nThe best scenes are framed on Kunal Khemu who has outdone all his previous luckY roles. He, delivered an honour killing episode in the best possible manner to hide the emotions of the aged people below his belt, under the smile, and beneath every action.\n\nPeople who failed miserably in recreating the magic were Achint Kaur because of a conspiracy theory that was planned and plotted against the general public who wants to embrace the emotion that holds the future of every technically challenged person alive."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "tabassumanika-92483",
        "review_rating": "2",
        "review_title": "Not worth the hype",
        "review_detailed_main": "To begin with, I went into the movie with minimal expectations of a slightly gripping story, hopefully strong performances, good music (which I had already heard on YouTube), aesthetically pleasing sets and surroundings, good direction, stable production, and simple but strong use of CGI.\n\nPROS: 1. Solid Performances: -The actors all lived up to their characters and did them justice. Never did I once think they were anyone other than who they were pretending to be on the big screen 2. Music and Background Score -Songs were great, and the music had the right inflections to try and ignite the besotted emotions 3. Aesthetically pleasing: -Certainly a bit of a treat to the eyes with the set and costume design\n\nCONS: 1. Confusing, cheesy, stereotypically predictable storyline -Hardly anything was original in the story. I had watched all but 15 minutes to be able to guess what was going to happen, and I was absolutely right. It seemed as if Karan Johar had decided he wanted to add elements that has already been iconically shown in other movies and come up with a cheesier, more dramatic version for this film. 2. Abhorrent storytelling: -if the story wasn't bad enough, the storytelling was even worse. The characters had little to no depth or growth, the love stories were not detailed enough for investment from the audience, there were way too many plot lines happening simultaneously, and each of them had abrupt beginnings or endings. I found myself not caring for a single character or their lives by the end of the movie 3. Excessive use of slow-motion (movie run time 2 hr 50 min) -death by slow mo is literally what this film did to me with the second half and some of the first being littered with slow motion action 4. Ridiculously bad and inessential CGI -Just because you hired a CGI guy, does not mean you need to use them to make unessential, unwarranted frames. WHY KJO? 5. Madhuri's disappointing dance performance with horrible cinematography and choreography\n\nAlthough Kalank's portrayal of strong female leads, positive depictions of minority and marginalised groups, and push for feminism through subtle themes are to be applauded, overall, the cons far outweigh the positives. I do not remember the last time I have sat squirming in my seat in a theatre waiting and praying for a film to end. It felt like a Sanjay Leela Bhansali knockoff where the production team went for an Adidas but came out with a Ababus instead. Kalank was horrendously dragged out, and murdered through it's story telling style with the actual script adding to the misery. It left a bitter aftertaste in my mouth and so I give this movie a solid 1.5/10. I would not recommend this disappointing grub to anyone."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "nsnil",
        "review_rating": "1",
        "review_title": "Best attempt to justify its title",
        "review_detailed_main": "Faltu Ghatia Bakwaas Kalank\n\nGo and watch if u want to waste money.......\n\nMoney savers avoid it and invest in a good content..."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "parthrekhasingh",
        "review_rating": "1",
        "review_title": "Gave it a single star since there is no option for giving a ZERO",
        "review_detailed_main": "Don't waste your time on this movie, please give it a skip."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "chahatp-59884",
        "review_rating": "1",
        "review_title": "Please dont watch this movie",
        "review_detailed_main": "Save your money, we work hard for it. Please dont spend it on this stupid movie with no entertainment AT ALL."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "nil-83450",
        "review_rating": "1",
        "review_title": "Disgusting",
        "review_detailed_main": "Kalank sach much kalank nikli.....songs r good... picture is not good just dumb...same old useless love story which dosen't make any sense.Dont waste ur money by watching this .....save ur money and watch Avengers EndGame on 26th of April."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "azreenummey",
        "review_rating": "10",
        "review_title": "had quite a few similarities to other movie but it was GREAT!!",
        "review_detailed_main": "Kalank had a few similarities to other movies like Padmaavat but it was great. Great acting. Great casting. And SUPERB chemistry between Alia and Varun. Gave me goosebumps tbh. Yes it was a gut wrenching movie, but definitely worth a watch. I wanted to go back to the theater to watch it again. Don't listen to rumours and just go watch it. Seriously!!\n\nI would've given this an 8, but since people are disliking it so much I'm just gonna give it a 10."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "dharmendramiet",
        "review_rating": "1",
        "review_title": "This movie is really kalank.",
        "review_detailed_main": "Avoid it at any cost . This is 3 hours of intense torture ."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "hinajain-33399",
        "review_rating": "1",
        "review_title": "Pathetic",
        "review_detailed_main": "In one word just pathetic.. Waste of time.. Lack content and is a big time drag"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "Brokenandbond",
        "review_rating": "1",
        "review_title": "Dont Watch this waste of a movie",
        "review_detailed_main": "Ise Bakwas movie jindagi mei nahi dekhe , mat dekho time and paisa waste hai"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "subisouvik",
        "review_rating": "1",
        "review_title": "Total disaster",
        "review_detailed_main": "Worst film i have watched this year. The title of this name does full justice to the film. Karan johar should stick to his nepotism and drinking coffee."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "RajKaliVPK",
        "review_rating": "1",
        "review_title": "Great movie for....",
        "review_detailed_main": "It's so hot in summer...It is also so sleepy in summer...Best movie for summer...The movie makes us sleep well...You will get a good sleep for 168min...So, please see this movie in theatre and see the above conditions...🙏"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "arpitrege",
        "review_rating": "1",
        "review_title": "Worst movie one can watch",
        "review_detailed_main": "One of the worst movie one can watch. The dialogs are worst. Boring movie"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "anmol-95222",
        "review_rating": "1",
        "review_title": "Stupid Film",
        "review_detailed_main": "I've To Say KarAn Johar Has To Be The Biggest Madarchod And Chutiya In The Country!"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "anushkakahawela",
        "review_rating": "10",
        "review_title": "Kalank makes you fall in love with love stories after so long!",
        "review_detailed_main": "Kalank is BEAUTIFUL! It's a true masterpiece that contains all emotions, dreamy and stunning visuals, too-notch performances from the entire star cast, amazing and soulful music, and a story that stays with you for a long time! Each actor gives his/her best!\n\nIt's a fresh story that can be easily classified as the epitome of love in modern Bollywood! Its genre is not action, thriller, masala, or romcom - it's a periodic love saga! Hence the audiences need to understand its pace and intensity, rather than sitting with expectations of a thriller or otherwise. Millions of fans of love stories (over the globe) are spellbound by the portrayal of Kalank's love story. To be honest, Zafar's love is still living inside many of them - audiences feel the eternal love in Kalank.\n\nTrue, there were some scenes that could've easily been taken-off - the bullfight scene especially. It would've made certain audiences happy with the length of the movie. However, periodic love stories are expected to grow slow alon with grandeur and great cinematic experiences - which is what Kalank is truly about."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "heenad-85136",
        "review_rating": "1",
        "review_title": "Anti hindu propaganda",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "abhinavkeshri8",
        "review_rating": "1",
        "review_title": "Nepotism at its peak",
        "review_detailed_main": "The visually movie would look good but when you come to story part 'Movie hag deti h'. Cliche melodramatic sequences, nothing new, poor story, 3 hr long movie, make you bore. Use this money for something productive instead of watching it."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "priyanshupareta",
        "review_rating": "3",
        "review_title": "Costumes and sets - 👍 but script and story - 😷👎",
        "review_detailed_main": "Watch this only if you are interested in fashion, costumes, music and Kunal Khemu. Script and story literally sucks."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "zfk-53203",
        "review_rating": "1",
        "review_title": "Zero was good",
        "review_detailed_main": "Typical Hindu-Muslim story which I guess everyone is probably sick of now. Can't the writers come with something original or innovative, Movie is very predictable and has very little to offer. What a waste of talent of the star power in this movie."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "moitraudayan",
        "review_rating": "1",
        "review_title": "For me the bull was the hero!",
        "review_detailed_main": "The VFX induced bull did a far better job acting than anybody else in this movie. Save yourselves."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "justrishi",
        "review_rating": "1",
        "review_title": "Shocking... boring... disgusting",
        "review_detailed_main": "Most disgusting story ever scripted. I wonder how can one make a movie like these in today's world. Idiotic, boring, heavy... total waste of time and money."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "anjanasinghwi",
        "review_rating": "1",
        "review_title": "Super slow romantic drama with no depth",
        "review_detailed_main": "Sets were pretty! Doesn't beat Bhansali's sets though."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "kumoy",
        "review_rating": "9",
        "review_title": "Great return to classic Bollywood melodrama",
        "review_detailed_main": "If you're a 2 minute noodle, this movie isn't for you. It's a slow, epic, deeply moving burn. Visually stunning, this period piece gains too from superb acting by Varun Dhawan, the peerless Madhuri Dixit & Kunal Khemu. Alia Bhatt sparkles in her innocence & her chemistry with Varun is something else. Background score & songs are very mellifluous with each song adding depth & distance to the plot. Kudos to Dharma for courageously going unabashedly retro & above all, raising intelligent questions in election year."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "vikrantbhadauria-69798",
        "review_rating": "1",
        "review_title": "Worst movie ever seen in my life",
        "review_detailed_main": "Very boring, characters mein bhi kuch dum nhi that, unrealistic, wastage of money and time"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "manish-snh",
        "review_rating": "1",
        "review_title": "3 cheers to all the reviewers!",
        "review_detailed_main": "I haven't seen the movie,but reading the reviews,I thank all those reviewers,who took the pain to watch it and help us. Kudos to u guys,but just one question- kahaan se laatey ho itni himmat?"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "nvisharmain",
        "review_rating": "2",
        "review_title": "Kalank of the name of Movie",
        "review_detailed_main": "One of the worst movi that I am ever seen after harry met sejal don't west your mony on this movies"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "vj-38883",
        "review_rating": "3",
        "review_title": "Save your time and money!!",
        "review_detailed_main": "Weak story, point less sets, unnecessary use of a periodic movie plot, OTT costumes and dialogues, too long to even enjoy anything good in the movie. The only positive was Aditya's acting. Don't waste your money on it!! I might ask for a refund, the most non-entertaining movie of the year."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "tanmaysk-02743",
        "review_rating": "1",
        "review_title": "A boring and money wasting 3 hour long disaster",
        "review_detailed_main": "It is very boring movie and makes people difficult to survive it for 3 hours. Although it has a very talented and majestic cast but still it fails to win hearts"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "mbhaswar",
        "review_rating": "3",
        "review_title": "Sinks like the Titanic",
        "review_detailed_main": "Abhiskek Varman who gave us the 2 States with his first directorial outing naturally had escalated expectations for his second venture Kalank, boasting of a stellar cast and Bhansali-esq opulent sets. Delving deeper we find the history behind the influence. He was in the directorial team which had assisted SLB for Devdas. Sri Varman clearly forgot that SLB's trappings are always the gossamer around a solid story. Regrettably a weak and yawn-inspiring narrative allows the glitter of lavish trappings to implode. Screenwriter Shibani Bathija who gave us the engaging 'My Name is Khan' fails miserably with this one. Set in a fictional town Husnabad outside Lahore in pre-partion Pakistan in 1945, Kalank remains undecided even at the end of its 166-minute run, whether to be a romantic story or a period drama. Countless questions assail you from the word go as you realise that the town is not the only unbelievable part of the film. Agree that Satya, the daughter-in -law of the Chaudhry clan suffers from a terminal disease and would like to see her husband Dev marry for a second time, but why choose Roop who is so unwilling? Why does a courtesan's abode appear more ostentatious than that of the Chaudhry's? Why the big deal about Zafar's illegitimacy, when apparently the whole world or at least Hira Mandi knows about it? At what point exactly does the friendship between Abdul and Zafar turn sour? Why does Abdul attack Zafar in the end rather than Dev or Roop? You get the drift? The plot is more porous than a blotting paper. And even a 3-year-old toddler would have scoffed at the pathetic VFX of the bull-fight. An insufferable plot made worse by the dead slow pace of the movie just cannot be supported by the laudable histrionics of the cast. Alia Bhatt as Roop and Varun Dhawan as Zafar especially stand out. Kunal Khemu tries his best in a poor role construct of Abdul. Sanjay Dutt and Aditya Roy Kapur underplay their parts well but appear wooden in some shots. Sonakshi is just about ok and Madhuri definitely looks jaded. Kalank like the Titanic sinks under its own weight. After the dismal failures of Thugs of Hindustan and Zero, Bollywood should re-examine the commercial acumen of persisting with big budget, big star and larger than life sets especially when the storyline is weak. The taint of 'Kalank' should remind them of this pitfall."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "kroy-37698",
        "review_rating": "1",
        "review_title": "Say NO to Nepotis..",
        "review_detailed_main": "KALANK of Bollywood..worst-ever.. Don't waste your money"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "tanaytamhankar",
        "review_rating": "9",
        "review_title": "A beautiful attempt!",
        "review_detailed_main": "I think the sets were elaborate, lot of efforts were taken on the look of the film. Varun Dhawan totally convinces you as Zafar. Alia looks ethereal. Sanjay Dutt, Aditya and Sonakshi all have acted their finest. The best was Madhuri Dixit. She's like a painting , dances like a goddess. The music, acting , costumes, everything is toooo good.The story could have been worked out a little more on and the movie drags in bits , however the romance is intense. Definitely a one time watch!! Guys you must give this movie a chance!"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "Ramandeepsinghgill",
        "review_rating": "2",
        "review_title": "Karan Johar cannot make a period move, Period!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "arsheenkauranandaka",
        "review_rating": "1",
        "review_title": "Money waste movie",
        "review_detailed_main": "Baseless senseless idiotic all these words are less to describe this pathetic movie idk what the hell alia bhatt was doing during the entire movie although i am her fan . But there was one good thing about the movie Aditiya roy kapoor , he is the only charm in movie otherwise movie is boring and to be frank bakvas"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "pragyasriva",
        "review_rating": "1",
        "review_title": "Pathetic movie of the year",
        "review_detailed_main": "The movie was so lengthy, too much overacting, kjo tried to make a cocktail of devdaas, bahubali n sawariya but failed badly, please don't waste ur money and if going to watch movie carry a head balm"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "singla-aanchal",
        "review_rating": "1",
        "review_title": "Grand filth",
        "review_detailed_main": "It is grand. But is garbage. Do not watch it. Or you will be the one saying tabah hogye."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "anandbawal",
        "review_rating": "1",
        "review_title": "bakwaas",
        "review_detailed_main": "This is one of the worst movie i have seen in the recent time. I don't understand why all these starkids did this film. madhuri is old now , nobody has interest in seeing her dance. its a long boring money wasting movie. i now pledge never to watch these starkids movie again in life"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "satkumartomer",
        "review_rating": "1",
        "review_title": "Worst film",
        "review_detailed_main": "Worst movie I have seen in their. No story, no acting."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "ashlybobanca-45008",
        "review_rating": "10",
        "review_title": "Loved it !",
        "review_detailed_main": "I would say the story might not be for everyone but I did like it personally. Cast did a great job in acting. Background and costumes were amazing. I don't know why so much unwanted hate people are giving. This movie should have been 6/10 on average at least . The whole crew did a great job. It was slow in some area i must say . Rest all good. 🗝😍"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "singhashu",
        "review_rating": "1",
        "review_title": "Literally kalank movie.",
        "review_detailed_main": "Justice to the word Kalank. Just avoid this movie it's a 3 hour torture."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "sachinsingh-71862",
        "review_rating": "1",
        "review_title": "Worst",
        "review_detailed_main": "Don't watch this movie. Its a waste of time and money. Bollywood sucks."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "shwetasekhon",
        "review_rating": "1",
        "review_title": "Save your money",
        "review_detailed_main": "I agree with Anupama Chopra's review. She went at length to praise everyone's clothes. That's it! There is not much in the movie and to watch pretty clothes you might as well wait for it to come on cable/Netflix/Prime. Not worth your hard earned money and half a day."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "reachns",
        "review_rating": "1",
        "review_title": "Kalank is a disgrace in name of movie",
        "review_detailed_main": "Watched kalank in theatre in Chicago . There is pathetic storyline, weak performances, only headache.. I demand my money back\n\nBetter watch the movie Hotel Mumbai"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "superbrahul",
        "review_rating": "1",
        "review_title": "Tatti",
        "review_detailed_main": "If you want to ruin ur 166 minute than go better than watch tatti"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "sundar-c7",
        "review_rating": "1",
        "review_title": "Avoid",
        "review_detailed_main": "It is slow movie with no story. Avoid at all cost. Settings and costumes are ok"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "anuragcool30",
        "review_rating": "1",
        "review_title": "Total waste of money and time",
        "review_detailed_main": "If you really want to waste your precious Saturday and Sunday as well as money, you are free to do so.\n\nNow, lets move to movie name \"Kalank\". It is totally a Kalank to India cinema.\n\nI don't know that Karan Johar fall to such a low level. Story is totally \"bakwaas\". I mean, at some places it didn't even make sense. It was a mess, a variety of scenes and ideas had been picked from movies like DDLJ, Pakeezah and so on. The set of the movie look totally artificial.\n\nThe flow was so discontinuous and random, at some times the director seemingly got confused.\n\nThe acting? Dixit's outstanding talent in dancing and poising with alluring expressions and grace had been seemingly, ignored.\n\nSonakshi had appeared in very few scenes, which was kind of unfair.\n\nAditya Roy Kapur has definitely made a good comeback after Fitoor, the chemistry between him and Sonakshi was pretty much commendable.\n\nComing to acting done by Varun - A BIG joke.\n\nAnd, Alia Bhatt - swift and sweet yet a novice at some points especially in dancing.\n\nA big NO this movie.\n\nIn future, I am totally going to avoid any of the film produced by Karan Johar."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "smita716",
        "review_rating": "9",
        "review_title": "Beautiful",
        "review_detailed_main": "Pros: The scenes were beautiful. The outfits, jewelry, makeup and sets are stunning. The story line is interesting. Actors did a good job and look amazing. Aditya (Dev) has a great screen presence. Cons: Some scenes are completely unrealistic and poorly done, such as the bull fight. Unrealistic- there is a single girl dressed skimpy dancing amongst all men in the street, where are the other women in town? Or would a dying wife really want to see her husband get married against his will, supposedly when she loves him and he loves her? Stuff like that."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "mrinalkalemk",
        "review_rating": "2",
        "review_title": "2stars only for the songs and costumes",
        "review_detailed_main": "Again a movie which didn't have script. They just decided to aim for a Sanjay Leela Bhansali kind of movie with lots of characters, huge sets and antique costumes. They just shot whatever was coming in their head and tried to call it a movie. Waste of money and time. They tried to show a HIGH-FI POSH era before partition, how the rich class used to live on other side of the border. Only the songs are good."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "ykausalya",
        "review_rating": "1",
        "review_title": "It's a Kalank if you watch this crap",
        "review_detailed_main": "Bollywood is fast running out of innovative story plots. It is again and again coming up with the Saale crap. Other than Muslim centric and Pakistan involved stories they don't have anything to show."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "jaglittheworld",
        "review_rating": "1",
        "review_title": "Must not watch",
        "review_detailed_main": "I like Alia Bhatt movies alot but this time had to leave the theatre before the interval."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "naveensharma-05999",
        "review_rating": "1",
        "review_title": "Too Boring and Slow",
        "review_detailed_main": "Rated 1 just because of some moments in second half .Otherwise full junk movie."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "fojychaudhary",
        "review_rating": "1",
        "review_title": "Kalank name suits the movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "champsharvan",
        "review_rating": "1",
        "review_title": "Worst movie from such great casting",
        "review_detailed_main": "Movie is totally absurd. Distored history with no logic emotions. Won't depict period of 90s. Nothing in this movie can be praised, even the sets and dresses which should be praised look out of context and makes those things irrelevant."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "shoebilyas123",
        "review_rating": "1",
        "review_title": "Please do yourself a favour. DON'T WATCH!",
        "review_detailed_main": "It's an utter waste of talent, production team's effort, money and audience's time."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "Invisible_Soul",
        "review_rating": "10",
        "review_title": "Outstanding such beautiful enchanting love story",
        "review_detailed_main": "I was sure to watch this movie on first day because of some reasons I couldn't By next day it got hammered so much by our Pseudo intellectual critics, that those who said it not Disappointing everyone started screaming paid reviews . It's sure a really beautiful poetic way of showing epic love story It got hammered for it's rhythmic dailogues a movie with backdrop of love and Muslim culture will not show shayrana andaaz, I guess they never heard of Mirza Galib disappointing is only, for one thing screenplay didn't flow smoothly that's negative Rest storyline aspect of love songs all were done so beautifully except that item number not neededMadhuri Varun Alia Kunal khemu out of world actingoutstanding epic love movie shot with larger than life canvas So beautiful enchanting love story am glad I didn't miss on big screen and I realized today That's India critics seriously shouldn't not be taken seriously like politician"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "nazir-386-83723",
        "review_rating": "1",
        "review_title": "Very Bad movie.",
        "review_detailed_main": "No good story line. Pathetic acting. Very fake sets showing streets cleaner then Singapore."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "pandu9933",
        "review_rating": "4",
        "review_title": "Kind of boring",
        "review_detailed_main": "As i said the movie was confusing and a little boring at times, but due to good company i still managed to enjoy it <3."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "muhammadsalman-74904",
        "review_rating": "1",
        "review_title": "Pure tatti",
        "review_detailed_main": "Varun dhawan said that this is better than endgame? WTF. What is he smoking?"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "travelwithht",
        "review_rating": "1",
        "review_title": "Epic disaster",
        "review_detailed_main": "Movie belongs to his title - KALANK....\n\nThe is movie is KALANK in all aspects , a crap, boring,disgusting,full of torture, i m biggest fan of alia and varun but this movie break my heart please guys choose proper script and back with a bang..."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "azam-90749",
        "review_rating": "1",
        "review_title": "A BIG TIME DISAPPOINTMENT",
        "review_detailed_main": "Went theater with lot expectations and good acting or storyline. It turned out to be soo boring and old style shit movie. Only Aditya Roy was good in his part. Rest didnt impress at all. BORING ....If you want to waste money to sleep in a air con room its for you . AVOID PIEACE OF CRAP...."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "sahilnautiyal",
        "review_rating": "1",
        "review_title": "Suggestions",
        "review_detailed_main": "Save money...go and watch ENDGAME.\n\nIt's not about how much we lost. It's about how much we have left. #endgame"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "saiprasadc",
        "review_rating": "2",
        "review_title": "*Here's my Review for Kalank*",
        "review_detailed_main": "*Starring* - Varun Dhawan, Alia Bhatt, Sonakshi Sinha, Aditya Roy Kapoor, Sanjay Dutt, Madhuri Dixit Nene, Kunal Khemmu.\n\n*Directed by* - Abhishek Verman\n\n*Runtime* - 2 Hours 45 minutes\n\n*The story in short* - Set during the partition era 1940s, the complex love story is based between Roop (Alia Bhatt) and her husband Dev (Aditya Roy Kapur). Also, the twist adds up when Roop falls in love with Zafar (Varun Dhawan). As the story unfolds further in the film, you will witness all the emotions at once. Be it heartbreak, love, happiness, etc.\n\n*Performance* - Varun Dhawan & Alia Bhatt stand out of the crowd throughout the film, the will never let you down when it comes to their chemistry, Sanjay Dutt has a less screen presence but its hard-hitting and impactful, whenever he is on screen and especially with Madhuri Uff.. they both literally Lit up the screen. On the other hand, Aditya Roy Kapur and Sonakshi Sinha are pretty average and do their part quite well. Kunal Khemu is a surprise package as he shines out in the 2nd half.\n\n*What's Good -*\n\n\n*What's Disappointing -*\n\n\n*Final Verdict* - Kalank will have its own audiences, it's not everyone's cup of tea I'll say. Some will enjoy it thoroughly while others will be bored for sure. It's way-way-way too Over-Dramatized. You can Skip this movie and instead save your money for Avengers: EndGame which releases next week.\n\n*My Ratings - ⭐⭐💫( 2.5/ 5)*"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "sanjogdhakal",
        "review_rating": "8",
        "review_title": "It's really amazing movie with great dialogues but one must be really patient to absorb it.",
        "review_detailed_main": "One could have an amazing time if one could relate to the movie. To get the amazing experience please watch it on cinemas . I had a huge smile on my face the whole time. It's Wow"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "nikhilonaws",
        "review_rating": "2",
        "review_title": "A pure waste created with a star studded filmcast",
        "review_detailed_main": "With all the due respect and appreciation for EFFORT and human-hours spent in making the movie, But director, writers and actors have created a \"crap story\", \"crap acting\", \"unnecessary plots\" and a complete waste of time. Cherry on top is \"worst ever dialogues\". I regret wasting $25 on this crap. Even if they show this movie for free I would not want to waste my time in watching it. Coming to Madhuri Dixit's performance - a lot more was expected from Madhuri Dixit. I think should have made her comeback with grandeur acting and performance. After watching series of movies that Madhuri Dixit has done recently, she must quit industry and give chance to other theater actors who can pull it off with their outstanding performance."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "msmcalvin",
        "review_rating": "2",
        "review_title": "Why i didnt like the movie...",
        "review_detailed_main": "The sets doesnt seem real to me..the story wasnt up to the mark..the movie couldn't satisfy my expectations..."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "mowgli-02376",
        "review_rating": "2",
        "review_title": "Great sets and just that",
        "review_detailed_main": "Beautiful sets, okay acting, poor direction, bad story, looooooooong railway platform, sloooooooooow train, boooooooooooring. Three hours of movie could have been cut down to hmmmmm, five minutes? The stars were for the sets only."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "tegrazero",
        "review_rating": "1",
        "review_title": "it's not a movie, it's a terror on humanity, wtf just i saw?",
        "review_detailed_main": "Screenplay was pathatic, i don't even feel like reviewing it.. wtf?\n\nnever watch this movie, it's just KALANK on bollywood.\n\ntashkent files dekhlo wo better nikli is se."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "vidushi-52265",
        "review_rating": "1",
        "review_title": "Save your money",
        "review_detailed_main": "Dont watch this disaster , it's the worst movie of all times"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "amitpathria",
        "review_rating": "5",
        "review_title": "Period Film with Slow Pace... Still worth-watching for one time...",
        "review_detailed_main": "Storyline is good however what disappoints us as viewers is the slow pace. And this slow pace is the actual cause that people found the duration of the film unjustified. It is set as a period drama with nice dialogues here and there that make the film soulful and worth-watching for one time.The film started with an abrupt scene and the flashback narrative from Alia came much later that led to confusion. Many scenes were unnecessarily long whereas some of them were insignificant adding no progression to the story.\n\nSanjay Dutt was missing his ferocity. Madhuri's attempts to balance her 'adaa' and 'kirdar' are worth a praise. She has proven that she would be the right choice for 'Pakeezah's remake if ever made. Alia Bhatt proved yet again that she is working hard on her acting skills. For Varun Dhawan, it could have been a lot better if his role had more anger instead of perennial anguish and chronic complains of being an illegitimate child. Aditya Roy Kapoor was quite disappointing. He was stone-faced and had confusing face expressions. If the story had shown Satya (Sonakshi Sinha) as already dead, and instead Balraj Choudhry convincing Dev to remarry, the movie not only had had less duration but less confusion too. And by the way, where were Dev & Satya's boys and girls as they were not shown even once throughout the movie? So, why mention them? Kunal Khemu's role was nicely etched and he did more justice than anyone else.\n\nOverall, it is a film with a good heart. If you expect to watch a period film with slow pace, you won't be disappointed. However, if you are looking for the frivolosity of contemporary Cinema From this grandeur casting, you might feel cheated. So, set your perspective right!"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "vidushi-52265",
        "review_rating": "1",
        "review_title": "Worst movie Ever!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "tejuchitre",
        "review_rating": "10",
        "review_title": "Nice movie!!!",
        "review_detailed_main": "The movie has nice sets and fabulous music! Surely a one-time watch!!"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "watson_dipti",
        "review_rating": "1",
        "review_title": "Lives up to its name",
        "review_detailed_main": "Had such high expectations from this movie, such a disappointment. Having great sets don't matter if you have no story at all. Would rate it a 0 star if IMDB allowed it. Complete waste of time"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "premschampawat",
        "review_rating": "1",
        "review_title": "kalank hai Bollywood par",
        "review_detailed_main": "The movie does full justice to it's name. kalank hai bollywood par"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "dhruvg-87158",
        "review_rating": "1",
        "review_title": "Waah kya title!!",
        "review_detailed_main": "The title of the film is very apt with respect to the cast. I give 5 thumbs down"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "vikasgalav",
        "review_rating": "1",
        "review_title": "Rubbish Movie",
        "review_detailed_main": "It is one of the worst movie bollywood ever made. so don't waste your money. Wait for Avengers Endgame."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "amaank-73669",
        "review_rating": "1",
        "review_title": "Paise bacha lo!",
        "review_detailed_main": "No story, no logic, no dialogues, no sense of making movie, extra paise yaha waste kar sakte hai.."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "zamal-02812",
        "review_rating": "1",
        "review_title": "Kalank movie is very bad move, guys don't weste your time and don't weste your money please. Karan Johory has been good director but this time very bad. Don't waste time ple",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "sehnaazali",
        "review_rating": "1",
        "review_title": "Avoid, Avoid & Aviid",
        "review_detailed_main": "I wish we had consumer forum where we can literally sue the producer and have refund. The movie aptly justifies it's title, indeed a Kalank on Hindi cinema. Boring script, haming actors and typical sob story. Save your money folks....not worth spending."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "khushiagarwalsuruchi",
        "review_rating": "10",
        "review_title": "Best movie ever!!",
        "review_detailed_main": "It explores eternal love in a beautiful way.It give us a peek into the olden days with simplicity.Everything about the movie is beautiful and well thought.Sitting I didn't want the movie to get over.Alia Bhaathas again won everyone's heart with her character roop."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "engachal",
        "review_rating": "1",
        "review_title": "Kalank Movie is a Kalank on Indian Cinema",
        "review_detailed_main": "Kalank Movie is a Kalank on Indian Cinema. Bahut hi Ghatiya Movie. No Story, No Logic. My head is still banging. Big star cast but nothing like a good movie."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "harishchidiri",
        "review_rating": "1",
        "review_title": "Don't waste your money",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "mamgainsona",
        "review_rating": "1",
        "review_title": "Don't watch this movie...",
        "review_detailed_main": "This movie was a piece of shit....pls don't waste your time..."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "jigneshpatel-15940",
        "review_rating": "1",
        "review_title": "Worst movie of 2019",
        "review_detailed_main": "Worst stupid movie of 2019 there is no connection between story and the actors were manipulating audience on screen except kunal khemu his role was surprising rest is full of typical dharma production movie as usual well karan johar has broken his dad's dream project in seconds this movie is gonna be a disaster save your money for Avengers End Game it's gonna crush kalank like Anything it will be kicked out of theatre's within couple of days"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "niravdesai-92077",
        "review_rating": "1",
        "review_title": "Boring.. don't waste ur time",
        "review_detailed_main": "Routing story.. some star cast acting is all right, but overall crap movie"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "arunkekare",
        "review_rating": "1",
        "review_title": "👎",
        "review_detailed_main": "Hdjdj hdhdh jhdhdj jdjhdg ggggggggggggggggg ggggggggggj ggggdsyjj"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "johararwa",
        "review_rating": "1",
        "review_title": "Kalank is not a black spot but a big black hole",
        "review_detailed_main": "Apart from grandeur production designing and pastel color theme there is nothing north watching in this movie. The script is so damn dull not sure why it was written at the first place. The dialogues were so long one can only think why someone is writting this in 2019 and why it is infact spoken. BGM was also so irritating. Not sure but something was missing in Alia's performance she was so blank and bleak that I hated her for the first time , her nostrils flaring gimmick is becoming repetitive for some reason. Her dancing was equally graceless. Varun what to say about him he was so confused about his performance that he was sleep walking in the entire movie copying Shahrukh which was a failed attempt. Aditya Roy Kapoor , Sonakshi , Madhuri and Sanjay Dutt all are wasted in the movie. Still can't understand why they infact made this movie. So so unworthy. Ghar more pardesiya was the only thing worth watching that to majorly for shreya Ghosal and amazing production set. Waste of time otherwise."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "nidachaudhary",
        "review_rating": "10",
        "review_title": "Amazing ( GO WATCH IT)",
        "review_detailed_main": "The story line of \"Kalank\" is amazing and there is no other Bollywood movies like it. It was definitely worth the wait. Alia Bhatt's acting was amazing and well preformed. Varun Dhawan showed true emotion. You could really feel all of the emotions preformed by all the characters in the movie. The story had a HUGE plot twist. The dialogue in the movie was really good as well. I definitely recommend that you see Kalank. If you don't want to spend the money wait for it to come on Netflix. But honestly this is my favorite Bollywood movie. I don't understand why this is so much hate and bad reviews. (GO WATCH KALANK!!!)"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "sarkarkushal",
        "review_rating": "1",
        "review_title": "Review on Kalank movie",
        "review_detailed_main": "Please don't waste your money and time for this movie, it is the worst movie in Bollywood industry."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "furqanfarooqui-63827",
        "review_rating": "1",
        "review_title": "Kalank is a Kalank",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "jshearar",
        "review_rating": "1",
        "review_title": "Utter nonsense",
        "review_detailed_main": "The movie has everything from lavish sets to big name actors, except for 2 main ingredients in a good film: an engaging story and good acting.\n\nThe film is a typical run-of-the-mill Hindu girl falling for a Muslim boy film, with partition as a backdrop. The story is utter non sense and except for Kunal Khemu and Alia Bhat, whose acting were decent, others have done bad acting. The songs are misplaced and mistimed and the long run time only increases the headache of having to bear this film. Not worth watching."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "shri-c9",
        "review_rating": "1",
        "review_title": "Only good things in this movie are costumes and songs",
        "review_detailed_main": "If you haven't watched this movie please do yourself a favor don't watch it."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "ronak-88925",
        "review_rating": "1",
        "review_title": "Worst Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "yashj-70961",
        "review_rating": "1",
        "review_title": "Worst movie of 2019 !",
        "review_detailed_main": "This is the second worst movie of 2019 after luka chupi . The title of movie suits the movie . I am suggesting who is reading my review don't waste your time in watching kalank . Very bad experience :("
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "suneelsharad",
        "review_rating": "10",
        "review_title": "Amazing film during Partition",
        "review_detailed_main": "Superb , deserves almost 10/10.What a direction, acting & cinematography.Must see for everyone."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "sandipandastidar",
        "review_rating": "1",
        "review_title": "oh god..what a kalank",
        "review_detailed_main": "Worst movie of 2019, dnt know what happened after making such high quality content driven movie what kind of movie is this???"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "moriharshad",
        "review_rating": "2",
        "review_title": "montage of good visuals and lack of connection",
        "review_detailed_main": "It's just my opinion. No offense.\n\nCharacter establishment could have been better. Lengthy and lack of engaging before interval.\n\nAll artist performance good.\n\nCouldn't found sould of 1940's Era. Some VFX is looking fake. .... bull fight. And horse cart scene in climax. Story polt could have been better. Set's interior looks well maintained but for exterior wide shot its looking fake..\n\nI think Cinematography saved this film much on visually.\n\nSongs sounds good and music score too.\n\nI Can't judge Film by giving star. But everyone has different perspective and vision to execute.\n\nCongratulate to all people who put their efforts. !!!"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "mayanktodi",
        "review_rating": "1",
        "review_title": "BAD BAD BAD",
        "review_detailed_main": "Don't watch it. Not worth you time and money.\n\nI feel the story was good but they failed to present it well. Climax was leanthy. Dialogues were boring. If my friend was not there to stop me during the interval I would have left.\n\nOne star for sets and costumes."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "dhavaljiya",
        "review_rating": "1",
        "review_title": "Karan Johar and his daughter alia bhatt",
        "review_detailed_main": "Delete kjo from hindi film industry and plz remove Alia Bhatt from dharma she deserves better mentor and better films"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "akumawat-72895",
        "review_rating": "1",
        "review_title": "Full Boring",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "twilightone",
        "review_rating": "1",
        "review_title": "save money for other movies",
        "review_detailed_main": "Same pathetic Hindu & Muslim love stories, total propaganda & distracting movies. don't go & these kind of movies"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "pradeepgangwar",
        "review_rating": "1",
        "review_title": "Worst movie",
        "review_detailed_main": "Such a waste of talented actors stupid script . This movie is not worth of your precious money and time."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "putan-71770",
        "review_rating": "10",
        "review_title": "A beautiful love story feel kalank",
        "review_detailed_main": "Amazing performance, good story, dialogue glorious visual but lengthy not everyones cup of tea if you like movies devdas jodha akbar u will love it"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "bapi-khulna",
        "review_rating": "1",
        "review_title": "it's a torture to watch full movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "prithuanny",
        "review_rating": "1",
        "review_title": "Pure KALANK",
        "review_detailed_main": "Disgusting. After watching this movie, I'm having a severe migraine. There's nothing special in storyline, acting. Only \"first class\" and \"kalank: title track\" is good enough. Waste of time, money and energy."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "abhaysingh87",
        "review_rating": "1",
        "review_title": "Poorly made formula film",
        "review_detailed_main": "Bad experience, looks like director's school project. No story.."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "nsohi",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "BORING, SLOW, complete waste of time. Grand shots, jewellery etc but nothing more. Horrible direction!"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "vikramkumar1000",
        "review_rating": "1",
        "review_title": "One of the worst Bollywood movie",
        "review_detailed_main": "This movie has nothing except heavy star cast. No story line."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "physicsgulati",
        "review_rating": "3",
        "review_title": "First FLOP of \" VARUN DHAWAN & ALIA BHATT \"",
        "review_detailed_main": "When teaser of this movie was out , I was really excited coz I thought I will see an international standard movie. But slowly hype of this went down ...No actor of this movie came into promoting it.....so there was dought When I saw it spending bucks of money I was really dissatisfied. Don't even watch for free."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "rathorevikramsingh66",
        "review_rating": "1",
        "review_title": "BORING",
        "review_detailed_main": "It's a Kalank on dharma production. No story no direction and pathetic screenplay. If you want to watch huge sets and location you can watch it. Even worse than the Epic Race 3 and Thugs of Hindustan Do not watch this movie"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "ahmedmughal-39167",
        "review_rating": "10",
        "review_title": "NO WORDS FOR THIS MOVIE😍",
        "review_detailed_main": "Just watch it you will see this movie is soo good. Bollywood is love. Avoid fake reviews"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "yagyaswaroop",
        "review_rating": "1",
        "review_title": "Don't watch",
        "review_detailed_main": "This movie is total waste of money and time. Watch if you are Madhuri fan"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "krupalikapadiya",
        "review_rating": "1",
        "review_title": "Don't watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "anshulkoundal",
        "review_rating": "1",
        "review_title": "Real disgrace",
        "review_detailed_main": "Whole movie was collection of different scenes and shots from Sanjay leela and karan johar movies. Story was predictable. All the actors were strong. But they didn't have any dialogues. Direction was poor. Sets are beautiful. Music was good, but dint do any favour to the story. People still don't believe a FLASH MOB of 5000 people( It's not practical)."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "bahwan",
        "review_rating": "4",
        "review_title": "#bollywood_racisim",
        "review_detailed_main": "The final similar idea in most recent bollywood movies: is that muslims are always bad.\n\n#bollywood_racisim"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "jigartimbadiya",
        "review_rating": "1",
        "review_title": "Worst ever",
        "review_detailed_main": "If there any option in rating than I will put 0 rating, third class story"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "vjstyla",
        "review_rating": "1",
        "review_title": "Rubbish...wasted money",
        "review_detailed_main": "What the heck you trying to show...nothing at all? All rubbish and wasted my money ...this is all made by bunch of fool"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "alakshendramishra",
        "review_rating": "1",
        "review_title": "Worst Movie of 2019",
        "review_detailed_main": "It is very slow and monotonous. B -Grade Story with average acting. Classic case of justifying the LOVE JIHAD .Not recommended for watching."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "yasirm-57791",
        "review_rating": "9",
        "review_title": "Good story line",
        "review_detailed_main": "The story line is quite good but the movie is bit slow.. Acting is not very good but just good"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "kariamalar",
        "review_rating": "3",
        "review_title": "OMG",
        "review_detailed_main": "Shocked the film is okay the 2nd half the first half nonono"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "sidharthmehta",
        "review_rating": "1",
        "review_title": "Stay calm and don't watch Kalank",
        "review_detailed_main": "The movie is out of sync. Period. A great star-cast with one of the worst stories and clichè dialogues. Could'nt get any worse.\n\nIts (Devdas + Hum Dil de Chuke sanam+ add more drama) gone wrong."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "jetj",
        "review_rating": "2",
        "review_title": "Not worth watching",
        "review_detailed_main": "Old love triangle melodrama. 2 stars are for the visuals and acting. 0 for story, 0 for songs and 0 for wasting our time"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "bhatiarashmi",
        "review_rating": "2",
        "review_title": "Kalank",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "rovemo",
        "review_rating": "1",
        "review_title": "Only the name is enough to justify its contents",
        "review_detailed_main": "Only mercy is the Mr Yash Johar was not Alice to this carnage of his dream project on screen. Not even an iota of this movie looked like it belonged to a period movie. Varun dhawan, aliaa, brooding sanjay dutt, all the leads were acting as if this a period movie of 1990s. This movie is a kalank on Indian cinema"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "farukjubayer",
        "review_rating": "1",
        "review_title": "Worst movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "duskivina",
        "review_rating": "5",
        "review_title": "I think it depends whether u liked it or not",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "sumanth-05484",
        "review_rating": "1",
        "review_title": "Disappointed",
        "review_detailed_main": "Created Lot Of Hype beacuse of its big budget and Beautiful Sets .\n\nAlso it's songs Enhanced the hype more.\n\nBut Bakwas Story Poor acting make this movie a big disaster .\n\nTime waste ."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "waleedwaqas-21460",
        "review_rating": "3",
        "review_title": "Disgusting",
        "review_detailed_main": "That film is really parthetic ..just song auchy. .idk but why these Sooper stars chosen signed this film ...film is totally opposite to the History; in past MUSLIMS were brutally not totured not Hindus."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "mukeshmishracrpf",
        "review_rating": "1",
        "review_title": "Regards",
        "review_detailed_main": "Kalank on Bollywood 😂😂😂😂. Never ever watch it. It's totally a propaganda."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "sharmardivya",
        "review_rating": "5",
        "review_title": "5 rating just for songs",
        "review_detailed_main": "Very confusing movie. Whether he/she loves him/her or not so confusing. Who loves who. Songs are awesome. but movie is hard to digest."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "arunishankit",
        "review_rating": "1",
        "review_title": "This movie is literally a 'Kalank' of Bollywood",
        "review_detailed_main": "This Movie should only be watched if you want to punish yourself by sitting through 3hours of torture. Bland movie, extremely slow, boring,monotonous with weak and predictable story with dose of overacting."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "anilsiradhana",
        "review_rating": "1",
        "review_title": "Kalank is really a kalank",
        "review_detailed_main": "Worst movie of2019 please don't waste your time..thank me later"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "attymumbles",
        "review_rating": "1",
        "review_title": "Waste of time ...please don't watch",
        "review_detailed_main": "The storyline ,screenplay is very very bad . It seems that the movie has 1980s plot .... Totally rotten ... Same old same old ... You will be doing a favour to your senses by avoiding this disaster . Such disastrous movies are expected from this production house ... Please avoid ... Don't waste your time on this horrendous movie."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "Invisible_Soul",
        "review_rating": "10",
        "review_title": "Beautiful enchanting experience",
        "review_detailed_main": "I was about to watch this movie first day first show and for some reason I couldn't . By next day it was hammered by our Pseudo intellectual Critics so much that whoever said otherwise everyone labeled it as paid reviws. After long really beautiful epic love story is shown on equally beautiful canvas . A epic love story that's takes you with them in their love journey with beautiful rhythmic poetic dialogues and equally enchanting canvas. They hammered it for it's rhythmic dailogues seriously a love story with Muslim backdrop will not even have shayrana andaaz. Mirza Galib poetry used to flows in viens of mostly everyone during that era specially in Punjab ..One thing disappointing is screenplay which doesn't flow smoothly ..But this is minor crack in otherwise Masterpiece it's beautiful enchanting experience for any die hard romantic..Varun Madhuri acting so top level ...Every nuance of their character so we'll depicted by them .. Certainly best performance of Varun ...Rest Alia Kunal Adi all gave such good performance...I am glad I watched this on big screen ..I realized one thing Indian critics are not to be trusted just like politician .."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "lakshay359",
        "review_rating": "1",
        "review_title": "Unbearable",
        "review_detailed_main": "Watch this at your own risk.....,................................"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "pronobdas-80285",
        "review_rating": "1",
        "review_title": "This film itself is a Kalank in the name of MOVIE",
        "review_detailed_main": "Is it a movie ? No it is another disaster from Varun Dhawan.\n\nDialogue Choice is too poor. I don't know why the cast selection is rich !! Why Kiara does a movie like this? Why even Kriti shanon does perform in a item song?\n\nDirector doesn't have any idea what kind of vibe he wants to serve to the viewers.\n\nDo you actually think people will watch this movie because of Cinematography. You guys can copy from Bansali but you didn't born with the brain he has.\n\nDon't waste our time. Watch more movie before you made them.\n\nDISASTER"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "smartmoviebuff",
        "review_rating": "1",
        "review_title": "Anti Hindu portrayal",
        "review_detailed_main": "The movie is typical Bollywood set up and very slow."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "asharwaqar",
        "review_rating": "5",
        "review_title": "Baseless story wrapped up in glamor",
        "review_detailed_main": "The story seems like patches forcefully merged together. Lacks in acting by lead roles.. The good thing about this is the glamorous sets.. Cinematography.. And costumes. Too much money wasted for this forgettable average project. Not recommended"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "rupesh_594",
        "review_rating": "5",
        "review_title": "Not worth wasting 3 hours....",
        "review_detailed_main": "Kalank, a period drama, with lots of characters. Few positive facts about the movie: 1. Heavy sets and grand palaces. The lavish sets remind you of the Sanjay Leela Bhansali's grand sets. Art director has taken extra cautions while planning the set. 1940s India has been shown properly without any sign of modernity. 2. Music is the biggest USP of the movie. Background score and songs are unforgettable. Title song is so melodious with sweet and appealing voice of legends like Arijit, Shreya, Javed Ali..... 3. The story is good with twist and turns leading to the death of the protagonist. The end has been woven unpredictably. 4. Love affair between a Muslim boy and Hindu woman in 1940s India shown in a well mannered way. 5. All characters are given due importance. Their utilization has been done in proper way.\n\nFew Negative facts about the movie: 1. The movie revolves around the extra marital affair of second wife of a renowned Hindu press owner, with a Muslim boy who was born out of an illicit affair of her prostitute mother. The extra marital affair of Hindu woman has been shown without any objection from the society. No one talking about such affair in 1940s is indigestible. 2. Muslims are shown as short tempered, easy to tampered, mindless and aggressive. Merely saying that machines would displace man leads to riots. Communal violence, which is initiated for no political reason is bizarre. 3. The prostitute is living in an ornate fancy palace. The palace is build in between the water body and one must travel by boat to reach there. Bit showy. 4. India is always rich in its varied heritage. Classical music and classic singers are well known personalities of the ages. But here the singing is restricted to prostitutes only. 5. The animation team of the movie should work hard as the bull fighting scene is not upto the mark. 6. Length of the movie is the last but not the least factor that adds to its negative reviews."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "rpant-10691",
        "review_rating": "1",
        "review_title": "Its hell",
        "review_detailed_main": "I mean, I dont know why I saw this movie today in Netflix. How its rating is still 3.7.Unbearable movie it was. How dumb do they think Indian audience is."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "nagald",
        "review_rating": "1",
        "review_title": "Crap",
        "review_detailed_main": "Wasted time watching such an idiotic movie. Can't imagine they still make such crap."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "priyanshug-17662",
        "review_rating": "10",
        "review_title": "It's awesome movie that I have ever seen....it's epic",
        "review_detailed_main": "The content is very different from others movie....the love is that I liked very much....this full of drama and suspense... i just loved it...Varun just killed it....and alia is fantastic."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "lawsonfyk",
        "review_rating": "1",
        "review_title": "Super flop Movie",
        "review_detailed_main": "Movie has nothing to offer will not entertain or amaze you at any point runs very slow looks as if just made for time pass witch is hard to pass while watching the movie. Big Names but no gain an absolute disaster non of the actors are involved in the movie. Story is very bad. 0 star if it was possible."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "vishwjeetsingh-31814",
        "review_rating": "4",
        "review_title": "Given 4 star just for great music",
        "review_detailed_main": "\"Kalank\" is a classic example of style over substance. Despite its grand scale, elaborate sets, and a star-studded cast, the movie fails to deliver where it matters most: storytelling and emotional depth.\n\nThe plot feels unnecessarily convoluted, with forced drama and zero connection to the audience. The characters are shallow, their motivations unclear, and their arcs unconvincing. Even powerhouse performers like Alia Bhatt, Varun Dhawan, and Sanjay Dutt seem wasted in poorly written roles.\n\nThe dialogues, which should evoke emotion in a period drama, come across as overly dramatic and often cringe-worthy. The pacing is painfully slow, dragging the movie to an unbearable length.\n\nWhile the film is visually stunning, with beautiful cinematography and costumes, it lacks soul. A good movie needs more than just a glossy surface. The songs, though well-composed, feel shoehorned into the narrative without adding value to the story.\n\nIn summary, Kalank is a colossal disappointment. It's a prime example of how a movie can look grand but feel empty. Not worth the time or money."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "ghoshrakesh-64629",
        "review_rating": "1",
        "review_title": "Boring boring",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "sharmaankur-78102",
        "review_rating": "1",
        "review_title": "1 star is twice as much as it deserves, I need refund if possible.",
        "review_detailed_main": "Anyone who has rated it 5 or above is either lying or paid or too biased. Anyways here is what I think:\n\nGood: Costumes Set Songs\n\nBad: Script Screen play Direction Dialogue delivery Acting\n\nThis movie is crap on so many levels, first it has no logic throughout and on top of that it is boring beyond anything. Even my wife fell asleep who love all the Hindi movies irrespective whether it makes sense or not.\n\nThe movie is so cliche that in first 15 min you know what is going to follow. Then the acting is mundane.\n\nMy advise: please save your time and money. I would have much rather enjoyed flying a paper plane of the 1000 Rs. bill I spent for movie."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "Sonia2223333",
        "review_rating": "1",
        "review_title": "Save your time, money and mood",
        "review_detailed_main": "Um.. Did that joker karan really just try to turn that nepokid who looks like a permanently disfigured chucky doll into aishwarya rai??????!!!! Only thing missing was a homosexual angle to this hatebuster. Every other angle present in any movie has been thrown in otherwise in this absolute kalank ranging from illegal kid, prostitutes, two wives, hindu Muslim, you name it.. Pls save your intellect and your money."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "jacobmazur-09701",
        "review_rating": "1",
        "review_title": "kalank",
        "review_detailed_main": "Kalank of this movie is alia bhatt, varun dhavan, aditya kapoor. You should not watch this movie. It is an abonimation. Alia bhatt as usual inviting everybody to show her innocence that she is related to mahesh bhatt. Varun dhavan showing he is related to David dhavan. Arjun kapoor related to vidya balan. Sanjayt dutt as usual crying for attention as he is the son of legendary sunil dutt. sonakshi sinha is crying as his father is shatrughan sinha. director only cast madhuri dixit in the right place but cut all her because according to amitabh bachchan every woman who gets married in bollywood is a pariah. It is a useless bollywood movie. nobody should ever watch this movie. it will be a kalank on you. aditya kapoor and aaliya bhatt looks as if they are experimenting in this movie. Their experiment is wondering about \"is this really what we are doing?\". Sanjay dutt as usual dont know what he is doing and declaring that he is the son of great sunil dutt. Varun dhawan needs to learn a lot apart from being son of david dhawan and having great relations in bollywood."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "rahulusha",
        "review_rating": "1",
        "review_title": "nonsense movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "shimmerstardust",
        "review_rating": "10",
        "review_title": "Actually not bad, amazing indeed",
        "review_detailed_main": "Its actually not bad, honestly I feel it's a new kind of cinema that's why we may not be understanding. But considering each aspect, I thoroughly enjoyed it, it was so different from what we have actually been seeing. So I would recommend everyone to watch it surely."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "checkoutkunal",
        "review_rating": "1",
        "review_title": "disaster",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "hessamlotfi",
        "review_rating": "3",
        "review_title": "Im not bollywood follower but I watched it casually",
        "review_detailed_main": "I didn't see this movie complete. By the time I turned on the TV, half the film was gone. So I wanted to change the channel, but the decoration, the costumes, and the beautiful restoration of the historic space, the detail of the film, and the type of filming attracted me. There are countless beautiful sequences and decoupages in this film, which is brilliant and engaging, showing that many groups have worked behind the scenes. I don't like or follow Bollywood, I think the actors are average and this story is very repetitive. Overall, fans of \"filmin taking\" and \"scene design\" will love this movie"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "radiahrivu",
        "review_rating": "1",
        "review_title": "Alia as disappointing as ever",
        "review_detailed_main": "Tired of watching movies with such budget where the cast is made purely because of nepotism and not proper capability. Acting below par, though the set looks well made and expensive. I miss those times when Karan Johar used to hire actors who are there based on their acting skills and not because they belong to famous families. Shame to see bollywood going down."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "mecthology",
        "review_rating": "1",
        "review_title": "True to its name",
        "review_detailed_main": "Kalank to hindi cinema. A must avoid if you like good movies."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "vivekmeena-02752",
        "review_rating": "1",
        "review_title": "Waste of time & money",
        "review_detailed_main": "The worst movie i have seen after roy 😡 dont go to watch this"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "malikmusman-28568",
        "review_rating": "1",
        "review_title": "Bakwas Hai Sab Kuch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "svxjgzf",
        "review_rating": "1",
        "review_title": "Shameless Misrepresention of Muslims",
        "review_detailed_main": "The movie was okay but the thing that disgusted me the most was how the muslims are represented in the film especially varun dhawan, one moment he is praying Namaz and the next sleeping with prostitutes and dancing with them.\n\nThere is literally an item song after eid prayer not to mention in the masjid. Like how can indians/Bollywood can be so disrespectful about one's religion\n\nOverall they should do more research before representing one or just don't make one\n\n(One thing more muslims are not only the one who is wearing topi on their heads, Kajal in their eyes , taweez in their neck ,tasbeeh in their hands ,etc just do the research before representing one in the movie)"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "iamnoone-70934",
        "review_rating": "8",
        "review_title": "NOT THAT BAD",
        "review_detailed_main": "After watching kalank I can say that the film is not that bad.Yes the pace might be slow but the film is a visual spectacle.The climax of the movie is just top-notch. 3.3/5 for this"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "Barbatulus",
        "review_rating": "4",
        "review_title": "painful to watch",
        "review_detailed_main": "Bad direction, bad screenplay. visually nice with not great visually effects. actors are trying to lighten up feelings and interest for the story, but with bad direction and screenplay it is impossible. tv dramas can bring more fun and feelings than this."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "bangalisoundz",
        "review_rating": "2",
        "review_title": "Should have been SO MUCH better!",
        "review_detailed_main": "The sets were great, the acting and songs decent, storyline was half decent..but it all got ruined by the abysmal CGI! There was so much unnecessary CGI in this and so badly produced it made me nauseous! Why? Just because you can now? Throughout most of the movie I could see cringe worthy attempts at CGI driven sets and action and it really dragged this movie down for me.. storyline was generally ok, there really wasn't any surprises in any of the revelations and even Sanjay Dutt and Madhuri Dixit couldn't pull this movie out for me..avoid. To the people rating it high - the sets and costumes do not make a movie great, they should enhance an already great story to give it the right feeling."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "content_is_queen",
        "review_rating": "1",
        "review_title": "Very bad",
        "review_detailed_main": "This movie is very bad. It also shows Dharma shows NO effort in casting. They have their elite closed club of actors and actresses who can't act to save lives but Dharma will only consistently cast them. ZERO effort casting new upcoming actors. Such powerful production house has the capability to make a real difference. They can bring some amazing talent to forefront. Well what better can we expect from an arrogant Production house like this."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "bilal_riaz40",
        "review_rating": "1",
        "review_title": "Hit father Flot Son..",
        "review_detailed_main": "Varun now same future like IMRAN KHAN... he's look like going for Retirement soon.."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "lilyjhonson-76628",
        "review_rating": "2",
        "review_title": "Was it a Musical Drama with bad CGI? Not worth watching!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "beevenkat",
        "review_rating": "5",
        "review_title": "magnificent sets, lavish costumes",
        "review_detailed_main": "Madhuri is the chief tawaif of a lavish kotha whose doors r always kept open. It houses many ladies who r forever singing n dancing. She is mother to an illegitimate son, Varun, who hates her. This son is a talented blacksmith, hes also an expert at seducing ladies. Alia is eager to get seduced, tho shes married to Aditya. What happens next? Watch #Kalank for its multi star cast, magnificent sets, lavish costumes n some old fashioned dialogues. Aditya n Sonakshi have dignified roles n they perform well. Running time needs to be reduced by 35 minutes. Music is bad. Rating 2.5/5."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "dr-soumitradas",
        "review_rating": "1",
        "review_title": "Ultra boring",
        "review_detailed_main": "What a disaster...how could you make such melodrama with meaningless staffs..must deserved flop! How could someone even rate it 7 , some problem in their frontal lobe!"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "annaki-63739",
        "review_rating": "10",
        "review_title": "loved it even though almost 3 hrs movie",
        "review_detailed_main": "Loved the surreal effect in every aspect... dance, action, drama. Great music - varun,Aditya .you guys nailed it!! Kudos to Alia,what a natural crying...and mesmerizing beauty. All songs r hit... surprisingly impressed by our villain Kunal khemu...what a acting. Madhuri n Sanjay dutt didn't not have any role as such. Movie cud have been made even without them,"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "krishnajyotisarmah",
        "review_rating": "1",
        "review_title": "Worst movie of the year",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "schandrabxr",
        "review_rating": "1",
        "review_title": "Boring. Waste of Time and Money",
        "review_detailed_main": "Simply boring and repetitive story of early 80 and 90, wrapped in decorative KJo and SLB type filmy Sets and locations in the current golden era of experimental content oriented bollywood. Useless Bullfight VFX is even worse than Video games.Torturous Melodrama, Mindless Script, Sensless Dialogues, Soulless Love, Endless Climax. Film with such big star cast (All misfit & fake), it's only @kunalkemmu who looks bit real & impress wid his grey character. Biggest Disaster of the Year 2018."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "jubayerhossain-85473",
        "review_rating": "1",
        "review_title": "Just waste of time",
        "review_detailed_main": "This is a baler movie. It wasted my time. If you show this movie, you will just waste your 2 hours and 45 minutes."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "srsasia",
        "review_rating": "1",
        "review_title": "A Movie to appease PAKISTANI & Muslim Audience and spread Love Jehad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "ceb-26047",
        "review_rating": "1",
        "review_title": "Torture by word \"Mohabbat\"",
        "review_detailed_main": "Complete torchure with urdu words and varun performance was meeting the expectations we have from him"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "yashkaran-85409",
        "review_rating": "1",
        "review_title": "Leave your brains out while watching this one",
        "review_detailed_main": "You will wonder how could someone has such amount of money to waste on a story which id pathetic and senseless but bollywood does it infact the movie name suites itself it is truly a kalank for Bollywood."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "marjanhossain-53552",
        "review_rating": "3",
        "review_title": "Kalank: A Cinematic Disappointment",
        "review_detailed_main": "Kalank promised to be a grand period drama with a stellar cast including Varun Dhawan, Alia Bhatt, Sanjay Dutt, Madhuri Dixit, and Sonakshi Sinha, but unfortunately, it fails to deliver on almost every level. The movie's biggest flaw is its weak and unconvincing storyline. Despite a compelling setting, the plot is melodramatic and full of clichés, offering nothing new or original.\n\nVarun Dhawan's performance as Zafar feels uninspired and lacks the emotional depth required for such a character. Alia Bhatt's character, Roop, is poorly written and lacks any real substance, leaving her to struggle with a role that doesn't give her enough room to shine.\n\nMadhuri Dixit and Sanjay Dutt, two legends of Indian cinema, are sadly underutilized, with roles that are more about creating spectacle than adding anything meaningful to the plot. Sonakshi Sinha's portrayal of Satya was also forgettable, and she hardly makes an impact.\n\nThe film's visual appeal is the only thing that stands out, with extravagant sets, costumes, and music, but even that doesn't compensate for the lack of substance in the script. The dialogues feel heavy-handed, and the emotional moments feel forced rather than heartfelt.\n\nOverall, Kalank tries too hard to be an epic but falls flat due to its shallow characters, predictable plot, and lackluster performances. It's a film that promises much but delivers very little."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "aquafeb",
        "review_rating": "8",
        "review_title": "Worth the entertainment",
        "review_detailed_main": "People rating this movie under 5, just understand why it woudk ever be belwo 5."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "Rishav1987365",
        "review_rating": "5",
        "review_title": "Decent yet Underappreciated film",
        "review_detailed_main": "The setting was good and the story was actually good but couldn't gain the favour of mainstream audience as lacking in promotions and conduction the true nature of the setting and engrossing the audience till the end where the real fun begins.I would like to appriciated Varun Dhawan , Aditya Roy Kapoor and Sanjay Dutt for their roles and how magnificently it was executed not to forget Madhuri Dixit for her small but significant impact to the story line."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "thunderbuddies",
        "review_rating": "4",
        "review_title": "Despite a decent premise, horrible screenplay and direction letdown the entire film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "chiremath",
        "review_rating": "5",
        "review_title": "Kalank's okay.",
        "review_detailed_main": "When I watched Kalank for the first time, it was okay. But it wasn't a perfect movie! The cinematography, the VFX, and the locations weren't good! This movie was worse that Bahubali, which had great VFX, cinematography, and locations! The cast members like Varun Dhawan, Alia Bhatt, Sanjay Dutt, Sonakshi Sinha, Aditya Roy Kapoor, and Kunal Khemu's performances were satisfactory. But Madhuri Dixit was amazing, flawless, and gorgeous! She was the only actress, who was very talented in Kalank! I honestly watched this movie for Madhuri Dixit! I got to know that Madhuri Dixit's role was originally given to Sridevi, who was one of the greatest actresses in Indian Cinema! Madhuri Dixit got this role when Sridevi suddenly died! Anyway, Madhuri Dixit's performance was absolutely fabulous! The only obvious and positive thing in Kalank was Madhuri Dixit's amazing performance! The remaining things in the movie were not good. The storyline wasn't great, and some character arcs were not engaging. The movie would have been amazing if the director did a great job on everything. S. S. Rajamouli and Sanjay Leela Bhansali would be considered as 2 of the best directors of Indian Cinema since their movies and direction were too fantastic! The director of Kalank could have learned something from them! Anyway, Kalank wasn't a box office blockbuster since it obviously failed to entertain the audience. I wouldn't watch this movie again since it was not a great movie. Now, don't watch this movie unless you are huge fans of the lead actors in Kalank! I have watched this movie for Madhuri Dixit only because I am a huge fan of Madhuri Dixit. She is the only actress, who is amazing in Kalank! This is my honest review of Kalank!"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "malikmusman-28568",
        "review_rating": "1",
        "review_title": "Bakwas Hai",
        "review_detailed_main": "Bahut Bakwas Hai Film.Gandi Film Hai. Flop Hui Achha Hua Flop Film."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "atynasr",
        "review_rating": "3",
        "review_title": "well-made",
        "review_detailed_main": "The film was well-made and had an interesting story, but it was anti-Muslim!!!!"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "SomitraSR",
        "review_rating": "1",
        "review_title": "Very Disappointing Movie",
        "review_detailed_main": "Hole Story is totally copies from other movies. Time Wasting ."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "hverma26",
        "review_rating": "1",
        "review_title": "A fine movie with a weak plot!!!",
        "review_detailed_main": "This movie has everything. Good music, acting, screenplay, cast, great locations but it lacks a good storyline. The movie is not as bad as the reviews suggest."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "lakshnj",
        "review_rating": "10",
        "review_title": "Awesome movie - lavish sets",
        "review_detailed_main": "The movie sets, the costumes, acting of the lead actors were all awesome. The sets were lavish and was a treat on the large screen. Surprised by so many negative comments, when stupid shahruck and salmon khan movies get ranked much higher - maybe public are not rating movies realistically - I have started to get a feel that clearly user review ratings of Indian movies are not realistic on IMDB.\n\nAlthough It is 8* for me, I had to give it a 10* to improve the IMDB rating of this well-made movie."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "aliarbaz",
        "review_rating": "1",
        "review_title": "It Starts Bad, Followed By Worse And End Made It All Worst.",
        "review_detailed_main": "Whenever Used To Think That Now A Love Story Is Between A Boy And A Girl But Our Bollywood Made It Complicated by Putting Hindu Muslim Angle Which More Complicated By An Unjust Relationship.\n\nThey Are Just Deteriorating the Purity of Indian Cinema."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "dkdeepakhatri",
        "review_rating": "1",
        "review_title": "Kalank is kalank at all !",
        "review_detailed_main": "Well disappointment at all . Huge piled actors & actresses but fails to make grip from start to end . Waste of time . Poor story"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "rifatuls",
        "review_rating": "1",
        "review_title": "What was that? Great Disappointment",
        "review_detailed_main": "If this was made for a showdown of stage creativity and art, I would say okayish! But still who has got fountain in their living room being a dance teacher.\n\nNow let me justify the score I have rated with, 1!\n\nWhy does Varun Dawan even act! What was that. A pathetic character, and acted in pathetic way as well.\n\nThe story was not of love properly, not of war, not even of vengeance! It was full of time wasting material. Although the screentime was toally on Alia Bhat, she did act well, along with good performance from Aditya and Sanjay Dutt. But overall the story made zero sense to me! In what world such story takes place and told in a mediocre way.\n\nThe writer and the director needed to spend more time to make it more realistic rather than just wasting the budgets in set designs and useless characters."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "raghavchaudhary-52388",
        "review_rating": "3",
        "review_title": "Unbearable",
        "review_detailed_main": "Kalank is a perfect example of wastage of money, talent and resources. An unbearable storyline and lengthy torture film's duration is almost 3 hours which is one of the main reason of backlash of this dud drama"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "pagalbhabatosh",
        "review_rating": "2",
        "review_title": "full flop",
        "review_detailed_main": "Don't spend on ticket for this movie, full movie is boring. valueless love story from director. except alia all the actors are doing over rated on this movie."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "karansinha88",
        "review_rating": "10",
        "review_title": "Story of Eternal love that transforms hate",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "wasrehman",
        "review_rating": "8",
        "review_title": "Watch it for yourself!",
        "review_detailed_main": "I really don't get all the hate this movie is getting on here. I really enjoyed the movie, nice story, gorgeous visually. Watch it for yourself, and be the judge. It's amazing!"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "mayaraam",
        "review_rating": "10",
        "review_title": "Kalank ya Mohobat?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "gaurav-47405",
        "review_rating": "10",
        "review_title": "Boring script",
        "review_detailed_main": "Boring sceipt.....just a waste of time to watch the movie"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "khanatheraziz",
        "review_rating": "8",
        "review_title": "Stellar performances and an awe inspiring visual experience",
        "review_detailed_main": "One of the best movies of 2018. Definitely worth a watch ! Specially the faceoff between Madhuri and Sanjay Dutt."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "samgarnica",
        "review_rating": "10",
        "review_title": "Must watch!!!",
        "review_detailed_main": "Some people are criticizing this movie but i don't why they are. It is must watchable movie of 2019. Also alot of hardwork is there in this movie at least appreciate their efforts."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "aashikathegreat",
        "review_rating": "10",
        "review_title": "JAANDAR SHAANDAAR MOVIE",
        "review_detailed_main": "Dont go for bad comments....must watch a movie you'll enjoy it #interestingStory #awsomeSet"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "ranayoussef-68163",
        "review_rating": "10",
        "review_title": "Loved it!!!",
        "review_detailed_main": "I just went to see this movie and completely fell in love with it. Madhuri ma'am was as gorgeous as ever, Sanjay captured everyone's attention when he was on screen, Sonakshi and Aditya were amazing in their roles, Alia was flawless like always, and Varun portrayed Zafar perfectly. It had beautiful sets, an engaging love story, and top notch performances. Ignore any of the haters and get yourself a ticket to this awesome movie!"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "twinklepethad",
        "review_rating": "10",
        "review_title": "Was great",
        "review_detailed_main": "It was actaully a very good film with new content. Thought I wont like it, but ended up loving everything, the acting by Alia and Varun was new and refreshing, and the cinetamography my God, was good! A must watch guys, if you want sth new, Not relatable today, but such an amazing movie"
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "nehal-93557",
        "review_rating": "8",
        "review_title": "Patience wins the game!",
        "review_detailed_main": "This is a brilliant film - it's only negative side is that has been slightly elongated with drama that does not need to be there. Brilliant costumes, excellent dialogues and bonus points if you enjoy Indian Classical Music. Only a one-time watch in the cinemas, be sure to budget the full 3 hours for this film."
    },
    {
        "movie_id": "tt6988116",
        "movie_name": "Kalank",
        "movie_rating": "3.7",
        "review_username": "abhishekojhaji",
        "review_rating": "8",
        "review_title": "Same Old Story, Boring Screenplay",
        "review_detailed_main": "This Film Offers Nothing New , Old Wine In New Bottle But This Time You're Not Going To Feel This Wine , This Wine Is Tasteless And Poor . I really wanted to know how these actors agreed to do this pathetic film . Skip this one , wait for Endgame"
    }
]