[
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "erisedwitch45",
        "review_rating": "4",
        "review_title": "The ending?? :( (Spoiler in review)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "Lover-UD",
        "review_rating": "6",
        "review_title": "An entertaining action flick with worst possible ending!!",
        "review_detailed_main": "Starting from Wanted, Salman started a special genre of movies which stars a hero which is Crazy, Insane, carries a unique attitude and style of doing things, have a punch line always with him, moves his body in a fashion, no one ever did and creates an aura around him, which overshadows all the other characters in the movie. After Dabang and Ready which just manages to maintain this, Bodyguard takes the Wanted tradition to a new height, spare the ending of the movie. Salman as a Bodyguard named Lovely Singh has a bookish and sincere approach to his job with all the strange rules, which certainly brings smile on your lips. His \"Ahsaan\" dialog, his breathing biceps as a dance step and his ruthless beating black and blue to the Gundas surely makes his fans jumping on their seats.\n\nThe movie starts with a sensational entry followed by a blasting action sequence of Salman. From the very beginning movie creates its own aura that continues in spite of few longer romantic sequences until movie reaches to last 15 mins. After Salman finishes and breaks down all the possible danger to Karina it was all well taken by the audience, whistling, applauding and shouting in praise and madness.\n\nNobody would have even imagined about such a pathetic ending of a nicely directed movie by Mr. Siddique which seemed to be handed over to some other writer for its ending and director for last few scenes. The end of the movie can very well be the last fighting sequence and everybody in the theater would have gone back with dancing legs, a smile and a tickle about such a Strange but lovable stud hero. Movie completely lose its track in its last 15 mins. Why these twists and turns when movie is actually not intended to be made in such a way.\n\nNot to forget, mentioning the marvelous action in the movie which undoubtedly is the best in bollywood in last decade. Music as well as background score is also a positive for the movie. Overall it was again a Sallu movie and quite and entertaining one.\n\nCut this ending and release it again with an alternate one."
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "marndibiswa",
        "review_rating": "5",
        "review_title": "Its all star power to blame.",
        "review_detailed_main": "Bodyguard seems to be a follow up of Dabbang and Ready, Salman Khan's previous blockbuster but it seems a more messy mash up of these earlier versions. The film didn't show any promise neither from its trailer neither when the reel starts rolling. As the painfully hilarious proceedings go on there is no way you can concentrate except to wonder how far Salman's star power is going to drag this film. It is evident that the director has put all his test on Salman and played a rather bold step. Not surprisingly the movie will be a crowd pleasure for many a viewer but there a re many who will be fatigued by its lack of plot and tactless story telling.\n\nMeant to be a love story the movie is as predictable as a five year old can imagine. But the most painful scenes are the incessant annoying jokes from the side characters and the naive portrayal of the lead character.May be fat jokes were never this bad. In this male star power driven film there is definitely no space for Kareena Kapoor to show her talent. Whatever but as time passes by and peril hovers on the female lead the action scenes we are fed is not that brilliant too. As many previous films have proved that hero worship is not bad for box office but at least they should be made credible enough for all to believe or at best convincing. But no Bodyguard is a far cry from this and instead we get is a lot of crappy and cheap special effects. And the last and the most important scene of unbuttoning Salman's shirt was by far the worst creativity anyone can come up with. Its really sad that after so much of crazy mishaps there was some substance at the climax of the film. Though the writing at the climax should be praised it is too less an too little after two hours of stupidity.\n\nAt least Salman's charisma works enough for you to wait till the end. Its surprising that a single performance can put such leverage to a film as such. And a special applaud to the song 'Teri Meri' which was much better than all other mediocre tracks. At the end it doesn't seem fair that a single star and a single song put so many audiences through the film. May be such case shouldn't be criticized rather appraised for such a daring feat."
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "tathagatverma-981-497310",
        "review_rating": "3",
        "review_title": "Unbelievably intolerable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "arvindkrb",
        "review_rating": "1",
        "review_title": "Just Bakwas",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "shubhamkat-ever",
        "review_rating": "1",
        "review_title": "total full of CRAPS....",
        "review_detailed_main": "this is the worst i could ever imagined...stale story line up, stale expressions,awful and mindless south Indian action... Bodyguard featured Salmaan...after giving a crap like Ready what anyone could expect from this.this movie is better than ready but not upto mark of the star cast.... movie is inspired from a a south Indian movie and also from one of Hindi movie's love story... movie contains action,comedy, drama but the only good part in the movie is the music....few songs are good n hummable....this movie is a total waste of money and time because it is awe-fully bad n STALE... so better keep out of this one....."
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "bobbysing",
        "review_rating": "",
        "review_title": "It may earn many more crores than before, but for me its like playing with the innocent loyalty of your millions of fans.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "himdesai",
        "review_rating": "7",
        "review_title": "A love story which happens to be a masala movie.",
        "review_detailed_main": "After Dabbang and Ready, this film is going to be third consecutive feather in Salman's cap.\n\nI felt a little disappointed with the treatment of the movie. The screenplay rushed at an odd pace. The first half was intriguing and speedy, but the second half stammers a bit. Again, in the last 20 minutes, we see a hurricane of emotions.\n\nThe movie has all the proportionate elements of a Masala Movie, but I seriously felt a letdown in the humor quotient of the movie. The so- called \"Tsunami Singh\" was a high disappointment, rather than him, his T Shirts looked funny. The dialogues were above average.\n\nA die-hard Salman fan might get disappointed, but it was a pleasure seeing Salman in a romantic movie; that too; was totally unexpected. Music boosted the movie, due to which, the faulty screenplay gets sidelined.\n\nSalman Khan is in top notch here. Kareena is back in the form. Mahesh Manjrekar, Aditya Pancholi, Raj Babbar are remarkable. Rajat Rawail as Tsunami is a letdown. He acts well sans comic timing.\n\nEditing by Sanjay Sankla is good, he manages to keep the movie on track in spite of futile screenplay. Cinematography by Sejal Shah is marvelous.\n\nHimesh Reshammiya has lived up to the expectations from the fans. Background score from Sandeep Shirodkar is top class.\n\nAfter watching this one, my recent favorites from Salman goes in the following order. 1. Dabbang 2. Bodyguard 3. Wanted 4. Ready\n\nFinally, watch it! Even if you are not a Salman Khan fan, you wont regret watching this one."
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "ram-c-madan",
        "review_rating": "1",
        "review_title": "If There Were A Nobel For Movies That Make You Want To Die This Wins It All",
        "review_detailed_main": "Body guard is undoubtedly *the worst* movie of all time (including Tollywood Hollywood and any other wood u can think of) .. this is one movie which deserves a negative rating ! I wish people wouldn't be thins kind with ratings.. This movie doesn't even come close to being rational . A person with the tiniest of logic would want to pour acid in his eyes to relieve himself of the pain he just endured ... the movie has the random-est of beings and *the most terrible* ending of all time ! If i could i would go slap all those producers and action directors that directed this piece of cauliflower yes this movie is that bad ! The toy helicopters and flying actors just add to the misery of the rational audience . To sum it all I wouldn't watch this movie again even if i were paid a 1000 bucks for it !"
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "Somak21",
        "review_rating": "7",
        "review_title": "Get 'Ready' For This 'Dabangg' Bodyguard",
        "review_detailed_main": "From the last 2 years Salman Khan, the 'jaaneman' of mass-pullers has been giving blockbuster hits like Wanted(2009), Dabangg(2010) and that has not been a failure a single time. Wanted, Dabangg, Bbuddah, Singham - Bollywood has got into form of welcoming spectacular action flicks, so Bodyguard is nothing new for it but a Salman touch. But Bodyguard is not a Action flick like the above ones. It's main stream carries Romance but we can see a situation also where action is necessary, just like Ready. Like Ready, this one is also an adaption of south hit 'Bodyguard'. But the question arrives is Bodyguard better or Ready? Ready was a comic-con movie where there was no serious matter, but Bodyguard doesn't lack of that at all. Bbuddah, even being a spectacular film stood a 'so-so' in the box-office, Singham disappointed very much in both fields, so can Bodyguard be the most successful Action movie of this year? The Answer's 'Yes'.\n\nWhen it comes to being punctual and doing his duties perfectly, Lovely Singh is unmatchable. Taking great pride in what he does, he spares no effort in giving his everything to his profession.\n\nSummoned for an assignment of guarding Divya, the daughter of Sartaj Rana, a business tycoon. Lovely Singh accompanies her to her campus, but ends up rubbing her the wrong way with his over-protective nature ...and paranoia about security. She finds him to be a major obstacle in leading a regular campus life. To throw him off-track and get him out of the way, she comes up with a 'master-plan'- that of trapping him in a fake love affair. 'Once he's smitten by the girl of his dreams and is reveling in his new-found romance, he will leave us alone, and we shall be free to do our own thing unhindered', says Divya to her friends.\n\nShe becomes an anonymous admirer of his and starts hounding him, expressing her 'feelings' in no uncertain terms. Lovely Singh however proves to be a tough nut to crack, and it takes quite a bit of doing from her side to penetrate his fort-like exterior. But once she succeeds in doing so, he transforms into a completely different person. Divya is triumphant and is all set to relish her regained freedom.\n\nBut things take an unexpected turn when she learns a few things about Lovely Singh. Things that she could've never even imagined! And she soon finds herself trapped in a dilemma that she's unable to resolve! And with her, soon enough, Lovely Singh finds himself ensnared in a web of lies, trickery and deceit!\n\nOn the whole, Bodyguard is a successful tale of Love, Faith & Betrayal. Even the film is not an action movie fully, the action scenes are sure to rain whistles and claps and shouts. When you see Salman's entry with the title track, be sure that there will be no mercy for applause throughout the hall.\n\nSiddique's simple but effective story and screenplay has every essential present in it that can bring a rock-hard mood in the hero. Lovely Singh is the symbol of silence, toughness and roughness and the script helps enough to glorify it. The twist-in-the-tale in the climax, which is one of the most surprising ones appeared in recent times was a stunner that makes you forget everything but to concentrate on the movie. How Sallu was tricked by nearly every man he trusted even the person he was protecting throughout, Kareena's sudden change in emotion, the unique storyline and some few but awesomely stylish action sequences and moves makes Bodyguard a dream debut for any director. Just like Abhinav Singh Kashyap, Siddique just got himself a master-blaster at his first try.\n\nThe first half of the movie was just going by the story to come to the main plot but the second half was furious in parts and it totally abolished the flaws of the first part. The second part works in a respective manner and transcends conceptually to an unbelievable climax. There are some comic moments by Rajat Rawail & some tough moments by the hero himself which are joy to watch.\n\nMusic of this movie is a bit disappointing. The title track is perfect, no doubt. But other tracks are not so special. 'Teri Meri' is beautifully visualized and it can be a good pick.\n\nThis one should be counted in one of the best performances by Salman Khan. The always 'no-bakwaas', silent, sweet & tough in times Lovely Singh showed some guts and attitudes which are like the very first time in Bollywood. Lovely Singh overlaps Radhe & Chulpul Pandey this time. Bloody Good! Kareena Kapoor was pretty and stole some actually good moments. As this movie is mainly man-centric, Kareena's character can look a bit unimportant but as she's a good performer, she tried to not let us feel she was unimportant at all. Mahesh Manjrekar was disappointing. Aditya Pancholi in a cameo having a fistfight with Lovely was commendable. Rajat Rawail gives some laughs. Raj Babbar had nothing much to do. Others like Hazel(extremely beautiful girl), Asrani, Mohan Kapoor etc. were okay.\n\nVijayan's action will yet again steal the awards this year, only if Ra. One & Don 2 doesn't compete such well. BGM by Sandeep Shirodhkar were perfectly situational. Art direction by Shailesh Mahadik & Monica Angelica Bhowmick doesn't catch eye. Editing by Sanjay Sankla is appropriate.\n\nSallu's his intentions directly indicated that Bodyguard will shake the box-office for a big time and I'm sure he will pass with flying colors. Bodyguard is a must-watch for the die-hard Salman fans and those who are entertaining movie lovers, this one's a certain dish that they would lick fingers after finishing. Final verdict 'Khud Pe Ek Ehsaan Karna Ke Bodyguard Ko Miss Nahi Karna'."
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "Hurdy_Gurdy_Man",
        "review_rating": "1",
        "review_title": "One of the worst Hindi films I have seen in my life",
        "review_detailed_main": "If ever there was a film which was a shining example presenting how a director \"drops the ball\" once he smells big money and a way out of the congestion and claustrophobia of regional cinema, all made possible because a star with a humongous fan following took an interest in his screenplay, one need not look any further than Bodyguard. In his review of Ready, Raja Sen wrote, 'In this latest film, Khan seems to be pushing his own rather frightening envelope -- \"How little can I get away with?\" \"Will they pay to just watch me smirk?\" \"Can I do this scene campy and that scene straight?\" \"Will the audience eat up random groin thrusts if only I use the hilarious word 'peoples' over and over again?\"' But maybe Sen should have reserved these lines for a far more deserving thing which was to be served only a few months later.\n\nAt least in Ready, Salman was in his element. His sole strength as an actor and a performer lies in playing smug, self-assured, overconfident macho men with a knowing wink to the audience. Dramatic acting has never been his forte and never will be, since his overall attitude towards his profession and even personal life has always drifted towards imperturbable laziness. Unfortunately, Bodyguard requires the male lead to emote. It asks of him to play a simple-minded loverboy who goes through near-heartbreak at least twice and also a mature man in the last third who is now father and sole guardian to a child. What was going to happen?\n\nBy virtue of being a near-remake, Bodyguard inherits all the demerits of Kaavalan. And by letting go of all artistic ambition and control, Siddique lays a load of as many shortcomings on top of it. The combined effect is nothing short of monstrously brain-numbing. In Kaavalan, to his credit, Siddique created a believable set of character relationships and obtained fine performances out of all actors. In Bodyguard everything seems to be on autopilot. Here is an intro song number for the hero, there are couple of action scenes which present the hero to be almost God-like, add a fat guy who is expected to make audience laugh simply by the benefit of being what he is, make the heroine's reason for falling for the hero even more illogical then the original, and completely edit out the relationship between heroine and her best friend. The stunt work is inane, the dialogues are lame, the graphics are astoundingly shoddy for a big-budget 2011 Hindi film. In fact the whole mess reeks of hasty filming and haphazard post-production. I remember that prior to the release there were concerns in the industry circles about the lack of publicity and a lot of work on the final product still remaining till the eleventh hour. Of course, now it has all been forgotten due to obvious reasons.\n\nHow this became such a monstrous hit is unbelievable. But what's happened has happened and nothing can be done about it now. We just have to ensure now that this film is forgotten from the minds of viewers and also discourage potential viewers from viewing this and running the risk of damaging their sanity."
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "krishnashivakumar",
        "review_rating": "8",
        "review_title": "Excellent love story",
        "review_detailed_main": "This movie which i have seen so far might be the best movie of the year as i have not seen that much movies barring NOKJ,Aarakshan.I really enjoyed this movie from beginning to end.Initially when i saw all the promos of this movie i thought it might be an action film but it turned out to be more of a romanctic movie.I liked the story it seemed it very different at least towards the end from the usual love storys and thats a good thing.Even the comedy in this movie was very nice too.The music is very nice with the best ones being Teri Meri and I love you.The direction was very good too and the scenes were well executed.The acting was top notch.Salman gave a brilliant performance throughout the movie and in my opinion deserves the best actor award and i really believe that given a chance and also a good director he really can give more great performances like this one.Kareena has given a blazing powerhouse performance as Divya she has a very meaty role and despite Salman having the author backed role i think she really outshined him in a couple of scenes and i also thought she was very cute when she was acting as Chaaya .And the actress who plays Maya was also amazing inspite her role was a supporting one and i think she should win a lot of awards for this one.The little kid who played Salman son was quite convincing especially in the scene where he asks Kareena to be his mother.The action and stunt scenes were magnificent but got boring after a while.I also thought after the Desi Beats song in the second half i thought the movie had started to became more intense and interesting.Anyhow this movie definitely deserves to be watched."
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "bk_connection",
        "review_rating": "7",
        "review_title": "What to say...Hmmm",
        "review_detailed_main": "Is this movie good: Yes .....is it very good: NO....is it on same same level as Dabangg: NO....is it better than Ready: YES...!!!\n\nThis movie is very simple, it doesn't have any big plots or thinking material, just a plain and simple movie. Its definitely not one of Salman Khans's best movie. So what save the movie? it must be The big hype around Salman Khan and the Songs.\n\nI personally don't see Bollywood doing any improvement, they are now stealing stories and songs from South Indian movies and as we all know very few of these movies are good. Bodyguard is worth a watch, and much better than the Non-Brainer \"Ready\", but its not one of Salman Khan's best.\n\nThe Song \"Teri Meri\" is breath taking, beautiful song."
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "kothiyal-mukesh",
        "review_rating": "2",
        "review_title": "I really wanted this to be a good movie but...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "kumarakshay175",
        "review_rating": "1",
        "review_title": "What nonsense!!??!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "jishnu-jis",
        "review_rating": "2",
        "review_title": "Remaking is not an easy business",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "vivek0960",
        "review_rating": "2",
        "review_title": "body guard-5/10",
        "review_detailed_main": "all hopes end in vain.The movie is entertaining in patches that too only in first half of the movie.second half is disastrous.no any strong plot,emotions too not up to the mark.movie just seems like the mix of 2-3 movies in particular.The only saving grace of the movie was khan's\n\nacting.khan is good,Kareena is average.even villains only looks like dangerous but they r never threat to our hunk.new comer Hazel Croney was good looking.Songs of the movie was very good.in short bodyguard is not even capable of guarding his own movie at the box office.It seems like that khan is badly obsessed with Telugu movie.he should look forward to act in better movies.not every movie is DABANGG,we know that.Go for the movie if Ur a hardcore khan fan."
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "virindra",
        "review_rating": "7",
        "review_title": "Second half is really worth suffering the first half.",
        "review_detailed_main": "Salman Khan is playing the role of a bodyguard, in this humorless movie with stupid action scenes. He gets introduced to be a hard stone man who lets his opponents pee in their pants. How, dancing? This guy can't dance. He is no Hritik Roshan. He still is this stiff man who cannot dance and who cannot act in a mature way in the first half.\n\nThe movie is filled with stupid rhyme jokes that are not funny. Like: waiter I see you later.\" Who wrote these lines? They are very dated. This bodyguard is wearing an earphone, why? He isn't communicating to anyone. He wears sunglasses inside, why? Salman Khan is driving in a bus to go to Kareena Kapoor. I thought this man who was running towards the bus, calling \"tupperware\" was Govinda. It amazes me how Bollywood can present Kareena Kapoor as a beautiful woman, when she isn't. She can act though. I was pleased to see Raj Babbar back in a movie. This man has a beautiful voice. The action sequences are not real. Salman beats a lot of guys up one by one in the disco, but after he beats up each guy, they disappear. Now it's not OK that a man from in the almost fifties falls in love with a girl who is in college or vice versa.\n\nI don't want to be all negative about this movie, so I mention one major plus: Aditya Pancholi! He's a great actor. And leaving all the jokes about Salman Khan aside, SK can play emotional and physical complicated roles very well. That's why it's a pity and a waste that he plays comedy movies and dances in songs. He should do what he's best at. He proved that in the scene where he said \"I love you\" to Kareena and thought he was speaking to Chaiya. Very beautiful moment, but he had to spoil it by bumping to the tree. The part of the bodyguard did not suit him, the part of this insecure man did. And that's very interesting. There is more about Salman Khan than meets the eye. Just face it and show it to us.\n\nAfter this park scene the movie gets mature and all together interesting. That's also the right environment for Aditya Pancholi to perform at best. What bothers me is that the similar action-scenes in old movies like Mission Kashmir or Blind Fury is much better than in this movie. And that's not good. Salman Khan already showed us he can act on a mature level in Tere Naam. If he would play in a movie without the stupid jokes, good action is not necessary, good story, mature acting, he could really amaze us, because Salman Khan is a complex actor who is not all around in acting. That sets a limit on his skills. But when he knows what his limits are and gets the best out of that, he could amaze more people than only a few he has reached so far. Don't travel the same road as JcVD, but learn from other's mistakes. As for JCvD, I really think he's making his comeback."
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "allypk2000",
        "review_rating": "3",
        "review_title": "Waste of time and money",
        "review_detailed_main": "The 'Try to be' remake of Dabangg but its all waste and crappy. One body guard trying to protect our heroine from the villain but there is one thing missing, the Story. There is no story in this film and to make some money out of it main attractions has been all the cast list. I would advice Salman Khan to stop experimenting because Dabangg was one family venture which went all excellently right but this piece of crap is down the drain. No doubt the action is good but acting is very poor and also the story line Two Hollywood movie stories cannot make one Hindi movie. Telegu action sequences OK acceptable. Salman's acting have also deteriorated in this movie other than Dabang. I give only 3 out of 5 to Salmans action and total movie acting rest of the cast sorry to say, made a mess."
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "kaya-tugba05",
        "review_rating": "6",
        "review_title": "Worth watching for the ones who like Bollywood",
        "review_detailed_main": "Although Indians are not good at action movies, they're really good at romance. This film is a mixture of both of them. Some scenes were not logical, for example when Lovely got private number calls again and again he chould have prevented it. Instead, he kept talking on the phone with that unknown person. Another illogical thing was that how he could fall in love with a person whose face he has never seen. Apart from these, the film is amusing and the music is so touching. It made me cry. Salman Khan is such a good actor. And so is Kareena Kapoor. To sum up, the film is worth watching though there are some illogical parts because it's a romance and Bollywood is really good at romance."
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "salshk",
        "review_rating": "1",
        "review_title": "bad movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "nmjoshi123-147-770845",
        "review_rating": "10",
        "review_title": "Salman scores hat-trick with 'Bodyguard'",
        "review_detailed_main": "The Rockstar has scored a hat-trick with his third consecutive Eid release with the first two films being 'Wanted' and 'Dabangg'.\n\nThe film portrays Salman as a bodyguard who looks robust but is tender and romantic at heart. Produced by his brother-in-law Atul Agnihotri and sister Alvira, 'Bodyguard' has all the essential elements of a blockbuster film.\n\nKudos to filmmaker Siddique to have presented Salman Khan in a way never seen before! And the action sequences are breathtaking. Incorporating the tried and tested formula of romance cum action, director Siddique has been able to churn out a thriller that keeps you glued to your seat until the very end. Coming to the movie~ Salman Khan Has Developed An Art of Delivering a Performance exactly d way audiences expect from him..first of all dis movie isn't out an out action flick..Its an Emotional Love story with a tinge of Action and Comedy.Surprisingly Kareena Kapoor's role is equally meatier(Rare sight in a Salman Khan film).she has delivered a very gud performance..Salman's Character will make u laugh and also cry.Another Blockbuster For Salman ,Second half will blow you with the eternal emotional touch .. some may make you cry also ..First Half Is Good it prepares a plot for second even then it keeps you entertaining , But Second Half Was Amazing Will Keep U Guessing Whats Going To Happen Next U Have No Clue Until It Ends...Mark My Words Pre-Climax Will Surely Shock U...Best Love Story In Recent Times :)\n\n*The title track and 'Teri Meri...' are sure to rock the audience."
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "ambivert_idiot",
        "review_rating": "7",
        "review_title": "Want to feel the old bollywood? Just go for it.",
        "review_detailed_main": "If you are looking for a realistic storyline or movie with good dialogues, I will not recommend this movie. But if you want to see Salman Khan with an old classical Bollywood story, It might be a good choice for you. Some scenes are mood booster.\n\nAlso, it is a bit mixture of comedy with action. So not a wrong choice if you are unhappy and looking for a mood booster movie. I felt refreshed with a good smile after watching this."
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "amitshetty73",
        "review_rating": "3",
        "review_title": "Huge Disappointment",
        "review_detailed_main": "Before release I had massive expectations from this movie considering it had salman khan who is in golden form, top actress kareena kapoor and hit music ! Bodyguard was huge letdown - as nothing is good in this movie except music ! Performances - Salman Khan is not up to mark in this movie. He was average. Hope he does better in next movie. Kareena Kapoor was okay. Villains were funny than scaring. Rest provide average support except Rajat Rawail who was horrible.\n\nStory, Direction all were pedestrian. Music was highlight of movie.Especially Teri Meri And I Love You song.\n\nSalman is having great run but such movie will hamper his golden run as audiences today are unforgiving if u gave them bad products. Wish best for him in Ek Tha Tiger and Sharekhan and he will come back to form again.\n\nIn Other Words, Bodyguard is huge disappointment 3/10"
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "mohak-narula",
        "review_rating": "",
        "review_title": "sucked big time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "chandanrajat",
        "review_rating": "1",
        "review_title": "Pathetic and Terrible",
        "review_detailed_main": "bodyguard is so bad that i wanted to slit my wrist and throat while watching the movie... For me this movie takes the Oscar for bad action bad comedy bad story and worst acting.... those Tsunami(fat)jokes in the name of comedy were awe-full... more awe-full was the complete mindless action...come on salman fight like a human not some god... the story was worst... the script writer should be imprisoned for writing such a bad script...I really request the people of India to stop making these movies hit at the box office...Salman stop doing this mindless crap in the name entertainment... i am not a fan of salman but after watching this piece of crap i simply hate him"
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "myasser_home2",
        "review_rating": "3",
        "review_title": "Waste of time and brain cells *** spoilers ***",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "ddasedEn",
        "review_rating": "3",
        "review_title": "Cheap sense of humor. South Indian trash as usual",
        "review_detailed_main": "Cheap sense of humor. South Indian trash as usual. I watched this just because its new. But thank God, I watched it at home. I watched it because too many people were praising it for its stupid sequences. I watched it because too many people were praising it for its worthless film making. I'm shocked at how Taran Adarsh, an Indian film critic, journalist, editor and film trade analyst gave it a score of 4.5/5 and said: \"BODYGUARD works for varied reasons -- it has a simple, but captivating story with a dramatic twist in the tale, the chemistry between the lead actors is perfect and the music is well juxtaposed in the narrative. And we thought Taran Adarsh is a wise man. I am shocked at how the Indian film-goers have made it into such a big hit -- it broke many records upon its release. Within the first day of its release, it went on to become the highest opening day grosser as well as the biggest grosser ever for a single day, breaking the records earlier held by Dabangg, another Salman-starrer. The film set another box office record, netting INR102.86 crore (US$22.94 million) in its first week, thus becoming the highest opening week grossing Bollywood film. As of 13 September 2011, Bodyguard has grossed INR215 crore (US$47.95 million) worldwide, and has emerged as Bollywood's second highest-grossing film ever. It is also the highest-grossing Bollywood film of 2011. This is a joke."
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "ankitgokani",
        "review_rating": "7",
        "review_title": "I would go with 3.5/5 worth a watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "zorro_3105",
        "review_rating": "5",
        "review_title": "A love story with masala",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "brij-raychanda",
        "review_rating": "6",
        "review_title": "I will only say that, \"Khud Pei eek ehsaan Karna\u0085K is movie Pei koi ehsaan Na karma\u0085\"",
        "review_detailed_main": "If you are going to watch Sallu's film so you will get some good actions, his own lovely styles and comedies. After super success of 'Wanted', 'Dabbang' & 'Ready', Sallu comes with 'Bodyguard'. But this time movie fails to create his magic like before movies.\n\nStory: Lovely sing (Salman Khan) as the newly-appointed hot-n-happening bodyguard of Divya (Kareena Kapoor) who follows her everywhere from classroom till bedroom. To divert him from duty, Divya starts flirting with Lovely on phone posing as an anonymous caller. Until she expectedly falls in love with him.\n\nThis movie reminds us two other khan's movies. Somewhat of Aamir's gajini & Srk's k2h2.(No Karina doesn't die and not sallu falls in love with two girls..:P). Movie has nothing new to offer in any area.\n\nMany of us won't know that this movie is also remake. Director Siddique has made it in Tamil and Malayalam before. Don't know about before versions but this movie fails to expectation at some places like action scenes are good but some easily looks like computerized. Screenplay is also not much good. Movie should be edited because it looks long at many places. Some camera angles were best though.\n\nMusic and BGM is good and makes movie melodious at some places but I feel music of \"Teri Meri\" could be used at many places. Songs comes in between without any reason but its OK as songs are entertaining. Video of \"Teri Meri\" could be made much better than it was.\n\nActing of salman khan is only thing which makes movie watchable. He was perfect in every scene. Karina was as expected. But she was looking very good in some scenes and dresses. Raj Babar has given justice to his role. Aaditya Pancholi & Mahesh majrekar are wasted as they have nothing much to do. Rajat Rawail was unbearable only his tee's captions were good.\n\nAt all we can say if you are sallu fan then only you will like this movie. Because there is nothing good then sallu and the movie songs."
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "harry_star86",
        "review_rating": "2",
        "review_title": "Another love story with action starring Salman Khan & Kareena Kapoor.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "MovieInspector",
        "review_rating": "10",
        "review_title": "a superb romantic action film/drama that should appeal to absolutely everyone",
        "review_detailed_main": "Siddique, who actually wrote the story, screenplay and directed this film, has made a marvellous debut in the Hindi film industry.\n\nThe story, in a nutshell ( I won't give anything away) is about a very disciplined Bodyguard called Lovely Singh (Salman Khan), an orphan who is instructed by his boss to report to the same person his dad worked as and actually died serving, and that he is Sartaj (played by veteran Raj Babbar). Sartaj has a number of people out after him and so is worried about the security of his daughter, Divya (Kareena Kapoor or Bebo as she's commonly known as). Lovely is appointed as her bodyguard by who goes everywhere with her wearing his much talked about uniform that the mischievous Divya doesn't like him wearing. The content that follows is funny, highly emotional and has been garnished with some fine action sequences. Oh and IT IS NOT your typical cliché plagued kind of thing. That's what makes this movie so good.\n\nThe film is packed with good performances. It looks like Salman Khan will get more recognition come awards season next year for his performance. Kareena is surely a contender for the best actress awards too. Look out for the supporting actors and actresses, not least Aditya Pancholi who conveys so much through his eyes, the newcomer Hazel Keech who plays a very interesting character very solidly, film maker Rajat Rawail in his acting debut in a comic role (look out for the interesting messages on the front of his shirts) and Mahesh Manjrekar.\n\nThe music has topped charts everywhere, not least here in the UK where the BBC Asian downloads chart has been dominated by the track 'Teri Meri'in recent times, and it does stand out. 'I love you' and 'Desi Beat' are also very good tracks too and have also entered the charts in high positions.\n\nOverall: good cinematography, story, screenplay, music and performances by the whole cast. I give it a double thumbs up!! RATING: 9/10."
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "evan-brandao",
        "review_rating": "6",
        "review_title": "STUPID FUN",
        "review_detailed_main": "This movie is a masterpiece. The fight scenes in this movie put Rocky to shame. Not only does the bodyguard deliver epic movies, his shirt gets ripped off with a hose and this boosts his fighting performance to an all new level.\n\nThis is life changing fun for the whole family."
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "SumanShakya",
        "review_rating": "5",
        "review_title": "Bodyguard: a love story laden in Bollywood gimmicks.....",
        "review_detailed_main": "\"Bodyguard\" was the highest grossing Bollywood flick from the year 2011 and has been especially popular for its songs and action. For me it was more a love story laden in a familiar premise of family feud which is much contrived with some of the most unbelievable stunts. The story is quite predictable and the viewers are kind of ready for the end. But a curiosity of how the story would end makes this film quite fascinating. A nice pace, the way the film has been pictuarized, its technical aspects, and few songs also make it gripping despite a very ordinary story in has in its crux. Much of the storytelling is lost in the comedy in the beginning which I feel has been overdone and is also crude. Similarly, the action sequences with cardboard characters are also unrealistic which gives a tart feel to the film. In these sequences it was a pain to watch the movie. Overall, the gimmicks in the film made it famous among the masses, but the film is worth watching for the simple story which has been attempted to be presented with a slight twist. (Remove the story and songs, the film is not more than a crap burrowed from few successful movies) Rating: 1 star out of 4"
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "bigale",
        "review_rating": "",
        "review_title": "worse than bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "sanjay_267",
        "review_rating": "2",
        "review_title": "A Good Flick To a Watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "slaverist",
        "review_rating": "3",
        "review_title": "Worse movie still got hit worse actress showoff only",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "elvenninja",
        "review_rating": "5",
        "review_title": "Wasted Potential and a regular useless tamil action showcase with languages changed",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "siddharthgaur",
        "review_rating": "1",
        "review_title": "PEHLI PICTURE JISME MAI SO GYA",
        "review_detailed_main": "If you can tolerate this, than nothing can stop u from achieving ur goals"
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "morowainuibrahim-924-206580",
        "review_rating": "2",
        "review_title": "1 for Karina's Beauty in Title song and The Other 1 for The songs itself",
        "review_detailed_main": "Bodyguard is a remake of another south Indian blockbuster.The story revolves round a daughter(Karena) of a wealthy nobleman who secretly falls in love with her bodyguard(Salman).\n\nThe story is very simple but the problem is how the movie was directed.Director Siddique who directed the south Indian version and the Hindi version did a very bad job.The ending is also not logical.\n\nMy main problem with this movie is its action scenes.Salman can fight like a superhero with no superhero powers.The action scenes are OTT and Salman can fly,dodge bullet and jump from a train.The comedy was not up to the mark for a mas-ala movie\n\nWhat wonders me is that Bodyguard was the highest grosser in 2011 and all was due to Salman's star power and mainly festive period.And finally,Salman needs to start from scratch"
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "soooo_9",
        "review_rating": "10",
        "review_title": "Amazing movie",
        "review_detailed_main": "Amazing movie does not believe it STORY and performance Salman and Kareena were fantastic Bodyguard\" is a rousing example of Bollywood-style pure escapist entertainment. Handsome, muscular Lovely Singh (Salman Khan) -- an unlikely name for a martial arts superhero -- is hired by a business tycoon (Raj Babbar) to guard his beautiful daughter (Kareena Kapoor) from kidnappers. She understandably chafes at Lovely's intense surveillance and mischievously pretends via her cellphone to be another woman who is smitten by him -- only to realize she has fallen in love with him herself.\n\nworth seeing"
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "rehmaanfatahu",
        "review_rating": "4",
        "review_title": "Bodyguard is one time watch movie for all the Salman Khan fans!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "GaneshKSalian",
        "review_rating": "",
        "review_title": "Bodyguard is Salman's show!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "wildlife-ptech",
        "review_rating": "3",
        "review_title": "Weak film with lazy plot and.unfunny jokes",
        "review_detailed_main": "Rating\n\n3/10\n\nWeak film with Salman playing the same character he has always played. The jokes are unfunny, the stunts are so so while the plotting is cliched and lazy. Has nice songs. Kareena is ok."
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "shuz009",
        "review_rating": "10",
        "review_title": "Action+Comedy+an unpredictable ending=super hit!",
        "review_detailed_main": "The movie rides on Salman's star power and the hype created by the promotion of the movie. For the people complaining about the ending i ask you to decide whether you want a very boring and predictable cliché'ed ending or an unpredictable ending which actually surprises you. I think the best thing about the movie is the unpredictable ending The music in the movie was spectacular i would easily give it a 8 out of 10. The direction skills was rather good for a amateur director. In my personal opinion the movie didn't lack anything. The actors did really well especially Salman. I was expected this to be like all the other movies but the twist in the end is just so shocking and surprising.... D O N O T M I S S T H I S O N E ! ! ! !"
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "bravokw",
        "review_rating": "9",
        "review_title": "OverAll Entertainining",
        "review_detailed_main": "This is an average masala pack. although the storyline and few other things are not up to their marks but it is entertainment package. There are two main action sequences and both are quite good. Comedy with Tsunami Singh is also quite good. You can also put this film in romance genre too. Music of this film is average with couple of very beautiful tracks. \"Teri Meri prem Kahani\" is really superb. It could have much better impact if it has a proper sequence to play as it started with any reasoning. Salman is looking dashing as ever and Kareena is looking really gorgeous.\n\nThis is a good time pass movie you can't rate it boring at all."
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "shashi-harige",
        "review_rating": "8",
        "review_title": "Salman's action is unbeatable",
        "review_detailed_main": "OK, I am a core fan of Salman. I would say that the movie is a good watch until the end. The movie does have all that a typical Salman's movie has,mainly power packed Action,a power dialog, a song dedicated to Salman's character, and Salman's out of the world dancing. Even the other songs are great voiced by Clinton Cerejo and Shaan. Its not an out'n'out entertainer like Dabang but Salman's acting can be seen maturing with his age. Kareena is good as usual with her acting. The movie may not have the potential to break records set by Dabang and Ready but overall a good masala flick. I would say, the only -ve of the movie is the way the story ends, which could have been given a better twist rather than a very predictable one. All the Salman's fans out there will definitely like the movie."
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "gurvinder1801372",
        "review_rating": "10",
        "review_title": "A salman khan movie with a soul",
        "review_detailed_main": "Just came back after watching 'BodyGuard' and I can still feel the background-score of 'Teri Meri' track.\n\nLet me just brief you on the story. Salman is a top class trusted bodyguard working for a security agency. His next assignment is to be the bodyguard of the daughter of a man who has saved his life once. She doesn't like him initially, so she decides to play with his feelings by faking a anonymous secret admirer, but eventually fell in love with him. Will she be able to confront him and tell him the truth, will he be able to save her and how he try to find his admirer is what follows next.\n\nIts an out and out love story with the good mix of action and comic reliefs, and director has managed to a good job in establishing the conflict and constraints between the characters and the story. I was completely hooked up with the story, didn't get bored for a second and just couldn't predict the end of the movie, so kudos to the director for such good story-telling. Songs are good, 'I love you' is choreographed well with great build up to it, spell-binding 'Teri Meri' is easily the peak of the cinematography in bollywood, and all other songs looks great too. Needless to say, action in this movie is nothing less than Salman's previous movies like Dabaangg and Wanted.\n\nSpeaking of performances, its easily Salman's most intense performance in a while. He is morally unshakable totally committed to his duties, but that doesn't mean that he always has stereo-typical stone cold silence on this face. He easily plays ruthless bodyguard to Polite and committed to his master, vulnerable to his admirer and funny with other servants of the house. Don't want to reveal too much about Kareena's role in the movie, her character evolves through out the story, and she performs it with such an ease.\n\nUnlike most salman movies i have enjoyed in the past, this one has soul and an world of its own. To be honest,Salman's presence is biggest reason to why i have enjoyed this so much. He certainly has a lot of charisma and ability to engage you effortlessly. Go for it, you won't regret it, regardless of whether you are salman's fan or not."
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "alone-insid3",
        "review_rating": "10",
        "review_title": "Great Movie",
        "review_detailed_main": "I'm not gonna write an article that its not good, etc like people are saying, they are just stupid! This movie is best in my point of view, Action, Comedy & Style all things are in movie so people don't be mean! Salman Khan is acting good Kareena as always, good looking Action style is great New comer in comedy, good change Story is twisting & end is really changed, not same as most of the movies have Great Movie, Great action, people spend your time watching it & don't read useless comments because these people ain't getting a life! they want sex or pornography in movies which is not gonna make it a family Movie GREATEST MOVIE!"
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "vivekaggrawal",
        "review_rating": "8",
        "review_title": "Good movie with Salman at his REAL best... Romance, Emotion, Action and Love(LY)",
        "review_detailed_main": "Salman khan knows what sells... In fact, All Big B-schools should call him for a GYAN session. Mix lots of drama, emotion, action, romance and love original SALMAN style and what you get is BODYGUARD. Definitely better than READY and had substance. Very unusual ending... yet you will feel you knew this will happen in one way or other. The movie starts with stunts either only a G.one, Rajnikant or a Salman can do. The ending actually moved the movie from an average no brain entertainer to a respected level. The movie also boasted stars like Kareena (Phone girl) and Raj Babbar (he looks really old now days) to be mentioned in footnotes. Add to it Blackberry, Tupperware and many other surrogate adverts and it completes the $35million blockbuster."
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "asif-abbasi",
        "review_rating": "9",
        "review_title": "Excellent Movie",
        "review_detailed_main": "This is one of the very few Hindi movies which have all the \"Masala\" action that a Salman Khan fan needs. It has Action, Love and some suspense as well. Comedy wise the moving was poor, but overall an excellent entertainment for the weekend.\n\nAfter a couple of successful movies this one is another blockbuster in Sallu bahi's cap, and definitely worth watching. His acting is always tremendous, and he has show again that he seldom disappoints his fans. Salman, Amir, Shahrukh and Saif, quadrant of khan's is something that Bollywood will seriously missing 10 years down the road, because these stars have the aura to bring audiences to the cinema. Hindi Cinema would definitely be poorer with the absence of Khans."
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "athuljames1993",
        "review_rating": "10",
        "review_title": "Not Reaching Near To Its Original Malayalam Script",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "AvinashPatalay",
        "review_rating": "",
        "review_title": "A convoluted love story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "DICK STEEL",
        "review_rating": "8",
        "review_title": "A Nutshell Review: Bodyguard",
        "review_detailed_main": "With my limited Salman Khan filmography under my belt, I can't help but to compare Salman's Chulbul Pandey of Dabangg with that of his Lovely Singh (yes, his name is indeed Lovely) of Bodyguard, where the introduction to the character deserves an item song no less, with Katrina Kaif playing herself as an item girl allowing plenty of Sheila Ki Jawani references peppered in the film. The tone's pretty much set when Salman makes his biceps dance - yes you read that right - like only Salman knows how, and I honestly believe this will turn out to be a hit move on the dance floor just like how he jiggled with his belt buckle in Dabangg, or those catchy moves seen in Ready, and swaggered whenever getting the chance to.\n\nAs Lovely Singh the bodyguard for hire from Tiger Security, Salman Khan plays his stereotypical hero blessed with a heart of gold, with a simple objective in life to be the best that he can be in his job without compromise or distraction, where his asking for a favour is to advise his adversaries never to ask for one in the first place. And if his holding his breath with arms pumped wide isn't deterrent enough, he packs some serious power in his punch and kick to send opponents sprawling. Perhaps it's part age, part long drawn injuries, or even part rationale for the filmmakers to want to dabble with a number of visual effects, that the fight scenes here is sans the intensity seen in recent Salman films, and relied pretty heavily on cartoony effects to a larger part which on one hand toned down the violent nature of bone crunching, finishing moves, and on the other was made to look really artificial and missing what fans have turned up in droves for, watching their hero dish out some serious punishment to the bad guys. Think of it almost in similar fashion how kung fu got treated in Stephen Chow's Shaolin Soccer and Kung Fu, and you get the drift.\n\nwhile the moves may seem a little too green screen for comfort, some things remain as real as they can be, such as the unmistakable finale involving a bare bodied hulking Salman; in case you didn't know one of the highlights of his films is to see how filmmakers challenge one another to create unique ways of an excuse to turn Salman topless for some muscle flexing. But while the title of the film may be macho sounding and brings forth many conjectures about how one is assigned to protect one's employer, in this case Lovely is being hired to protect the only daughter (Kareena Kapoor) of his benefactor Sartaj Rana (Raj Babbar), in actual fact it's far more a romantic story than an action one, with limited set action sequence on display.\n\nThe core of the story revolves around how Kareena Kapoor's college girl Divya and her best friend (Hazel Keech) try so hard to shake Lovely off their backs, with Divya devising a plan to distract Lovely from his duties of protection and providing physical training by adding some romance into his life. Posing as a secret admirer and calling constantly from a private number to flirt with Lovely, it's a classic tale of being careful of what you're wishing for, as it turns the simple, sincere Lovely into believing that someone anonymous actually fancies him, and between the two strike up some real feelings with our A+ bodyguard none the wiser of the real identity of his \"Chayya\".\n\nRomantic die-hards will swoon over the forbidden love and melodrama thus presented, since it's a love that cannot be since it's based on deceit on both ends even, one keeping her identity secret and the other starting to waver in his diligence and coming up with excuses to scoot off, and not forgetting the obvious potential parental objections as well as the crossing of the line between employer and employee. The song Teri Meri sung by the duet of Shreya Ghoshal and the acclaimed Rahat Fateh Ali Khan cannot be more poignant and apt when it interjected the narrative for the usual song and dance routine, and it's to no surprise it's my favourite song of the lot here, besides the fun title track Bodyguard.\n\nBut to call Bodyguard the perfect film will be a bit of a stretch. At times its comedy tried too hard especially since it relied heavily on the obesity of Rajat Rawail's Tsunami to bring on the laughs with his uncouth behaviour and language, and had villains who were without so much as a threat in their execution of their kidnapping plan. What's perhaps more criminal here is the editing, where the narrative felt hastily pieced together leaving behind a lot more on the cutting room floor, and for action sequences to be strung together as a series of ad-hoc battles without a proper flow nor provide for any spatial awareness and references. Twists in the final act more than compensates for its flaws, while it did turn out to be quite lengthy, had to stick to its guns since that's the big reveal from the original version that had to be kept intact for this to qualify as a remake.\n\nStill, Bodyguard was a lot of fun especially with a packed full house of Salman's fans turning up to celebrate yet another big screen outing of their larger than life hero. There's this unmistakable infectious energy that Salman Khan brings to his films these days perhaps drawn from the confidence of recent box office gold he had struck, and his performance showed that he's equally adept at playing the action hero, the lovelorn romantic lead or just plain swaggering around the screen in his on-screen persona. Recommended, and definitely so for Salman Khan fans!"
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "afsalthodupuzha",
        "review_rating": "",
        "review_title": "\"A Simple,but twisty love-story!All cheers for Salman\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "chakrabortyabhishek07",
        "review_rating": "8",
        "review_title": "Sabka Ek Bhaijaan.........Aa Gya Hain Dekho Bodyguard !",
        "review_detailed_main": "Nowadays it sounds like a cliché if we in India say that Salman Khan rocks, but truth in the matter is he does rock. The story isn't that moving but there is an unexpected twist in the climax.\n\nThe story is simple Lovely Singh (Salman) is a body guard for Sartaj Rana's (Raj Babbar) daughter Divya (Kareena). Divya hates Lovely and tries to get rid of him by playing the mystique lover Chhaya through phone with help of her friend Maya (Rose Dawn aka Hazel Keech) what happens next is the plot while Lovely saves Divya from goons.\n\nThe music is awesome, actions are a bit superficial, cinematography is the watch out factor, acting is good from everyone but the real deal Salman Khan will rock the box office with his mannerisms.\n\nGreat family entertainer and you are gonna have a blast watching this so I have rated it 8/10"
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "Vivekmaru45",
        "review_rating": "",
        "review_title": "Bollywood's Hottest Hunk Meets Bollywood's Hottest Babe!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "manavhablani",
        "review_rating": "10",
        "review_title": "One of the Milestone",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "akshatip",
        "review_rating": "",
        "review_title": "The worst movie I saw in 10 years or so...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "tusharadhikari",
        "review_rating": "8",
        "review_title": "Heart touching",
        "review_detailed_main": "Very good movie very good script good performance a must watch don't miss."
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "silvan-desouza",
        "review_rating": "",
        "review_title": "Not worth the hype",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "GypsiB",
        "review_rating": "8",
        "review_title": "Don't Take It Seriously",
        "review_detailed_main": "Bodyguard Lovely Singh (Salman Khan) has been assigned to college student, Divya (Kareena Kapoor). She is frustrated by having him tag along and comes up with a plan to distract him: by giving him a secret admirer. Divya's plan works well, and Lovely falls for the mysterious Chhaya of the phone calls, but Divya never foresaw the results of her actions.\n\nThis film is a mix of action, romance, and drama. Khan's character is a too-serious, over-conscientious one, and the movie pokes fun of itself through him in a thoroughly funny way. The fight scenes are unbelievable, but no less enjoyable for that. The musical scenes, costumes and film work are average. The story, though, becomes entirely engrossing, and throws a few surprises. Overall, I recommend it, as long as the viewer knows not to take it too seriously."
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "medaincredible",
        "review_rating": "",
        "review_title": "It is just a crap..... I never seen a worst movie like this before.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "lischneider",
        "review_rating": "8",
        "review_title": "Bodyguard",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "phadvijayanand",
        "review_rating": "",
        "review_title": "One time watchable another Bollywood Movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "arafatdhaka-40058",
        "review_rating": "10",
        "review_title": "Fantastic movie based on exceptional love story.",
        "review_detailed_main": "When I started watching this movie I thought maybe the story of this movie not special like the other movies. But I was totally wrong. It is based on an extraordinary and exceptional love story. Salman khan and kareena have both done well. It is undoubtedly one of the best film in Salman's career. Though some people say it is not a good movie but they are totally wrong. It's a movie which touches the mind of the viewers. So, I give it 10 marks."
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "sunyx-26086",
        "review_rating": "10",
        "review_title": "Great movie!",
        "review_detailed_main": "The film is a remake of the 2010 Indian Malayalam-language film Bodyguard! In fact, it's not that bad, it's purely a commercial film! Salman Khan is indeed quite suitable for the role of a bodyguard, but I feel that the muscular body is simple and pure, and I think he is so cute and silly! I think kapoor's acting skills are better than the original version. She can fully demonstrate the entanglement of the characters. In fact, she likes lovely but finds him annoying, so she had to act as chahaya to trick lovely, but something happened later. In the end Still by lying! So I think it's pretty good in every way!"
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "divysingh-77794",
        "review_rating": "10",
        "review_title": "Amazing love story",
        "review_detailed_main": "Salman kareena Raj Babbar just got fit in their respected roles......"
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "barcacatalunia",
        "review_rating": "9",
        "review_title": "Love Story Superb",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "zsupari",
        "review_rating": "9",
        "review_title": "amazing Film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "manavutopia",
        "review_rating": "8",
        "review_title": "Action Comedy Romance Story",
        "review_detailed_main": "Well, This is A Remake of South Indian Movie . But Salman Khan Played This Role in a different way and Public enjoyed a lot this movie cause of BHAI's Action Comedy and Dance"
    },
    {
        "movie_id": "tt1729637",
        "movie_name": "Bodyguard",
        "movie_rating": "4.7",
        "review_username": "cgrowney-83432",
        "review_rating": "10",
        "review_title": "Classic piece of Cinema - Worthy Among the ranks of Citizen Kane and Batman Begins",
        "review_detailed_main": "I strongly urge the average moviegoer to login to their Netflix account and watch this superb work of art on their own time. Never have I been so enthralled in the rich story, developed characters, interesting twists, and amazing music. This is the first Indian movie I've seen, and I have to say, it is by far the best movie I've encountered in recent memory. Lovely Singh shows a wide range of emotions, while Tsunami always makes me laugh in one way or another. However, the biggest plus in this movie is the special effects. I never once saw anything I thought was improbable, and never did I see any obvious use of the green screen. Again, and I cannot stress this enough, this movie is heaven-sent, and if there was one movie I could take with me on a deserted island, it would be Bodyguard. 19 out of ten stars!"
    }
]