[
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "erostew",
        "review_rating": "3",
        "review_title": "Surprisingly Un-Sexy",
        "review_detailed_main": "This film suffers heavily from a distinct lack of sexiness and way too much boring dialogue. And that is just the beginning of the problems. You really know a film is bad when Lindsay Lohan is the only bright light in it!\n\nThe Acting: Lindsay Lohan does quite a good job in a couple of scenes involving emotion, though she is much less effective in the (too abundant) dialogue heavy scenes. James Deen shows a few flashes of talent but mainly seems as if he is trying to emulate a method actor with no real understanding of how to actually pull it off. The other \"performances\" are uniformly bad to less-bad.\n\nThe Writing: One word... Awful. Boring dialogue and unbelievable story. Poor ending. I think Bret Easton Ellis is a one-trick pony. He has never managed to equal what he achieved with American Psycho.\n\nThe Directing: Same word as above... Awful. Paul Schraeder really should sink back into obscurity. This project is definitely not going to help his career. Poor choice of camera angles and poor framing abounds. He shows no sign of his earlier talents. I think he is lost in his own imagined \"genius\" as he tries for a gritty realism and gets ugly pretentiousness.\n\nCamera, Lighting, etc.: Poor lighting in almost every indoor scene. It looks like it was shot on a smart phone. The music is irritating. Wardrobe... What wardrobe? It looks like the actors supplied the clothes they wanted to wear. There is no costume design or set design in evidence here.\n\nSexiness: Basically there is none. Lindsay Lohan looks pretty sad with her prominent beer belly, sagging breasts and 1960s style lingerie. Control-top granny panties are not lust-inducing! The sex scenes are boring and much less spicy than the hype suggested. The \"orgy\" was so badly filmed it and lit that it was impossible to find it sexy or even interesting. Women or those with a gay interest may find it more sexually appealing but I don't find dangling limp penises to be anything but silly looking. The entertainment media painted this as shockingly graphic but it is pretty tame compared to cable shows like True Blood if you discount the number of penises on view.\n\nIn Conclusion: Not really worth a look even if you just want to see Lindsay Lohan in the buff. There was more of her on view in Playboy and her body looked at least a bit better in the magazine. If you are looking for titillating sex scenes you would be better off with Skinemax. If you want to see a dramatic expose of Hollywood's dark underbelly look elsewhere. In fact just look elsewhere. Period."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "highwaytourist",
        "review_rating": "4",
        "review_title": "Low-budget film has a few good points, but too dreary and sordid to enjoy",
        "review_detailed_main": "While \"The Canyons\" is not a total loss, it still doesn't work. As mentioned, it's about this spoiled and mentally unbalanced trust fund baby named Christian (James Deen) who's accustomed to getting his way, and his gold-digging yet not entirely unsympathetic girlfriend, former actress Tara (Lindsay Lohan). They live in a stylish mansion and have sex with each other and sometimes have guests join them. Partly on his father's insistence that he work, Christian produces the occasional film and one of those films stars Ryan (Gerard Funk Nolan), a hunky actor whom Tara was once lovers with and whom she still secretly loves. This unexpectedly makes Christian violently jealous (even he's surprised by his reaction) and sets in motion eventual tragedy. None of the people here are all that likable, not even the seemingly idealistic Ryan, and the low budget shows. The gratuitous sex and violence is reeks of exploitation. Yet the film is watchable at times. The entertainment industry is somewhat captured and some of the dialog is perceptive. The acting is somewhat better than one would expect. James Deen is a porn star, yet he shows he can carry a lead role without sinking a legitimate film. More importantly, Lindsay Lohan gives her best performance in years. She's a greedy user not because she likes to be, but because she believes she has no choice, yet she's still capable of love isn't really out to hurt anyone. I don't recommend this film, but it's not as terrible as it could have been. For all its faults, \"The Canyons\" has its moments."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "britishdominion",
        "review_rating": "4",
        "review_title": "Two Provacateurs Chicken Out",
        "review_detailed_main": "Whoo-boy, saw \"The Canyons\" and I guess to damn it with faint praise is that it isn't the worst movie I have seen this year (congrats still, \"Grown Ups 2\").\n\n\"The Canyons\" does have its minor moments of art-directed, abject L.A. decadence and contains a modicum of car-crash curiosity. Lindsay Lohan is OK in it, as is porn star James Deen - although both are characters I'd pretty much cross the street to avoid in real life.\n\nThe movie is as nihilistic and dead-at-it's-core as it was designed to be, particularly expected when you have the guys who collectively created American Psycho and Taxi Driver piloting this thing. In fact, if you took Bret Easton Ellis' \"Less Than Zero\" and spliced it with Paul Schrader's \"American Gigolo\", you've pretty much got this movie's number.\n\nSchrader's camera captures the vacuum of this glam couple well in the early going setting up Lohan and Deen's hedonistic, vacant relationship - its coolly pointed in its visual observation. Ellis manages to make a few catty points about the movie industry and those who work in it. It doesn't add up to much, though.\n\nPerhaps coked-up \"The Canyons\" greatest misstep is that it settles to be forgettable mid-grade trash instead of a batsh*t-great guilty pleasure. The movie seems satisfied to recline in low-speed soap-opera theatrics, softcore antics and smug button-pushing instead of putting pedal to the metal and really going gonzo - which both writer and director are prone to do in their own individual projects.\n\nIn the end, the film's final act basically torpedoes whatever low-budget goodwill the picture had cobbled together. Both director Schrader and writer Ellis are expert provocateurs and have done - and will do - better than this shoestring experiment. Still, it coulda been worse."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "Michael_Elliott",
        "review_rating": "",
        "review_title": "The Greatest WTF Movie Ever Made",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "zombiebird",
        "review_rating": "1",
        "review_title": "Horrible",
        "review_detailed_main": "Horrible horrible movie. To start with the story is far from original and the pathetic writing doesn't really add much to it. For the 1st 40 minutes or so you kind of feel like you're watching a bad B-movie, after which it turns into a bad urban suspense thriller, most of which will either make you roll your eyes or just laugh. The acting is pathetic, I'm pretty sure school kids could act better than this, but then again it's not like they had a lot to work with as I've already stated, but I feel distinctly sure that even if they did, they'd still be horrible. The directing is amateurish, trying desperately to make the movie seem \"arty\" but failing. A lot of the stuff didn't even make scene, like counting the days (Monday-Wednesday), why were we doing that again? How exactly did that fit in with anything else? Well that's about it for my review, just one more thing I'd like to mention is the horrible soundtrack which makes you feel like you're in a sleazy strip club. In short, don't watch this."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "avenuesf",
        "review_rating": "2",
        "review_title": "Could I have my two hours back, please?",
        "review_detailed_main": "I've been waiting to see this film for some time, and was finally just able to see it on VOD. Unfortunately, it was a disappointment, especially considering Paul Schrader directed it. The combination of he and Bret Easton Ellis is not a good one. The film is yet another saga of bored Hollywood individuals looking for meaning in life - pretty much the common theme of BEE's novels - and indulging in sex, mind games and jealousy while attempting to hold on to their flailing, angst-filled existences. Mr. Schrader drives the point home further by occasionally interspersing shots of dilapidated, closed movie theaters to show us how the \"old Hollywood\" has decayed. \"The Canyons\" attempts very hard to shock, but unfortunately, we've seen it all before, as Hollywood has been making these caricatures of itself since the 70's and 80's. Lindsay Lohan is surprisingly effective in her role most of the time, and carries a lot of the film. James Deen, who I was not familiar with as I'm not that into porn, also does a believable job (and illustrates WHY he's had a career in porn during his full frontal shot). There's also a refreshing twist during a four-way sex scene. But I was left wondering at the end of the film - and it ends very awkwardly - what was the point, and how could anyone invest much empathy in these characters? I understand \"The Canyons\" opens today in Los Angeles and New York, as well as being simultaneously offered on television and Itunes via pay-per-view. I would be very surprised if this gets any further than those two major cities; it's just not engrossing or original enough to draw in much of an audience."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "tigerfish50",
        "review_rating": "1",
        "review_title": "Sociopathic Sex in Canyon-land",
        "review_detailed_main": "'The Canyons' portrays a collection of characters deceiving and manipulating each other to distract from the emptiness of their lives. Chief among them is a sociopathic film producer, Christian, whose jaded girlfriend Tara reluctantly consents to the sex orgies he arranges with random internet strangers. After Tara helps a former boyfriend, Ryan, get the lead role in Christian's new movie, they resume their old affair, despite Ryan having a girlfriend called Gina who is also working on the film. Christian grows increasingly suspicious of Tara's fidelity outside the group sex dynamic, and has her followed by a slacker private eye, while he hooks up with a former assistant, who is also an old girlfriend of Ryan.\n\nThis incestuous merry-go-round is merely the set-up, and director Shrader fails elevate the subsequent hokey-pokey above soap opera level after making disastrous casting decisions with Lindsay Lohan, James Deen and Nolan Funk as his lead trio. The only competent actor is Amanda Brooks who plays the scorned Gina in a minor role - although she's actually five years older than Lohan, she looks fifteen years younger and fifty times more desirable than the supposedly irresistible Tara. Sex is a crucial plot element, but no erotic intensity is generated since the characters are more robotic than human. The film wastes many tedious minutes on lengthy shots of them entering and exiting cars and buildings. 'The Canyons' limps along with wooden direction, dialog, acting and storytelling until the deceptions and manipulations lead to a pointless act of violence and an implausible conclusion."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "thefleece2",
        "review_rating": "5",
        "review_title": "Better Than I Expected... But That's Not Saying Much",
        "review_detailed_main": "Release Date: 2nd August 2013 (US)\n\nAfter starring briefly in two of the years worst films, Lindsay Lohan makes her full length return in Paul Schrader's \"The Canyons\". A film that documents just how crazy one individual can go, when he finds out about the secret love affair between his girlfriend and the lead on his film project.\n\nWith this being Lindsay Lohan's first full length appearance since the critically panned, \"Labor Pains\" released in 2009, there has been a lot of correspondence and speculation surrounding this indie flick.\n\nDespite hearing some very mixed opinions, I have to say I wasn't particularly fazed by \"The Canyons\". The film is littered with problems, yet I never really had any trouble sitting through it. It is overdramatic and slightly ridiculous, but at times, that alone makes it a very compelling watch.\n\nDon't get me wrong, I didn't enjoy the movie, but I didn't dislike it either. It's a very middle of the road experience. Well at least it was for me anyway.\n\nThe films production budget is very low. So don't go into it expecting some extravagant revenge-romance esque thriller, because that's not what it is. In a way, the films plot-line could be compared to that of a soap opera. It's not particularly exciting, but it is partially entertaining watching it unfold.\n\nHowever, for such a low budget film ($250,000 to be precise), the film is actually rather attractive. It is very well lit and the various locations work with the direction that the film goes in. It's well cinematised, and in terms of shots, whilst it doesn't do anything original, there were times when I was watching the film amending some of the cinematography.\n\nNow a lot of media outlets have compared to the film to porn. I don't necessarily agree with that statement. Sure there are specific body parts that are revealed on numerous occasions, but whilst there is an emphasis on sex, it's not as explicit as a lot of people have made it out to be.\n\nThe performances are average. Nobody really impressed me and whilst nobody is bad, some of the dialogue is very cheesy and repetitive, but of course that can only be blamed on the writers. Lindsay Lohan offers a solid turn as does real life porn star, James Deen, but nobody does anything that you're going to love or remember the next day. Everyone's very mediocre, and due to how ridiculous the film eventually becomes, the characters all end up becoming rather comical.\n\nWhilst the film does lack in its key areas, along with the cinematography, one of the aspects I liked was the score. I will be the first to admit that it does sound very amateurish, but the electronic nature of it occasionally works, with what the movie is trying to present. That presentation being that shouldn't have affairs, especially if you're dating a complete an utter psychopath.\n\nI have to admit The Canyons was lot of better than I expected it to be. I didn't necessarily enjoy it, but there were aspects to it that I liked. Perhaps I'm being too nice, but for a low budget production I didn't find it too bad. If you have a partial interest in seeing it, see it. But if you don't, then I wouldn't bother.\n\n5/10\n\nCheck out my website: www.jacks-reviews.com"
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "aforandromeda",
        "review_rating": "4",
        "review_title": "Dull, creaky drama that's devoid of relevance.",
        "review_detailed_main": "The Canyons lays it's cards on the table right from the beginning. The opening scene introduces the main protagonists right off the bat, a curious tactic that immediately signposts the motivations of all the characters.\n\nTara (Lindsay Lohan) and her rich boyfriend Christian (James Deen) are a couple seemingly living the Hollywood dream. Christian is in the process of cobbling together a low budget slasher movie, using his considerable trust fund in order to break into the film industry. However, the movie's lead, the naive and inexperienced Ryan (Nolan Funk), has a secret that threatens to derail the movie and shatter Tara's relationship with Christian. What follows is a story of suspicion, betrayal and secrets, set in the seedy underbelly of a Los Angeles populated by dream chasers and wanton, predatory selfishness.\n\nThe first ten minutes tell the audience immediately that we are dealing with shallow and vacuous individuals, grasping at every opportunity in order to satisfy their self serving natures. This presents the main problems that ultimately ruin any chance that The Canyons might have had of being a compelling drama. In order for a drama to succeed where the majority of the characters are simply dreadful, there has to something to engage the viewer. That could be an interesting script, stylish direction or passionate and sincere performances. The Canyons regrettably has none of these to offer the viewer.\n\nBret Easton Ellis' script is quite amazingly dull. It really does give the actors very little to work with. The story line contains an unbelievable series of coincidences, the dialogue would embarrass an amateur dramatics class and the characters have no depth to them at all. Lohan tries gamely to prove her acting chops in some scenes, but the dialogue gives her nothing but tired, predictable lines to try and give some life to. It doesn't help matters any further for her that she spends most of the movie opposite James Deen, a porn star who has little or no real acting experience. He starts the movie off reasonably enough, but by the end his acting becomes forced and clichéd. Unfortunately, although Deen isn't primarily a dramatic actor, you can't help but feel that a better director could have coached more out of him. However, even he is streets ahead of the ludicrously named Nolan Funk, who gives a vacant, amateurish and dreadfully stilted performance. That leads me to one of the most significant problems that The Canyons suffers from, that being director Paul Schrader.\n\nDespite his impressive list of past credits, including directing edgy and challenging projects such as Blue Collar and American Gigolo, as well as writing screenplays for most notably Taxi Driver and Raging Bull, it's made abundantly clear from The Canyons why he doesn't make many movies these days. His style is quite simply outdated and his efforts here show that he has done little to keep up with the changes in modern film making that audiences do not unreasonably expect.\n\nThe camera-work is creaky and linear, the editing is poor and he overwhelmingly fails to get the best out of an admittedly ragbag collection of actors. You always feel like the crew are in the scene, such are the hackneyed nature of the set ups. For example, many scenes feature an entrance from a character walking into a room with the camera at first at a distance, then either panning across or following them in an unimaginative and linear fashion once it leaves it's previously rigidly static position. Many set ups feel disconcertingly framed, yet they feature hardly anything of interest, lending a stagey, unnatural feel to the proceedings. Strangely, the much talked about sex scenes are so tepid and perfunctory you wonder why they were even bothered with, yet it seems Schrader wanted to elicit some kind of outrageous shock value from them. As they stand, even the actors look rather embarrassed to be in them, even though of course one of them is a porn star.\n\nThe talky nature of the dialogue also grates even more than it should as the scenes appear disjointed, either being too long or too short, then simply going on to leave the plot devoid of pace and flow. Locations are curiously bland and the cinematography is completely by the numbers. It all feels very much like the work of someone who didn't have any fresh ideas or flair to assist this very oddly assembled cast who were stuck working with such a tepid script. Everything feels very clichéd and predictable, almost to the point of ridicule.\n\nWhile Lohan's allegedly erratic behaviour on the set of The Canyons has been well documented, she is actually the only member of this motley crew of a cast to show any real acting ability. There are a handful of scenes that serve as reminders that before her life descended into chaos, she was indeed an real talent with great potential. It would therefore be unfair to blame Lohan and point the finger at her, as many have done, for the critical mauling that The Canyons received. The real blame must go to Ellis and Schrader. I find it remarkable that such an empty screenplay would be made into a movie in the first place and Schrader is a director who is squarely stuck in the past, with his best days as an auteur sadly long behind him.\n\nIt's hard to fathom out to what kind of audience The Canyons was aimed at, as it has contains so little in the way of redeeming features. It all amounts to what is frankly an irrelevant and entirely unessential piece of film making that's unquestionably one to avoid. Unfortunately for Lindsay Lohan, this project should have been one for her to avoid as well."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "SnoopyStyle",
        "review_rating": "6",
        "review_title": "Com'on people... give 'em a break.",
        "review_detailed_main": "Seeing that this stars Lindsay Lohan the train-wreck and James Deen the porn star, the long knives are coming out for this movie before it finished taping. With all the bad press, I was expecting an amateurish mess. The one main thing that I got from this film was that this was professionally made.\n\nThe filming style looks good. Lindsay Lohan is ... well ... Lindsay. Certainly she's not going to win any awards but she still has the screen presence. James Deen does a good douche bag. Maybe that's just his real personality. Everybody fit their roles. Lindsay is a cold emotionally damaged ex-star. Deen is sexually perverted. They might as well used their real names.\n\nThe one thing that I wish they would improve on is setting up more danger at the start. A better foreshadowing would improve the tension. Instead, it's strictly a linear time line and the start of the movie is rather slow. It doesn't actually start moving till the middle of the movie. Overall, it's a good effort for a low budget indie."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "brchthethird",
        "review_rating": "2",
        "review_title": "A complete waste of the talent behind the camera",
        "review_detailed_main": "This is a pretentious piece of crap, with a nary a good performance to be found. The story is repugnant and boring, and all of the characters are soulless, vacuous and empty. Granted, I'd heard about how bad this movie was before I even saw it, but I still expected a little more from Paul Schrader and Bret Easton Ellis. The story is about some trust-fund kid (James Deen) who's also producing a movie so that his (unseen) dad will get off of his back. His live-in girlfriend is played by Lindsay Lohan, and the small cast is rounded out with other characters who know each other, and sleep or have slept with one another. Still, most of the movie is just boring, lifeless dialogue interspersed with some of the most unerotic sex I've ever seen, which includes a foursome. I mean, what were these people thinking? The only redeeming qualities are some good soundtrack selections and good camera-work. That's it. It's best just to take most people's word and just skip this trash."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "chenthom",
        "review_rating": "9",
        "review_title": "Great movie, typical Ellis - detached and cruel",
        "review_detailed_main": "I think that a lot of the criticism of \"The Canyons\" is missing the point. All of Ellis' stories have a detached quality in them which makes them hard for audiences to relate to, especially on screen. They seem \"unreal\".\n\nA constant theme in Ellis' work is the existential \"ennui\", the boredom and emptiness of life, the absence of deeper meaning. His main characters feel that something is missing, but they can't pinpoint what it is. As an audience, we know what they are missing - connection with themselves and others, and genuine emotion. This is why there is so much disconnect between the protagonists and the viewers.\n\nIt may be that the choice of Hollywood as a backdrop for this display of existential emptiness is an unlucky one because few people can relate to wealthy Hollywood life on a personal level.\n\nHowever, I applaud the filmmakers for at least having the guts to try. The people in this movie are all choosing materialism over personal connection, and mechanical sex instead of intimacy, an orgasm is for them a reflex just like sneezing. Neither money, sex, nor social status provide happiness for those who get it in abundance; only those who don't have it in abundance think they will bring happiness. The values that popular culture upholds are devoid of value.\n\nIn addition, I think James Deen does a perfect job playing a narcissistic, controlling, emotionally empty vessel on the verge of snapping, and Lindsay Lohan (this is her first movie I've seen, and given the bad press, I'm positively surprised) does a great job playing a woman despairing from choosing hell in physical luxury, while starving emotionally."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "thealefmagnus",
        "review_rating": "6",
        "review_title": "not necessarily on par with the worsts",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "loveandthunderstorms",
        "review_rating": "5",
        "review_title": "A weak soap opera with few redeeming qualities",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "momentfilms-1",
        "review_rating": "",
        "review_title": "It's worth at least one viewing.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "Musicalplayhouse",
        "review_rating": "1",
        "review_title": "Really Disappointed, Hoping Better Film in the Future",
        "review_detailed_main": "I could not finish watching this movie as it is less than a B movie. I stopped watching this movie because of the quality of the acting, the make up, location and overall script. Film looked cheap and cheesy.\n\nIt seemed that this movie is going right along with what the tabloids are saying about this actress. It looks like she and her friends who she parties with produced this film.\n\nI expected a lot better, especially of all the hype with Lindsay. Maybe Lindsay seriously has to focus on any project she takes on, especially if she helps produce it.\n\nThe public sees you as a particular character in the parts actors and actresses take on. It is part of their reputation.\n\nI hope these actors and actresses can learn from criticism, move on and learn something from it in order to better their skills."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "Camoo",
        "review_rating": "5",
        "review_title": "So strange but I dug it",
        "review_detailed_main": "Very early on in the Canyons you sort of resign to the fact that you will be sitting through a B movie. The acting is for the most part amateur hour, the cinematography looked cheap and the editing choppy. That's not to say The Canyons isn't an entertaining film - I found it to be pretty well written though I would have preferred to see some better actors in many of the roles, which would have given Ellis's dialogue more weight and energy.\n\nI kinda appreciate the approach of choosing a porn actor as your leading man but James Deen as Christian mumbles his way throughout the film when his dialogue is calling for him to be more assertive. It's a casting mistake and as a result much of the cast crumbles around him. The one bright spot was Lindsay Lohan, I actually thought she was the best cast in her role and the best actor in the bunch. The Canyons works best as a metaphor, for what film is and what film has become, the degradation of the medium, the cheap video look, the broken cinemas."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "hemril",
        "review_rating": "2",
        "review_title": "Poor Lindsay",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "Bradley-Grube",
        "review_rating": "1",
        "review_title": "I watched only because I thought to myself \"It can't be THAT bad!\"...oops!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "nicoloszenberg",
        "review_rating": "1",
        "review_title": "A movie to avoid",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "grantss",
        "review_rating": "6",
        "review_title": "Not great, but nowhere near as bad as it is made out to be",
        "review_detailed_main": "Not great, but not anywhere near as bad as it is made out to be. Written by Bret Easton Ellis (Less than Zero, American Psycho, The Rules of Attraction, among others) it contains the usual Ellis trademarks: a character-based story of the dark side of opulent Californian living, slow-burning plot, decadence and potential violence always lurking just beneath the surface.\n\nThrow in director Paul Shrader (Affliction, Auto Focus, American Gigolo, Cat People, among others) and you should have a recipe for a good movie.\n\nWell, it almost gets there. Direction is fine. Script flatters to deceive, however. Starts well, builds well, but ends badly. A few more scenes were needed to tie everything together, and/or make a point.\n\nPerformances vary. Lindsay Lohan is pretty good in the female lead. I suspect some of the dislike for this movie stems from her starring in it, but she does a good job. She's not a bad actress, but I guess her private life alienates people. She's certainly an infinitely better actor than Kristen Stewart, though most people are...\n\nNot sure why a porn actor was cast in the male lead, but James Deen does okay. Not great, but not terrible.\n\nThe supporting cast let the movie down, however, generally giving flat, not-very-convincing performances."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "damianphelps",
        "review_rating": "1",
        "review_title": "No matter how low your expectations are...lower them",
        "review_detailed_main": "If you need to see Lindsay's boobs that badly...GOOGLE THEM!"
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "MOscarbradley",
        "review_rating": "8",
        "review_title": "Hugely underrated.",
        "review_detailed_main": "The credits show a series of derelict cinemas, now just ruins, before cutting to a kind of business lunch in which beautiful, vacuous movie people talk about movies and sex. The scene would appear to be 'badly' written and acted but brilliantly directed; if this is what constitutes the movies today it's little wonder so many theatres have closed down. You might call Paul Schrader's \"The Canyons\" a satire on the movie business but it's much too sour to be truly satirical. For decades Schrader has always been Hollywood's Number One Avenging Angel, condemning sex and violence in his puritanical fashion while showing it in extremis.\n\nNow he has turned his jaundiced eye on the business that has been providing him with a livliehood from the seventies onwards. It takes time to get your head around the inane dialogue and the stilted acting that in lesser hands might have condemned this to a straight-to-video release but this is an expensive production, brilliantly photographed in widescreen by John DiFazio, its money shots coming, not from below the belt, but from inside Schrader's head, or should we say from inside Schrader's head and that of writer Bret Easton Ellis who has also been biting the hand that feeds him for quite awhile now.\n\nThe problem lies in the casting. It's one thing having good actors play 'badly' but it doesn't really work in reverse. The lead here is played by porn star James Deen who is supposed to be someone who, if not exactly intelligent, is at least successful and in this role Deen never convinces for a second. Lindsay Lohan, on the other hand, is somewhat better. Lohan is someone who might have had something of a career had her personal life not got in the way. Everyone else is cast for their bodies and not for their brains which, I suppose, is just as it should be in a film about an industry that seems to have been founded on sex. No doubt the 'Me2' movement will find much here to back up their argument that Hollywood has long been operating on exploitaiton. At least Schrader has fun telling us that all this is bad while wallowing in it. Of course, most people haven't caught Schrader's little jest as intended and the film flopped. It may be far from his best work but I think it fits perfectly into his canon."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "coastin_on_a_dream",
        "review_rating": "6",
        "review_title": "Has the makings of a great movie, but ultimately doesn't reach its potential",
        "review_detailed_main": "\"The Canyons\" is probably one of the most talked about low budget indie films ever made thanks to Lindsay Lohan. People aren't talking about her acting work in the film, but her on set antics instead. Since 2004 or so, Lohan has been a tabloid fixture as a Hollywood party girl, and her tabloid profile has only escalated thanks to her brushes with the law, rehab stints, and fame hungry parents. Her personal life eclipsed her acting career and sometimes it's hard to remember that Lohan started out as an actress...a promising one at that! I am a fan of low budget, indie films. Sure, they aren't the best quality, but I find most of them to have interesting concepts and passionate ideas. I love the idea of saying \"fuck the Hollywood studios, let's go film this the way we want to\". That's why I've always enjoyed low budget independent films. They're made out of love, and not made for money. So when I heard about \"The Canyons\", I was of course immediately drawn to it.\n\nI just finished watching it, and I'd saying it had a lot going for it, but ultimately fell short of my expectations. For what it was though, I'd say it was a fairly decent film.\n\n\"The Canyons\" is a skeleton of a great film, but doesn't have the goods to back it up. It has a neo-noir style/tone but it doesn't stay consistent with it. It's visible in some scenes, but not so much in others. It has a lot of interesting themes about Hollywood, fame, power, and the film industry. It sets-up these interesting themes in the first half hour of the film, but they are never really incorporated into the plot. The script was good, but the story got lost in the relationships/dynamics of the characters. I felt it sort of lost focus halfway through and never found it again. It was enough to keep me interested, but ultimately the film wasn't deep enough to get much of an emotional reaction out of me.\n\nNow, onto the acting...obviously having Lindsay Lohan in this brought a great deal of press for the film. Without her, this movie would have been released and nobody would have known about it...it would have faded into indie film oblivion. But what's really interesting is that Lohan not only gave the film publicity, but she actually carries the entire movie! I wouldn't say her acting was astounding, but she did successfully create a great character out of Tara, who otherwise might have come across as underwritten if another actress had played the part. Lohan gives her character a lot of depth and emotion that probably didn't even appear on the page. It is clear that despite all the intense drama that surrounds her on a day to day basis, she still has talent. What sets her apart from other actors, though, is her amazing screen presence. She is no longer the teen beauty queen she used to be back in 2004-2008, but something about her makes you focus all of your attention on her whenever she is on screen. She has a rare gift of commanding a scene no matter what role or what movie. Lohan is clearly a star. She has a horribly notorious and infamous reputation in Hollywood, but she can still act pretty damn well. If she just got her personal life sorted out, she could have a chance at a major comeback.\n\nJames Deen, on the other hand, has the looks of a movie star, but not the acting chops. In some scenes, he is fine. In others, he is very wooden and, unlike Lohan, fails to give his character depth or layers. Not that he had much to work with, anyways, because his character, Christian, is VERY unlikable. And not in a fun or epic villain kind of way, but in more of a forgettable and wimpy sort of way. Christian has no redeeming qualities at all. The script has Christian written as a fairly one dimensional character, and Deen unfortunately doesn't have the acting chops to bring the character to life or do much with him. Deen was such a bore to watch other than the scenes where he was naked. Deen does not have any charisma or screen presence (again, unless he is naked). He might want to take some acting classes if he wants to continue getting roles outside of porn.\n\nNolan Funk, the other lead who plays Ryan in the film's love triangle, does an adequate job in the film. I think he has a lot of potential and I'd like to see where his career goes from here. I think he has a lot of natural talent.\n\nOverall, \"The Canyons\" was not a complete waste of time. I think people are being very hard on it because Lindsay Lohan is in it, but she is honestly the best thing about it. Its biggest flaw was that it was not consistent. Also, casting James Deen in the role of Christian was a mistake because he is simply not talented enough to give a character like that any sort of depth.\n\nI think with a better script and a bigger budget, the film could have been great. But there just wasn't any \"umph\" to it.\n\nIt is worth checking out if you are interested in and can appreciate low budget indie films...otherwise I doubt you'd enjoy it.\n\nI give this movie a 5.5 or a 6 out of 10."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "Rodrigo_Amaro",
        "review_rating": "3",
        "review_title": "Decadence in its pure form",
        "review_detailed_main": "I know I shouldn't reference a classic movie while writing about this film but I have to because there's a certain strange connection between both, despite the different outcome each one had. The majority of viewers of \"The Canyons\" might never have heard of \"The Misfits\" (1961), that depressive tale starring Gable, Monroe, Clift and directed by John Huston, a reunion of washed up characters that never seem to do anything right in life, and behind the scenes it was another sad story as well, becoming the final films of Marilyn and Clark, and Monty's career already in ruins, didn't get better later on. Rumor has it, the movie was on TV the day he died, someone asked him if he wanted to see it, to which he replied with a 'no'. Yet that was a marvelous picture and still interesting to watch. What's Paul Schrader movie has to do with it? It's also a story about washed up people (in and off the movie) who try to do something with their lives but only manage to complicate things. Unlike \"The Misfits\", this excuse for a movie is simply dull, hollow and idiotic.\n\nThe same hands that wrote the great \"American Psycho\" and \"Less than Zero\" are the same that brings this movie to life. Can you believe that? Yep, Bret Easton Ellis tries to deliver a piece involving Hollywood and its nasty schemes of money, power, sex, lies, betrayal and love going out the window. In it, famous producer film Christian (porn star James Deen, trying his big break in conventional films) goes bazoork after finding out that his wife (Lindsay Lohan) is having an affair with Ryan (Nolan Gerard Funk), the leading man he selected to star in his new project. Conflict, or catch some might say: Christian doesn't mind sharing his lovely wife with other partners in orgies and wild parties as long as he's there as well, so it's kind of weird when he reacts in a psychotic way after discovering the affair. \"I love you because I trust you\" he says at the beginning, maybe it's the other way around, I don't know.\n\nThat side of the story is pure garbage, and the more the film tries to bring sensuality or just throw some sex scene, the more embarrassing it gets. It looks like a lousy carbon copy of a softcore (and trust me, there's softcore flicks with better plot and sexy moments than this thing), the sex is just presented very briefly, with no deep connection with the story, and even the sequences involving nudity are tame, prudishly captured. Whether being a weird drama or a unsexy thriller, \"The Canyons\" doesn't hit right at anything. There's not even a bold or original take into Hollywood way of running things, no critique, no judgment, just the exploitation of us unfortunate viewers.\n\nI only (slightly) cared about \"The Canyons\" in the sequences involving Ryan, the young and struggling actor caught in the middle of complicated situations, torn about acting in a good project - but what's it about, anyway? the movie never tells us - and staying with the love of his life, the decadent actress married with Christian, and Ryan also happens to be married. Throughout the film, he spends his time trying to find ways to be in the picture, no matter the consequences (since he's a drop dead gorgeous guy, he's frequently tempted by guys who have power in the business) he fights for that role mostly because it's the only thing for him to do.\n\nGathered here is the ultimate members of the decadent career group: Lohan post-rehab career, another low movie for her; the unlucky director Schrader - his latest ventures are quite troubled, specially with producers who remove the man cause he never delivers the movie they wanted (apparently, that didn't happen here but it happened with the fourth Exorcist and the recent \"Dying of the Light\") but at one time he was a gifted filmmaker and writer; and Ellis, whose script is just another proof that some novelists shouldn't write original film material. Coming out of the porn universe, Mr. Deen proves to be a suitable and good choice for the frightening character he plays, his alpha-male quality was powerful enough to make you believe this guy can do anything he wants and with anyone he wants. A little bit of acting classes and he might have a future in mainstream films. Also from porn, but just doing a bit uncredited part is Danny Wylde who should have a better and bigger cameo.\n\nThe only ones who escape without injuries are Nolan Funk, quite good in some moments, and one scene stealer Gus Van Sant as Christian's shrink. Just because it's a movie about decadence filled with down and out people that doesn't mean the final project should be like them. The fore-mentioned classic is a clear evidence of this. 3/10"
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "tieman64",
        "review_rating": "",
        "review_title": "Underrated Schrader, with an excellent performance by Lohan",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "marshagentry",
        "review_rating": "1",
        "review_title": "One of the Top Five Worst Movies of All Time",
        "review_detailed_main": "I knew nothing about this movie when I accidentally got hooked on it. I thought it was almost over when I tuned in, and I left it on out of morbid curiosity. Lindsay's acting isn't bad. It's actually good, at least in parts. It is Lindsay who looks so phony herself; she's difficult to look at with cheap uneven hair extensions and hard makeup. Her face looks puffed up. She works pretty hard at throwing away her career. I can't understand why she did this.\n\nWhat got my attention was a guy who takes off his pants for a full-frontal view of him, not a quick view, maybe five seconds or so, while he moves around with his jewels exposed, followed by Lindsay taking off her top to show her boobs, and a third guy going down on her on the sofa while the naked man has his way with himself. Yuck and ick.\n\nThe first thing wrong with the movie is the script. None of the dialog is clever. No witty banter, and there should be, because the only thing to this movie is dialog....and some boring sex. Not much action. Just a little. There is only one storyline going on. A good script will have several mini-plots interwoven into the main plot. Here is the gist of it that is revealed early in the movie: Will he or won't he catch her cheating, and what will he do about it? This should be a sub-plot, not the main story.\n\nThese actors looked like soap actors or waiters, not that I have a thing against either. All the cast seemed to be roughly the same age. I'm attempting to explain why the cast of men seems generic to me. A pug nose with a good head of hair and some muscles will get you into this movie if you don't mind saying the F-word 20 or 30 times\n\nThe music is pretty funny as well. I confess to watching this movie for the fun of it. I recognized it as a baddie right away, when the guy dangled his jewels.\n\nSave you money unless you have a weird sense of humor, a boring life and time to waste.."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "planktonrules",
        "review_rating": "2",
        "review_title": "Like a bad porno film with many of the more explicit parts excised.",
        "review_detailed_main": "\"The Canyons\" is not the sort of film I'd normally watch. The movie is essentially a low budget porno film with more plot...which surprised me a bit since the film was on Netflix. The reason I chose to see it was because it has a rating of 3.8....nearly enough to merit its inclusion on IMDB's infamous Bottom 100 List...something I try to see as many of them as I can. Yes, I am apparently a masochist.\n\nAs I watched, I assumed that the low score was simply because it's a Lindsay Lohan film. But after reading up on co-star James Deen and the dozen or more rape allegations against him, perhaps this is much of the reason the film is hated by so many viewers.\n\nThe film itself plays like a porno film with a little less nudity (just a bit) and a bit more plot...albeit not a very deep one. Apparently, Tara (Lohan) wants money and to feel wanted...and the oddly named Christian (Deen) fits that bill. He's an odd man. While he encourages her to have sex with various people while he watches, he MUST be in control. At first, this control is exciting because Tara can just turn off her mind and let him run her life. She also likes all the kinky hookups with him and various other folks joining in with the fun. Later, Christian shows his jealous and possessive side...especially when she begins seeing another man. Eventually this leads to very violent things....provided you keep watching the movie...which is a bit doubtful.\n\nIf you are looking to see a lot of Lindsay, well you might feel disappointed. While there is lots of male frontal nudity and other women, it's odd that Lohan is mostly covered up in her nude scenes. As for me, I wish all the nudity wasn't in the film because it seems to take the place of plot AND isn't very sexy...especially that green sparkly scene.\n\nSo is the film worthy of an inclusion in the Bottom 100 or is there more to it than this? Well, I will say it was hard to like the film because the characters were difficult to like, being mostly selfish and underwritten jerks. Of course, it's not like folks watch porn for the plots...and the plot and nudity don't deliver. The film just didn't have enough plot for a mainstream film nor enough nudity for porn. I personally would have preferred the story with less nudity and more character development. Finally, I felt uncomfortable with the juxtaposition of sex with violence. Overall, a film that isn't particularly enjoyable to watch....not so much bad as not."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "contrerassherry",
        "review_rating": "3",
        "review_title": "The House is the Star",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "wyckes13",
        "review_rating": "1",
        "review_title": "Just awful...",
        "review_detailed_main": "I've never seen more grown men whining. Bad acting, bad plot, DON'T BOTHER!"
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "teodoramonika",
        "review_rating": "2",
        "review_title": "I expected much more...",
        "review_detailed_main": "1.5 / 10.\n\nIt's very boring. According to the description, I expected some tense action, but there was almost no action. The story and acting are unconvincing, and the film has a lot of empty scenes. It wasn't interesting to me at all, so I almost fell asleep. It's not a thriller, but just some horribly boring drama."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "johannes2000-1",
        "review_rating": "7",
        "review_title": "Curious and with some major flaws, but really not that bad!",
        "review_detailed_main": "I really don't think this movie deserves this low overall score of 3.8 (at the time I write this review), in my opinion it's not that bad at all. Sure, it has some major flaws, but nevertheless I was intrigued and entertained until the last minute. The premise is interesting enough, and the acting is surprisingly good, taken into account that one of the leads is renowned as a porn actor and another one is an equally renowned (if not notorious) pop star.\n\nIt seems to me that the makers wanted to give this project a certain mysterious and sensual David Lynch or Brian de Palma feel (I hope I don't offend Paul Schrader with this!), and they partly succeeded. It definitely has a fascinating, brooding atmosphere, and the story, with the characters and their sub-plots gradually getting interwoven with each other into an erotic and dangerous web, seemed to build up to a thrilling climax. Well, there's my biggest let-down: this climax just never comes. In fact, it all ends in a disappointing puff, and the lasting impression is that the whole thing just went no-where and lacked real urgency.\n\nThat's such a pity, because there are some good things to mention too. I loved the settings in the sordid back-streets off Sunset Boulevard, with the dilapidated theaters. The house of Christian is awesome, breathtakingly located in the hills, and the scenes in the house are beautifully photographed. Lindsey Lohan is, in spite of all the hoo-ha and troubles she apparently caused during filming, absolutely convincing in her difficult part. And pornstar James Deen plays main character Christian in my opinion fabulously, extremely sinister and menacing, all the time making you feel that his cold and aloof attitude could explode at any time. I don't know if he does more main-stream movies, he sure should!"
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "thesar-2",
        "review_rating": "1",
        "review_title": "Soft Porn aLLert",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "mymainman2685",
        "review_rating": "8",
        "review_title": "Looking into the mirror, Looking into the lens",
        "review_detailed_main": "Bret Easton Ellis is probably the most misunderstood author in the United States. His characters are often described as flat and uninspiring. Their story lines are described in much the same way. And yet, he still remains the same writer, as Norman Mailer described with the 1991 release of American Psycho, that 'shows older authors where the hands on the clock come to.' The Canyons is no exception. Ellis is the screenwriter for the film alongside longtime writer/director Paul Schrader (Taxi Driver, Affliction). After viewing the film, I was surprised to see it was almost universally panned. But it didn't take long for me to remember the history of Ellis and his critics. Evidently, the deliberate work of Schrader was still not enough to help them see the hands on the clock.\n\nThe film's plot involves the relationship between two couples living in Hollywood. One couple is made up of the boyish, aspiring actor Ryan (Nolan Funk) and his dedicated girlfriend Gina (Amanda Brooks). The other are the subversive, mover-and-shaker Christian (James Deen) and his masochistic girlfriend Tara (Lindsey Lohan). Gina knows Christian and pulls some strings to help Ryan get a role in a low-budget horror film. Right off the bat, it is made clear who is corrupt and who has maintained some level of innocence. The line drawn between these two qualities isn't as bold as the film continues.\n\nThe film was shot well and the acting was fittingly detached. Schrader is known for being psychologically penetrating and, contrary to many other critics, I believe he shines in his direction here. The mistake commonly made when viewing (or reading) the work of Ellis is to expect his character's intricacies to be spoon fed to you. Much is implied in the dynamics of their interaction. Their unrelenting one-dimensionality is what makes them compelling. Why do they care so much about material gain and power, in spite of the extreme pain it causes them? Or better yet, why do we? The answer is in the mirror. This is the territory Ellis's characters enter. And it is a place where, if we look closely, we might see what time it is, if we don't cringe and automatically dismiss its relevance in the wake of our confusion."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "lionarea86",
        "review_rating": "7",
        "review_title": "Unusual movie, still worth a watch",
        "review_detailed_main": "The film just finished. I'm happy with it. I think it's a 7 out of 10. Main reasons why:\n\n1. Lindsay Lohan outshines from her partners. She delivered a very good performance. You actually get to like her character and get to bond with Tara as you watch her struggle with Christian and Ryan. James Deen did a good job, too.\n\n2. Good photography. It was nothing spectacular but it looked pretty decent for an Indie movie which has a low budget.\n\n3. Even if the movie was boring at times, it kept you wanting to know what was going to happen next. A hook is needed in every movie, and The Canyons does not fail here. You what to understand the story and you want to know how the movie ends.\n\n4. The Canyons, even with a lot of weak points (direction, editing, script) is fresh, unconventional, edgy and, after all, that's what an indie movie should be so it fulfilled my expectations.\n\n5.The ending leaves you wanting more, you don't expect that to be the end, and I think that's wonderful.\n\nOverall, it's a good movie, y'all should watch it, just remember to focus on the movie and NOT on it's controversy and media reception."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "cindyrellaexists",
        "review_rating": "1",
        "review_title": "Why? Seriously why make this movie?",
        "review_detailed_main": "I watched it during the COVID pandemic quarantine on a streaming service and I still want a refund."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "Red_Identity",
        "review_rating": "",
        "review_title": "Kinda entertaining",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "rpete528",
        "review_rating": "1",
        "review_title": "Steaming Pile",
        "review_detailed_main": "That's what the name of this basement masterpiece should be called. Lindsay Lohan isn't going to go far in her career doing movies like this. She really needs to take care of personal issues I think. It doesn't appear that drugs and alcohol are a thing of the past yet. She looks hard. Much older than she is. Her acting is so limited in this and what a shame too. I was not impressed by her and I have to ask, was it me or does her left eye appear to closed in a few scenes? Then we have a porn star who might be able to do some community theater work at best. The story sucks. The music sucks and wtf is with the ending? This was supposed to be an erotic thriller. Well, this movie gives new meaning to that."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "MasterCD",
        "review_rating": "4",
        "review_title": "Under-Written Over-Acted Borefest",
        "review_detailed_main": "I'm a Paul Schrader fan, Ellison is a big so what, and Lohan is a fabulous train wreck with talent. I was hoping this combination would create a B movie extravaganza to rival Beyond the Valley of the Dolls. The elements were in place, but damn, this is one inept movie. If you didn't know the pedigree of the players you would think this was a first film by a pair of twentysomethings. Perhaps, that's where Schrader was on the money with his complaint that SXSW should have included them in their line-up. I suspect Canyons was rejected by SXSW b/c in so many ways its an unintentional parody of the type of crap Indies that SXSW loves to show. The kind where the acting is awful, barely any plot, no style and the characters blah blah blah about nothing. The blah blah talk reminded me of that awful SXSW film, The Weekend. Jimmy Deen is terrible. He delivers his lines in a monotone too quickly. The only shining light is Lohan and poor baby, some of the camera angles and makeup choice are just unkind. The cinematography is lousy with a smattering of some interesting shots. The bore factor and bland looks place this below an episode of the Hills. I'm sorry to say there isn't even an ounce of cult love I can give this one. Misfire all the way."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "otoole007",
        "review_rating": "1",
        "review_title": "I have to believe that all those stills of deserted cinemas",
        "review_detailed_main": "... Is a message that cinema is dead. This movie is certainly a sign.\n\nI would have expected at least some titillation from Schrader and Elllis. Some decent violence, sex.... A worthwhile story maybe?\n\nThis movie is unbelievably flat. The rest of the actors are so incredibly awful they make Lohan look good (well better than them).\n\nDeen is a real revelation. Possibly the worst performance I've seen and it is not a style decision. Hope his cock performs better than the rest of him.\n\nDid Gus owe these Gus a favor? Unbelievable how beaten LL looks. Has the face of a 50 year old alcoholic and that's with professional makeup. Just because everyone in the flick keeps telling me how beautiful she is doesn't make it so. I honestly hope she can clean it up."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "neilwaynesmith",
        "review_rating": "1",
        "review_title": "Oh. My. God...",
        "review_detailed_main": "Watched the last hour plus because I was channel hopping and, well I flicked on as Lohan was in the shower >blush<.\n\nHaving sat in front of the TV, mesmerised by the paucity of acting, of expression, of plot, of decent dialogue, of chemistry between the actors even;.... desperately begging myself to change channel, it soon became evident that not even Ms Lohans charms could rescue this car crash.\n\nIn summary, if I thought I could sue the film company for sucking an hour of my life away, I would do so without hesitation...\n\nLastly, I think for films like this, the voting scale should encompass minus figures..."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "khaligari",
        "review_rating": "1",
        "review_title": "I think this is it!",
        "review_detailed_main": "This may be the worst movie I have ever seen in my lengthy life. Pure garbage. What was the point in making this? It says nothing, it's not even Showgirls-level camp. I've never been fond of Bret Easton Ellis, but I figured Paul Schrader might be able to do something with his vacuous, self-absorbed characters. NOPE! I know Schrader had to promote this movie after its release, but it is baffling how he constantly defends Lindsay Lohan's terrible acting. Actually as bad as she is, she's not even close to being the lowest on the acting scale here. Deen is terrible, but I guess he wasn't really hired for his speaking skills. What I can't understand is how the Ryan character gets acting jobs. I mean, do you want your movie to be at the level of community theater? Hell, at least the actors there try. At this point I have lost all respect for the once great Schrader and consider him little more than a dirty old man with a Lohan obsession. If you're interested in the nude scenes, save your money & just seek them out on Utube."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "kubpink",
        "review_rating": "7",
        "review_title": "The manipulators (and Schrader is the smartest of them)",
        "review_detailed_main": "Having watched the film, which I discovered thanks to an article in Télérama, it is indeed regrettable that it has not received more attention. Except that it is (almost) not a movie about movie people, contrary to what said Schrader (who mocks the person who asked him what his film dealt with), but a critique of modern youth (there goes Ellis) and its digital alienation. The film industry it is supposedly taking place in is a pretext here and all the shots of abandoned film theaters dotting the story may be the prophetic vision of an artist sensing that his means of expression will soon see its classic format (the silver screen) disappear forever. For in The Canyons, the protagonists cannot communicate otherwise than lying to those they \"love\", but above all they cannot take off their eyes and fingers of their smart-phones screens. These terminals, housing both the existence of their owners, but also allowing them to follow all their past and present \"friends\" (through sms, emails, social networks, applications to find f**k buddies) are for Schrader the emulators of the paranoia and jealousy of his characters. And, finally, all the shenanigans that these people can do remain more entertaining to fill their life than making a film or even than sitting in a theater to watch one."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "adj-699-887746",
        "review_rating": "1",
        "review_title": "Whoa boy...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "boydwalters",
        "review_rating": "8",
        "review_title": "Really Pretty Good",
        "review_detailed_main": "God knows where these freaks are coming from that are giving this film so much hate ... Probably middle America ... Oh yes ... There's no big explosions ... No monsters, well Bret Easton Ellis is probably a bit of a monster :)) ... But the fact is the film is engrossing ... James Deen is great in his part ... I've always thought anyone who is good in porn MUST be a great actor and the great ones usually are ... Lohan is good but I hope she starts looking after herself a bit better cos she is looking a little damaged ... The rest of the cast range from spot on to may be a bit off ... Just like any Hollywood film ... The story has the usual BEE nihilism but not as heavy as his earlier work ... This is not a slasher movie ... Its a mood / character piece ... And in many ways a requiem for the lost days of true cinema ... Its well worth the 90 minutes of your time if you like film and not just hollwood gut busters"
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "swordfish_man",
        "review_rating": "6",
        "review_title": "Lindsay carried it",
        "review_detailed_main": "Look, yes it's low budget, but it has a charm to it. I can appreciate the effort that was put into this. May not look like much, but there definitely was. People can be harsh with their judgements, so I will say no, the acting is not terrible, realistically. I mean come on, there are waaay worse movies for bad acting out there. At least their was real ambition behind these actors. Some reviews say the dialogue is bad. I didn't think it was. It was cringy at times, and I wish they didn't say \"babe\" as much, but it wasn't hard to listen to. Some parts of the movie have really professional looking shots, yet it is balanced out with home-made looking shots - but honestly, watch this movie in black and white, and the quality goes up. It helps make the movie more artsy. I swear, b&w makes everything look better. The music is unique. I get the vibe. But lets get real people, Lindsay was pretty great in this. She held the film together. I really enjoy her acting, and she had some great moments in this (crying scenes in particular). Lindsay held her own, and I thought it was a great role to see her play. So in conclusion, if you're a Lohan fan, I think you'll enjoy it. It's really not as bad as people make it out to be. There's so much worse."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "Jerghal",
        "review_rating": "2",
        "review_title": "Cave Troll",
        "review_detailed_main": "This is the worst piece of junk I saw all year! In the cast we have Lindsay Lohan -a beautiful and sexy girl at the time of Mean Girls- who now looks and sounds like a Cave Troll (the booze and the drugs haven't been kind to her) and James Deen a real life porn actor who might have a big schlong but a minuscule acting talent. The film is so empty and meaningless it almost seems like Paul Shrader just turned on the camera and left the building - there seems to be no directing whatsoever involved. Writer Bret Easton Ellis must have written it on toilet paper while he was taking a dump and used it to wipe his behind coz the script reads like sh*t. Oh, and there is 'music', but it's so bad you unconsciously block it out. Cinematography mainly consists of pointing the camera at their faces and making sure some lamps are turned on so we can see the actors. The funding for this $250.000 disaster came from poor schmucks on kickstarter who might have hoped it would amount to something...NOT! My guess is this crap will rake up more razzies than Catwoman, Battlefield Earth and the Twilight Saga combined. Avoid!"
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "italian_shoegal",
        "review_rating": "",
        "review_title": "I didn't even make it halfway through",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "tmccray",
        "review_rating": "1",
        "review_title": "Unwatchable",
        "review_detailed_main": "To be completely honest, I did not see the entire movie... I couldn't bear to watch it all. It's so incredibly bad. I would have never paid to see this, but it was on TMC and I happened across it.\n\nIn Lindsay's OWN network reality show, someone showered her with praise about this movie. I should have known it was merely sycophancy. Everything in this movie is bad, from the script to the acting to even Lindsay's makeup. Did she look in a mirror before she walked in front of the cameras? Did they put caterpillars above her eyes?\n\nI know she's desperate to act in \"anything\", but accepting roles in this kind of trash will result in fewer future opportunities. The only potential value of this movie is for those who want to see stars showing some skin. This is the only role I've seen Lindsay in with nudity. However, I haven't seen many of her recent movies, so this may not be unique."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "streetend",
        "review_rating": "3",
        "review_title": "Watch if you have nothing else to do.",
        "review_detailed_main": "I was looking forward to watching this movie expecting loads of Hollywood scandal, which there was to an extent, with bloody murder and intrigue in abundance. But I just thought it did not deliver on all fronts unfortunately. I found myself ready with the off button but then deciding to give it a bit longer, thinking it's got to take off at some point. And that was the way I was throughout the movie. I was just waiting for that moment to say, now here we go, but I never did. A film full of emptiness and not really going anywhere. I thought the acting was poor. I was expecting a lot more from it, maybe a bit too much. A movie not to write home about and don't go out of your way to watch it."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "raynaking0",
        "review_rating": "1",
        "review_title": "One of the worst films I've ever seen.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "Nadara_G",
        "review_rating": "1",
        "review_title": "It's Crap",
        "review_detailed_main": "Okay. I haven't seen a movie this horrible for a long time now. The plot is stupid and trivial, the ending is kind of idiotic and if you will be able to watch it without rewinding you deserve some sort of a medal. But the worst part about the movie was how horrible the actors were. I mean I couldn't find one single actor who was good in that movie. I really think James Deen should go back to porn and take the whole cast with him. And about Lindsey Lohan I don't know what she did to herself but she looked like a mummy in this movie. First of all she didn't do well as an actress but I think her plastic surgeries went really wrong. One of her eye was always shutting down, her eyebrows were always on a wrong place and moving really strangely and she looked terrible. So, horrible plot, horrible acting, I guess the conclusion is the movie is just HORRIBLE! Don't watch it if you value your time!"
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "A-Koppelman",
        "review_rating": "1",
        "review_title": "Save your money and time",
        "review_detailed_main": "Bad movie. I would have given it a 0 if I could have. I rented it only because I am a Lindsay Lohan fan and I thought from her past work it might be somewhat good but it wasn't. The acting was horrible by pretty much everyone especially the \"porn star\" James Deen who supposedly kept the name from friends who called him that from the way he smoked when he was only 12. The real James Dean has been put to shame by this guy stealing his name with the exception of it being spelled differently. This movie constantly reminded me that they were attempting to \"act\" and a was watching a movie.. That alone made me shut it off 30 minutes in. I hope whoever put money in to make the movie made it back or learned a huge lesson from this disaster."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "morrison-dylan-fan",
        "review_rating": "6",
        "review_title": "Grand Canyon.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "ironhorse_iv",
        "review_rating": "3",
        "review_title": "This movie was not grand at all! It was really below average.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "sinnerofcinema",
        "review_rating": "10",
        "review_title": "Deliciously twisted, yet deadly serious...a sweet treat!",
        "review_detailed_main": "Paul Schrader's \"The Canyons\" plays out as a cautionary tale of producers & actors ambitions gone awry. Porn star James Deen is Christian, an obsessed film executive producer. Performed with much dedication and delight, he is definitely a talent to watch as his presence lights up the screen with a dual vitality of charm amongst the midst of darkness in this sordid story of manipulation, vengeance and greed. When Tara, Lindsay Lohan, crawls her way to a better life via wealthy Christian, she also finds a way to carry along her long time love interest Ryan, Nolan Funk, only to realize that in life and relationships alike, everything comes at a price.\n\nSex is used as the main tool to enact corrective enforcement from Christian as well as Tara. Using this same device, struggling actor Ryan realizes that he must go above and beyond the call of duty if he's to save his principal role in Christian's film. What is to be determined by the protagonists who engage in very sultry situations, is how far they are willing to go to pay for the price of personal and career fulfillment.\n\nEveryone has an agenda in this movie. some with plans more evident than others, and when actions don't align the consequences can be severe. A much publicized foursome including LiLo & James Deen and another couple they invite into their bedroom smartly creates a table turning set up that will ultimately plunged the tug of war between the two protagonist Tara & Christian into a surreal, albeit conflicted ending. Actor James Deen beautifully carries the film with a dark charming eloquence as he smoothly enables his obsessive plans into action inconspicuously through anyone surrounding Tara who can be bought or swayed by any means necessary.\n\nThere are minor technical flaws with sound and focus which by no means are a deterrent to the story Schrader wants to tell. It only becomes a reminder of the limited resources used to bring this independent visions to fruition. Performances from the cast is somewhere between dead serious to campy. This interesting range, some may find it distracting from the story, others may welcome it as an additional oddity within the assaulting feeling of doom and gloom that permeates the picture.\n\nThe beginning of the film smartly defines the setting and much of the tone of the characters by showcasing once vibrant movie theatres now sadly abandoned defunct venues. This is an allegory that may very well parallel the unforgiving ways of Hollywood and how if left unchecked, unscrupulous cunningness with a bulldozing determination can decay beauty & innocence. That is the case with Tara & Ryan. In a business where the main commodity is the human trade of talent, \"The Canyons\" does succeed in demonstrating a microcosm of real personalities as they struggle to find their voice in a sometimes all consuming illusionary reality created by Hollywood and the ever revolving doors this dream machine creates.\n\nreview from Entertainment Film News"
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "felixmartinsson",
        "review_rating": "7",
        "review_title": "It's fantastic!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "stevenaisbitt",
        "review_rating": "2",
        "review_title": "A painfully slow, boring, labored turd",
        "review_detailed_main": "The dialogue heavy script is actually painful to watch. The actors are all wooden as logged timber. Lohan is especially clunky and comes over as dumb, whorish and trashy, not remotely sexy. I agree with one of the other reviewers who wrote that her noticeable beer belly isn't particularly alluring. It's supposed to be a dark, sexy, moody movie. What you get is slow, stilted boredom, and almost two hours of your life stolen. The score is horrendous and jarring also. Avoid. I wish I had."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "chaos-rampant",
        "review_rating": "",
        "review_title": "Exposed selves",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "moviestar26",
        "review_rating": "5",
        "review_title": "Erotic neo noir",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "Luis_Felicio",
        "review_rating": "1",
        "review_title": "What a disappointment",
        "review_detailed_main": "Mr Paul Schrader\n\nYour a decent filmmaker with titles to your credits like Hardcore 8/10, American Gigolo 6/10, Cat People 9/10 and Mishima 6/10 (these are my scores) to name a few, and now there is The Canyons .... what a disappointment.\n\nLindsay Lohan ??? is she even an actress or someone with a so/so face a some b**bs ?\n\nJames Deen 1013 films to his credit !!! that's impressive, but in ALL of them the thing he uses best is his lower head ....\n\nMr Schrader, did you saw the casting before shooting ? They don't act, at some parts they look like they are reading the lines.\n\nAnd what happened to the camera ? it shakes all the time, is that a new trend, low budget or just bad professionals ?\n\nThe only thing i liked was the soundtrack, really well chosen and right for what was happening on the screen.\n\nI like the writing of Bret Easton Ellis, but this story was kind of a mess.\n\nMr. Schrader, i hope to see a good movie from you, the next time."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "zamansm",
        "review_rating": "1",
        "review_title": "Softcore Porn",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "MaxDM",
        "review_rating": "1",
        "review_title": "Needed Lindsay to hold it up",
        "review_detailed_main": "This is one of the B graders that fails to really go anywhere. The story is really hard to follow and has several goofs in it just to complicate this further. By the end, you really have to ask yourself \"what was meant to happen\".\n\nFrom my perspective the film looked like a poor excuse to give James Deen is big break from seedy porn to Hollywood, while Lindsay holding his hand all the way. With the amount of graphic nudity shown by the two male actors, and in particular Deen, I can understand Lindsy's protests during production, as this has the potential to tar her reputation as a porn actor, rather than lift Deen's image. By media reports, if Deen behaves in real life as he does on film (one of LiLo's protests), then I can also understand her concerns and having days where she does not want to show up.\n\nWith everything so vague and by the end of the show, I could not make out what was the goal of the whole movie. If you like close-ups of Deen's anatomy then this might be the show for you."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "FlashCallahan",
        "review_rating": "1",
        "review_title": "Canyon?, more like Pothole.....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "Manuel-Hoerth",
        "review_rating": "7",
        "review_title": "Very shallow, but if you dig deep enough, you can find some depth",
        "review_detailed_main": "Yes, it's a shallow movie with a shallow story, shallow characters, bad cinematography and mediocre acting that desperately tries to make up for its shortcomings by throwing in a bunch of entirely unnecessary nudity - but I feel that's the point!\n\nThe movie is very self aware and criticizes the sad state of Hollywood nowadays, which is made clear not only by the characters who are all in the movie industry and are basically all portrayed as total sell outs in one form or another who couldn't care less about the actual movie they are making, but it's also made very obvious by the footage of the abandoned movie theaters etc. at the beginning and end of the movie and by the constant 4th wall breaks, be it by the intentionally careless cinematography, the characters seeming awareness that they are in a movie or by the actors constantly starring at the camera...\n\nI don't know if the movies really succeeds at being meta, but it's very obvious that it tries to be, so I am suppressed that most of the critics didn't even seem to notice that at all. They are already so accustomed to seeing shallow movies, that they really seem to think that that's all there is to it, so in a sense the critics not even realizing that the movie tries to be meta, only serves to reinforce the message of the movie..."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "solidabs",
        "review_rating": "1",
        "review_title": "Just numbingly Horrible",
        "review_detailed_main": "I have never seen Lindsay Lohan Act. Never seen any of her movies at all. I only know of her through her criminal ways. Plus I have always thought she was Kinda sexy in a dirt baggish way. Anyway the movie was horrible. Lindsay is a horrible actress. I don't know if she just can't act cause if all her drugs and alcohol problems or what. But she can't act and her voice is painful to listen to. She does still have a decent set of mammaries, but that is it.\n\nWhat year was this suppose to have taken place in?? The Lingerie Lindsay was wearing was it the 50's ?? Or was she just doing a 2 Hour Spanks Commercial. Anyway watch the movie for the few Lindsay nude scenes only. Warning they are not good."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "gladiator2201-755-90519",
        "review_rating": "8",
        "review_title": "Better than expected!",
        "review_detailed_main": "The Canyons is an engrossing soap opera-esque film. Director effectively captures the seedy atmosphere of Hollywood fringe players. All four leads give decent (somewhat uneven) performances, with Lohan and Deen showing flashes of higher ability. There are some tense scenes of man on man action to keep things interesting. Sex scenes are not played for eroticism, but rather as chilled, impersonal interactions and playing fields of psycho-sexual mind games. The memorable, menacing electronic score sets a fine pace for the story to unfold. I wouldn't call this a comeback for Lohan, but it's definitely a big step in the right direction towards legitimacy. My only (minor) complaint would be the sound of her voice when she's crying.. her off-putting, asthmatic squeals do her no favors. I went in expecting a total mess of a film and walked away feeling satisfied and impressed."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "michaeltrivedi",
        "review_rating": "7",
        "review_title": "Good Movie",
        "review_detailed_main": "This is a very interesting watch. The combination of Ellis and Schrader is a genuine treat. Lohan does a great job of doing what she does. And the other actors brilliantly keep the movie rolling.\n\nIt is an intriguing story of actors and wealth in Los Angeles, particularly the Canyons. The film delves into pornography and murder, which at times can get rather boring. But it definitely held my attention, and is my favorite type of movie.\n\n7 Stars"
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "patologul",
        "review_rating": "1",
        "review_title": "worst movie ever",
        "review_detailed_main": "worst movie of all time. has no beginning and end, you do not understand any of it. The scenes where the shooting had nothing particular is a low budget film, Lohan thinks sexy but fails to be just a bad actor, fat, devoid of eroticism and no little acting talent. The actors in the film are not distinguished by something. No phase memorable scenes acre there to remember them. It is an amalgam of words and pictures without logic. a mixture of eroticism and homosexuality cheap. What I was unhappy with the mobile advertising front Lumia Windows operating system. true as in other films promoting products, but this is all too obvious. The film can compete successfully in the worst movie of the year. Lohan is an actor who disappoints daily."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "Dawn_Assayas",
        "review_rating": "",
        "review_title": "Paul Shrader's THE CANYONS is actually a pretty good film!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "hollywoodshack",
        "review_rating": "3",
        "review_title": "New title: As the Casting Couch Turns or Internet Junkie Hotel",
        "review_detailed_main": "I am surprised Paul Schrader, known for Taxi Driver and Patty Hearst, would direct a film with so many time wasting random movements that students in film school were told to cut out. The characters spend a lot of time getting out of cars, walking up to a door to enter and find someone in a room. And the worst people for the leads were picked, probably because they were so well known as celebrities but not quite as much in the acting department. James Deen has 200 porn films, Lindsey Lohan 200 appearances on SNL and probably as many substance abuse incidents. The scripter, Bret Easton Ellis, should go to an unplug camp for internet junkies and stay a year where he can write five minutes of film without the actor talking on a cellphone or picking up a laptop. No doubt Deen and Lohan just needed a career SOS on their resumes, with him getting old and her running out of acting work. They do well in spite of the dull pacing. Christian is a tyrant director jealous his girlfriend (Lohan) is seeing another guy, the lead in his film, so he knocks off a girl who knows a scandal in his past. He seems to have gotten away with murder and you'll think so did those who churned out this tripe. Agents need to stay out of producing films."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "csr1000",
        "review_rating": "4",
        "review_title": "Not quite as bad as I expected, but far from great.",
        "review_detailed_main": "I wanted to give this a solid 3.5, but half-stars aren't allowed, so I've rounded up to 4.\n\nThe critical and popular reviews of this films seem to agree that it's a disaster. However, I like Bret Easton Ellis and the some of the images in the trailer, for example the run-down theatres I found enticing. For this reason I felt I really had to give this a watch.\n\nFirst off, I'd have to say that this move had potential. If they could have replaced some of the cast with actors who could deliver a line with some semblance of believability, it would have had a chance. Surprisingly James Deen was not terrible. Perhaps also surprisingly, Lindsay Lohan was pathetic. I'm not a huge fan of hers, but I've seen her act before and not like this. If this role had been early in her career I'd guess she may not have had one.\n\nThe plot was weak, and I don't have to warn of spoilers here as there wasn't really any mystery to solve. The second last scene was painful simply because the lines were so poorly delivered. The director couldn't have been present, or maybe he was as high as the actors likely were. I've seen better acting in high school plays.\n\nThe last scene was funny--there was a clever musical climax to tell you that something shocking happened, but nothing did.\n\nThe \"sexy\" scenes were decidedly not sexy at all. In fact I don't think I've ever been this utterly NOT titillated by nudity in a film.\n\nAll in all, I'm glad I watched it just to say that I did, and to know what I didn't miss. However, I'm equally glad that I watched it for free because I would seriously resent a $4 rental of this flick."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "tamaramarkovich",
        "review_rating": "1",
        "review_title": "Soooo bad",
        "review_detailed_main": "Well watched this one out of the curiosity. Now I am thinking it would be better if I watched porn - less boring dialogues and actors usually know what they are doing. People in this movie should go back to whatever they know how to do, as acting is not it..."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "I_Ailurophile",
        "review_rating": "1",
        "review_title": "I tried to find something meaningful to appreciate here. I didn't succeed.",
        "review_detailed_main": "I've been so very curious about this movie. To read about the production, and everything that went on behind the scenes, the whole affair sounds like a questionable mess. Paul Schrader has been involved with some terrific films (1982's 'Cat people' is a personal favorite), though on the other hand, some total rubbish, too (e.g. 2016's 'Dog eat dog' was just awful). I hope some day Lindsay Lohan sorts herself out, but she has struggled personally and professionally for a long time; the very notion of seeing James Deen in a straightforward acting role is a little strange; Bret Easton Ellis can claim some deserved renown.\n\nAnd, well, then one sits to watch.\n\nFrom the very first scene so very much about 'The canyons' inspires skepticism, or is altogether aggravating. Tim Silano's editing immediately raises a quizzical eyebrow, and one can only hope that Ellis' script will eventually prove to be less blunt, vapid, and senseless than it seems from the outset. Schrader's direction feels emphatically tactless and unsubtle, or at times even hopelessly scattered; in that brief scene after Tara first sends Ryan a text, for example, the moment feels so divided that I can't actually figure out what Schrader was doing. The original music of Brendan Canning and Me & John ranges from \"unremarkable but fine,\" to \"indescribably off-putting.\" Other crew behind the scenes may put in good work, and this is well made from a technical standpoint, but what do these facets matter if the most substantive elements of the picture are so tawdry?\n\nCan irritatingly forthright, forceful, unnatural performances, bereft of nuance and believable emotion, be chalked up to a lack of skill on the part of the cast, flimsy material, rotten direction, or some combination thereof? Whichever the case may be, Deen especially stands out like a sore thumb, and I don't think it's unfair to say that Lohan demonstrates the strongest acting of anyone here. However, is this because she has real chops to manage the part - or just because everyone else is significantly worse than she is? I'm honestly not sure what the answer is, and that very fact is deeply concerning. There are fragments of suitable storytelling in Ellis' writing, but the dialogue, scenes, and characters are so weak, flat, phony, and dubious even as written as to far outweigh any meager possible value, and the narrative itself, and the plot development, are very thin as it is. The substantial sex and nudity never feels meaningful or sexy, only pointless, tiresome, and annoying.\n\nEgads, this is not good. Writing, direction, acting, editing... It's so putrid that the most generous view may be to assume that 'The canyons' is intended as a parody of some sort, or an R-rated variation on the sort of over the top melodrama that characterizes Lifetime original movies. It's never funny, though, or baseline entertaining. For as poor of an impression as it makes from the very beginning, it only gets worse as the length draws on; 99 minutes feels impossibly long. I searched long and hard through this feature for a pinprick of light, something worthwhile to hold onto, but the solid contributions of the crew aren't enough, and as I'm truly unsure if Lohan's acting is up to snuff or not, that's definitely not enough, either. I don't know what Ellis was thinking, or Schrader. I don't know who would enjoy this, let alone who I would ever recommend it to. This picture is a mistake, and so is watching it."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "buckeyes-05926",
        "review_rating": "1",
        "review_title": "The films shows how far a star can actually fall in life.",
        "review_detailed_main": "Lidnsey Lohan oh what has happened to you and where has that talent gone. Lohan now is make soft core porn with porn stars. A film that instead of commenting on the vapidity of the film industry, Paul Schrader's miscast, poorly executed and utterly soulless drama is an example of the failing art form it seeks to indict. Though it has real ideas, Schrader and his team never manage to put them into action. Lohan has been atrociously directed, allowed to get away with the worst aspects of her vocal-fry laziness, and trotted out like a symbolic objet d'art. Paul Schrader and Brett Easton Ellis don't have the sense of play this kind of narrative of one-upmanship requires, as we're never allowed to enjoy the characters' misdeeds."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "kapelusznik18",
        "review_rating": "6",
        "review_title": "The man in charge",
        "review_detailed_main": "***SPOILERS*** It's James Deen as Christain looking a lot like cyber flasher freak Congressman Tony Weiner aka Carlos Danger who's been having this obsession of ruining young struggling actor Ryan's, Noland Gerald Frank, life after he found out that he was having an affair with his now girlfriend Tara, Lindsay Lohan, before he met her. Bankrolling this slasher film to be made in Mexico Christian had Rayn picked for the leading role as the slasher. Unknow to Rayn Christian planned to ruin his life both financially as well as professionally before the movie even started filming.\n\nIt's later that Christian uses his gay special effect expert Jon, Jim Boeven, to get him to tell Ryan that Christian is dropping him from the cast and have him, for a better word, put out so he'll get him to change his mind. Still pulling the string Christian uses Jon's internet expertise to clean out Ryan's bank account, all $15.12 worth, leaving him penniless and causing his relationship with both Tera and present girlfriend Cynthia, Tenille Houston, to brake up. Not only that he frames Rayn for Cynthia's murder that he in fact committed!\n\n***SPOILERS*** The movie was about a spoiled brat, Christian, who always had everything go his way and when he didn't he struck out with deadly force at those who were in his way and didn't go his bidding. It was poor Cynthia who ended up getting the worst of it by paying the ultimate price, her life, for not staying with him despite his obvious deteriorating mental condition. As for his surviving girlfriend Tara I can imagine what her life will be like with this crazed and power addicted lunatic breathing down her pretty neck. He can get away with murder through blackmail & intimation which seem to be his best qualities that strangely enough attracts foolish and naive young girls like Tara & Cynthia who end up being his victims like here in the movie."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "Lott444",
        "review_rating": "1",
        "review_title": "Very accurate depiction of life - BORING",
        "review_detailed_main": "What was unique about this movie is it is very close to real life. Probably the most accurate representation of an average life in America today. No, not because we all have people like these characters in our lives - we don't and we wouldn't be able to stand being near these sleaze-balls - but because in this movie ABSOLUTELY NOTHING INTERESTING HAPPENS. Just like an average day.\n\nPeople argue, sit around, have dinner, argue, talk to one another, make snide comments to friends, sit around AND argue. Nothing intriguing happens, it's just status quo. You see, most writers write stories and movies with interesting and novel tales both realistic and fantastic to grab and maintain the attention of movie-goers. These writers chose not to even attempt to tell an interesting story. I have to respect that. Bold and risky.\n\nLohan comes off as sedated and keeps her clothes on for the most part (not that there is anything left to see). The other actors are forgettable. The male lead is a porn actor and it shows in his acting.\n\nThe worst part is the ending. There is no ending. The movie just stops abruptly. Who green-lit this? Anyway, this movie is like a boring episode of a reality show. Skip it."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "littocona",
        "review_rating": "10",
        "review_title": "Indie movie of the year.",
        "review_detailed_main": "This movie was really a one of a kind. It was amazing from start to finish and is very engaging. The characters aren't overly interesting but they don't have to be. All of the actors, especially Lindsay Lohan, are very very good, especially Lindsay. It's the kind of movie you either hate or love but you really need to see it and judge it yourself, as the reviews are all very opposite of each other. If you have an appreciation of indie/artist films then you will most likely like this film. Some of the camera shots are beautiful and although the script isn't top notch it is still good enough that you don't think \"what are they even talking about right now?\" I don't recommend it to people with high morals in regards to nudity as it can be quite shocking at times, but overall this is an amazing film."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "emmiilp99",
        "review_rating": "6",
        "review_title": "I liked it!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "connie_paknadel",
        "review_rating": "4",
        "review_title": "A novelist is not a screenplay writer.",
        "review_detailed_main": "I am a huge fan of Bret Easton Ellis, but I believe that this film fails because Ellis' writing style does not translate to the screen. Without any narration to fill in the gaps, it is just sparse, monotonous dialogue and shots of the scenery. The Canyons tries to emulate the characteristics of American Psycho or Less Than Zero, but with no insight into the characters minds like we would get in a novel, it falls incredibly flat. Tara is a one-dimensional character, a woman who men become obsessed with, but we're given no reason why this is so. We don't know anything about her by the end of the film. The same is true of all of the other characters.\n\nEllis deals in superficiality, but somehow this film fails to tap into the tone of quiet desperation that makes his written work so compelling. The direction, also, tries *too* hard to remind us that these characters represent a hundred or more different people - from the opening scene where the camera focuses on the people *not* speaking, to several shots throughout where heads and faces are deliberately cut out of the frame. I understand the rationale behind it all, but unfortunately, with the film trying so hard to keep its characters faceless and shallow, it's easy to end the film wondering what the point of watching it was.\n\nFor what it's worth, the acting is fine. But The Canyons is ultimately a hollow experience."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "raul-458-137166",
        "review_rating": "4",
        "review_title": "Shallow movie, shallowness all the way.",
        "review_detailed_main": "The Canyons, an erotic thriller by Paul Schrader, the independent film promised more that it actually achieved, DeFazio's cinematography was impeccable, but character performing was deficient, completely shallow in some parts, incoherent in another ones, Lohan's character was lacking of acting strength, while, Deen's was fluctuating either overacting and underacting. The director seemed to try redoing \"Autofocus\", with a maintained suspense level with little emotional uprising spikes, while the script reflected the image of an empowered man who shined in American Psycho, with a powerful plot line and crescendo suspense spikes, overlapping Direction and Script in a relentless battle. Some spikes, caused a gaging effect in the audience instead of the dramatical force they supposed to have. The main plot was shallow, was lacking of a real leitmotiv or sometimes irrelevant for the characters to be, its a shallow movie, we get it, but you don't have to perform shallowly in a shallowly movie, if you want to be shown as \"shallow\" you give the best doing that. Art direction was interesting, well employed, the music was also themed with the motion pictured, if what XXX and crew wanted was to get a shallow movie with naked parts and no intellectual value, they nailed it!, otherwise, the film leaves much to be desired..."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "sussmanbern",
        "review_rating": "4",
        "review_title": "Life with Psychopath ..... no, not Lindsay",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "newyorker_ny88",
        "review_rating": "1",
        "review_title": "Boring and cheap acting",
        "review_detailed_main": "Boring movie and cheap acting .. i wasted 2 hours of my life"
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "soundoflight",
        "review_rating": "5",
        "review_title": "Flawed, but not as bad as the main rating makes it out to be",
        "review_detailed_main": "This is an interesting film, made for people who are into interesting films. But interesting doesn't necessarily mean good. While \"The Canyons\" managed to hold my attention throughout (a topless Lindsay Lohan at seemingly every opportunity doesn't hurt), it never really compelled me. It was kind of like watching a TV show when nothing else was on.\n\nProbably the main failing of the film, and I'm unsure whether it was the acting, writing, or directing (I'm thinking the directing), was that the main character of Christian played by James Deen was in no way scary, crazy, or psychopathic, despite the fact that he was supposed to be. I can't help but think of that other Ellis vehicle \"American Psycho\" where Christian Bale and the director of that film made a highly compelling case of psychosis. If Bale and that director were transplanted into \"The Canyons\" in place of Deen and Schrader, we very well may have had a minor success, instead of a film that was almost universally panned.\n\nI was going to really slam Paul Schrader's directing skills until I saw the budget. Now I'm reconsidering. On a dollar/goodness ratio the movie seems a bit remarkable. There are multi-million dollar movies that I would never willingly sit through again, but I could probably be convinced to give \"The Canyons\" another spin someday. All that being said, I do think the film suffers from poor production, bad music, and I still don't think Paul Schrader is a very good director.\n\nI'm not privy to what sort of machismo made Ellis/Schrader/The producers decide that $250K was enough to make this movie, but they were wrong, and end product suffered as a result. There is a sub- theme that kind of cast derision on the entire film industry and Hollywood itself, and it seems like this bled through into the production itself. The irony is that such an attitude makes it impossible to actually make a successful film, and it begs the question to the aforementioned group: \"why even bother?\""
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "caspian1978",
        "review_rating": "5",
        "review_title": "Hollywood in a nutshell / a cry for help PSA",
        "review_detailed_main": "The Canyons may not have accomplished what I feel it set out to do. Whether you liked this movie or not, it made a financial profit. So for that simple reason alone, the Canyons was a giant success. There are many box office bombs that are brilliantly filmed with a moral message, but bottom line, they failed to find an audience or make a profit. Lindsay Lohan is the only reason why one would want to watch this movie. Millions have paid to watch and Millions have googled certain images of this movie. The Canyons is an example of a Lifetime Movie with nudity. With that said, it is hard to consider the Canyons a good or even a serious movie. Everything about this movie is hard to watch. The acting, the directing, the storyline, and the movie's overall message to the audience. The \"magical movies\" which Lohan's character talks about is lost among the audience. I believe the Canyons does represent how Hollywood has been to many people. After all, the Canyons is located in the city of Lost Angels. A canyon after all is a giant hole, an abyss. The Canyons comes across as a \"cry for help\" of a movie that talks about how people have been victimized by the movie industry and by the people in that industry. The Canyons covers: sex, physical & mental abuse, murder, drugs, prostitution, homosexuality, manipulation, with failed therapy, failed love, failed relationships, failed dreams and the movie industry that is somehow connected to all this. The hundreds of closed cinemas is an attempt to showcase the reality of where dreams were once present. And in the middle of all this is Lindsay Lohan, whom, is a survivor but an overall victim of this industry. In the end, everyone in the cast has been used and has lost their innocence. From Disney to pornography, the journey of these characters who came to Hollywood for the magic of the movies are left on the side of the road. They live surrounded in fear and regret. Like a failed audition, they are over looked and passed by where no one has chosen them and no one wants them to be apart of the movie. Sadly, the taboo issues of sex draws the movie's only audience. There are no powerful acting performances or amazing cinematography that will attract a non bias audience to judge the Canyons for what it truly is. The hidden message the Canyons gives can only be understood by the ones who have been jaded by Hollywood."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "malcolja",
        "review_rating": "7",
        "review_title": "Stick to indie actors for a better film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "nipny",
        "review_rating": "2",
        "review_title": "Lindsay Lohan Topless",
        "review_detailed_main": "You get to see Lindsay Lohan's ample bosom in this movie. I can think of a single other redeeming quality."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "Dan919-755-712633",
        "review_rating": "10",
        "review_title": "Why psycho analyze it? It ruins all the fun",
        "review_detailed_main": "All the negative reviews i've been seeing for this movie sounds like the rater didn't even watch it. I saw it VOD because I wanted to see what all the hype was about and truth be told, I'm totally rooting for Lindsay's comeback. I actually enjoyed one of her last movies - I Know Who Killed Me - and thought The Canyons was OK. Lindsay was obviously the best thing happening in it. James Deen made me laugh every time he spoke... He sounded like a \"Californian\" from the SNL skit. That other couple was completely dumb, so I guess the actors must've hit it out of the park. In the end - I liked it and am 110% happy I spent the $8 to see it opening VOD yesterday. I think it will become a cult classic."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "karenanne-kirch",
        "review_rating": "6",
        "review_title": "One plus...James Deen",
        "review_detailed_main": "Ok so Linday Lohan was drunk and so flowed looking. I read she was drunk the whole movie. In my opinion.. I loved James Deen. For being sign actor..he was cool and very natural. Way better than Lindsay."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "FilmMan47",
        "review_rating": "4",
        "review_title": "Tenille Houston Is The Only One Worth Watchable In This Film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "Kirpianuscus",
        "review_rating": "",
        "review_title": "pieces",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "petarmatic",
        "review_rating": "5",
        "review_title": "It is worth to watch.",
        "review_detailed_main": "This film is worth watching for the scenes of sex. I always love when they try to smuggle porn into mainstream film making. Tha actors are good, plot is not so interesting I yawned once or twice during the movie and watched Jacked In while I was watching this movie.\n\nIt simply one can watch what is happening in today*s film industry, it always happens that sex is involved in one way or the other. At least in this film girls look great and guys are not far behind, especially during group sex scene. :)\n\nIf you have nothing better to do in your foggy day, I did not, please watch this film, otherwise you might skip it too."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "danew13",
        "review_rating": "5",
        "review_title": "Same Old Story: Good Acting Can't Save a Bad Script",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "motley6",
        "review_rating": "3",
        "review_title": "It could have attained mediocrity with a few changes",
        "review_detailed_main": "The film is garbage of course, but a few things that could have helped make it watchable.\n\n1) Shooting in HD will make your film look like poop- This isn't Paul Schrader's first rodeo, and yet he chose to shoot the film like a UCLA graduate. This guy made beautiful films in 35mm like Cat People, Mishima, and American Gigolo, but yet he actually wanted to shoot in a distracting, garish, noisy, unfilmlike format. If he couldn't scrounge up another $300K to shoot on film, then this shouldn't have been made.\n\n2) Hire people who can act- And it wasn't just the porn stugats either, nobody else could act except for Lohan. I understand the casting in this film was part of some internet promotion/gimmick and it shows. There are all kinds of actors in LA and Europe who can act who would have done this for peanuts and they managed to hire an entire cast who couldn't.\n\n3) The music was atrocious- Indie schlock that nobody cares about, shoehorned into a film where it doesn't belong. This is another bad directing decision from someone who should know better.\n\nThe premise of the film is interesting and there is some good dialogue, but that isn't enough. It has to look and sound like an actual film instead of an amateurish mess in order to interest people."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "kosmasp",
        "review_rating": "5",
        "review_title": "Beaten up",
        "review_detailed_main": "If you have the man responsible for writing Taxi Driver at the helm, you'd be excused if you thought more would come of the movie. You might also be disappointed by the acting. That is overall, not one name that should stand out in particular. You also might question the movie itself, because it does seem like a therapy session for Lindsay Lohen ... the story seems to fit that.\n\nThe movie itself though does have some issues it discusses, about relationships, about society, about fame, about many things that are worth exploring. It's not like the movie is a complete waste as you can see, unfortunately even the nudity will not help overlooking its flaws, and there are more than I listed above. Still an interesting movie, if you see it as an experiment ... even if it could and should be better"
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "IClaudius7",
        "review_rating": "3",
        "review_title": "\"The Talented Mr.Ripley\" without the talent >>>>",
        "review_detailed_main": "Yep, shoulda looked at the IMDb reviews first before viewing any portion of this movie 🎥.\n\nSometimes, ordinary folk reviewers are too hard on movies 🍿. This time, I cannot disagree.\n\nThe self indulgence of the main character (and he is no James Dean) made me want to throw something at the screen. The unsatisfactory result of an unsolved murder yet like most CSI cases, had plenty of clues. The LA cops aren't THAT incompetent. Thus, do NOT waste your time.\n\n3.0 out of 10."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "fredrikgunerius",
        "review_rating": "7",
        "review_title": "A story that vibrates within its own peculiar realm",
        "review_detailed_main": "It's always a special kind of seedy pleasure being transported into Bret Easton Ellis' cynic, cold worlds of decadence, narcissism and distrust. Even when it happens via a badly lit, crowdfunded low-budget flick with B-movie aesthetics such as this one directed by Paul Schrader. Lindsay Lohan and porn actor James Deen play a filthy rich Malibu couple who engage in casual sex with other couples. Amanda Brooks and Nolan Funk are an assistant and a struggling actor, respectively, who get tangled up with Lohan and Deen. The script operates in the borderland between erotic thriller and soft core porn. Tacky as that may sound, Ellis' characters are well-drawn and edgy, despite the fact that they are obviously as shallow as the society that formed them. The practically non-existent budget makes The Canyons tawdry to look at. But Schrader is often at his most interesting when given full creative control and operating on the fringes of everything. And he gets intriguing performances out of his two controversial stars, both of whom seem invested in this in a way that you probably haven't seen them before. For all of Ellis' sleazy aspirations, he definitely knows how to weave a story that vibrates within its own peculiar realm. There is also some evocative music by Brendan Canning and Me&John. New Queer Cinema icon Gus Van Sant appears in a cameo as a psychotherapist."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "patvach",
        "review_rating": "3",
        "review_title": "This. Was. Bad",
        "review_detailed_main": "Except for seeing Lohan naked. Nothing much here. It made 1h38 feels like 3 hours!"
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "lexanaya",
        "review_rating": "10",
        "review_title": "Schrader Returns",
        "review_detailed_main": "Unfortunately this film has been packaged all wrong, it really isn't a thriller, nor is it really about Linsey Lohan supposedly being sexy or having sex scenes. Why it is getting such negative reviews is perhaps a sign that it is being taken in the wrong context. This is film about madness, insecurity, insane relationships, infidelity -- yes there is some sex, yes there is some murder, yes there is debatable scenes that could have been cut, but the film hits points that usually make up a masterpiece; you think, you reflect, you question -- major points that are lost in most of today's sequel films and money makers. Schrader is old school and deserves to be taken with the weigh of what he has done before. The cinematography is incredible too. Why this film is getting 20 percent at RT and 4/10 in IMDb makes me concerned any film that dares to throwback to 70s/80s styles of movie-making are doomed. It's a risky film, takes chances, and imprints moments, something most films today can hardly do"
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "bowmanblue",
        "review_rating": "5",
        "review_title": "Mullholland Drive (filmed on an iphone)",
        "review_detailed_main": "The Canyons is not a good film. However, I stuck with it all the way through. I could have turned it off, but I didn't. And, even though I knew it could have been better, I didn't entirely regret the experience. Because, somewhere buried deep within the screenplay, is actually quite a good little film.\n\nIt's written by (American Psycho-famed) Brett Eastern Ellis, who specialises in showing us shallow, rich, decadent characters. Therefore, don't expect to particularly identify or relate to any of the leads. It's about a rich young man who has links to the film industry. He starts to suspect that his girlfriend is having an affair and sets about destroying his potential rival.\n\nIts plot is nothing special, but, there must have been a way of getting a little more intrigue out of it. However, all you have is beautiful people, wandering in and out of equally beautiful (or actually quite sleazy) locations, having conversations and then moving on to the next.\n\nYes, despite being pretty short on action, it definitely had a 'vibe' to it. It was certainly raw, as if it was filmed on video without much thought going into the shots' framing or lighting. If you've seen David Lynch's Mullholland Drive, then you'll know the kind of haunting atmosphere which was created here (only minus the supernatural element). That's the main reason I stuck with it. The film was genuinely creepy, showing us much of the seedy underbelly of L.A.\n\nIt's a hard film to watch, especially during the first two halves, as little excitement is contained within. If you're looking forward to the sex scenes, they've been somewhat exaggerated and you can probably find better on Youtube! You need to be in the right frame of mind to watch quite a slow movie with no real redeemable characters if you want to get something out of this film.\n\nhttp://thewrongtreemoviereviews.blogspot.co.uk/"
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "leapinglizardland",
        "review_rating": "1",
        "review_title": "Simply horrible.",
        "review_detailed_main": "I will not regurgitate the story line of this horrendous clunker of a film, The Canyons; there are many reviews outlining this stark, confusing and confounded movie, so I won't bore anyone with a redundant rehashing of this freakishly odd, depraved and lackluster bomb. All I can offer are a few, hopefully non-cruel notes on the sad fate of it's pathetic, washed up lead actress, Lindsy Lohan. Oops, so much for not being cruel. This film (more like student made video) is a true life commentary on the pitfalls and repercussions of allowing oneself to drug and drink her way into oblivion as Miss Lohan has apparently and unfortunately done. This once beautiful and talented young actress was teetering at the precipice of super stardom; now, she is a terribly aged has-been addict who has run her career and life down the proverbial tube. We have watched in horror, and perhaps morbid curiosity, as this young woman has circled the drain and finally sunk into a virtual abyss of failure, and in the end, written herself into the annals of infamy. It's a very depressing sight to behold. In this instance, art really does imitate life. Well, at least REALLY bad art. Lindsy accepted a role befitting a faded and torn painting of her own life. Maybe she took a major turn at Method Acting. Maybe she could truly see herself mirrored in her character. Maybe this putrid film is another note in her real life swan song. Maybe The Canyons is so hard to watch because I actually see a glimpse of the real Lindsy Lohan in a more heartbreaking light. Then again, maybe I am just trying to justify the very existence of this crud-fest in my own philosophical way."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "tomchaud",
        "review_rating": "3",
        "review_title": "James Deen",
        "review_detailed_main": "Now that i know James Dean Willie i can't imagine seeing this movies without seeing James Dean in action :))) well what can i say James Dean and Lindsay Lohan great combo :)))) Rest is tippically rich people hollywood lifestyle"
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "BandSAboutMovies",
        "review_rating": "4",
        "review_title": "Oh Lindsay",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "sparkytx",
        "review_rating": "4",
        "review_title": "Moderate melodrama /thriller",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "HuntinPeck80",
        "review_rating": "4",
        "review_title": "It's like The Room but minus the comedy.",
        "review_detailed_main": "I'd always been under the impression that The Canyons fairly bombed upon release; that it got lots of bad reviews. And that is basically true, except there were positive reviews also, and there have been more since, if Wiki is to be trusted. The biggest names attached to the project are off-camera, writer Brett Easton Ellis, and director Paul Schrader. I know Lindsay Lohan is or was a name that trailed a certain amount of stardust, though I have no idea why. Then again, I am completely bemused by the Emma Stone phenomenon. What is the big deal? Speaking of big, James Deen...\n\nThis is a low budget movie about awful, trivial people in L. A. It's kind of like a porn movie but with too much talk, too much walk, and not enough bopping. They all look like they'd much rather be making the beast with two backs instead of talk. It's kind of like a portion of a soap opera that broke free and became a separate movie. Couple with open relationship, other couple without, one from each are having an affair, and not hiding it too well. Both men, Christian (Deen) and Ryan (Nolan Funk) are jealous of one another, but mainly because the script says so. Group sex would probably be effective therapy for the foursome (fivesome if you count Christian's bit on the side). Incidentally, Christian is seeing an actress/yoga-teacher called Cynthia Grey. This movie came out after the 50 Shades book blew-up.\n\nThese are awful, pathetic, seedy, verbally and emotionally stunted, trivial people, a bit like the losers in Boogie Nights, but thankfully this is a shorter movie. I started to wonder, early on, what it might be like if David Lynch directed instead of Schrader, or even Tommy Wiseau. If only it were funny, or darker, or sexier, or all three. There's too much toing and froing, a lot of shoe leather. Deen does so much stepping. Lohan, to me, my first real sighting, looks like someone who has eaten food she's allergic to, and gone all puffy. The plot, such as it is, involves both Christian and Ryan activating stooges to c***-block the other guy, but it's the most vacant and uninteresting sort of scheming. What's most striking about The Canyons is the spiritual aridity of these people, symbolised by the abandoned moviehouses (I guess) that are shown between scenes. This is a dead world populated by empty people. It begs the question, who is watching, and if the answer is me/us then why am I / are we bothering?\n\nThe Canyons, in other hands, could have been a richer arthouse drama, or even a steamier XXX-movie, but instead it exists nowhere inbetween. As such it is well named."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "LeonLouisRicci",
        "review_rating": "8",
        "review_title": "Totally Uncompromising",
        "review_detailed_main": "Say what You will, and Plenty have, about Lindsay Lohan, She Beautifies the Screen and is a Very Good Actress. It can all be Witnessed here, and more, as She Literally Bares All, both Physically and Emotionally to Literally Melt the Screen with Her Sensuous Allure and some Deep Acting Chops that, in Reality, were most likely Not Far beneath the Surface.\n\nWriter Brett Ellis Easton's Usual Dead Souled Characters are around to Use and Abuse Lohan for Personal Gratification of all Sorts. With the Empty Hollywood Landscape that, after all, \"Manufactures\" Dreams from a Prefabricated World, the Film is about \"Filmmakers\" of the Lowest Sort.\n\nDirector Paul Schrader is Making the \"Lowest Sort\" of Film, with its $250,000 Kickstarter Budget and a Porn Star Opposite Lindsay. In the End it is the Type of Psychological Nervous Peek at Separated from Everyday People Movie that is its Creator's Forte and Framed with the Style that is Certainly not that of a Mainstream Movie .\n\nIt has an Artfulness about it that is Designed for the Art House and those Fringy Types that Love to see this sort of \"Personal\" Movie Making. Here there are Three Artists that are Free of Compromise. Schrader, Ellis, and Lohan are Delivering \"Their\" Goods. It's Completely Up to You, Buy it or Not. There's not going to be much of a Loss Either Way. That's about as Honest as it gets in Hollywoodland."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "kareemamgad",
        "review_rating": "3",
        "review_title": "A Missed Opportunity with Unrealized Potential",
        "review_detailed_main": "The Canyons had the potential to be an intriguing exploration of relationships, power dynamics, and the darker side of Hollywood, but unfortunately, it falls short in nearly every aspect. Despite being penned by Bret Easton Ellis, known for his sharp and provocative storytelling, the script lacks the depth and nuance needed to engage the audience fully.\n\nThe plot, which revolves around a group of morally ambiguous characters navigating deceit and manipulation, feels shallow and unconvincing. The pacing is uneven, with scenes dragging unnecessarily, making the film feel much longer than its runtime.\n\nWhile Lindsay Lohan shows glimpses of her acting talent, her performance is inconsistent, which is partly due to the weak material she has to work with. The rest of the cast delivers forgettable performances, failing to elevate the story or make the characters relatable or intriguing.\n\nThe film does have some redeeming qualities. The cinematography captures the sleek yet cold aesthetic of Los Angeles, mirroring the emptiness of the characters' lives. Additionally, the concept of exposing the emptiness of Hollywood's superficiality had potential, but it was never fully realized.\n\nOverall, The Canyons is a disappointing watch, with its lackluster execution overshadowing its ambitious premise. While it might appeal to fans of Lindsay Lohan or those curious about Ellis's involvement, most viewers will likely find it underwhelming."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "ccmiller1492",
        "review_rating": "8",
        "review_title": "A fine film, much maligned...",
        "review_detailed_main": "The negative reviews of this film are incredible. Watching it without preconceptions, however, is probably essential. Both Lohan and Deen give stellar performances, the latter practically steals the film as the sadistic wealthy manipulator with long-standing mental issues who begins to seriously unravel when his sense of power over others is disrupted by his seemingly weak paramour. Deen wisely underplays it, with considerable subtlety, avoiding any suggestion of camp and thereby becomes quite realistically and quietly menacing. These two actors carry the film with enough skill to make it believable. In some ways reminiscent of \"Gone Girl\", but far more effective and meaningful than that over-rated, far more popular film. This work will eventually come into recognition for its merits. In the meantime, hopefully we will see more great work from both talented Lindsay Lohan and the new leading man with photogenic charisma, James Deen."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "connorclowes",
        "review_rating": "10",
        "review_title": "An amazing movie.",
        "review_detailed_main": "I had high expectations for this and I was right to! Lindsay Lohan and James Deen are great together and Lohan is amazing. Deen is surprisingly good for a porn star and has a good screen presence. The story is decent but is still interesting enough. Nolan Funk is also very good and the final scene of him was perfect. The rest of the cast are barely in it so they do not matter much overall, but they are still good. I especially liked Gina and wish she had been in the film more. An especially good scene involves Nolan at a DVD store. The lighting was used perfectly. I would recommend this movie to anybody who appreciates character development because the movie is mostly dedicated to that."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "christopher-underwood",
        "review_rating": "8",
        "review_title": "stylish to the end",
        "review_detailed_main": "I is rather difficult to write about this film without making it seem boring and perhaps to some the film will seem boring, But then whether something is boring or not usually has more to do with the bored than the subject. Boredom is too subjective, what I find interesting you might find boring. So, back to the film which I loved (but some may consider boring!) Lack of strong narrative flow will be a problem for some and the slightly stilted dialogue takes a few minutes to get used to ( James Deen's fast talking is also problematic at first). Overall, though this is most engaging and a highly pertinent look at just how we are all engaging with one another. More and more of our lives are either monitored by others or advertised willingly by ourselves and there is less and less free and private space. This inevitable means that when people actually engage face to face there is more than a little strain caused by all the other 'engaging' going on electronically. This film presents an exhilarating look at a small group of people struggling within this environment we have created and managing not too well. Somehow I have missed all the hype surrounding the career of Lindsay Lohan and barely recognised her. James Deen I knew only what I had read regarding this movie and his porn stuff. I have to say, however, that both are most persuasive in this. Deen's is a mighty performance and considering the low budget environment of this film, probably as good as anything his namesake achieved in his short life. Lohan is also a revelation, oozing charisma despite the achingly evident fragility. Nothing like as much sex and violence as you may have been led to expect but enthralling and even exciting in the way it engages in such a raw and intense manner, whilst, it has to be said, remaining beautifully shot and stylish to the end."
    },
    {
        "movie_id": "tt2292959",
        "movie_name": "The Canyons",
        "movie_rating": "3.8",
        "review_username": "lamegabyte",
        "review_rating": "10",
        "review_title": "Excerpt > Hot California *",
        "review_detailed_main": "In fact, it's a bit the same story as babe #76 Ashley Smith : once upon a time, there was a fabulous celebrities forum called « Zodcaps » with awesome daily updates of babes! So i guess I picked Lindsay here notably with her paparazzi shoots when she walked outdoors bra-less and with only a sheer black shirt ! And for sure, Lindsay has two beautiful arguments well displayed in this movie and foremost the character that goes with them: nude shower, sex with a porn-star and a group sex orgy!\n\nI think this movie looks a lot like her real life as she likes to have fun, to party and to have sex with whoever but fails to find yet her charming prince ! Anyway, after Laurel and Mulholland, it's also another LA canyon where very hot things happen!! Like Jackie Collins, this movie helps to discover the real (sex obsessed) Hollywood and not the one they want us to believe!"
    }
]