[
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "warriorscot",
        "review_rating": "4",
        "review_title": "Better than bloodrayne at least",
        "review_detailed_main": "One of Bolls better attempts. Just shows that if you do something long enough you have to improve just by chance. It is still not good but it is at least watchable which is an improvement over the bloodrayne. The main difference between Bloodrayne and FarCry really is that the story from Farcry wasn't the games strong point whereas Bloodrayne had a strong story and thus Boll had more chance to mess it up.\n\nThe action in this movie is actually fairly good. Occasionally a touch overdone but in a good way and worth a watch just for that.\n\nActing wise it was pretty decent. Most of the actors are pretty good but you can tell they aren't taking it seriously based on comparisons with other performances. But the lighter mood this gives to the film actually helps.\n\nWhile I think sticking a little bit closer to the story of the game might have made for a slightly better film the changes made are pretty practical and not big enough to make a difference. Especially given the plot of the game was hardly Oscar winning just a vehicle for FPS carnage. Would have liked it set in the Jungle as that was a pretty integral part of the game but Canada doesn't have a great deal of Jungle and it is at least set in a kind of rainforest.\n\nWhy Boll feels the need to change already professionally scripted and directed game plots I don't know but he does. And until he starts letting the source material speak through his adaptations will always be lacking. Watch the film for a laugh its good for that and maybe for watching during a party as drinking party fodder."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "wesleybh",
        "review_rating": "4",
        "review_title": "Actually, I had fun watching this",
        "review_detailed_main": "There are several conditions which one must abide by in order to enjoy this movie. ONE, forget the game (even though it is good);TWO,watch this movie empty headed/don't take it seriously; THREE, ignore the bad acting. If you can do these things, then you might actually like it. There were several points in the movie where I was laughing so hard, I was crying. The humor was subtle at times and others it was blatant, but it was still funny.\n\nNow, with that being said, it wasn't a quality movie by any means. The action scenes were nice, but not awesome; the acting was sub par, especially the lady in the beginning, \"But George, I want to see the whales!\" This was a part where I was cracking up. Also, the chemistry between Valerie and Jack was, well, interesting. They just sort of, ummm, came together as if they knew each other for a long time. In fact, the character development was the weakest point of the movie, but hey, like I said, condition number two.\n\nThe ending was good enough, but in the end I felt like nothing was accomplished. It sounds like I hated the movie, but the humor and Shweiger's relaxed feel, even in dire situations, just made this enjoyable. Plus the ending action sequence was cool. Don't watch this if you want a serious, hard core action movie. Watch this if you want to watch a relaxed, not-so-serious movie.\n\nUwe Boll's best video game movie, and the only one worth seeing (renting)."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "pesach65",
        "review_rating": "4",
        "review_title": "Watchable",
        "review_detailed_main": "There is only one reason this movie is watchable. Till Schweiger. He is such a good actor the movie isn't completely terrible. Uwe Boll please take up another career. The special effects and action are acceptable. All other aspects were very disappointing. All I can say is that Kevin Smith (An evening with...) talked about Tim Burton not ever reading the Batman comics and it showed. Uwe Boll must not have ever played the video games that he keeps making movies about. If you two ever want to know how it is done go see Andrzej Bartkowiak. Doom was one of the best video games to film adaptations ever. Some people may disagree, but if you watch the movie you can see that the guys at ID had a lot to do with Doom. It doesn't seem like anyone at UBIsoft was even near this production."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "chrichtonsworld",
        "review_rating": "5",
        "review_title": "Forget the game it is based on and you might find it watchable",
        "review_detailed_main": "This may be Uwe Boll's best movie ever. No,I'm not a fan. How could I be. Uwe Boll is a director who shows no respect for his audience and doesn't deserve respect when it comes to making movies. He even admitted himself that he does it solely for the money. He is not skilled at all and has got the creativity of an amoeba. But is that a reason for not liking or watching his movies. Well,yes and no. It all comes down to expectation. If you have none than \"Far Cry\" will surprise you. Til Schweiger is well aware of Boll's reputation and doesn't take it seriously which shows and is one of the strong points of the movie. The second strong element are the action scenes which are actually pretty decent and fun to watch. Does this movie has anything to do with the game? Of course not(OK,maybe 1 or 2 elements are taken from the game). Does it have a good story? Guess again. What about the acting? At least it wasn't completely annoying and Til's Jack Carver was very likable. \"Far Cry\" is movie that can be fun if you are able to put your brain off."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "Henkwich_88",
        "review_rating": "5",
        "review_title": "Not a horrible movie",
        "review_detailed_main": "I'm going to make this short as I don't know much about how to properly review a movie. Seeing how the director behind this movie is Uwe Boll which, as a lot of you probably know, isn't a very well liked guy I'm guessing that a lot of people gave this a 1 on principle alone, some of them even without having seen it imagine. Bearing this in mind and having just seen it I can say that while it's far from the best movie I've seen it isn't horrible. I'd say not worth buying but renting this for a lazy Sunday or something isn't wasted money. The dialogue could be better and there's not much in the way of character development or anything but it has solid action through and through. Final verdict 5.5/10 - Worth Watching."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "virgo47-1",
        "review_rating": "5",
        "review_title": "Turn off your head and relax",
        "review_detailed_main": "It's definitely more than 3 when you want to relax. It's not serious movie thou, not even good action one - although the action is fine. I watched it after the game and I think the game has better story. :-) But I simply forgot about the game, watched the simple movie with some action and not exactly believable romance in it, and I was relaxed. Opening scene might be the best part as it looks like sci-fi stuff, but the rest is still OK. Acting is like the movie, probably the romance in the bed is the worst part (although I generally like bed scenes and I'm very forgiving there ;-)), some action parts are way too long (one chase with the mutant) but otherwise it's quite solid average movie based on a simple script without any great idea. The thing that is great about this movie is that it's generally quite smooth and it didn't make me angry like my last bad experience (Flight of the Phoenix http://www.imdb.com/title/tt0377062/). No far-fetched scenes, no embarrassing dialogs (\"You better be here when I return\" :-)), no forced drama. Easy, smooth, flowing average action. There are better movies outside that made me rather unsatisfied because they looked more serious. This is NOT serious even if it's not a comedy. It's simply B class (or C?) action movie. Not a bad one. Probably the missing point is the worst problem - but hey, who would expect a point here?"
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "westreal",
        "review_rating": "5",
        "review_title": "The Better of Uwe",
        "review_detailed_main": "Up until right now, i have rated Uwe Boll's movies no more than a 4, everything was so poorly written and directed that i couldn't give a better one.On this particular movie though..i had to give him a 5 for trying.He managed to get the best second hand actors around and put out a better display of the movie....for the first part that is.The beginning made me think the movie could be it...the first one to which i could have given an over 7 rating....but from the middle ..it just kept lower and lower.The ending was too dull..no fun for the watcher..]Keep it up Uwe,you might get the chance of scoring a 7 with me for that matter ! Enjoyable B movie (bolded B)!"
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "maxyfrommars",
        "review_rating": "1",
        "review_title": "Dreamteam Til Schweiger und Uwe Boll",
        "review_detailed_main": "Deutschlands schlechtester Schauspieler und Regisseur machen einen Film..."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "quirell",
        "review_rating": "1",
        "review_title": "do not watch this movie!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "santiago404",
        "review_rating": "1",
        "review_title": "Opps, he did it again :(",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "bryanhelder",
        "review_rating": "8",
        "review_title": "Bolls best movie, people hate him to be cool or something",
        "review_detailed_main": "I enjoyed this movie, it was fun and pretty well made. I think that people should watch this movie before rating it. There is no way it's a 3/10, seriously did you even enjoy the snore-fest of Oscar movies released recently? I have to try to stay awake watching movies like the Bicurious case of Benjamin Buttkisser, and don't even get me started on Not so Revolutionary Road. If you still enjoying watching movies that are fun, then you won't have a problem with this. It was made in Vancouver and I'm sure there was more than just one person working on this movie. If your head isn't up your butt then you will get over the fact that Boll was involved, you might even be surprised."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "fmbr-1",
        "review_rating": "6",
        "review_title": "Not as bad as expected",
        "review_detailed_main": "I've never seen a Boll film before but I have heard the rumours. This might be why I thought this wasn't too bad. My expectations were way, way down.\n\nHowever, it wasn't as bad as I feared. Now granted, I'm glad I didn't pay money to see it but it was better than some of the drivel I've seen. This, I could actually sit through and didn't think that I was completely wasting my time.\n\nThe locations and sets were good, the cinematography not bad, the acting let things down a bit and the writing was very, very ordinary. I even found the references to the game (as little as they were) amusing."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "Pratikvora453",
        "review_rating": "5",
        "review_title": "Why such bad ratings?",
        "review_detailed_main": "Maybe it led people to believe it had something to do with the game franchise, saw it and felt helpless after. But that's not the movie's fault. Even thought the title was poorly chosen it would be wrong to misjudge it for the gaming franchise. Any good action-lover would mark it as a decent watch. It had Til Schweiger and Emmanuelle Vaugier. Also to be mentioned, Craig Fairbass. Udo Kier playing a part in the movie. Follow up his previous films. The movie runs very fast, it doesn't lag. Keeps you engaged and entertained. Why I rated this in its mediocrity is when I saw this had a budget of $30,00,000. It left me shocked with the feeling that it could have done so much better. Where did all that money go? It leaves you wondering and disappointing."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "laama-1",
        "review_rating": "5",
        "review_title": "Not that bad...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "Rabh17",
        "review_rating": "5",
        "review_title": "For Uwe Boll. . .this isn't a total bomb",
        "review_detailed_main": "First Off. . .this is an Uwe Boll Production, which places it in a category all its own.\n\nHaving said that-- for a straight to DVD or Grade B- Late night Mad Scientist / Monster romp, it's actually not. . .all that Bad.\n\nIt's not. . .all that Good either, but it will fill the late hour and a half if you are not yet ready to hit the sack and just wanna watch some low-grade action.\n\nThose of you who are avid FarCry players. . .Don't. Just Don't. Play the game, instead. If you DO watch this, don't go cursing or crying to anyone, because you were warned. The Game was far more dark and intense than this movie could ever be.\n\nFor everyone else, it can be a chuckle-- even though it is NOT a Comedy or a Spoof. But I SWEAR that Udo Keir (Dr. Kreiger) couldn't help himself because he was delivering some ringing one-liners with a deadpan face that was DARING the viewer to laugh.\n\nThe other actors can be forgiven their emotive trespasses because this is a Mad Scientist / Monster Movie. No-one expects a Oscar nomination out of this, so don't hold it against them. Be fair. Besides, the wooden, cardboard, plastic, ersatz performances of the Lead characters could be EXACTLY what Uwe wanted.\n\nRemember: This Man Sees the Cinematic world through a different lens than the rest of us Mortals. He is an Artiste!!!\n\nAnd several reviewers have commented rather 'objectively' on the 'romantic liaison' that both Viewers AND Actors were subjected to. Again: This is Uwe Boll. Romantic scenes are not 'Created' in Uwe's movies; they just happen. They happen without reason, without NEED for reason, like a rock dropped in a puddle, like a stinkbomb exploding in a bowl of jello. . .BOOM! Romantic moment NOW-- Kiss & Fumble and now we're done, on to the next page. . .And in Uwe's favor, upon reflection I note that all the weird Romantic Uwe Moments in all his movies are surprisingly CHASTE. I'm not gonna psycho-analyze that.\n\nSo like I said, got nothing else to watch on a late Saturday night, but don't wanna hit the sack yet? Slip this DVD in and let your brain lay back and doze.\n\nThis movie is Totally Girlfriend Friendly. She won't even care."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "planktonrules",
        "review_rating": "2",
        "review_title": "Yet another crap film by Uwe Boll that's based on a videogame.",
        "review_detailed_main": "Uwe Boll has an unusual distinction. On IMDB's infamous Bottom 100 List, he currently has five movies listed! This is NOT a distinction any normal person would want...though in the case of Boll, somehow studios keep giving him huge budgets, so he's probably laughing all the way to the bank! I have seen his other four entries on the list, \"BloodRayne\", \"House of the Dead\", \"Alone in the Dark\" and \"In the Name of the King: A Dungeon Siege Tale\". Why? Because I have an odd obsession....to try to watch all 100 on this everchanging list!\n\n\"Far Cry\" is odd in that Boll bought the rights to this videogame BEFORE the game was even released. He was lucky...the game was a hit. The public, however, wasn't...as the film stank.\n\n\n\nThe plot is pretty simple. Valerie pays Jack to take her to the island where her Uncle Max works. However, after she arrives, the baddies on the island blow up Jack's boat...and he just barely escapes. Apprently Dr. Krieger* is doing evil stuff on this island and he's not allowing anyone to get in his way! But Jack is an ex-special forces guy...and soon it's him versus all of Krieger's brainless and rather indestructable genetically modified minions.\n\nA few things you are likely to notice shortly after the film begins. First, it's ultra-violent....not too unusual for Boll's films. Second, most in the cast sound either German OR they put on very fake and stupid accents in order to try to hide this. In particular, the 'American' couple on the whale trip are among the silliest fake-American accented characters I'd ever heard. Apparently Boll didn't notice...but someone should have noticed this. And, considering the film was made in Canada, there surely were some locals who sounded much more like Americans. The film also abounds with dumb writing mistakes and cliches. When Jack attacks one of the baddies, the baddie makes sure NOT to cry out for help (a common but bad cliche), a helicopter explodes for practically no reason at all, Valerie throws a grenade and forgets to pull the pin (is anyone THAT stupid???), after initially evading the baddies the pair (who just met each other) stop to make whoopie (which is odd since they ARE on an island full of folks wanting to kill them), three soldiers firing at Jack at close range with machine guns....yet he takes them all out with his pistol....and that incredible annoying fat guy with the sandwich....uggh! The bottom line is that the film is terribly written and is, at times, an insult to your intelligence...and it often uses violence and action in place of acting and writing.\n\n*I found it funny that the mad German scientist, Krieger, is the same name given to the mad German scientist on \"Archer\"."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "badoli",
        "review_rating": "5",
        "review_title": "Average action. Not more, no less.",
        "review_detailed_main": "Nothing special about this one. Uwe Boll gets beaten for several of his movies, so after watching this one i assume he has improved...? The camera work is decent, the action is explosive, the acting is average to poor, the story is predictable, the sex scene is laughable and my low expectations were not disappointed. If you want a cheap action flick, you're not going wrong with this one.\n\nFor the game pro's in here: This movie is NOT made after \"Far Cry: Crysis\", but it's predecessor \"Far Cry\" and only that. Check the box art of both games, Jack Carver was only in the first title and only there you'll see him wearing his infamous Hawaii-shirt."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "jackmeat",
        "review_rating": "2",
        "review_title": "Just curious if uwe plays or has someone play the games before",
        "review_detailed_main": "I don't really mind the creative ideas interjected in these movies, but seriously. There isn't one coherent part of the game in this movie. That seems to be the trend, buy the rights and then just make a movie that has zero to do with what the fans want. This butchering is almost entertaining because you know you are getting away with hiding behind a lack of skill, and control of money (not yours) that allows you to do this. Play a game, or hire someone to, and please make a real movie, or stand in the boxing ring and have your butt handed to you as you so claim won't happen.\n\nwow, 9 lines of text and i was done. had to add blah to bug you, sorry"
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "LoneWolfAndCub",
        "review_rating": "3",
        "review_title": "Uwe Boll's best, meaning it's still a steaming pile of horse****, but it's a tolerable one",
        "review_detailed_main": "I am deeply disturbed by some posts I am reading on the message boards for this movie, people saying it is actually a good movie! Just because this movie is Uwe Boll's best to date does not make it a good movie at all, no way in hell! Far Cry is a clichéd mess full of bad acting, poor direction, and an uninspired story with a shoddy script. This is Boll's first pure action movie, and news flash people, action movies aren't too hard to make because for a basic action flick all you need is explosions and gun battles scattered around a flimsy plot, and hey, Mr. Boll succeeds in doing that. House of the Dead, Alone in the Dark, and Bloodrayne, all horror games adapted into movies by Boll are far worse than this (they have no redeeming qualities). Far Cry boasts two things which make it his best yet: two good leads and a couple of well-done action sequences. Til Schweiger is quite good as Jack Carver, and Emmanuelle Vaugier is a strong female lead. The usually great Udo Kier is passable as the clichéd villain and the supporting cast are pretty damn bad. Towards the end of the film there is a surprisingly tense chase sequence which came as a shock considering Boll was behind the camera.\n\nUnfortunately the rest of the movie has an incredibly cheap feel to it, with bad CGI, lame one-liners and clichés around every corner. Oh, and the worst lead up to a sex scene I think I have ever scene. Not only have the two only known each other for six hours, but all it takes is for him to say he kept warm while in the army by spooning his fellow soldiers. He already got her to take his clothes off by merely telling her to. Then he took his off and climbed into bed because he was afraid of hypothermia.\n\nAnyway, to summarise, this is a bad movie. It is mindless action movie that can kill 80 minutes if you are totally bored. One could probably do worse than popping this in and watching it, but I'd personally say watch a classic action film like Die Hard or Predator and stay away from this derivative mess.\n\n1½/5"
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "skylerisaac",
        "review_rating": "1",
        "review_title": "Ow",
        "review_detailed_main": "This film is painful to watch.\n\nIt starts off with a scene that's supposed to be tense and scary, but the amateur cinematography will throw you off and make you wonder why the hell no one decided to go for a second take.\n\nIt doesn't get much better from there.\n\nThe movie plods along at a snails pace, which is especially painful because the characters on display are impossible to care about. They're bland and uninteresting. We're given a lot of scenes that are supposed to act as comic relief, but they just physically hurt. The romance scene between our two lead actors is the most awkward thing in the movie by far.\n\nAs for the acting, the two leads are passable, as is Udo Kier, but everyone else is so awful that you can hardly believe it.\n\nThe story isn't great, either. The plot revolves around an island where creepy looking super soldiers are being developed. The \"Plot\", as it were, is quickly shelved to make way for endless scenes of soldiers shooting each other. I'm not against action-heavy movies. In fact, they can be quite fun when done properly. However, the action on display here is as bland and lifeless as the monsters. There are car chases, boat chases, explosions and endless bullets flying, but it's all so poorly executed and shot that it just numbs the senses and damn near put me to sleep.\n\nHonestly, it's hard to think of any redeeming values this film may possess. I can't recommend this movie, not under any circumstances."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "donuil",
        "review_rating": "10",
        "review_title": "Great Action Flick with Humor Throughout",
        "review_detailed_main": "I cant believe some of the bad reviews of this flick. Who cares if it isn't your idea of the game. Rate it as a movie.\n\nAs a movie it has great action scenes, a very good cast that works well together and decent dialog. Unlike many of the action flicks of late this thing has characters with actual personalities. The two leads work well together and have some on screen chemistry.\n\nI don't know anything about the game this is based off and don't care. What does concern me is the quality of the movie, which was excellent. Its nice to see a movie where the characters are interacting with each other instead of spitting lame lines at one another.\n\nOne more thing, the lead female (Emmanuelle Vaugier), its refreshing to see a hottie that can actually act for change, good job. And Til Schweiger pulls off the gruff action hero role flawlessly.\n\nJust check this movie out, it's a great lazy Saturday afternoon flick, you wont regret it. I hope to see a sequel to this with at least the same actors playing the lead male and female roles they really made this movie work."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "mr_shya",
        "review_rating": "7",
        "review_title": "You need to know, what to expect",
        "review_detailed_main": "I went to see this film in the cinema with some friends of mine and we expected the movie to be complete trash. Since Uwe Boll is regarded the worst director ever, we expected to see a stupid, bad, ridiculous action movie with a story hardly good enough for a video game.\n\nAnd this was, what we got.\n\nThis film will just make you laugh all the time. Not for actual jokes in the movie, but more for the ridiculous characters. Come on, a German ex-elite soldier making his living as a boat-captain in Canada, Meets the niece of another German ex-elite-soldier, who works for an evil, mad, German scientist who is trying to create the new Master-Race of biologically modified soldiers for the US-Military...in Canada. Then there are the stereotype Mercenary, the stereotype Soldiers and the stereotype Monsters.\n\nSpeaking of ridiculous characters, what exactly is Emilio's role in this film? Still, the action was surprisingly good and the movie all in all was very entertaining. If you want to see art, it's your own fault you didn't like the movie. But if you want to see a movie, too ridiculous to be taken serious, I promise you, you will be fine with \"Far Cry\""
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "jwchoo1",
        "review_rating": "5",
        "review_title": "Beat Down Reviews : Far Cry",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "ein1983",
        "review_rating": "1",
        "review_title": "The Most forgettable experience",
        "review_detailed_main": "This was a true B movie without a budget. Why they used the Far Cry name as it does not really do the game franchise any form of justice at all.\n\nMundane acting, poor effects, ridiculous story and overall tiresome to watch."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "TheHonestCritic3000",
        "review_rating": "1",
        "review_title": "Not good at all.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "narathip_87",
        "review_rating": "1",
        "review_title": "I realized this guy belongs in an Ernest movie, not a violent R-rated action film.",
        "review_detailed_main": "An unambitious and limited \"action\" film filled with stupid dialogue, bad jokes, desperate characters, and repetitive and boring sequences of violence."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "haikoh",
        "review_rating": "3",
        "review_title": "very bad movie...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "Aka_Who",
        "review_rating": "3",
        "review_title": "Having nothing to do with the story it is based on...",
        "review_detailed_main": "I was actually fairly surprised to find out a movie based on the Far Cry game had been created. The story here is not something I would consider to be a strong point in the game universe. No worries though as in typical Boll fashion the story in the movie has very little to do with the game it is based on. Now I understand that certain liberties need to be taken to make a transfer from one form of media to another but it seems like he really just doesn't even try to make a connection. Not only that but the acting and action sequences are so corny it almost makes you feel like the whole project was one big joke. It has been said a million times before but why couldn't someone more talented pick up the video game rights to create a movie????"
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "jakburton76",
        "review_rating": "5",
        "review_title": "A Simple Review",
        "review_detailed_main": "Just finished watching this and here is my simple review.\n\nThis film is an adaptation of the popular Far Cry game series.\n\nThe good points - Some good action,lead character is nearly perfect for the part, acting not too bad.\n\nThe bad points - cheap plot,not every aspect of the game is not put into the movie(eg. the main character in the game has the ability to change into superhuman at will there is no sign of this in this movie) All in all it's not a bad watch if you fancy a simple action movie and I am glad to say one of uwe boll's better films.\n\nEnjoy"
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "nickrboyade",
        "review_rating": "10",
        "review_title": "As an action movie, it performs outstandingly.",
        "review_detailed_main": "This movie is exactly what the far cry game basically was : 100 % non stop action. The plot is basic and just there to justify the action. If you just want to watch a action movie and be entertained, this is for you.\n\nAlso there are some memorable funny performances by actors, as the movie is basically not serious at all. It is meant to be an over the top action movie.\n\nIt will make you laugh and keep you entertained. There is a real fun but short chase scene between Jack and a mutant and just a bunch of those comedy-action scenes.\n\nUwe really made THE movie about far cry. I played the game and this is exactly what the movie should have been. Sure its not in a desert island, but who cares ? And far cry was basically a basic plot as an excuse to shoot mutants.\n\nGOOD JOB BOLL !"
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "adrianogt4",
        "review_rating": "7",
        "review_title": "Why so bad? It is not Far cry but decent movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "Waltersson",
        "review_rating": "3",
        "review_title": "This isn't Far Cry",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "Skull_Lord",
        "review_rating": "2",
        "review_title": "\"meh\" movie-wise. Horrible Far Cry-wise",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "Robert_duder",
        "review_rating": "3",
        "review_title": "Uwe Boll plays around once again...sadly.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "ars89",
        "review_rating": "5",
        "review_title": "How to make viewers Cry & Laugh",
        "review_detailed_main": "How to make viewers Cry & Laugh.\n\nAlright Far Cry is basically NOT based on a computer PC game, It is an action adventure thriller, I mean at least this is what this movie look likes.\n\nOK far cry starts with a weird examination that is going on an unknown Island far away from general population by some weird scientist (Dr. Lucas Krieger), who Experimentation are funded by government officials (General Roderick). (We have no Idea why would government do that).\n\nMax Cardinal comes into contact with some sensitive information regarding to the operation which proves that the experimentation is illegal, so he contact his cousin Valerie cardinal(Who is a press reporter). So Valerie goes on a mission to search this unknown Island and his missing uncle Max. Valerie hires a boat and (the HERO enters the scene), Jack craver who happens to be MAX best butt buddies in the Army special force way back in time and the Mission starts, Things didn't turn out the way it should have been and now the girl and the boy are chased by entire Island security force. (Crappy background Music)Cheap thrills, Medium quality Action scenes and a semi-hot bed scene and some more Crappy music.\n\nTurns out that uncle MAX has been turned into a Super soldier who is now under the possession of the Weird scientist and has been activated to kill his Cousin & his best buddy. But the real human emotion in MAX has been activated by some code word used by JACK, which symbolizes something from the past when they were in special forces (Probably an erection technique). MAX(the super soldier)is now against the Scientist and will save his Cousin & Buddy. Mayhem starts, every soldier is foot loose and is on killing everyone who comes along his way. But some how Valerie and Jack are off the Island in a boat which comes to rescue by a Food guy(Comic relief) & the scientist is left alone on the Island to take the taste of his own medicine. (Crappy Music again). Happy ending. Valerie got her covers news, Jack got a new boat on which the Food guy makes hot delicious meat and we are left to decide Uhhhhh.\n\nThe movie is not to bad, Tim voice sucks no wonder why German kicked him out. The actor played the role of scientist looks likes he is taking some kind of Drug. There is a food guy, which gives us a comic relief(Beside the fact that the movie itself is a big spoof of Itself) My Rating : 5/10"
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "antonialubo",
        "review_rating": "2",
        "review_title": "Boring",
        "review_detailed_main": "Till Schweiger isn't a good actor. He is boring in every film. In German: Schweiger ist vollkommen überbewertet. Seine schauspielerische Wandlungsfähigkeit ist die eines Steins am Strand. Der Film ist saudumm, sorry. Schade um jede Minute."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "masapi",
        "review_rating": "1",
        "review_title": "A disappointment for Far Cry fans",
        "review_detailed_main": "I'm just wondering what Boll's ideas were, when thinking of turning this mile stone video game into a film. If you do a film based on Far Cry, called Far Cry, I expect Far Cry! That is so simple. I want brilliant characters, great action, astonishing location with bright exotic colors, tropical islands, emerald palm forests, crystal clear water, white sand, shipwrecks, concrete ruins, abandoned labs, huge satellite dishes to be blown up, tons of enemies and of course monster soldiers. In this film there is LITTLE or NOTHING of all this. Not even the haunting trademark bell sound or the amazing musical atmosphere! Maybe the Hawaiian shirt is the only recognizable element of that masterwork of FPS game. Boll is disappointing openly every single Far Cry fan. It doesn't deserve the title FAR CRY. The same happened with DOOM! A shame! It makes me CRY out loud!! I wonder why some Hollywood studio does't take the chance and create a real well made video game adaption! Probably they are still busy with graphic novel adaptations!"
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "schreff",
        "review_rating": "2",
        "review_title": "Why So Serious?",
        "review_detailed_main": "So if you're of the mindset that this movie is going to be kick ass like the game then you'll be sorely disappointed. However, if you watch it as a comedy then it'll be more entertaining."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "funnybone7",
        "review_rating": "",
        "review_title": "Left Wanting More",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "stupid_one",
        "review_rating": "1",
        "review_title": "I want to take a s**t on the directors face",
        "review_detailed_main": "Being a fan of the game and watching this film made me physically vomit!!\n\nIt was an awful film, though the story was similar to the games plot. the whole super human soldiers thing. Other than that Jack Carver, an all American man in the game, is played by a germen, unless thats some sort of twisted irony, that is what made me pull a middle finger at my TV screen the second it started. The fact that you can tell its filmed in a forest in the middle in what seemed like the middle of summer, this is uncalled for because the game is set in the tropical rain forest, whereas this looks like the director just looked out his window in the morning and went \"thats a good forest.\"\n\nTHIS IS A NOTE TO ALL DIRECTORS: If you ever plan to make a film based on a game/book play it, understand it and ask fans about it... don't just play it for an hour and assume you know it!!!"
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "playboy69-1",
        "review_rating": "10",
        "review_title": "The most bullied director ever delivers an enjoyable Movie",
        "review_detailed_main": "Bill Gates, Brad Pitt, Richard Branson, and so many other great people got bullied in their lives before they reached the ultimate success and respect by the general population. Uwe Boll is no difference. Even before anyone has seen his latest movies their IMDb Rating is at 1/10 with 1000 of Voters. They do not rate the film, they join the lemming army of weak people who enjoy to pick on a victim. It used to be the Nazis with the Jews, now its the film critics against Uwe Boll.\n\nSo many standard Hollywood Movies are boring, even Quentin Tarantino can get boring but Uwe Boll always delivers something new, re-refreshing and interesting. His cynical and abstract jokes are not understood by everybody but thats why the more intelligent people love his movies and his Fanbase keeps growing (there isn't just the lemmings who rate all his movies 1/10 there is also a lot of people who rate them 10/10 and the number keeps growing).\n\nNow rate my review as not useful if you feel offended because you know I am right."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "tkchess",
        "review_rating": "6",
        "review_title": "It wasn't terrible, certainly not a 3/10...",
        "review_detailed_main": "I am well aware of Uwe Boll's work, I am also aware that the people on this site are not fond of his work and mercilessly down-rate his productions. That said, I don't think this movie is worth only a 3 or 4 out of 10.\n\nThe acting wasn't terrible, then again there wasn't much acting to begin with. The movie seemed like something out of the 1980's with its numerous action sequences, a lot of which involved boats, water and explosions.\n\nThe movie's plot didn't exactly follow the game's, but it worked to some extent. Simply put, there is a crazy scientist genetically engineering soldiers to be super soldiers. One of the normal soldiers on the island decides to organize a meeting with his journalist niece on the island to expose the work and in the process gets caught. The niece hires Jack, a guy who runs his own tourist boat, to get to the island to meet her uncle. She gets caught, Jacks goes to save her and also gets caught. Blah blah blah blah, Jack and the niece escape and live happily ever after...oh and the scientist guy dies. You know, your standard Hollywood movie plot...there's a bad guy, the good guy infiltrates and gets caught, eventually escapes and in the process kills the bad guy and destroys his evil operation.\n\nYeah, at times it drags, and yeah the guy who plays Jack isn't a native American which doesn't really work since the guy in the game comes off as your run-of-the-mill beer drinking American. The action sequences involve fake guns and props which appear to be just that...and yes, we can blame the director as he likes to rush his dreck movies into theaters which allows for little post production time...but the movie worked well. I put it on par with any other fairly rated action movies with similar plots that lack any sort of serious character development...Collateral Damage, Eraser, Escape from LA, Mission Impossible 2, Resident Evil movies, Tango & Cash, xXx, etc. In other words, if you are looking for just another run-of-the-mill action movie where the good guy wins, bad guy loses, and there is no character development, Far Cry is another movie to put on your NetFlix."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "peter-emmrich",
        "review_rating": "2",
        "review_title": "Amazingly, Stunningly, Jaw-droppingly bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "christian-lund",
        "review_rating": "1",
        "review_title": "Horrible acting topped by unimaginative storyline",
        "review_detailed_main": "Clearly this would have had potential in more capable hands, but given Uwe Boll's track record it would have been surprising if there would have been any merit to this farce.\n\nThe first 5 minutes are classic monster movie madness - even the horrible one-liners delivered by GI Joe type soldiers feel as if they were lifted off another venture into the same genre.\n\nYou will be doing yourself a favor if you exit the movie at this point. You've already passed all the highlights and you will have spared yourself the suffering of sitting through some of the worst acting in recent history.\n\nNext, enter absolute rubbish talent. The leading man has the same amount of charisma that you will find in garden slug.\n\nThere is an awkward bit of contrived romance thrown in - this feels so wrong that you can only speculate why this scene was conjured up in the first place. Normally the genre uses interludes of romance and nudity to inject some humanity and sympathy into otherwise cardboard cut-out characters - here it backfires on all cylinders.\n\nThe effects are bad and the action unbelievably boring. Where other classics show originality and imagination in the face of budget restraints - here it just seems like everything was spent on catering.\n\nThere are in fact no redeeming features here - not even the \"it's so bad it is almost good\" applies. It's just bad, and in a bad way.\n\nOur hero questions the leading starlet about the night they spent together and how she would rate him. She gives him 2 out of 10. I give the whole affair 1 (I'd have gone for 0 if that were possible).\n\nDon't waste your time on this dribble, there is plenty of crap cinema out there, which exceeds this ridiculous rumble in the jungle.\n\nOh and finally, the movie has little to nothing at all to do with the popular game Far Cry (at best it is extremely loosely based on it).\n\nHorrible, move along!"
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "cameronrobert87",
        "review_rating": "2",
        "review_title": "Another epic Game-to-Movie FAIL",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "stojko88",
        "review_rating": "1",
        "review_title": "It's just... bad.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "pashaf",
        "review_rating": "1",
        "review_title": "This is one of the worst movies I've ever seen",
        "review_detailed_main": "Bad directing, bad acting, bad lines, bad everything!\n\nThe plot and story line are hideous; acting is worst than in Catholic school play; some silly lines are beyond unfunny.\n\nThe special effects are somewhat good...well for a 1980's movie. Shooting is as bad as it gets, high-caliber machine gun's short-distance shooting precision is beyond terrible; however, handgun's log-distance shots are so precise that I even jealous of the guy's skill :) Of course, there is a love scene, that looks like a preamble to a low- quality, low-budget German porn. I understand of course, that anyone escaping death (who has been shot at, escaped from an exploding boat, dropped from the helicopter inside a car) wants to have sex with the person they just met. This is not a spoiler, just a hint of the hideousness that you will experience while watching this movie.\n\nOverall - don't even bother watching it (I watched it on Showtime)."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "brenti-2",
        "review_rating": "1",
        "review_title": "Disappointing...",
        "review_detailed_main": "Sadly this film lives up to about 1% of the hype that the game created in 2004 and leaves a very sour taste in the mouth. For video game enthusiasts, book worms and movie fans alike there is nothing more disappointing then a film that is based on an original concept (whether on paper or gaming console) that does not deliver. And not only that, goes well under the mark. Far Cry the video game released in 2004 created such a cult following that making a movie from the content should have been easy and scores of gamers would have flocked to watch the film. If you are a gamer that has played Far Cry; do not watch this film. Anyone else who hasn't played the game; it'll still seem like a B grade acted / B grade directed movie. Uwe Boll, hang your head in shame...this should've been easy to make into a blockbuster. The storyline of the game was incredible (think Jurassic Park meets Alien) and yet you still managed to take it and mould it into your own terrible recreation of an instant classic. Video game companies be warned - if Uwe Boll comes a knockin', lock the door. Oh & Til Schweiger...I look forward to seeing you make up for yourself in Inglourious Basterds. What were you thinking taking this one on? Sigh."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "antileft",
        "review_rating": "1",
        "review_title": "Dante's hellish bottom layer has a new resident ,guess who !!",
        "review_detailed_main": "I stumbled upon this so - called film by chance ,and as I had once tried to play the game ,I said what the heck , let's see the film .And, boy , was I surprised –riled – deadly amazed–disgusted only after about 10 minutes of this manure .That I was in for a horrendously bumpy ride on the supposedly best German highway, I did not expect , but I should 've known better after facing the introduction ,emblazoned with ,yes , prepare thyself and forgive them not ,God , none and nothing other than the infamous Uwe Boll !!! I had heard some chat and warnings on the net ,but that something could be so bad ,I really did not , we , the innocent flock of viewers ,DID NOT deserve ! This is on par with Slovenian so-called movies and TV comedy series that our self-proclaimed national TV station is force - feeding its innocent and especially gullible citizens to withstand and even positively support ( God and Gods ,forgive them NOT ! ) ! I wouldn't let the Bolldude flip burgers in a prison with cross-dressers or clean the flip-flops ,so incompetent and miserable he is ( I hope he doesn't drive ,if yes ,please warn me in advance of his whereabouts !) .And the reason for this outrage , ah, the film : some Aryan dude ,who is a sailor –contractor , one day takes on board some semi-good looking red-haired bimbo journalist-she opposes being called a reporter , mind you !- chick to transport her to some island that is off limits for the public as there she is supposed to meet her uncle Max ,who has meanwhile already been transformed into some genetically improved humanoid super warrior , and , you 've got to see these poor 'monsters' , namely , they are all dead white and , they are impervious to any bullet unless hit in the eyes or mouth,so ,naturally they don't utter a squeak, but they are killed and\u0085 I can't take it no more !And the crown achievement , the aforementioned couple supposedly has sex ,and then he keeps asking her how good he was !Flaming thunderbolts ! And to finish this review ,the sponsor of this so-called film is VW!! You have been more than properly warned ! O, God"
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "TwistedContent",
        "review_rating": "3",
        "review_title": "Long, Confused, Unnecessarily Comedic Cry",
        "review_detailed_main": "Uwe Boll is an altogether fascinating human being and, well, someone has to watch his movies, right? If you don't know nothing yet, just cherry pick a decent video about him on YouTube, and marvel at the troll. Widely known as the world's worst movie director (Although I would give the title to Ulli Lommel or David DeCoteau), Boll has made a myriad of movies, from which I have seen the decent examples , like \"Rampage\" trilogy and \"Assault on Wall Street\". Very exploitative but contained and fun movies. Then some 4's in form of \"Postal\" and \"Tunnel Rats\", so I figured it's time for a few of his most infamous game adaptations. Being a Far Cry franchise fan, it wasn't a tough first choice.\n\nIt has now been about 10-15 years since I played and even finished first of the \"Far Cry\" games, and the memories are only made up from pictures, so I won't be able to compare the two. To a big stretch, the game seemed respected. We all know how it is to shoot some barrels while driving so the car chasing you crashes. The plot goes like this: An ex-special forces soldier turned boatman, Jack Carver, or Til Schweiger, is hired as a transport by a journalist who's about to investigate a top-secret military base on a nearby island. On this island, the cuckoo scientist Lucas Krieger (Udo Kier) is making advanced zombie soldiers. That's the entire plot, and you know who, when and how will 'ride off into the sunset'.\n\nOkay, so, \"Far Cry\" is an enormous mess of epic proportions. It features a variety of bad stylistic choices, overdrawn scenes, very pushed-in comedy in big amounts, prolonged scenes, uncut frames, subpar lighting, subpar make-up, sub-par cgi, sub-par action sequences, lots of cheese, no tension, nothing is at stake, it's highly predictable and the comedy relief character of Emilio grew to annoy me greatly. Comedy is consistent in a bothersome way, and most of the jokes are tepid. Schweiger, as much as I like him, seems a little miscast, which I can't say about Udo Kier who's familiar with crazy scientist roles, and still, some of the dialogue given to him is on-the-nose artificial. Lots of the action takes place during daytime, not a very good decision, ain't no Ari Aster and his daylight phenomena Midsommar. Atmosphere here is null. Locations are boring, the island is not taken advantage of, and scenery-wise \"Far Cry\" is a lackluster. Boll's often been about what's loud, bangs and explodes, and it shows. Cinematography is inconsistent and doesn't help in a portion of fight scenes. Gore hounds, beware, there's little bloody action. I truly was expecting more. Taking all this into account, the most scary is the fact that \"Far Cry\" is budgeted at 30 million dollars. This and that about how he got the budgets can also be found out, if you go on Uwe Boll history lesson.\n\nNonetheless, \"Far Cry\" was more fun than the previous week's \"FearDotCom\", but I can't in good spirits recommend \"Far Cry\" to anyone really, for it didn't manage to be so bad that it's good. Boll's still crazy though. My rating: 3/10"
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "TheseusKhan",
        "review_rating": "8",
        "review_title": "Good",
        "review_detailed_main": "I think 2 things have happened with both the rating here and peoples general outlook to the film.\n\nFirst ill explain about an experiment done quite some time ago. Some researchers made sweet;s that looked like dog poo then recorded the reactions to them. They weren't all that good people didn't even want to eat them let alone give it a good rating.\n\nThe exact same thing has happened here , Bols repuation proceeded him here and it seems to have the same effect while people are watching the film. The film is grate in my opion Uwe did a fantistic job made it witty, funny and full of good action and stunts.\n\nBut ooo there's a saw word in todays world \"stunts\" not \"special effects\" and the far cry crowed was expecting the latter. This is the second bit im chatting about because Uwe has gone for a good old fashioned shoot all the pc gamers feel its a crap film.\n\nWell its not, i watched the film with my stoner mates and we loved it. Every film now days is 3 hours long pumped full of special effects and no personality at all=/ This has that and Uwe has a good sense of humor to. The stunts are oldschool, perhaps to much use of slow mo but it seems not to matter in the end. The budget isn't amazing and shows but apart from that the film is good and to top it off a decent tribute to far cry.\n\nMy personal opion is people should watch a film with a open mind before they rate it."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "lakic_matija",
        "review_rating": "6",
        "review_title": "This is much better than Bloodrayne or Alone In The Dark",
        "review_detailed_main": "I just watched the movie, and I played the game, and although little more than 50% is in common, Far Cry movie isn't that bad. It isn't a summer blockbuster, nor instant classic, but, it was never meant to be. It's a nice straight to DVD action flick which will give you 1,5h solid entertainment. Other than basic stuff (characters, name, enemies), movie is set on different location, and as much faster pacing. Action sequences are nice and solid, and effects are also good considering this is a low budget movie. But that's the point, it IS a low budget title, but looking at it it feels much more expensive. Script is OK, most of the time works well, and I have to say that Jack in the movie has a lot in common with game Jack. Both make fun of almost everything, and are more phlegmatic in nature. Val on the other hand isn't that action oriented as her game counterpart. Kier does very nice job bringing Dr. Krieger to life, and frankly, I like this one better. Nobody but Kier could portrait mad German scientist. The only thing about characters that kinda annoyed me is Jack's noticeable German accent, although Till did excellent Job for the performance part. The only major disappointment what I had with the movie is that location was changed from pacific sand beaches to rocky and cold bay like in western Canada/south Alaska. Considering the budget, I understand and forgive. Film is no award nominee nor winner, but a nice rental on a hot or rainy afternoon to fill a void and have house popcorn fun. 6/10 :) P.S. It's faaaar better than Bloodrayne or Alone In The Dark, seeing this will make you think that it wasn't directed by Boll."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "tcecoleshaw",
        "review_rating": "5",
        "review_title": "Predator vs Universal soldier",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "mrouttt",
        "review_rating": "1",
        "review_title": "Abysmal",
        "review_detailed_main": "This is worst than Doom and not as funny as House of the Dead.\n\nI didn't watch the entire BollVerse, and to be honest I'll probably never complete it, but this is by far the worst so far.\n\nBetween the lights, the set, the explosions as misery cover, this as NOTHING to do with the spirit of the game.\n\nBoll just grabs the cash on any license, use it as toilet paper as much as he can , rinse and repeat on the next one."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "george-1137",
        "review_rating": "1",
        "review_title": "Atrocious, if you have ever played the game this movie is based on you will want to kill the directors.",
        "review_detailed_main": "Atrocious, if you have ever played the game this movie is based on you will want to kill the directors.\n\nThe plot is that much that the French guy(The lead was American in the games)is basically Rambo. The Female lead jumps him after only meeting him for one night and the monsters are just stupid. Some may have heard that for half-life there were rumours that a movie script had been written that a journalist breaks into black mesa, and it was turned down because the writing was very poor and one-dimensional, well it seem that the developers of Far Cry had that movie made but with the setting and monsters changed.\n\nThe only thing this has similar to the game is that there is a form of monster involved (although completely different from game monsters) and that it is on a island.\n\nAlso all the actors seem very wooden and uncaring, and they included a pointless comic relief for no reason at all, he just appears from nowhere and continuously tries and fails to be funny.\n\nIf you have spare time and want a laugh then go and watch it, the acting is definitely laughable. But you may have more fun watching paint dry."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "chrisfrazier33",
        "review_rating": "1",
        "review_title": "Awful adaptation of the game - SPOILER ALERT",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "TXBear360",
        "review_rating": "2",
        "review_title": "Slightly better than a Frontal Lobotomy without sedation",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "carloz46",
        "review_rating": "3",
        "review_title": "A far cry from \"good\", but not totally terrible.",
        "review_detailed_main": "There's nothing much that's inspiring about this film, but I didn't have very high expectations of a first-person-shooter game spin-off, and, actually, this could have been a lot worse. It's not taking itself too seriously, for one thing. The plot is pedestrian, clichéd and totally predictable, but then one gets the feeling that it's supposed to be. I've seen much worse acting, worse effects and sets, and worse action sequences.\n\nI've neither played the game, nor watched any of Boll's other movies, so although my expectations weren't terribly high, I wasn't offended by the film's take on the game (as I had no comparison) nor was I predisposed to hate it because of the director (never heard of him).\n\nUnlike certain other movies (I'm thinking the execrable \"Click\", for example), if I'd watched this in a cinema I probably wouldn't actually have walked out.\n\nUnexciting but not offensively bad. OK to watch on a boring flight or when suffering from insomnia, I would say, so long as you're not precious about the game it's meant to represent."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "TheNonSmoker",
        "review_rating": "3",
        "review_title": "Atleast their was an attempt",
        "review_detailed_main": "The movie is kinda disappointing, it lacks a good storyline, most of the movie is bloated with unnecessary rogue action scenes."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "striker_1909",
        "review_rating": "8",
        "review_title": "a very watchable movie",
        "review_detailed_main": "This is my second comment in this form. The comment is applicable only to those who are here to enjoy a movie. This is a very good movie. The action is good and watchable. Don't think that this is a pathbreaking movie. It's a nice one. I didn't have any expectation frm this, but it exceeds even if I had something in my mind. Definitely, it could have been far more better, but I think still there is a lot to see. I hope that there is a sequel to this as I liked this pretty much. Well this site has put a very bad condition of writing at least 10 lines. So don't read what I am writing now on as I am just trying to fulfill some a**hole's wish. Nice to help someone."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "Leofwine_draca",
        "review_rating": "6",
        "review_title": "Reasonably entertaining - a first for a Uwe Boll movie!",
        "review_detailed_main": "FAR CRY is the film version of a popular video game that I know nothing about. However, I do know something about the career of infamous German director Uwe Boll, a man responsible for the likes of BLOODRAYNE and ALONE IN THE DARK, and commonly thought of as one of our worst modern directors. I'm pleased to report that FAR CRY is by far the best Boll film I've thus watched; it's no masterpiece, that's for sure, but it's reasonably entertaining, unlike the majority of his output.\n\nThe film contains all of the ingredients usual for a Boll-style B-movie: an ensemble cast of fading faces, lots of low rent action, some cheesy effects and the like, and plenty of cliché. However, this time around that mix is quite fun. Til Schweiger, the German actor who rose to international prominence after his part in Tarantino's INGLOURIOUS BASTERDS, is fine as the likable and humorous hero, and Emmanuelle Vaugier and Natalia Avelon are suitably attractive female co-stars.\n\nThis film is a German/Canadian co-production which is quite convincing when it comes to the styling. The action scenes are fairly well done and certainly you often see B-movie shoot-outs that are done far worse than the ones here. Some of the old-timer actors playing tough guys include Don S. Davis, Craig Fairbrass, Udo Kier, Michael Pare, and Ralf Moeller. The plot is your usual nonsense about a mad scientist creating an army of super soldiers and the one or two soldiers we do get to see here are pretty impressive, coming across as a zombie version of the ones in UNIVERSAL SOLDIER. Anyway, FAR CRY is no great shakes as a film, but it is a reasonably entertaining B-movie nonetheless."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "janne-verronen",
        "review_rating": "2",
        "review_title": "Best of the worst!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "Walter_Skinner",
        "review_rating": "4",
        "review_title": "Uwe Boll starts to slowly improve.",
        "review_detailed_main": "Unlike early Uwe Boll movies such as Bloodrayne, Alone in the Dark, and House of the Dead, Far Cry isn't actually a horrible movie. It's just a below average one. The movie has a slow pace, the romance is completely cliché, and it horribly abuses logic but when you look back from watching this movie you realize that as a whole it wasn't a total waste of your time. It's one of those movies that you watch on TV because nothing else is on and you have nothing better to do. If you find yourself engaged in this movie and are applying even slight common sense though then you could probably point out about ten plot holes or character inconsistencies within the first five minutes. I was actually surprised by this movie because I figured that it was going to be far worse then it was. But if Boll continues on this path he might one day actually make a good movie."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "jackok10",
        "review_rating": "3",
        "review_title": "Far Cry The Movie (2008)",
        "review_detailed_main": "There are no spoilers in the review and neither in any other film review all my reviews are based upon my view on the movie and no one others please feel free to send me a message or your review on this movie\n\nfar cry the movie based upon the great fps (first Person Shooter/s) Game seen as it is based on a game it probably would be bad because most movies based upon games are shocking Eg Alone in the dark It would of been good if it was not made by shocking The director 30 million for this movie no way i could make better on movie maker Pros Good Fight Scenes Cons Jack Carvers Accent Acting Effects Guns battles sound effects Muzzle Flashes Just about everything 3.5/10 Reviewed and Watched By Jack Doyne Next Review Doctor who Classic"
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "opticuscro",
        "review_rating": "3",
        "review_title": "U miss all",
        "review_detailed_main": "I really sometimes feel sad when a movie doesn't meet even 20 percent of my expectations, especially a movie that I've been waiting for or hoping for for a long time. In this film there is a very famous cast, I am very surprised that the acting shown is so bad that it is unprecedented, the acting is stiff without character, reluctant, oh my, I haven't seen something like that for a long time. The special effects are at the level of a high school project, the action of the film unfolds too quickly, a lot of illogical situations and holes in the story, an inserted romance that has nothing to do with the brain. It's a pity, but this is a failure of epic proportions!"
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "gianmarcoronconi",
        "review_rating": "1",
        "review_title": "Terrible",
        "review_detailed_main": "This is not really a review, it should be taken more as a collection of impressions of the film.\n\nThis movie is obviously based on the video game of the same name and teaches us how not to make a movie about a video game, but I wonder why most video game movies suck? Well, in this film there is a very valid indication that to make these films you don't put the slightest effort. The film is very listless, the acting is bad and the whole film is poorly structured proposing a boring action film with really bad action scenes. In conclusion this film is a very bad waste of time and damage to the image of a great video game."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "lvalyani",
        "review_rating": "3",
        "review_title": "Hmmmmmm",
        "review_detailed_main": "This movie has no stakes, no tension, and makes you care about absolutely nobody. Uwe Boll has no idea how to shoot action. The only good thing I can say about this is that I wasn't completely bored while watching it."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "dbborroughs",
        "review_rating": "3",
        "review_title": "Uwe Boll's abilities as a filmmaker ruin a script that should have been a good B scifi action horror film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "apull",
        "review_rating": "1",
        "review_title": "Worst movie I've seen in a LONG time.",
        "review_detailed_main": "I watched this movie fully aware of how bad it could be. After all, it's based on a video game that I played half of and got bored with.\n\nI was in no way even close to prepared for how bad this movie would be. The acting was some of the worst I've EVER seen. The directing was pathetic. The story was unbelievable. In short, there's NOTHING that was good about this film.\n\nDon't get me wrong: I love action movies with horrible plots. I can tolerate mediocre acting if it's fun. This movie wasn't. The jokes were bad, the accents were bad, the fight scenes were bad, the very premise of the movie was bad, the plot development was bad.\n\nDon't waste your time: you'd be far better off expanding your horizons and checking out some foreign language action movies (excepting, of course, french ones, because they don't know how to fight!). If you're looking to make the next MST3K movie, this is it."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "JJohnny_Cool",
        "review_rating": "8",
        "review_title": "An over-the-top action feast in the tradition of vintage classics like \"Universal Soldier\", \"Invasion USA\" and \"Commando\".",
        "review_detailed_main": "Germany's most notorious director, Dr. Uwe Boll, has stricken again and just unleashed his next action-packed adaptation of a popular video game, namely Ubisoft's best selling ego shooter \"Far Cry\". And, of course, a lot of self proclaimed preservers of good taste will now scream bloody murder once again and ask themselves the same old questions, namely why in god's name is the \"Ed Wood of the 21. century\" still allowed to make movies after all the atrocities he committed in the past and why couldn't he have chosen a game that's at least a little less popular and well respected than the legendary \"Far Cry\".\n\nI, however, have stopped to listen to the complaints of the naysayers long ago, cause not only have I more or less enjoyed almost all films that Boll directed since his infamous first video game adaptation \"House Of The Dead\" in 2003, but also do I believe that even those flicks, which I personally do not hold in the highest esteem, like \"Alone In The Dark\" or \"Bloodrayne II: Deliverance\", are still quite a bit better than the bashers say they are.\n\nAnyway. As a fan of most of the eccentric director's work, I personally couldn't wait for his new action smasher \"Far Cry\" to hit the silver screens here in Germany on October 2nd, 2008. Of course I went to see it on the opening day and when me and my pals arrived at the cinema for the midnight screening of \"Far Cry\", we opened a bottle of beer right away and prepared ourselves for a little more than 90 action-packed minutes full of explosions, car chases, gun fights, punch-ups, stunts and even more explosions.\n\nAnd, you gotta believe me, \"Far Cry\" did indeed live up to all of my expectations. It's of course not up there with the big summer blockbusters like \"The Dark Knight\" or \"Iron Man\", but it's nevertheless a helluva lot of fun from start to finish. If you're lookin' for a fast-paced, tongue-in-the-cheek no-brainer in the tradition of vintage b-movie classics such as Van Damme's \"Universal Soldier\", Chuck Norris' \"Invasion USA\" or Arnie's \"Commando\", \"Far Cry\" is definitely the right film for you to watch.\n\nIf the cuts had been a bit slower during the action sequences and if the camera had been a bit less shaky during the fight scenes, I would almost have believed that I'm watching a cheesy cult flick from the past and not a movie that's been shot in 2007. Except for a few minor reservations, Uwe Boll has indeed succeeded in combining the special charm of the action flicks of the 80s with modern techniques, spectacular effects and an up-to-date look.\n\nSure, just like the afore-mentioned classics, \"Far Cry\" does also not really have a profound story, deep characters and clever dialogues, but then again, I really doubt that anyone in his right mind would expect a campy flick like this to come up with any of these things. If you're going to watch \"Far Cry\" in cinema or rent it on DVD, you wanna see lots and lots of stunts, fights and explosions and the film does certainly not fall short on any of 'em.\n\nYou get a see spectacular pursuits by car, speedboat and foot as well as lots of jeeps and helicopters being blown to pieces, soldiers being beaten up or shot to death and tons of other cool effects and stunts.\n\nWhen the former elite soldier Jack Carver (Til Schweiger) and the ambitious reporter Valerie Cardinal (Emmanuelle Vaugier) set foot on a secluded island where the mad scientist Dr. Krieger (Udo Kier) is working on the creation of an army of genetically engineered super-soldiers, all hell breaks loose and bullets and fists are about to cut the air at minute intervals.\n\nIn Dr. Krieger's secret labs the laws of physics and gravity seem to be no longer valid and hence we get to see a lot of cool and totally over-the-top action sequences that make us laugh and giggle almost as much as the corny dialogues and (unintentionally) funny incidents (you have to see the hilarious build-up to Jack's and Valerie's love scene, for example).\n\nThe only things I didn't really like about \"Far Cry\", apart from the afore-mentioned fast cuts and shaky camera work during the fight scenes, are the fact that throughout the whole movie hardly any blood squirts out of the wounds when people get shot and the annoying character of Chris Coppola. He plays the sniveling cook Emilio, who's unfunny jokes and constant complaints about his hurting back make him quite a pain in the ass whenever he is on screen.\n\nBut these are only minor points of criticism and all in all I really enjoyed \"Far Cry\" for it's over-the-top action sequences, vintage b-movie charm and tongue-in-the-cheek humor. Neither the film itself nor the stars, like Til Schweiger and Udo Kier who both deliver really cool performances, take themselves too seriously \u0097- a point that really adds to the overall enjoyment of the flick.\n\nTo cut a long story short, I'd finally like to recommend Uwe Boll's \"Far Cry\" to all those of you who are still into the old action hits of the past. If you still enjoy your vintage tapes of Arnold Schwarzenegger, Dolph Lundgren, Michael Dudikoff & Co every once in a while, there's a good chance you might enjoy \"Far Cry\" quite a bit as well. Check it out and give it a fair chance... it's really a kick ass movie from start to finish and a helluva lot of fun to watch!!"
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "cschaefer77",
        "review_rating": "7",
        "review_title": "Far Cry - Not the Game, but a descent movie",
        "review_detailed_main": "O.K., here we go. First of all, I must say, I liked the game very well (I'm talking about the first game, the second installment is still on my to do list). So, I'm speaking of a first person shooter that really got me for days (yes, it took me a while, but I like to play a game on more difficult level). But this is about the movie.\n\nI've seen a lot of so called \"video game adaptations\". And I know that the name \"Uwe Boll\" makes a lot of people say: \"Oh my God, not another movie by this guy\". BUT: When I want to see a video game adaption, I always go to the movie with the lowest expectations. Like it was with \"Far Cry\". I thought, o.k., another movie about a video game I played, let's see what they made out of it. Well, I wasn't surprised, that the story deviated from the game, I wasn't surprised that they didn't have a lot of money for the special effects, but I saw the list of actors taking part in the movie, which was really surprising.\n\nFor the movie, I must say, that it is a descent action movie and that it is - of course - on a low budget scale. That includes taking the setting away from a nice tropical environment and placing it into a more Canadian and cheaper setting. That also includes, that the storyline changed - who ever made a movie based on a first person shooter and based the story only on this person? - but in a reasonable scale. This also means, that some characters were invented (e.g. the big funny guy and the uncle, you will see, if you see the movie).\n\nWhat I liked about it was all about the game - they implemented the cars, the boat(s), the secret experiments stuff and the one guy that got there - uninvited. What I disliked about the movie: Well, it could have been a lot closer to the game. Why not making an opening according to the game? Let the one guy making the opening with his boat getting torn apart and leaving him in a situation, where he must find out for himself. Let him discover on his own, where he is and why all this sh** is going on around him.\n\nSo, if you like cheap action movies - go for it! If you want a serious storyline with academy awards performances - avoid it. I liked the movie and I must admit, that although the storyline changed and it doesn't really feel like \"Far Cry - the game\", there was a lot of fun and action in it.\n\nWho else besides Uwe Boll dares to give us movies about our most favorite games?"
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "swedzin",
        "review_rating": "3",
        "review_title": "A mediocre game turns into a bad movie\u0085 thanks to who?",
        "review_detailed_main": "A mediocre game turns into a bad movie\u0085 thanks to who? Ah, the great and immensely wonderful Uwe Boll takes yet another video game and turns it into the motion picture. It's bad enough that the game itself (in my opinion) could be a lot better, but the making of the film (by Boll) was a freaking sacrilege. Boll as usual just took the game, re-wrote the plot and then squeezed out of his butt on the big screen.\n\nIt has that mad scientist on the Island thing, like in the game, but in the game the plot is settled somewhere on uncharted island in Micronesia, let's just say somewhere on Pacific. While in the film, it took place somewhere\u0085 in Canada? In some country on the north of US? Who knows? The looks of the filming locations are unlikely to have a large island with giant military operation. It just doesn't fit. The only thing that is same just like in the game, is that we have heroes Jack Carver and reporter Valerie who hires Carver to find her uncle, while in the game she just looks for the island to find out what is going on there. With the help of a man named Doyle. And, Doyle is not here\u0085 There is a mad scientist, there are his monstrous creations\u0085 but with the help of Boll, they look more messed up. I think that the game would ask for more budget. Curiously, I think that Boll didn't have enough. That's weird. While his movie funding remains a mystery\u0085\n\nCarver is played by Till Schweiger, whose career could have been instantly killed after this. He was kind of likable, but his character was so bad, that I just had a hard time to see\u0085 what kind of special, super solider he is. He was just badly written. Valerie is played by Emmanuelle Vaugier, whose career could also have consequences after this. She was nothing that special. In the game, she only appeared by voice, but here, they decided to put her as Carver's love interest, and without any emotion and any of the chemistry. The mad scientist, Dr. Krieger is played by Udo Kier. A fine actor, but he made so much bad movies. Why does he need to pile it up more? Even with this? I don't understand. Why would such a good actor waste his talents on such a bad film and such a bad director. Ralf Moller appears in this film as Valerie's uncle Max. Max was basically pointless. He did not appear in the game, he was put in the film only because Moller is a 6'6\" behemoth of a man, who can easily play these super human soldiers. There was just nothing that this character gives to us. And you just can't tell that he is Valerie's uncle. You just can't. There is no connection of any kind. The actors as Michael Pare and Clint Howard are also here. Yeah, the two extremely washed up actors who constantly seeks refuge in Boll films. What the hell? Both are solid actors, not the best, but solid. And by keep appearing in Boll's films are just killing their career more and more. Craig Fairbrass was used because of his soldier like menacing looks, but this can guy can do more than that. He should just avoid Boll. And, sad to say, Chris Coppola, who was the most irritating character in the film, one of the worst performances ever. I know that he is supposed to be irritating and boring character. But his character was so dull written, that Coppola didn't even, probably knew how to perform it, and I think that he was far more confused by Boll's bad directing.\n\nThe action scenes, camera work, score, editing\u0085 they are nothing special. The worst stuff was specified above. Avoid this film. It will ruin your mind. Better stick to the video game."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "kysiersan",
        "review_rating": "3",
        "review_title": "Not bad..... but...",
        "review_detailed_main": "As a standalone action movie it's average. Not great. Not bad.\n\nWhat puts it squarely into the bad camp are two main points. The first is they very obviously tried to make it appear they were connected to the game \"Far Cry\". The lettering and image used, even the plot gives the impression it's based on the game. Of course, it's not. This misrepresentation makes for a very poor experience. The second is the budget. 30,000,000 and it looks and feels like a low budget indie movie."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "bryanmartin1",
        "review_rating": "5",
        "review_title": "Way Better than Reviews",
        "review_detailed_main": "This was a fun flick. I've never played the video game so I have nothing to compare to. I also had low expectations watching this and was pleasantly surprised. Even though this movie is predictable, it's worth watching. I saw it for free so wasn't trying to get my money's worth. Is it a little campy? Yes, on purpose. The main actor doesn't have a bunch of lines but this is an action movie so not too much to say. The added comic relief character actually was kind of funny. If don't take this film seriously and just enjoy the ride, it's worth your time to kick back and enjoy an 80's style cookbook action film."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "Ismaninb",
        "review_rating": "8",
        "review_title": "Trick or treat",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "erikkoii",
        "review_rating": "6",
        "review_title": "Another Uwe Boll movie, a good one!",
        "review_detailed_main": "It's another Uwe Boll movie. That should say everything. But it sure does not.\n\nJust like when I watched the Postal movie for the first time. You think that you know what to expect, like; aw crap, another Boll movie. You, or at least I didn't expect much out of that movie. But hey, it was a hilarious comedy.\n\nIt's not exactly the same thing with this one. This movie tries to be serious. Well, it's not that's a bad thing. It's pure action through the whole movie. The effects and stunts are well made. But the acting could be way better. But still, it's worth watching.\n\nI'd say; time spent kinda well."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "Ghenghy",
        "review_rating": "8",
        "review_title": "OK, maybe in 2008",
        "review_detailed_main": "This might have sucked, but today its Academy Award material in comparison to the garbage we're being fed by Hollywood. Time for all you 4* Gomers out there to rewatch and recalibrate your opinions of this terrific action flick, this is as good as it gets in these times."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "Heislegend",
        "review_rating": "6",
        "review_title": "Let's get one thing straight...",
        "review_detailed_main": "Let's face facts: if the director were anyone other than Uwe Boll this would have a much higher rating. Why? Because all in all it's not a bad movie. It's by no means great, but it's still a hell of a lot better than some trash that made it to theaters recently (I'm looking at you, new Friday The 13th). Boll's reputation certainly precedes him so there'll always be a good number of people getting exactly what they expected even if the film wasn't as bad as...say...Bloodrayne. But to be fair, not much is quite as bad as Bloodrayne. This flick is pretty much standard action fair. A bit light on the plot, but have you tried watching anything with Steven Seagal in it...ever? There's gunfights, super soldiers, some somewhat lame attempts at comedy, but in the end it's all a decent way to kill some time.\n\nI must confess...I've only played the sequel to Far Cry, never the original so I don't know how faithful the movie is to the game. But Far Cry 2 was simply awful and whatever you may think of Boll, he's usually pretty true to his source material. I mean come on, you can't tell me that the movie version of House Of The Dead was any sillier than the game. Same goes for most of Uwe's ventures into the video-game-gone-movie realm (save for the criminally underrated Postal).\n\nThe purpose of this is not to make apologies for Mr. Boll. He's made some terrible stuff in the past. Does he deserve an Oscar? No, NO, one thousand times NO! But at least you know what you're in for and can hope for something a little better. And at least he's trying. If I may point further back in this post and point out that Michael Bay seems intent on simultaneously remaking horror movies that don't need to be remade and ruining them all at once. And Boll's the bad guy?"
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "thisisntmyrealnamehahaha",
        "review_rating": "8",
        "review_title": "S'allright",
        "review_detailed_main": "It's a pretty good adaption to the first videogame.\n\nI'd rate it higher if it had proper mutants and more of a horror aspect, but it gets close enough to the mark to get a B+"
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "budman21901",
        "review_rating": "7",
        "review_title": "Good Movie",
        "review_detailed_main": "I just got done watching it and i give it a 6.5. It's not a great movie, but its worth watching! It is much better then most reviews on this board give it. The game never had a great storyline to begin with so i think the director did a good job with what he had to work with. I would have gave it a 7.5, but the handcuff scene was out of place. Stupid humor should not be in the middle of the action, but rather toward the beginning. If you have played Far cry, or like action films i see no reason why its not worth checking this movie out. Disregard some of the haters of the director. It's not a bad movie at all. I have seen much worse!"
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "moviedude908",
        "review_rating": "7",
        "review_title": "A Whole Lot of Fun!",
        "review_detailed_main": "Sure, Uwe Boll has directed his fair share of B-movies, but I think he has shown real promise with his latest video game adaption \"Far Cry\". Far Cry stars Til Schweiger as Jack Carver, a worn out ex special forces soldier who now charters a whale watching rigg. Jack is suddenly thrown back into battle, while trying to drop off a journalist on to a mysterious island. On the island Carver is faced with a mad German scientist who's genetically modifying people into mutant soldiers.\n\nFar Cry is very fun and quite an enjoyable movie, I can't imagine why anyone would rate this film anything less than a 5. Perhaps the low rating is due to people rating it without even actually watching it.\n\nIn my opinion Uwe Boll has directed a great action film that doesn't take itself to seriously. I was very impressed with the outcome of this film and I'd recommend it to any action fan. Keep up the good work Uwe Boll! I look forward to your future work."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "BroadswordCallinDannyBoy",
        "review_rating": "6",
        "review_title": "Action Flick 101",
        "review_detailed_main": "One tough guy kicking butt and taking out an entire army during one weekend. That sounds like Schwarzenegger in \"Commando\" or Stallone in the 2nd and 3rd Rambo movies. Or like Til Schweiger in this film. A tough guy, who's good at heart, is forced to fight for his life and probably also for the life of the entire free World, though that last part is only not too subtly implied here. But it all works for the better and adds up to a dumb, yes, but actually enjoyable action movie.\n\nThere is a variety of action scenes, some humor, and a German guy who has an inexplicably English name... Jack Carver. Oh well, maybe it's an alias. But in light of the frenetically edited, darkly themed, and super produced Bourne movies among others, this return to basics is pretty enjoyable. The only thing different here than in those crazy 80s action movies is that the bad guys aren't communists or Soviets, but a shadowy government agency and possibly an evil corporation - in other words, the people that we currently most dislike are getting their butts kicked. Not much more to expect and not much more to ask for. --- 6/10\n\nBsCDb Classification: 13+ --- violence"
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "FlashCallahan",
        "review_rating": "6",
        "review_title": "you owe me a meatball sandwich....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "konya-s",
        "review_rating": "6",
        "review_title": "You know what? I LOVED this flick!",
        "review_detailed_main": "It was directed by Uwe Boll. So what? Is that makes this film instantly the worst film ever? I know, Uwe Boll is not the greatest director ever. I saw Bloodrayne and it was pretty awful. But you gotta believe me, Far Cry is an entertaining, action-packed flick, and if you love those \"B\"-movies from the '80s and '90s you will love this movie as much as I am. Believe me please, and give it a chance! It has some corny jokes but still great! And I mean it! Till Schweiger was good in his role, Udo Kier is an icon, it was a pleasure to watch him, and...Great action, explosions, car-chase, boat-chase, blood, and everything you need! Great movie!"
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "HistoriMaster",
        "review_rating": "6",
        "review_title": "Surprisingly good",
        "review_detailed_main": "Based on a much-loved video game of the same name, and directed by Uwe Boll, a lot of critics were sure that \"Far Cry\" would be a complete failure, even before they had seen the movie. Naturally, a lot of reviews reflect that.\n\nMost of the criticism is unjustified, however. I have yet to see a movie adaptation of a video game that can faithfully reproduce the atmosphere of the game, and how could they? In a VG, you are an active participant, with your imagination contributing to the story. In a movie, the director can only present his own interpretation, and that will seem unsatisfactory to many fans of the game.\n\nGiven this restriction, Uwe Boll has done a fairly good job. He did not fall into the trap of trying to copy the VG scene by scene. Instead, he produced a movie that used the available funds and actors to best advantage. Especially Udo Kier as Dr Krieger was an excellent choice. All in all this may not be a first-rate movie, but can surely hold its own with many another production of this genre."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "cgatewoo",
        "review_rating": "6",
        "review_title": "He's getting better",
        "review_detailed_main": "Video game fans beware. Jack Carver dishes the Hawaiian shirt early and never reclaims it, not even during the epilogue. If you can accept that, you can accept this movie. The actor playing Jack is a rather unknown. Most notable would be the gun toting drug dealer from SLC Punk! The confused villains are Udo Kier (who everybody will recognize but not know why) and that German guy from \"Beerfest\". There isn't really anything I can fault this movie with (aside from dropping the shirt). It is an average action movie which is actually better than anything Segal has put out in a decade. Budget wise, it beats Max Payne into the dust (and is more enjoyable). Dungeon Siege proved that Uwe Boll can make a decent picture, now he is refining it. If you have some time to kill this does the job. By the way, Emanuelle had to be improving, a lot of his lines are to funny for the script."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "gavin6942",
        "review_rating": "6",
        "review_title": "Another Step Up For Uwe Boll",
        "review_detailed_main": "Jack Carver is a retired special forces soldier... but he gets sucked back in to combat when a reporter has him bring her to an island where a money-hungry German scientist is genetically modifying humans into super soldiers (not like Captain America) to be one-man wrecking machines. Will Jack be able to defeat an entire army?\n\nUwe Boll is getting better as a director. \"Bloodrayne 2\" was good, \"Tunnel Rats\" was respectable, and now this... I liked it. The days of pure manure like \"Alone in the Dark\" and \"House of the Dead\" might finally be behind him. And it helps that he has a strong cast... Til Schweiger (\"SLC Punk\", \"Inglourious Basterds\") is a great action star as Jack Carver. Emmanuelle Vaugier is annoying, but able as reporter Valerie Cardinal. I fell in love with Natalia Avelon as military leader Katja Chernov, and want to see all her movies... too bad they're in German.\n\nB-movie hack (and I say that with respect) Michael Paré is Paul Summers... and not to be missed, creepy German guy Udo Kier is Dr. Lucas Krieger! Because, you know, you can't have a good film without a mad German scientist. (There should have been some subplot of him being an ex-Nazi, but the mystery of his painting kept me intrigued well enough.) Chris Coppola shows up as Emilio the Food Guy. You might recall Coppola from other Boll films: \"BloodRayne II: Deliverance\" as Newton Piles and \"Postal\" as Richard. I wouldn't mind seeing him again... a little comic relief is important in an action film.\n\nAction, humor, sex... this is a good adaptation. And there are plenty of stunts (see the list of stunt men -- it's longer than the cast). Uwe Boll, you are beginning to pleasantly surprise me... bring on your \"Max Schmeling\" movie and bring on \"BloodRayne 3\"."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "ctomvelu1",
        "review_rating": "6",
        "review_title": "Fight fight fight",
        "review_detailed_main": "Yet another video game adaptation by Mr. Boll, FAR CRY has a retired Special Forces guy (Schweiger) ferrying a female reporter (Vaugier) to a remote island where her uncle is being held by mysterious forces. Turns out the island is a government institution where a mad doctor (Kier) is transforming soldiers into super soldiers. Vaugfier gets captured early on, so it's up to Schweiger to rescue her and the uncle and take on about 500 soldiers -- plus the mad doctor. Schweiger, the current generations's answer to Tom Jane and Christopher Lambert, is an affable, German-born actor probably best known for INGLORIOUS BASTERDS. Vaugier is her usual sexy self, but is little used in the film. Standard mindless fight scenes and explosions clearly inspired by UNIVERSAL SOLDIER. For true cineastes, it will become clear two minutes in that this was shot on the cheap in Canada."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "kupatadzevefxvia",
        "review_rating": "6",
        "review_title": "Not bad",
        "review_detailed_main": "When I watch this movie,I did not know who was director.Uwe Boll really?He finally made good movie.Of course its not perfect,but I think there are many good scenes,effect are also OK.Actors were not bad,but their performances were really weak.\n\nDon't trust any uwe boll'haters.Probably some people gave raiting without watch this film. After all far cry was good game adaptation with some powerful action scenes If you want to see ridiculous film and already play far cry games,this movie is one of best. 3/10 very low vote.Far cry deserves much more. My rating 6/1 Thanks and sorry for my English.This is my first review."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "Mike_T-Little_Mtn_Sound_Archive",
        "review_rating": "7",
        "review_title": "Fun action flick with a little humor and good pace",
        "review_detailed_main": "I'm so tired of IMDB reviewers. Any movie by Ule Boll is instantly horrible. If this was made by anyone other than him the reviews would be better. All the poor reviews are very obviously colored by those either:\ndon't like Ule Boll\nare total backseat drivers\nexpected something totally different due to the game connection\n\n\nIf the movie is judged solely on its merits, nearly every review would be multiple points higher.\n\nJust watch it for yourself. Don't worry who directed it, don't worry what you could have done better or pointing out all the falacies (come on...it's a sci-fi action film after all), and knowing nothing about the game I simply cannot comment on the movie.\n\nBUT...taken on its own, as a quirky kind of sci-fi action flick, it's a fun 90 minutes with a great pace, and decent all around production."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "nodurxshn",
        "review_rating": "6",
        "review_title": "Fary Cry vs. SF: Legend of Chun Li",
        "review_detailed_main": "As far as VG to movies go i think this one was a better VG movie than SF for many reasons namely ..ACTION and ..DETAILS ...and that is why this movie is better..for the remainder of this comment i will ramble on about some other interesting things in the movie ...lots of kinda funny parts and some super lame parts some really cliché things but that is kinda what your signing up for even watching this movie some cliché one liners in some ways it could have been better but it more ways it didn't fail ..so its still better than street fighter..but this movie is better ..so forget about the major fail flop let down that was SF and do yourself a favor and give this movie a chance you really cant go wrong"
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "kelvinselimor",
        "review_rating": "6",
        "review_title": "A boring adventure.",
        "review_detailed_main": "Far Cry. A boring adventure. A very average quality action movie and if it was an unnamed film it would be possible to forgive a lot, but this is Far Cry! The opponents are insanely stupid, even in the game computer models with artificial intelligence are even smarter."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "zaberansary001",
        "review_rating": "6",
        "review_title": "Havent played the games, had fun watching it",
        "review_detailed_main": "Pretty fun movie with some cheesy moments. Plus the story is awful but hilarious here and there. Acting of all side characters are subpar. Still would give at least 6 out of 10."
    },
    {
        "movie_id": "tt0400426",
        "movie_name": "Far Cry",
        "movie_rating": "3.2",
        "review_username": "robinmaes-06129",
        "review_rating": "7",
        "review_title": "Not as bad as some make it out to be",
        "review_detailed_main": "It's cheesy and sometimes poorly acted but i still enjoyed it, just don't expect The Expendables. It's not as bad as some make it out to be. Decent action, decent story.\n\nLong live the Far Cry games."
    }
]