[
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "avneet-15775",
        "review_rating": "3",
        "review_title": "No words",
        "review_detailed_main": "It wasn't the worst of worse but was bad. No story, rubbish acting. Disappointed Jonny would even agree to do such roles. Overall I would say wait until the movie's on TV to watch it."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "sourya-mukherjee",
        "review_rating": "5",
        "review_title": "Might not run Housefull 4 long 😊",
        "review_detailed_main": "First there are funny films that leave an impression for a lifetime (e.g. Golmaal of Amol Palekar, Chupke Chupke of Amitabh & Dharmendra, Hera Pheri, Munnabhai MBBS) and then there are those casual weekend watches which makes you laugh your heart out at certain moments during the film but nothing you'll recommend to someone the next day. Housefull 4 qualifies for the latter. One great thing about the movie is that it's NOT a vulgar comedy filled with hindi slangs (which many other directors bank on today to make people laugh). It's old school, clean and meant for a family watch & I really loved it from that stand point. Akshay Kumar is brilliant. Kriti Sanon is good too. Certain one liners are outright hilarious and will make you laugh. Problem is that the support casts (including stalwarts like Johnny Lever) are absolutely horrible. Chunky Pandey & Bobby Deol should stop acting. They are an eye soar. Johnny Lever's acting as a transgender is difficult to watch and in just how many movies more are they going to make Riteish Deshmukh behave in a feminine way. There's no originality left in that any longer. The music is terrible & the story is rubbish. However, the best part of the movie are the last 20 mins. So there's a bit to look forward to. Therefore, if you're not doing much this weekend, you might like to buy the tickets for this one or not. I'll leave that choice to you 😊"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "ggg_goldy",
        "review_rating": "3",
        "review_title": "Disappointed.",
        "review_detailed_main": "Totally waste of time. Previous all 3 movies were much better than this latest version. No fresh punchline. Pathetic screenplay and dailogue."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "Vineet_MishraPrayagraj_Dibiyapur",
        "review_rating": "1",
        "review_title": "I feel so sad about Indian Film Industry",
        "review_detailed_main": "Film is only about money making in India, respect for Art is dead. No script, no acting, only big stars and plenty of crap songs that's what make movies in India.There should be a quality check before a movie is made public. Outside world when they see this kind of movie they might be laughing at us not on the movie. Directors and Producers of this movie should arrested for making this movie. Its pure nonsense and may cause migraine to some people in audience."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "gauravsuman-72827",
        "review_rating": "1",
        "review_title": "UNBEARABLE",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "hiteshpoudel",
        "review_rating": "1",
        "review_title": "Waste of time and money",
        "review_detailed_main": "The movie is consistent throughout the runtime, consistently boring!! All those predictable and unfunny jokes with female cast being there just for glamour sake. Same old thing that has been there in this sort of senseless bollywood movies. Even if we consider the fact that this sort of movies have no room for logic and common sense, it should at least for a reasonable amount of runtime make people laugh. Dialogues like \"Tatti chatle\" and \"mere upar hagdo\" are used with the intent to make audience laugh. It's really ridiculous seeing these sort of movies are made wasting huge amount of budget. It's really time the audience boycott this sort of senseless movies in order to better the level of bollywood movies in future."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "kumarsumitnimesh",
        "review_rating": "1",
        "review_title": "I am giving this review while watching!!",
        "review_detailed_main": "Worst movie ever I have seen!! Total Time waste!! Money waste!! Tatti!! No laughter!!"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "najminabil",
        "review_rating": "1",
        "review_title": "Worst Movie of The Year",
        "review_detailed_main": "Total Garbage No Story No Fun No Laughter Nothing 2 nd a half of Hours of pure Crap I want my Money Back now"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "deepakdst",
        "review_rating": "7",
        "review_title": "Senseless plot but Hilarious, Funny and crazy comedy.",
        "review_detailed_main": "I can assure you if you are an Indian you will not regret watching this comedy in free time because this comedy is totally crazy and every character had done his best to entertain us. Obviously Bala is now a historical character and you will enjoy seeing him but others characters are also crazy. The plot is a problem but I don't think people care for plot in case of comedy. This is a paisa-basul comedy."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "samjeremiah-21052",
        "review_rating": "2",
        "review_title": "It's a Sajid Khan's movie at all (Humshakals , Himmatwala )",
        "review_detailed_main": "Nothing new old story Housfull 1 was epic second was very good and third part was not that good as the previous and now this is going to be epic disaster because of grand budget , bad story and specially becasue of Bobby"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "pawanpunjabithewriter",
        "review_rating": "10",
        "review_title": "Couldn't stop laughing even after it ended",
        "review_detailed_main": "This movie is exceptional, truly and epic reincarnation comedy. The best comedy movie of the year, and one of the best of the decade. However, the second best of the Housefull franchise after Housefull 2. This one is a gem. The first half seemed okayish, above average, all the secrets were out. The second half, I must tell you, it was unbearable for my stomy. I laughed so hard, so loud, I couldn't imagine ever. Akshay Kumar, Ritesh Deshmukh, Bobby Deol, Pooja Hegde and Kriti Sanon, all have done a remarkable job. The best was Johnny Lever, oh my God! I couldn't take a moment of calmness. Mamma Mia again rocked it. We need Housefull 5. My ratings for all the Housefull Series are as below: H1 : 7.5 H2 : 9 H3 : 6 H4 : 8.75 Yes, I'm an Akkian, but this is my true review, not a biased one unlike the idiot Taran Adarsh who never underands comedies 😂😂 I couldn't stop laughing when he Rated Prem Ratan dhan Paayo and ABCD 3 as 4/5, Dabbang 3 as 3/5 saying entertainer and one of the best movies of Bollywood Dil Chahta hai as 2/5 😂😂"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "salmaniac-26688",
        "review_rating": "",
        "review_title": "Huge Disappointed",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "triphixzapperking",
        "review_rating": "6",
        "review_title": "Not so bad! Just for change.",
        "review_detailed_main": "Main objective of any movie is entertainment. Housefull 4 is an entertaining movie. Its true that plot isnt great but its okay. If you are seeking for movie full of serious subject, i would say we've been enough through subjects at school. I watch movies for things that won't happen in real life and what if movies starts to show only reality.........every movie will be depressing because reality is depressing. This kind of movies.....watch them just for change."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "prathampikku",
        "review_rating": "1",
        "review_title": "Flop Recarnation",
        "review_detailed_main": "Akshay Is Doing So Hard Itself , But All The Co Stars Is Doing Their ;P , Director Sajid Again Gives A Biggest Disaster Of The Decade , Then Hamshakal , Himmatwalan, Now Houseful 4 😂😂"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "maazrehman-11324",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "Faisaco movie total disappointment no story forcefully comedy not comedy punchlines at all not at all entertaining totally waste of time even housefull 1 & 2 were better then these"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "pawan-niks",
        "review_rating": "1",
        "review_title": "Headache",
        "review_detailed_main": "Watched Housefull 4 with lots of expectations from this franchise but it's let down my hope. Total overacting by starcast, idiotic dialogues and mismatching of storyline, maybe because of two directors film. It's headache to watch out."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "Nalam39",
        "review_rating": "1",
        "review_title": "Disappointed it's",
        "review_detailed_main": "I always love akki as a comedy actor but this is a crap , it's another Teesmarkhan or joker."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "usamawago",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": "Don't even watch it for free you will go in depression by watching it."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "kunaldarakha",
        "review_rating": "1",
        "review_title": "Worst in the name of comedy",
        "review_detailed_main": "They have tried to everything to make this film funny, but the sad reality is they failed totally.. It is an terrible and totally waste of money Watch it at your own risk"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "sparampreet",
        "review_rating": "",
        "review_title": "They makers only care about money",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "yoyoseenu",
        "review_rating": "7",
        "review_title": "Funny and hilarious movie",
        "review_detailed_main": "This movie will make you laugh Anyways weak story line and direction But it's an enjoyable movie"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "ashutoshaswaleho",
        "review_rating": "1",
        "review_title": "Sajid khan did it! Again!",
        "review_detailed_main": "When we sat down entire theatre was shouting at nonsense jokes, cringy dialogues, it kinda feels like we are going back into the 90's era. The film itself doesn't offer you anything new, trailer does show that it has that medieval touch which was unique and turned out that the creators fail to execute it properly. Songs and music was rubbish. Don't go, it was a peer pressure that brought me to the theatre. Save your money. Or donate it to the poors and make their diwali."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "kumaraman-34074",
        "review_rating": "8",
        "review_title": "Nice 👍 movie",
        "review_detailed_main": "Why everyone spreading negativity about this movie.."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "shadabsiddique",
        "review_rating": "6",
        "review_title": "Good comedy",
        "review_detailed_main": "Comedy is good. It's a different kind of movie where logic doesn't work. Critics are at times harsh in their reviews. They should have reviewed from another perspective. One time watch movie with good comedy by Akshay, Ritesh. The actresses were average in comedy. Ranjit is a veteran. I liked Pasta (Chunkey Pandey). Bhallaldev was a surprise. Remember these kind of movies is a nice time pass at home when watched in OTT streaming service."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "smohammeds-88463",
        "review_rating": "1",
        "review_title": "Pathetic movie of 2019",
        "review_detailed_main": "Perfect example of how to waste time and money... A typical Akshay Kumar movie with his overacting.."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "sanjaysahni",
        "review_rating": "1",
        "review_title": "Crap",
        "review_detailed_main": "Humshakals 2 in the name of housefull4 Don't waste your money and time,save your time and Money to celebrate Diwali festival with family..."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "ksinghh",
        "review_rating": "1",
        "review_title": "Worst movie in the history of Bollywood",
        "review_detailed_main": "It's the worst movie of India cinema both in terms of content and acting. That's what happens when several C grade actors act in a movie. Don't ever dare to watch this crap"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "barcacatalunia",
        "review_rating": "1",
        "review_title": "Nothing new",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "maheshkendre",
        "review_rating": "1",
        "review_title": "Torturous , Horrible , Headache",
        "review_detailed_main": "Worst movie of the year. Forceful comedy , acting of akshay kumar is still good but others are totally crap. Don't waste ur money and time on this movie . I suggest u don't watch this movie, if u want some relaxing time and some sleep then u can go and sleep in theatre."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "wwwabhisbngn",
        "review_rating": "1",
        "review_title": "I quit after the interval.",
        "review_detailed_main": "Unbearable Illogical what more can I say.. Save your money and get some food."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "abhinav-05389",
        "review_rating": "7",
        "review_title": "Good entertainer without a proper script",
        "review_detailed_main": "Movie is full of humour but lacks proper script Akshay Kumar's performance was nice. Songs were good Saitaan ka saala was lit. Ek chumma was a nice song. Kriti k, kriti s , Pooja Hegde were not impressive but okay"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "safetyprofessionaldxb",
        "review_rating": "1",
        "review_title": "Worst movie of now",
        "review_detailed_main": "Really to be honest, This movie is tortured and waste of money and time. Just you have vacation and you are thinking to go to watch movie. I suggest you better go somewhere else wastage of completely 3hrs."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "nalindra-ferdinando",
        "review_rating": "9",
        "review_title": "Most funniest ever!!!!",
        "review_detailed_main": "I was not a huge fan of Housefull 3 which was dull but still went to check this. Believe me when I say it's the funniest in the series and you will have a great time with your family!!! I know I did and it was such a joyful movie perfect for festive season."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "khushalsharma-65460",
        "review_rating": "7",
        "review_title": "Throw your heads, it's a family entertainer",
        "review_detailed_main": "I don't know why this movie is getting so much hate. After looking to the reviews I cancelled my plan for watching this movie but after all it's a Sajid Nadiadwala movie so why so much expectations from this movie. I watched this after coming to Hotstar, it was good for once and fun. So don't use your brains just watch for once and decide your own, don't look to the reviews. JUDGE your own."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "ronakkotian",
        "review_rating": "2",
        "review_title": "Immature and repetitive",
        "review_detailed_main": "The Housefull franchise has always been a guilty pleasure for me. I knew that all the films were bad but there was something about them which gave me enjoyment whilst watching them. The fourth film, however, is just straight up terrible.\n\nHousefull 4 is about three couples who get reincarnated 600 years later as they find out that they're about to marry the wrong person.\n\nI'll just get to the point. This movie is just atrocious. Out of all the Housefull films, this one is most certainly the weakest. What sells this movie is its huge scale and ensemble cast but apart from that, everything else is poorly made. I think the jokes in this film is the worst out of the four. Majority of them get constantly recycled and some of them are just childish and disgusting. There were a few moments and jokes which I thought were creative and actually got a laugh from me but there is so much rubbish that overshadows them. It starts to get tedious really quickly. The visual effects were a pain to sit through. It seemed very noticeable where the effects were used and it made me repeatedly facepalm in my seat. There was also an absurd amount of perversion scattered throughout which weren't clever or funny. It goes to show the struggle the writers went through in terms of writing unique and witty humour.\n\nThe acting was fine. Akshay Kumar was clearly trying to funny and is definitely the best part of this film. Riteish Deshmukh and Bobby Deol were fine. The three actresses didn't have much to work with and just had the purpose of being eye candy. It's so sad to see talented actors like Nawazuddin Siddiqui be completely WASTED and pointless to the film's story.\n\nIf only the film actually tried to provide us with jokes that were actually funny and unique as well as giving a compelling story with fleshed out characters in the forefront rather than a bundle of cameos, references to past and current actors and illogical sequences that make you shake your head in disappointment.\n\nEven if you're a fan of the Housefull series, I reckon this installment won't satisfy your expectations. It's better to skip this one and watch something more worthy of your time."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "morshedasif",
        "review_rating": "1",
        "review_title": "Nothing new , story very bad,hoursfull 1and 2 is awesome story",
        "review_detailed_main": "Akshay kumar comedy is ok ok ,but not so good, Riteish comedy is outstanding"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "yazooshrestha",
        "review_rating": "1",
        "review_title": "Worst (2 hrs 30 min torture)",
        "review_detailed_main": "I got nothing new from this movie. Same old kind of bad jokes and all...Really don't want to talk about this movie cause it's bad.😑"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "satishmeghani",
        "review_rating": "1",
        "review_title": "Totally time and money wasting experience.",
        "review_detailed_main": "Housefull 4 is is a full of rubbish. The movie has a nothing new to offer to audience. I felt cheated after watching this. I am sorry for Akshay Kumar. Please watch some other movie as it will ruin your Diwali in this festive season."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "iamafzal",
        "review_rating": "2",
        "review_title": "Torture",
        "review_detailed_main": "Housfull 4 is torture in the name of comedy Directions dull Screenplay dull Acting dull Only Ritesh performance was good Akshay Kumar did irritating overacting If you want headache than watch this, and if you don't want better to skip... And watch rather than Saand ki Aankh"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "impraveengarg",
        "review_rating": "2",
        "review_title": "Not for diwali celebration,",
        "review_detailed_main": "It's doesn't touch height of Comedy, a commenn comedy that we already watch in old films ,that VFX shown in trailer , not available in movie... Akshay made patriotism movie good.. Happy diwali to all"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "iambikashkush",
        "review_rating": "6",
        "review_title": "Good Comedy movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "canuj-71279",
        "review_rating": "1",
        "review_title": "Movie is Animal excreta",
        "review_detailed_main": "Lethal for brain cell . Give your money to buy stuff from poor people this diwali instead of wasting it on this poop."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "nigamashish-99882",
        "review_rating": "10",
        "review_title": "Bikul Jhakas",
        "review_detailed_main": "Truely love this movie. Akshay is fabulous and his forgotten memory is very witty."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "ankit-88502",
        "review_rating": "7",
        "review_title": "Little good",
        "review_detailed_main": "Little good and comedy was not much good but ok movie was not bad"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "nairtejas",
        "review_rating": "2",
        "review_title": "One-Line Review: Housefull 4 (2 Stars)",
        "review_detailed_main": "Housefull 4 has every stereotype that we are trying to eradicate whether it is with the expected size of women's waist or men's biceps or making fun of someone's name (three pigeons are named Neil, Nitin, and Mukesh) and it still reduces as a 150-minute product of unimaginative, crass humour that mostly depends on wordplay and spoofing Baahubali (2015) and still cannot be termed funny or entertaining. TN."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "taruns-83045",
        "review_rating": "1",
        "review_title": "Disaster",
        "review_detailed_main": "Disaster movie worst comedy movie I have seen in my life flop actor bhaghora Canadian"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "kaveta-63257",
        "review_rating": "1",
        "review_title": "Holy Crap!",
        "review_detailed_main": "Actor #Akshay Kumar is the only saving grace in Housefull 4. Its probably the worst of the four films under the franchise. When the funniest dialogue in the film is \"GAMA Marega\" very late into the film then you know you got no hope left Nawazuddin Siddiqui must have needed money terribly to do that goddawful 5 minute cameo. And Riteish Deshmukh..that guy is a really good actor. Give him a break from the girly stuff. Johnny Lever ..feel sorry. There was nothing he could do when the script was so bad. Bobby Deol I interviewed you a while ago and you are so kind hearted and warm and I still love you. Dharamputra ko sau khoon maaf! Rana Daggubati.. what a let down after the classy Bahubali..but atleast you got the best line!\n\nThe outtakes were funnier than the film!\n\nMy husband Ajit sat mostly poker faced through the film that was a comedy, while I laughed at the absurdity of it all. He had the last word.\" Now you know how much I love you!\" He was keeling over in misery in Housefull 3\". To brave Housefull 4 is truly a demonstration of selfless true love..Lol. Taking him out to dinner to make amends!"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "rajiyer-66521",
        "review_rating": "1",
        "review_title": "Pathetic movie",
        "review_detailed_main": "Dont even try to see this movie, trust me you will regret the same. Worst movie done by akshay kumar"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "hurtyvijay",
        "review_rating": "1",
        "review_title": "Bakwas",
        "review_detailed_main": "Tatti movie Tatti movie Tatti movie Tatti movie Tatti movie Tatti movie"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "omerkhan-37202",
        "review_rating": "1",
        "review_title": "Pathetic movie! Headache",
        "review_detailed_main": "It's a worst movie, Sajid khan could make a better movie than this .. I don't understand how this movie making good movie , why people are wasting money on this movie."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "akumbhar",
        "review_rating": "7",
        "review_title": "One word review -only Entertainment",
        "review_detailed_main": "Dimag ghar pe chod ke jana 100% you enjoy comedy 100%Entertainment"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "amybharadwaj",
        "review_rating": "1",
        "review_title": "Worst film in the history of India cinema",
        "review_detailed_main": "Friends dragged me to see this movie coz it has a star cast - it was pathetically boring and ridiculously unfunny. Each and every minute of my life was wasted watching is atrocity - nauseating to even think back about it.\n\nI want to rate it in the negative but the system here doesn't allow me to. I don't know who the target audience is - but its certainly not for anyone which half a brain and an ounce of logic."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "asadharanasone",
        "review_rating": "10",
        "review_title": "ONE - TIME MUST WATCH",
        "review_detailed_main": "If you watched it once, whenever you will hear the music, you will be tempted to watch it again and again.\n\nTop notch acting in flashback scene, climax could have been better"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "rish2006",
        "review_rating": "7",
        "review_title": "Take it easy - It's not that bad",
        "review_detailed_main": "We people often tend to focus on the logic in the films we watch. People are cursing the film, due to no logic and unnecessary fiction. The cast had already informed that there is no logic in this film and is made for entertainment purpose. After that also some people don't get it and start passing unnecessary comments.\n\nComing back to the film:\nthere is good humor\nsets shown are impressive\nsongs are not that good enough\nApart from that - it is a decent film to watch, just don't keep digging for logic during the film."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "jayashmah",
        "review_rating": "1",
        "review_title": "There was no option for putting a negative",
        "review_detailed_main": "If you are planning to watch this movie at theatre-- one advice;DONT. Often you are not able to leave in the middle.\n\nYou can gauge my plight - I didn't have an account. I created account while I was trying to kill time in theater only to save few worthy souls from going through same plight that I went through."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "coolrathish",
        "review_rating": "2",
        "review_title": "Useless",
        "review_detailed_main": "Completely useless novie, a pure waste of time that too during a festival holiday. Please don't waste any amount of money or time behind this movie. There is no storu, it's a KUCH BHI STORY, the makers have not even though of any logic before working on this movei and script, and the main negative thing I felt was Bobby deol, he didn't had any role nor is able to act now. Highly not recommended"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "aanshu-63288",
        "review_rating": "1",
        "review_title": "Horrible Movie",
        "review_detailed_main": "Extremely irritating movie. Brainless and useless. Wastage of time"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "santoshambekar19",
        "review_rating": "1",
        "review_title": "Why on Earth we need this movie",
        "review_detailed_main": "The only good thing about this movie is it's title song - Bala! The rest is just hours of time waste. It seems that the story is not a well thought work here. All good moments where they can add some hillarious comedy was deliberately missed. There seems not even a single moment where you would even grin."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "dnklionheart91",
        "review_rating": "2",
        "review_title": "A big noooo",
        "review_detailed_main": "What a waste of time .. the cast n crew should be ashamed of making such a illogical and totally crap movie .."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "AnonymousbutDilpreet002",
        "review_rating": "1",
        "review_title": "In one word - Stupid.",
        "review_detailed_main": "Okay, how many times we have seen this in Bollywood. A person regains his memory when he encounters an incident that made him forget everything . In this film, Akshay Kumar gets reminded of his previous birth in which he and his two friends could not marry their lady loves.Funny part is, everyone from his past life, including three pigeons are reincarnated and met at the same city where they died. He tries to remind everyone of their previous births. Thst's the whole story. And it doesn't make littlest of sence.\n\nIt was supposed to be a reincarnationfilm but there's totally no suspence. Whole story is not only predictable, but many of the themes were actually taken from some famous films like Bahubali ,Sacred Games(series). Besides this, there are not many funny scenes either.\n\nIt's a copied(Cliche) plot, predictable and not even funny, why should anyone watch it."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "rajgarkar",
        "review_rating": "7",
        "review_title": "Average",
        "review_detailed_main": "Hello fellas, the movie was great fun and a lot of comedy. Yes some guys are disappointed but i think it was not that bad you can give it a try. Overall the movie was decent and average"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "arpitgargsbsc",
        "review_rating": "1",
        "review_title": "Should now close this series",
        "review_detailed_main": "The worst Housefull series film. Poor dialogues, bad direction, worst screenplay. Don't waste money on this."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "samsafari",
        "review_rating": "10",
        "review_title": "Atrue comedy movie , so underrated !",
        "review_detailed_main": "I can't believe why this movie is so underrated in reviews ! this is a very nice comedy movie , I don't know about this 1 and 2 and 3 star reviews ! but this movie deserves more than this !"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "swagatnistelrooy",
        "review_rating": "7",
        "review_title": "Awesome timepass movie for people who like Comedy Genre",
        "review_detailed_main": "People lacking a sense of humor, my advice stay away...u will hate it"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "unrivaledraj",
        "review_rating": "1",
        "review_title": "Insult",
        "review_detailed_main": "Can IMDB introduce option to rate things in negative, because this deserves it. I understand you can go wild in imagination and logic when creating comedy, but this is totally unbearable. Not a single moment that'll make you even smile a little. It's even worse than the previous Housefull franchise. Such kind of movies are an absolute insult to the comedy genre and film industry."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "greysky-10644",
        "review_rating": "1",
        "review_title": "From Painful to Suicidal",
        "review_detailed_main": "I fail to understand, how ridiculous a movie can get. Waste of time."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "sajid-49164",
        "review_rating": "1",
        "review_title": "Bad movie of the year",
        "review_detailed_main": "Waist of money and time better watch war movie again its 10 times better"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "shianpanchal",
        "review_rating": "1",
        "review_title": "....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "preet-33461",
        "review_rating": "1",
        "review_title": "Pathetic movie",
        "review_detailed_main": "Don't waste your time and money . It's a pathetic stupid movie with no sense. Even comedy scenes doesn't make you laugh . All actors have done overacting including Akshay. Bad used language like ' tatti ' is horrendous Only good to watch was Johny lever and Chunky pandey Please stop making movie like this"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "YeTejaTejaKyaHai",
        "review_rating": "1",
        "review_title": "Intolerable",
        "review_detailed_main": "The movie has only two things: 1) overacting and; 2) unmatched obsession with animal poop.\n\nPure pure garbage. Complete waste of time and money. By far, this is the worst Bollywood movie of 2019. Movie lacks script, acting, jokes, content, dialogues, direction... come on, the morons even have used old lyrics instead of dialogues...\n\nPlease save your money and time by *not* watching this movie. It's something I can't tolerate even if I have to watch it for free, it's such a diarrhoea."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "yoyoseenu",
        "review_rating": "7",
        "review_title": "Funny and hilarious watchable mivie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "ankitthedon-sharma",
        "review_rating": "1",
        "review_title": "Tatti happens!...but more so when whole cast is tatti..it means more tatti.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "alishashoaib",
        "review_rating": "10",
        "review_title": "BESTEST FILM EVER WATCHEDD",
        "review_detailed_main": "Wowieee ! The best film i've ever watched . Like ughhh, I literally lovedd the movie and i've watched it 1000x and I literally loved it every time , i fully recommend tp watch this . Peace :)"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "pranayjadhavmum",
        "review_rating": "7",
        "review_title": "No Brainer but good Entertainer",
        "review_detailed_main": "I don't know on what grounds people are rating this movie so bad. Were they expecting this movie to be of Hera Pheri's and Andaaz Apna Apna's Class? Or were they expecting something of the quality of Swades? I agree this movie is illogical, no brainer but it is a good enternainer. This movie does tickle your funny bones. Yes there are few repetitive jokes from previous housefull installment, but that's fine as we expect characters like Akhri Pasta and Papa Ranjeet to do their trademark antics. Akshay Kumar is at his funniest best.\n\nIt's a funny movie which you should go and enjoy keeping your brain and logic at home."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "chatterjeesandeep-29099",
        "review_rating": "1",
        "review_title": "An ultra disappointment....",
        "review_detailed_main": "This is a horribly written script... Superb overacting by the actors.. Will try for a forceful comedy... But actually it's a tragedy... 👎👎👎👎👎👎"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "kumarhimanshu1993",
        "review_rating": "1",
        "review_title": "Save Your Diwali..Skip This",
        "review_detailed_main": "Bore-fest, Headache, Mediocre, Cringe scenes and dialogue. No plot, poor direction 3 hours n 300 rs wasted , better to burn ur money, atleast that will be less painful than this TORTURE"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "nasimaktar-19906",
        "review_rating": "1",
        "review_title": "Hate it",
        "review_detailed_main": "Big disappointed Akshay Kumar please try new Overacting just like a total dhamal One more disappointed 2019"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "mohamedjamee-80161",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": "The crew really did their best to do nothing..this literally the worst movie ever i saw..i need my money back"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "artificialintelligenceai",
        "review_rating": "2",
        "review_title": "F - That Sit",
        "review_detailed_main": "Only Disappointment #H4 it's Worst Movie Every 1 Story line - faild 2 Direction - Useless 3 Acting - Hell 4 Comedy - Noting Equal 5 Entertainment - worst/Roast"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "winak",
        "review_rating": "2",
        "review_title": "Stupid !! Stupid !! Stupid movie !!!",
        "review_detailed_main": "Brainless, Senseless and Humourless. The less said about this movie the better. There are some mysteries in this world and how this movie was declared a hit should be one of them. I felt like committing \"Harakiri\" for just watching this movie."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "anilk007",
        "review_rating": "7",
        "review_title": "Good for A Laugh",
        "review_detailed_main": "A quality production that entertains from start to finish. About 50% of movie is (sensibly) based in 1419 and remaining in 2019. Good cast and characters with Akshay Kumar at his best. Kriti Sanon was her usual. Catchy background music. Overall=average++"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "Abdullahalmamuntony",
        "review_rating": "1",
        "review_title": "Foul film",
        "review_detailed_main": "Never expected from Akshay Kumar and the team. It is the worst film I have ever seen. It is totally disrespectful to the Houseful series."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "jattsidhu-04164",
        "review_rating": "10",
        "review_title": "nice movie",
        "review_detailed_main": "Different comedy in houseful franchisee..... every one played decent role.."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "shekharnov",
        "review_rating": "7",
        "review_title": "Worth watching movie!!",
        "review_detailed_main": "I like the movie and laughs alot because I had no expectations from it and I knew what kind of comedy it would be and I was ready for it. I just wanted to enjoy the movie with certain elements, which Akshay only provide. I don't know why all want to criticize this and yeah, I am ok with that that's their point of view but i like the concept and everyone knows that only Akshay can do this type of movies. Only he has the quality to laugh anyone by doing things and I really like the KNIFE SHOT scene most. This is the fact that you don't have to use your brain for laughing........ just enjoy the scene if you like it and laugh but to make everyone laugh is not the cup of everyone's tea, you must have that quality."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "eradi-15588",
        "review_rating": "1",
        "review_title": "Horrible, worst ,ruined my day , torture",
        "review_detailed_main": "Didn't expected this kind of script and humor from akshay kumar atleast such a wrost comedy movie never seen not even laughed once in the theatre money wasted"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "krishna-20426",
        "review_rating": "1",
        "review_title": "Really disaster",
        "review_detailed_main": "Total waste of time, money . Aksay sir , ritesh and jonney sir is good bt other are to much boring and especially actresses"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "yogeshnandal-44248",
        "review_rating": "1",
        "review_title": "worst movie even worst then thugs of hindustan, mastizadde and other tati movies",
        "review_detailed_main": "Worst housefull with even worst jokes worst movie even worst then thugs of hindustan, mastizadde and other tati movies"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "itssubrata-16362",
        "review_rating": "1",
        "review_title": "Pathetic Movie",
        "review_detailed_main": "Non sense movie. Bad storyline and full of cringy acting in the name of comedy. Its really very hard to produce such a dumb movie."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "anweshipsitpatel",
        "review_rating": "1",
        "review_title": "Don't waste your money",
        "review_detailed_main": "Go treat yourself with something nice like a good meal or something don't waste your money on this"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "saurabhmonga",
        "review_rating": "1",
        "review_title": "This is trailer review becoz it seemed like a sin to watch movie after this",
        "review_detailed_main": "I am not even sure who all wanted to watch this movie after watching the trailer. The trailer I saw was a clear warning to not watch the movie. Why would someone want to spend so much money, time and energy to make such a senseless movie and then somehow have the expectations that viewers will like this film. The actors in the film, especially Akshay sir, are very talented. So what I fail to understand is why talented actors choose to act in scripts like these. Cinema is supposed to be a medium of not just entertainment but also leave the audience with some valuable takeaways... but films like these are sheer waste of time that leave audience with headaches"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "aasif-73484",
        "review_rating": "6",
        "review_title": "Below Expectation",
        "review_detailed_main": "Multicast movie. Story can be rearranged in a better way. Plot was good. Bobby wasn't a good choice. As a whole, good comedy movie, but expecting much from these stars & than previous sequels."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "tawfiqsediqi",
        "review_rating": "1",
        "review_title": "Worst Movie goes to HOUSEFUL 4",
        "review_detailed_main": "So I watched Housefull4 in my laptop and the whole movie is about showing actresses novels cleavages and actors terrible acting If I was a critics I would gave this movie\n5 Stars"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "rkirne",
        "review_rating": "9",
        "review_title": "Brainless comedy I loved it",
        "review_detailed_main": "I'm not sure why so much hate for this movie but I loved this movie,"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "soumyamsd",
        "review_rating": "6",
        "review_title": "It's just fine.... Not a great movie to watch",
        "review_detailed_main": "Plot- 6/10 Quite a common story. Moreover you can guess it from the trailer I think. There's nothing more than that. But obviously overall you can take it as a good mixture of mostly comedy, little romance, and much little action. Screenplay- 4/10 The acting and the direction sucks at few times. It's only Akshay Kumar who gave his best. Though there were some great actors like Ritesh Deshmukh, Kriti Sanon, Johnny Lever but they couldn't make it up to the mark. Moreover it's better I talk less about Bobby Deol. Yeah one thing, Nawazuddin Siddiqui's presence made it a little cooler. Cinematography- 8/10 This is the point where Bollywood is improving day by day. Absolutely no words against the location chosen by the director. Everything looks absolutely fine regarding costume design, graphics used etc. Overall - 6/10 If you want to chill out for an evening just go and watch it with your friends. One suggestion don't have too much of high expectations like the ones from housefull one or any other comedy films of Akshay Kumar."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "vaasavgoel",
        "review_rating": "1",
        "review_title": "Some one pls tell me when Bollywood stops copying other movies?",
        "review_detailed_main": "Copy of dictator, all the things from dialogues, scenes to songs almost whole movie is copied, very disappointing."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "iamirshad-70264",
        "review_rating": "1",
        "review_title": "Huge Disappointment",
        "review_detailed_main": "This Movie is just a Waste of time and Money.\n\nWeak Storyline Mixture of 3 Movies Stories Weak Screen plot Cheap jokes"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "aman8931",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": "No fun in the story....no proper linkage...housefull 1,2,3 were much better"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "aakash_coolpunk",
        "review_rating": "1",
        "review_title": "Another Disaster",
        "review_detailed_main": "Bollywood Scripts - Facial Surgery, Reincarnation that's all it is nowadays.\n\nWhat an useless, Illogical and senseless movie."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "naweedmir",
        "review_rating": "1",
        "review_title": "Disappointing",
        "review_detailed_main": "Walked out of the movie halfway. A torture. Please save your money and do not watch it"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "mdshabanazad",
        "review_rating": "1",
        "review_title": "WASTAGE OF TIME",
        "review_detailed_main": "Absolutely bad.... very bad written...very third class YouTube vide type story... unbearable"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "skarmaspalz",
        "review_rating": "6",
        "review_title": "One time watch",
        "review_detailed_main": "Good punch lines and great piece of acting by akshay and ritesh.. rest as expected watching the trailer , loose and predictable plot. Though good for the laughs."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "SinhaSomesh",
        "review_rating": "2",
        "review_title": "Unforgivable Farce!",
        "review_detailed_main": "#FinalVerdict\n\nHousefull 4 is that rare genre of films which will test your patience with its foolishness, shock you with its lack of logic & launch a vicious assault on your senses. Utter nonsense!\n\nUsually, a paragraph is devoted in reviews to detail the plot & screenplay but to say that Housefull 4 has even a semblance of the two is a poor joke. The audience is just going to shake their head in dismay & frustration as the intolerable cruelty unfolds.\n\nFridays are becoming a messy hodgepodge in Bollywood with each transient months, in the matter of getting an epochal release and a Diwali release is an event in itself. But the makers of Housefull 4 have literally shown a middle finger to the audiences. Sure, we relish madcap entertainers, but what director Farhad Samji serves in Housefull 4 transcends all limits. He attempts a crazy, simple entertainer yet again, but peppers it with inane, ridiculous episodes that makes you wonder, is this for real? Sara Bodinar and Sajid Nadiadwala's story drains you at the end, despite the actors putting their best foot forward to make you giggle. The banal jokes & the lame PJs coupled with the muddled screenplay are clearly responsible for the EPIC mess.\n\nThe soundtrack of Housefull 4 is pleasant, with the composer (Sohail Sen) belting out a couple of hummable tunes. The plush locales of London & the grandiose production design ( Subrata Chakraborty-Amit Ray) gives the film the required scale. And that's it.\n\nVFX should've been better. Editing (Rameshwar S Bhagat) is uneven. This singularly unfunny film plumbs the depths of comedic bankruptcy by a director who quite frankly, hasn't delivered anything funny in a long time.\n\nAkshay Kumar plays to the gallery but is letdown by the writing. Also, he tries too hard to be funny. Riteish Deshmukh hams to the hilt. Bobby Deol looks out of place completely. The leading ladies - Kriti Sanon, Pooja Hegd and Kriti Kharbanda - are pure eye candies. Chunky Panday is wasted. Ditto for Ranjeet, Johny Lever, Sharad Kelkar, Rana Daggubati and Nawazuddin Siddiqui.\n\nOn the whole, it'll be difficult for Housefull 4 to sustain once the initial euphoria settles down. It's all bad. All of it, every last instant, every single word. Simply put, Housefull 4 is an unforgivable farce. This is public harassment - a precise sentence I'll use to describe the experience. If you thought comedy could sink no further. Watch just 15 minutes of Housefull 4 and you'd be disavowed of that notion."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "nitinpatkar",
        "review_rating": "9",
        "review_title": "Very entertaining movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "alekhyatiru",
        "review_rating": "7",
        "review_title": "Random comedy",
        "review_detailed_main": "The movie's comedy is mindless as expected but I enjoyed it nevertheless. People who understand the reference to old movie songs/dialogues will find the movie hilarious. Lot of randomness, short spoofs of many Hindi/English movies made it an entertaining watch."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "zeali-60705",
        "review_rating": "1",
        "review_title": "Headache",
        "review_detailed_main": "Too much headache while watching movie, can't bare 2 hrs 15 mins of screenplay"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "jasmin-26547",
        "review_rating": "1",
        "review_title": "Flop movie of the year",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "patel-35166",
        "review_rating": "1",
        "review_title": "Pathetic movie ever made after Humshakals",
        "review_detailed_main": "Let me start....ITS A DABBA FILM....sewage, worst, cringefest etc etc....BOBBY DEOL, no matter every 2 years you get relaunced...why dont you take retirement, you really need to look into mirror and ask yourself that do you deserve to be an actor...and was it so nessesary for AKSHAY KUMAR to sign this film, he is countries one of the finest actor, he could have done some good directors film. AVOID this sewage friends. They have taken Indian audience for granted and have fooled us."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "bijoypaul-13412",
        "review_rating": "1",
        "review_title": "Bokbaas movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "aliwazid-80790",
        "review_rating": "1",
        "review_title": "Housefull 4",
        "review_detailed_main": "Worst movie I ever watched in my life.. Full Bogus.. Poor Direction and acting is worst"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "adnanshaikh-58699",
        "review_rating": "1",
        "review_title": "STORY LINE",
        "review_detailed_main": "This movie story line is not directed well. As my point of view. VFX is very poor at some point. & Akshay sir is not made for this role at all. Other actors just support characters. Songs are not fit in the movie. Do watch unless you're akki fan"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "Stanley_R_S",
        "review_rating": "7",
        "review_title": "Great Fun !!!",
        "review_detailed_main": "Great fun and full family entertainer. All are good. The 'BALA' song stands out with nice choreography and enjoyable Music. Rana Dagubatti surprises with his Qawwal role and has fun with it. Akshay gets the best lines and nails it. Just Laugh and Enjoy. Happy Diwali :)"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "shashthezarch",
        "review_rating": "1",
        "review_title": "Perfect, Amazing and Sensational",
        "review_detailed_main": "This movie is amazing. I have to say, it crossed all of my expectations. I thought it would be a flop, turns out it is a complete disaster!"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "rajeshpanchal-97166",
        "review_rating": "10",
        "review_title": "DON'T USED YOUR MIND ON LOGIC.JUST ENJOY",
        "review_detailed_main": "I know there is no logic in the film but it is for entertainment.enjoying this movie with family"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "sehgalsumit-23735",
        "review_rating": "6",
        "review_title": "A perfect recipe to make laugh",
        "review_detailed_main": "Blend of contemporaneous and archaic is aloof in a comedy movie. A nice one to spend time with some laugh."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "sunvechowdhury",
        "review_rating": "1",
        "review_title": "Disappointed",
        "review_detailed_main": "Lack of story...some scene was inspired/copied.. Side cast was better than some main cast!"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "himadrihpr",
        "review_rating": "1",
        "review_title": "Waste of money",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "spsgkp",
        "review_rating": "1",
        "review_title": "West time",
        "review_detailed_main": "Meaningless comedy nothing is logical pls dont support this type of movies"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "akashdeep2708",
        "review_rating": "1",
        "review_title": "worst simply",
        "review_detailed_main": "This movie is worst. Nothing funny. Need a remedy. Pathetic"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "tawfiqsediqi",
        "review_rating": "1",
        "review_title": "Biggest Disestar Of The Year",
        "review_detailed_main": "So I watched #Housefull4 in my laptop and the whole movie is about showing actresses novels cleavages and actors terrible acting If I was a critics I would gave this movie\n5 Stars"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "sajidshaikhkgn",
        "review_rating": "1",
        "review_title": "Waste of Money and waste of time, both ate valuable",
        "review_detailed_main": "Worse Comedy film I have ever seen. Bundle movie watch it on TV it will come within 2 months don't spend your hard earned money in this tough slowdown economy time."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "shwetank-54723",
        "review_rating": "6",
        "review_title": "The film makers now think that we audience are a bunch of fools...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "prateekmishra-61043",
        "review_rating": "1",
        "review_title": "The nakedness of ur body is filthy nd it doesnot attribute entertainment",
        "review_detailed_main": "Bollywood is going perwerted nd filthy day by day, Why do they attribute filthness in a positive way to cinemas nd wants the public to take up the same? Sleeping in bed casually with anyone nd having no shame on this is not womenhood, Preaci"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "moyouha",
        "review_rating": "9",
        "review_title": "Pretty good and funny",
        "review_detailed_main": "I dont understand why so many people dont like it. I enjoyed watching this movie and it have great music videos. The Story is easy to understand and it had a good ending."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "saileshdahal",
        "review_rating": "7",
        "review_title": "Better than housefull 3",
        "review_detailed_main": "Housefull 4 is far better than housefull 3 Don't go with the critics Watch yourself and give the review"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "chetanananta",
        "review_rating": "1",
        "review_title": "Pathetic!!!",
        "review_detailed_main": "Very bad & Pathetic... Pls don't release worldwide.. be shameful to create such a disastrous movie.. there is nothing new & fresh."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "thoufeeqbcom",
        "review_rating": "1",
        "review_title": "Not satisfied 😒",
        "review_detailed_main": "Waste of money and time Direction * Acting ** Music * Story **"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "Tejas_Vinda_AITS",
        "review_rating": "3",
        "review_title": "Housefull 4 = 0 comedy n Bekar Story..!!",
        "review_detailed_main": "The film opens with Harry, played by Akshay Kumar, who is working as a barber with 'ghajini problem' (short-term memory loss), .......,,along with his brother Max, essayed by Bobby Deol and Roy, played by Riteish Deshmukh.\n\nThe trio somehow manages to convince the daughters of a billionaire, played by Kriti Sanon, Pooja Hegde and Kriti Kharbanda, to marry them.\n\nThey all arrive in Sitamgarh for the wedding, where the dumb comdey unfolds.....,Just like the earlier parts of the film, Housefull 4 is about the mistaken identities, goofy plans and some silly, hilarious punches.\n\nThe first half of the film is full of poor jokes, Here, Akshay plays the notorious prince Bala and is in his top form.\" ..., thts a copied character of 'General Alladin' of English movie 'The Dictator'.\n\nMovie is Brain-tickling TORTURE ,horrible blend Of Lame writing, painful screenplay, miserable dialogue & direction.\n\nAkshay is good but he couldn't rise above the horrible script.\n\nExcept Bala-Akshay bakki sab Bekar..!!😔\n\nHousefull 4 = 0 comedy n Bekar Story..!!"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "praveenkeshari",
        "review_rating": "1",
        "review_title": "Maha maha maha maha chutiya movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "wasifmintoo",
        "review_rating": "1",
        "review_title": "Pathetic boooo",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "veddesai-09576",
        "review_rating": "1",
        "review_title": "Bakwaas movie",
        "review_detailed_main": "Waahiyad Bakwaas movie ..have to see phir Hera pheri after watching this..."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "hmhy1982",
        "review_rating": "7",
        "review_title": "Nice comedy movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "reapershagor",
        "review_rating": "1",
        "review_title": "Absolute Trash Despite of Akshay's Performance",
        "review_detailed_main": "Successfully wasted 2hr of my precious Life. wannabe comedy thing. tried so hard to laugh but couldn't. Akshay got maximum screentime & his dialogue, comic timing was perfect. Riteish was as usual. story was trash, also direction. bgm was good. all the comedy scene from trailer are the only comedy scene i got from the movie. Even housefull 3 was better than this. not recommended."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "urvishpatel256",
        "review_rating": "10",
        "review_title": "Overall it is a laugh riot.",
        "review_detailed_main": "Except few dull moments. Entire movie is superb . Love the concept and acting of akshay and ritesh. Don't spread negativity. It is far better than golmaal again and total dhamal."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "goswamianshul",
        "review_rating": "7",
        "review_title": "Family Entertainer",
        "review_detailed_main": "Full of Laughter and craziness That will drive you insane"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "avnishsrivastav",
        "review_rating": "1",
        "review_title": "DisSssss",
        "review_detailed_main": "Same old jokes, Akshay and Ritesh is only carrying movie on their shoulder......Theme was good and couple have been better in writting ?................................."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "jprakash-693",
        "review_rating": "1",
        "review_title": "Plain torture",
        "review_detailed_main": "Toued as an epic reincarnation comedy, Housefull 4 was a keenly awaitd release This Diwali. But, boy, oh boy, what a disappointment it has turned out to be. Jokes dont make you laugh, rather they irritate you, the dialogues are cringeworthy and absurd. The three actresses are their just for glamour quotient. Even Akshay, for whom comedy is his biggest strength, fails to impress. A good starcast, truckloads of money and resources have been wasted for this torture called Housefull 4. My advice: Skip it..."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "pankajpunjabi",
        "review_rating": "2",
        "review_title": "Disappointed",
        "review_detailed_main": "Akshay has done a good job but the writer and director has no sense of comedy. They should learn from classic comedy movies with low budget and great content."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "satyasatyayt",
        "review_rating": "1",
        "review_title": "Worst movie",
        "review_detailed_main": "Worst movie of the year . Logic less Worst performance"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "surajraghuwanshi-43610",
        "review_rating": "4",
        "review_title": ".",
        "review_detailed_main": "Totally disappointed by the movie i was too much excited for the movie but whatever i got is disappointment giving 4 🌟 only for akki paji he did his roll too well"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "amansingh-20016",
        "review_rating": "1",
        "review_title": "Worst experience",
        "review_detailed_main": "Even if u earn from the movie rather than paying for it don't even consider watching it. It will waste ur time and spoil your mood. Film makers :- Please stop making such senseless film and make way for the film which truly deserves to be watched."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "parwalparadesarthak",
        "review_rating": "7",
        "review_title": "I'm a Christopher Nolan Fan....... So you can trust me",
        "review_detailed_main": "1- Good Movie 2- One Time Watch 3 - Different from Housefull Trilogy 4 - You'll love it 5 - Acting is A+ 6 - Script is B+ 7 - VFX is A+ 8 - Makeup is A+ 9 - Actress did awesome work 10 - Go and Watch it"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "shashanknov-31001",
        "review_rating": "1",
        "review_title": "Headache and Non sense",
        "review_detailed_main": "Worst movie of all time. Its atrocity. One cannot find as bad as this one in any cinema. It lacks everything. No humor, No Comedy, No story. Just a senseless 2.5 hours of stupidity."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "abhay8567",
        "review_rating": "8",
        "review_title": "Diwali Entertainer",
        "review_detailed_main": "Akshay Kumar did excellent job, special effects are good, beautiful cinematography, gripping story. Kirti Sano's acting is appreciable. I recommend this movie if you are looking for fun & laughter. Why there are so many negative reviews - difficult to digest why people have rated it low. I honestly enjoyed the movie, it's paisa vasool movie. Go guys, see it for yourself & then judge. Thanks"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "rchandrame",
        "review_rating": "1",
        "review_title": "Had to leave in 1.5 hours",
        "review_detailed_main": "Sajid Khan written all over. Tees Maar Khan but worse, Misogynic low class unbearable."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "dhitesh-46768",
        "review_rating": "2",
        "review_title": "Strictly Avoid it!!",
        "review_detailed_main": "Only good thing about the film is it ends. It was complete torture. No proper comedy, no story, nothing. Waste of time and money."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "sanivc",
        "review_rating": "1",
        "review_title": "Housefull 4 -worst movie",
        "review_detailed_main": "Worst Housefull 4 series and waste of money ..Please avoid and donate the money to the poor and needy.."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "mohammedsaadd",
        "review_rating": "1",
        "review_title": "Water of tym n money",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "parthgoel-74406",
        "review_rating": "1",
        "review_title": "Well, Curse me if I go for such movie again",
        "review_detailed_main": "My mind is dead, so bad this movie is. Half minded idiots are liking this movie. People who liked this should either be treated for mental health or should be ignored. their voter card should be cancelled since they cant properly decide for the future of the country. Seriously very very bad movie. The makers should be punished for such movies maybe handed or just a bullet in the head. CRAP MOVIE"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "Tap032",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": "I could tell it would be worst movie by watch trailer. Still I watched this disaster since my kids wanted to warch it. I had really low expectations and I was right. This is the worst movie so far. I am not sure if Akshay Kumar reads script or not before signing this kind of movie. Don't waste money and time for this movie."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "nehapatwardhan",
        "review_rating": "1",
        "review_title": "Regret.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "abhaydube-24360",
        "review_rating": "10",
        "review_title": "Best movie",
        "review_detailed_main": "All time blockbuster movie,please stop negativity.... 🙏 About HF4"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "rjvip-13493",
        "review_rating": "2",
        "review_title": "You thought Humshakals is the worst comedy movie? Wait till u watch this movie!",
        "review_detailed_main": "This movie is only for those who don't have brains. If u try to find logic in this, you're gonna hate it ALOT. Story is absolute rubbish. Brainless comedy which is very outdated. Filmmakers are trying to force audiences to laugh. Unlike other Housefull movies, I had to force myself to laugh through this one. Utter rubbish which the directors made just to torture audience. Akshay Kumar and Johnny Lever are the only good things about this movie. Rest of the cast is just overacting. History genre doesn't go well with a class comedy series like Housefull. Don't watch this movie even if you're a hardcore Housefull fan."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "ertahir",
        "review_rating": "1",
        "review_title": "Save your 💰",
        "review_detailed_main": "Worst movie ever no laughter no script don't waste your time and money watching this scrap"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "jinudevanj",
        "review_rating": "1",
        "review_title": "Worst movie ever made in the history of bollywood",
        "review_detailed_main": "How can a director make this kind of crap with a huge cast and crew."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "saurabhamishra",
        "review_rating": "2",
        "review_title": "Worst movie",
        "review_detailed_main": "Worst movie, I mean how makers can make fool of us ..Even they dont have the idea why they are making the film.. Akshay kumar is the only one who tried to save of the film and makers!! Sorry for language but its totally waste of money!! I repeat do not waste your money cz i did already"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "imdb-ikysmoviedatabase",
        "review_rating": "3",
        "review_title": "Only first half is ok and watchable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "mehulsant",
        "review_rating": "1",
        "review_title": "Worst movie",
        "review_detailed_main": "Consistently boring. Waste of time and money. No fun at all except jonny lever comedy. Can we have an option to rate it half star or no star."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "rahuldutta-13207",
        "review_rating": "1",
        "review_title": "Tv serial got Movie-named! Waste!",
        "review_detailed_main": "Waste of my time and money. Looks like the script of Tv serials! Though Akshay Sir tried to balance the movie but failed because of the crap Script. Even Retiesh Deshmukh didn't make me laugh this time. Utterly disappointed. Please DON'T WASTE YOUR MONEY."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "mintomh-23821",
        "review_rating": "10",
        "review_title": "Housefull 4 is excellent entertainer on this diwala",
        "review_detailed_main": "Housefull 4 ka hi bol bala hoga...kyuki bala o bala o bala o bala.....akshay Kumar has given his best comic factor as bala.....audience becomes lovable to bala and entire movie is very entertaining with different kind of storyline....must watch with family...."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "rehanliet",
        "review_rating": "1",
        "review_title": "Tatti",
        "review_detailed_main": "Housefull 4 on of the wrost comedy movie i have ever seen.. interval time is best thing in this movie."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "rohanjaisingh",
        "review_rating": "1",
        "review_title": "DISASTER",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "maroofahmedsiddique",
        "review_rating": "1",
        "review_title": "Worst in series",
        "review_detailed_main": "The housefull series is getting worst after every release. No comedy, just 'sasti' punchlines. Akki you are now disappointing us dude."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "devika-49635",
        "review_rating": "3",
        "review_title": "Funny",
        "review_detailed_main": "If a movie doesnt has a story line or anything sensible you atleast what that you can laugh at the stupidity like we did in humshakals, himmatwala. Let me be clear this is not Thaaaat level of bad movie. The first half is very very boring i just needed all this to end, the second half comparitively is much much better. The climax was funny i did laugh at the stupidity as i mentioned before. You know that climax when people are running like the 3 and 2 housefull. I really love the franchise but this was the worst of all. If you just need to laugh and not use ur mind much you can watch it"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "sashiv-rajiv",
        "review_rating": "1",
        "review_title": "Waste Waste and Super Flop",
        "review_detailed_main": "Yukkkk, Again poor story and poor acting by Canadian Actor so called Akshay kumar and why this director survive in Indian Cinema : Faltu Sajid khan.Why would someone want to spend so much money, time and energy to make such a senseless movie and then somehow have the expectations that viewers will like this film....Sorry"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "deepansharma-42593",
        "review_rating": "1",
        "review_title": "Worst movie",
        "review_detailed_main": "Totally waste of time, worst comedy movie ever seen, unreasonably added songs Totally disappointed"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "mdamir-74018",
        "review_rating": "2",
        "review_title": "Ultra disaster /unbearable",
        "review_detailed_main": "The makers of the film make us fools . There is no script, there is no story, no logic, no sense, and this movie will not get audience as well. Totally worst and worst movie of all time .makers should be jailed for making this kind of movie.."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "siddharthphogat",
        "review_rating": "9",
        "review_title": "The best comedy of the year...Cheers up for our old Akshay. Beware of fake reviewers",
        "review_detailed_main": "Undoubtedly housefull 4 is the best comedy of the year. With more than 100 punches and no sensical but entertaining storyline make it a much required entertainer. Dont believe in the critics coz they will never rate a comedy movie.Go with your friends and this is the best treat you can offer them on diwali. Akshay in comedy is back with same charm. You can not afford to miss this guys.....its worth every minute every penny."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "tegrazero",
        "review_rating": "4",
        "review_title": "you can't laugh if everything is predictable",
        "review_detailed_main": "I enjoyed at between few parts but hated it.\n\nakki did great job but i think movie lacked a batter script"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "itsmywork",
        "review_rating": "1",
        "review_title": "Not at all comedy and unexpected from Akshay movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "gautamsarthak",
        "review_rating": "1",
        "review_title": "Worst movie #tattimovieoftheyear",
        "review_detailed_main": "Worst movie i watched in 2019 i think i need to see endgame once again to refresh my mind"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "nib-06152",
        "review_rating": "1",
        "review_title": "Bakwas",
        "review_detailed_main": "Cheap humor, the jokes are cringe. Akshay acting is bad why is he doing such cheap movies."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "rohit_vit2020",
        "review_rating": "1",
        "review_title": "Worthless",
        "review_detailed_main": "Worth not even writing a review. Just bad timing of jokes, bad performances."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "tushargupta-27286",
        "review_rating": "2",
        "review_title": "Yuck movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "sramdev",
        "review_rating": "10",
        "review_title": "Full entertainment with HOUSEFULL4",
        "review_detailed_main": "Its laugh riot Diwali dhamaka family entertainer best comedy movie akshay kumars comic timing 👌👌 Go and watch 👍👍"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "farooqliaqat",
        "review_rating": "1",
        "review_title": "total waste",
        "review_detailed_main": "Another 3rd class movie by Sajid. Bollywood should take action against Sajid khan."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "Undertaker20",
        "review_rating": "5",
        "review_title": "Logicless but ofcourse a Comedy Movie",
        "review_detailed_main": "Many things in the movies are beyond considerations but since the plot was of interaction with previous generation i consider focusing on comedy itself. I don't connected movie from 1st half to second half and it was entertaining."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "harshshah3",
        "review_rating": "1",
        "review_title": "Watching the this film is a punishment",
        "review_detailed_main": "Watching this film is a punishment to \"consider\" watching the film."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "elk-88300",
        "review_rating": "1",
        "review_title": "Kiya bakwas hai",
        "review_detailed_main": "Third class humor, cheap jokes, bad acting. Akshoy Komor should stop making movies."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "pramila-18308",
        "review_rating": "1",
        "review_title": "Derserves zero",
        "review_detailed_main": "Pathetic movie. Overacting, stupid story and utter garbage"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "ankit-20217",
        "review_rating": "1",
        "review_title": "Waste of Time and Money",
        "review_detailed_main": "This movie is just make without even think of the storyline and even without sense. I am just thinking why I watch this movie. Instead of the watching this movie, go for other option. While I watching this movie, I just feel like I am watching serial of ekta kapoor that is there is no logic behind anything, no comedy, no sense, just like they just showing anything. Again, last time telling do not watch this movie."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "MkRs_k",
        "review_rating": "5",
        "review_title": "not as bad as housefull 3",
        "review_detailed_main": "If u are a fan of akshay kumar u might enjoy it . films lacks logic and a good story . the film looked beautiful and cinematography is the best part of the film for me good job Sudeep Chatterjee (also responsible for padmavat & Bajirao ). & they kept pasta,Johnny Lever, etc...from previous houseful movies."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "vivekbhardwaj-37438",
        "review_rating": "10",
        "review_title": "Great movie",
        "review_detailed_main": "A great movie Don't believe on others stories Just go and watch it first then decide"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "saijack",
        "review_rating": "1",
        "review_title": "Worst movie ever in india",
        "review_detailed_main": "This type of movie will degrade the value of indian movies iam really upset by watching this type of movies atleast if we consider this is comedy movie then there is no comedy at all"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "sanjoydeb-48183",
        "review_rating": "5",
        "review_title": "Average",
        "review_detailed_main": "If you are a comedy lover, then this movie is for you. All characters did average job except Akshay Kumar. He is the trump card of the movie. He was really funny. You will enjoy him. Female actors were beautiful but their performances were average. Nothing else special to say about the movie. I'll give it 5 star."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "arjuncshekartheofficial",
        "review_rating": "1",
        "review_title": "Absolute Nonsense and Garbled movie",
        "review_detailed_main": "The most worst movie of Bollywood, worst comedy, 100% Profanity words have been used, actor's talents has been misused. Totally crass and horrible."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "qrg-40302",
        "review_rating": "1",
        "review_title": "Bakwas",
        "review_detailed_main": "For illiterate richshaw fans of Akshoy Komor...cheap humor."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "mdashiqx-48836",
        "review_rating": "1",
        "review_title": "Boring",
        "review_detailed_main": "Very boring movie, dont watch................................"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "zubearchaudhary",
        "review_rating": "1",
        "review_title": "Extremely poor",
        "review_detailed_main": "This was absolutely a waste of time. Do not watch. Story line is terrible I cannot believe they make movies like this these days. And people praying to pigeons is beyond limits. The jokes was so bad I can't believe this movie was even produced all the housefull movies are bad and this just tops it."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "SoumikBanerjee1996",
        "review_rating": "4",
        "review_title": "Akshay's Performance Sadly Couldn't Save It",
        "review_detailed_main": "Being a household name in comedy genre, Housfull franchise surely should have some responsibilities towards its fanbase!\n\nI know it's a brainless, logicless comedic script that doesn't really need to analyzed under a microscope! But Even as a standalone Comedy film this has utterly failed. The previous housefull movies at least made us laugh!\n\nExcept few scenes, the humour wasn't really there. The dialogues are poorly written, instead of making you laugh ; in reality they annoyed me a lot. Except Akshay's Portrayal other performances were just below average! I had high expectations from Ritesh But man did he disappoint!\n\nThere are only two Things that Liked in this film is one Akshay's performance as I said before and the CGI or Art Direction in general. Asthetically the film had high scales and properly maintaned their standards For the entire runtime. With a Premise that could have been interesting if done properly but has been totally wasted under lacklustre script writing and Bad choices.\n\nThe Tonality shifts, Between comedy and drama/action it just makes all the things more confusing! Sometimes these blends do work pretty well but it should be handled properly and under a expert supervision! Unlike here where the film itself doesn't know where it's headed, and makes the audience feel the same.\n\nThey should have focused more on the script and dialogues rather than investing lots of money in VFX department. If the content itself is good enough ; Average CGI would do the Job damn well!\n\nAfter finishing the movie I still don't get why Nawazuddin, one of the finest actors in this generation accepted to do that small ridiculous role! It was Sad to see to be honest.\n\nIn the end, I must say it's the Worst movie in the Franchise, Although I loved what Akshay has put on the table but His sole presence couldn't save the movie unfortunately.\n\nWith that poor of a script and direction, it was bound to fail."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "arunpariya",
        "review_rating": "10",
        "review_title": "Blockbuster",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "aniruddhawaghmare",
        "review_rating": "1",
        "review_title": "bakwaas",
        "review_detailed_main": "Please don't watch this movie it is just waste of money and a damage to your brain worst movie ever made"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "rba-21552",
        "review_rating": "1",
        "review_title": "Avoid",
        "review_detailed_main": "Avoid it for your own good. Cheap movie and terrible jokes."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "imdb_girl90",
        "review_rating": "1",
        "review_title": "The word 'worst' isnt enough",
        "review_detailed_main": "The most senseless and the ugliest movie I have ever watched."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "TheNonSmoker",
        "review_rating": "1",
        "review_title": "Very shameless movie",
        "review_detailed_main": "This \"movie\" soully made to made money, the plot is just meaningless."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "tyron_alphonso",
        "review_rating": "1",
        "review_title": "I went into a severe depression",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "sporty-vin18",
        "review_rating": "3",
        "review_title": "Don't use brain and laugh",
        "review_detailed_main": "Entertaining , comedy genre doesn't mean that viewer should stop thinking , directors ,writers need to understand viewers want story plot not empty box ."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "gk303007",
        "review_rating": "3",
        "review_title": "House full of dirt",
        "review_detailed_main": "Not funny. Am actually too generous in rating it 3. Movie is a spoof of many other like Magadheera, Bahubali and what not. Cheap jokes, repeated comedy and lame picturisation. Frankly, when you get to show reincarnation, you are creating high expectations and you have power to craft mystery. But, but, but... Its Housefull and how can i forget it has to be stupid, and yes, i won the bet. Disappointed. Even Om Shanti Om of Farah Khan production was better than this. Left in between.\n\nAnd yes, by the way, reincarnation as a keyword, is no spoiler to it..."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "mitulgajera",
        "review_rating": "10",
        "review_title": "Blockbuster entertainer of the year...",
        "review_detailed_main": "\"HOUSEFULL 4\" is a super comedy and highly entertaining movie with amazing combo of comedy , romance , superb funny dialouges , entertaining songs , nice action with Royal locations and Royal sets that are eye-catchy and Mesmerizing. Akshay Kumar , Johnny Lever , Chunkey Pandey are Show-Stealer throughout the movie with great funny acting and other cast acts so well too...\"Watch it - Dil se\" and U will loved it so much..Perfect Diwali Gift for everyone....4.5/5 stars from me.....Enjoy with best wishes of diwali and new year :)"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "gei-16231",
        "review_rating": "1",
        "review_title": "Flop cheap movie",
        "review_detailed_main": "This movie is bad for your health. The jokes are so cheap it makes you lose a few brain cells."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "sirmohittomar",
        "review_rating": "1",
        "review_title": "Total waste waste waste",
        "review_detailed_main": "It's a waste of tym, energy and money.. Horrible.. story was gud, but u can't laugh loud in those things, Silly jokes here and there, Silly punch line here and there.. . And that's it.. . These kind of movies earn more thn 250cr on box office, I mean seriously 🙄🙄 . Why they use lead female actors like a idiots, . Why they don't give them more time on the screen, . Look like they just want to be a part of big budget, that's it.. . Total blindness.."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "Tira-Yashi",
        "review_rating": "1",
        "review_title": "Excuse me?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "neetabora",
        "review_rating": "1",
        "review_title": "Dumb Dumb Dumb",
        "review_detailed_main": "I want to donate my eyes & brain after watching this. It's the dumbest movie after Hamshakals."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "warule_mahesh",
        "review_rating": "1",
        "review_title": "It should be called HOUSE EMPTY.",
        "review_detailed_main": "What a waste of time..watched it on Hotstar but can't bare more than 10 minutes..total headache.. Good thing that I didn't watch it in theater. Unbelievable that how could such disaster movie can earn more than 200 crores in India."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "darshilm",
        "review_rating": "1",
        "review_title": "Why producers are wasting money?",
        "review_detailed_main": "How can anyone creat a movie like #Housefull4 ? It is total #waste of money and talent. I wonder how the producers are willing to waste money in this type of project? Probably the most #horrible #Bollywood movie of 2019?"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "abhinav-30011990",
        "review_rating": "1",
        "review_title": "Do Not Watch It even if someone offers you free tickets",
        "review_detailed_main": "One of the worst Bollywood movies till date. Seems like johny Lever and Akshay wrote the story of this movie. Poor acting by actresses, overacting by actors and no jokes. There's nothing funny in the movie. Please help yourself by not watching it."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "soorya-007",
        "review_rating": "10",
        "review_title": "A potential Blockbuster",
        "review_detailed_main": "Akshay kumar is at his best. Usually Whatever movie is good or not he always entertain us. Akki-Ritesh combo rocks again. Bobby is decent. Nawazuddin rocks as always. A perfect comedy movie."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "alymuhammad",
        "review_rating": "1",
        "review_title": "Why just why.",
        "review_detailed_main": "The worst Housefull out of them all. Would have rather watched housefull 3 again."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "shlokmvns",
        "review_rating": "1",
        "review_title": "Danger ahead",
        "review_detailed_main": "Watch it on your own risk. Officials will show this movie inside tihar jail Cos it's a f__in torchure."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "srkmani",
        "review_rating": "1",
        "review_title": "Don't waste Time",
        "review_detailed_main": "After watching 1 hour i was like wtf is this. I am Writing this review so that people will not suffer as i did."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "mdsadikulislmshovon",
        "review_rating": "3",
        "review_title": "One Word Review - \"Tatti\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "vivek-2011",
        "review_rating": "1",
        "review_title": "Worst",
        "review_detailed_main": "Worst of the franchise.....😑😑... overactors can't do movies"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "shreyasjoshi-39965",
        "review_rating": "1",
        "review_title": "It's going from bad to worst",
        "review_detailed_main": "Really awful writing. Even worse performances. Highly predictable jokes. This thing's a mess."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "churusonu",
        "review_rating": "1",
        "review_title": "Time wasted",
        "review_detailed_main": "Money wasted so please do not go for watching so you are not supposed to watch this movie"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "amitwb-31821",
        "review_rating": "10",
        "review_title": "Laugh Riot",
        "review_detailed_main": "Akshay Kumar is back in comedy after 3 Years. There was huge expectation from Housefull4 & it is bigger than our expectation. It's a complete Laugh riot."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "Insane_Man",
        "review_rating": "1",
        "review_title": "Burn your brain and then watch this movie, you will love it",
        "review_detailed_main": "People says before watching some kind of movies, keep you brain out of your head, you will find the fun, you will not look for at least a logic. I would like to say, burn your brain before watching this movie, otherwise you will regret whenever you remember that you watch this movie.\n\nAkshay is a talented actor. And Bobby also. Even Riteish also. So why they did it, are they unemployed? Why bobby here? He and Akshay looks too much old. They don't fit this crap comedy movie. For Akshay only, he is good in acting but bad in choosing. I think he does't ever choose any movie rather every movie offer he gets, he does the role. Most brainless and idotic movies in bollywood mostly made by Akhsay the hero.\n\nAkshay forgets and this is the worst part of the movie. What the actors are doing in this movie they know themselves. Song after every 10-15 minutes. Just a brainless full of hollow comedy. AVOID IT ANYHOW if you don't want to torture your existence. Otherwise, YOU'LL REGRET.\n\nThe director Farhad Samji, I checked his profile in IMDb, he has the creator of most of the crap movies now a days. Dilwale,It's entertainment, Golmall again, Houseful 2, Himmatwala, Houseful 3 etc.\n\nThe song Bala is good. Akshay is is good in acting. Johnny lever wasted."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "ayonbhunia",
        "review_rating": "2",
        "review_title": "Housefull 4!",
        "review_detailed_main": "Waste of time ! The comedy and the jokes are actually not funny but disrespectful in many ways ! You don't always have to make jokes to insult somebody...sometimes smart and sensible jokes can also make people laugh ! Absolutely worst movie !"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "parthgoel-74406",
        "review_rating": "1",
        "review_title": "they just stole bits and pieces of every movie and web series ever made",
        "review_detailed_main": "The movies they stole- Bahubali, the dictator, national treasure, the mummy, Anjana Anjani, The series they stole- true detective, Game of thrones I even doubt the intention behind creating this historical diarrhoea."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "frk-engine",
        "review_rating": "1",
        "review_title": "Losing hope in bollywood",
        "review_detailed_main": "All I did during watching the entire movie was -CRINGE. The joke's were homophobic, sexist and just plain lame. No story, horrible acting and one of the worst comedies."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "DAN0707",
        "review_rating": "2",
        "review_title": "You can't market whole movie based on one popular song",
        "review_detailed_main": "I don't understand how one can make movie so bad, just one catchy song and nothing else. We have had many good mindless entertaining comedy movies that you can easily stay engaged throughout while watching the movie. This movie however will give you headache, and will make you feel like you can't take it anymore. Despite having some great cast who can do good comedy, producer/director has failed to produce good product. Hard to say why Akshay Kumar is engaging himself in this kind of movie."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "calhobbes99",
        "review_rating": "2",
        "review_title": "Just when you think a more stupid movie cant be made.. along comes Housefull 4",
        "review_detailed_main": "Arrrghhhh, This movie is just insane, who wrote it? who directed it. Really bad storylines, loose directions. How can Akshay work in such movies and such characters. You can see sets and characters picked up from Hollywood.\n\nHard pass on this one!"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "patel-35166",
        "review_rating": "1",
        "review_title": "Pathetic",
        "review_detailed_main": "A movie only tick tok users can watch and rate 10/10. It just took audience for granted. Just Saw the film and came out....ITS A DABBA FILM....sewage, worst etc etc....BOBBY DEOL, no matter every 2 years you get relaunced...why dont you take retirement, you really need to look into mirror and ask yourself that do you deserve to be an actor...and was it so nessesary for AKSHAY KUMAR to sign this film, he is countries one of the finest actor, he could have done some good directors film. AVOID this sewage friends, they have made fool out of Indian audience."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "pvsonu",
        "review_rating": "9",
        "review_title": "Watch it and know yourself that this movie is hilarious or unbearable.",
        "review_detailed_main": "Wait 4 some time to get impartial reviews. They are those users who haven't seen movie yet but because they are haters and had to spread negativity. Movie is good."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "johntherealcena",
        "review_rating": "1",
        "review_title": "Disappointing",
        "review_detailed_main": "Total waste of time & money.Instead of laughing You will cry after watching this movie because you wasted money for this disaster"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "anwarshaikhkaiser",
        "review_rating": "1",
        "review_title": "Worst of the Lot!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "chmmokhan",
        "review_rating": "2",
        "review_title": "Not 4 house full",
        "review_detailed_main": "My exptation for this movie is very, bt I ultra disappointed after watching this movie."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "bhavikjani",
        "review_rating": "1",
        "review_title": "Waste of time.. Boring",
        "review_detailed_main": "Totally waste of the time and makes boring. Even if u don't use ur brain still it keeps irritating ! Disappointed."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "memayankdhransotia",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": "The worst movie ever. Script, what to say about it.They don't put even little effort in script. Acting is also very worst by Ritesh and Bobby."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "salmaniapandeji",
        "review_rating": "2",
        "review_title": "Worst Film of 2019",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "parnavarora",
        "review_rating": "1",
        "review_title": "Worst movie i have ever watched !",
        "review_detailed_main": "Worst movie ever! srrdard h Pura. watch it on your own risk 😂"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "deeppatel-13722",
        "review_rating": "10",
        "review_title": "PERFECT DIWALI DHAMAKA🔥",
        "review_detailed_main": "One of the best comedy movie, can't stop laughing, Akshay kumar is on his best, when it comes to comedy Akki always nailed it👌 Fabulous performance with amazing star cast😎 #MUST_WATCH_MOVIE_FOR_SURE🔥🔥🔥"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "priyajyoti2506",
        "review_rating": "2",
        "review_title": "Watch only of you have the FREE time to pass",
        "review_detailed_main": "No story/ Punches are horrendous/ songs are a waste to listen even/ Altogether: please watch any Hollywood movie instead."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "vipinbhskr",
        "review_rating": "1",
        "review_title": "Most worst movie of 2019",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "siddhantdawkhare",
        "review_rating": "1",
        "review_title": "Tf",
        "review_detailed_main": "Is nothing but have 2-3 jokes and nothing at all !!! A full 2.30 hr of tik tok video nn"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "harshbhagat-26001",
        "review_rating": "4",
        "review_title": "House-dull!",
        "review_detailed_main": "To begin with,sadly where are those days when Priyadarshan Films used to make us laugh, Malaamal Weekly, Khatta Meetha, Bhool Bhulaiya all lacked logic but they had their jokes landing and their humour in context to the story and atleast had a story, they used to make us laugh. Guiltilly or not.Even Anees Bazmee made Welcome which was a benchmark in Bollywood.But Sajid Khan And Farhad Samji are intollerable. Housefull 4 is a kind of a film which makes us compare which was the worse part first,second,third or fourth?while watching it because we are thrown in our thoughts at the very start of the film. Neither the film is much funny nor it has a kind of magic which makes us believ disbelief.\n\nI watched Entertainment directed by Farhad Samji as a child, this sort of films are crappy mind numbling creations filled with tacky humor and childish gags supported by hamming of deliberate actors. I did'nt enjoy Housefull 4 because i have grown up but i will argue confidently i won't have enjoyed it as a child also because not even a six-year old would be categorized as a age bracket in this sort of movie which is both misleading and illogical. And offensive is the word which already attached with housefull films.They insult women,they insult homos,they insult our minds and now they are insulting the ancient era's.\n\nTo be fair i have been an Akshay Kumar fan and i am his biggest fan since long time i have enjoyed his slapsticks such as Garam Masala and Bhagam Bhag they were dhamaal multistarrers but housefull 4 is not only offensive but it is unfunny and belongs to Humshakals family of films. But to give credit where it is due,the locations are mindblowing and some scenes with jokes do land expectedly Akshay Kumar is good as Bala but not great as Harry and tries too hard to make us laugh and mostly succeeds but Akshay Welcome and Bhool Bhulaiyaa were still far better films i would prefer on any day rest of the cast is wasted. What is also missing his bromance of Akshay and Riteish which is totally a concern because atlas it was a lifeline in these otherwise mindboggling films with idiotic gags and wholesome torture. But the grand presentation some average music (espesicially good Bala Track) and some hard hamming make it save from boredom by death. Chunkey pandey is also seen last time as Akhree Pasta! I believe !\n\n4/10"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "messimagical",
        "review_rating": "2",
        "review_title": "Disappointed",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "silviliril",
        "review_rating": "1",
        "review_title": "Left theatre before interval",
        "review_detailed_main": "This movie is big hammer on people's head. Super boring, no concept, forced comedy, repeated puns, chewed ideas. I left theatre in before interval itself. I have seen two more couple leaving the movie following us. Do not watch this movie."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "mohitxy",
        "review_rating": "5",
        "review_title": "Good but not great",
        "review_detailed_main": "Story of movie is good ,only few scences are laughable ,music is good but lyrics are bad,I think character prince Bala(Akshay kumar) is based on the main character Alauddin from the movie the dictator.Sets are good and hugemous Acting every one is ok."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "solanki-98974",
        "review_rating": "10",
        "review_title": "Lougher comedy",
        "review_detailed_main": "Entertainment house full story low but enjoy full,"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "faizangagan",
        "review_rating": "1",
        "review_title": "Waste of money",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "sheryar-79279",
        "review_rating": "1",
        "review_title": "Stupid af",
        "review_detailed_main": "Over the top acting over the top script. There is no comedy at all. Vulgar is any thing."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "tayalparmesh",
        "review_rating": "1",
        "review_title": "Senseless comedy",
        "review_detailed_main": "There is no sense of comedy.. movie forces us for laughing"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "pp-vick",
        "review_rating": "1",
        "review_title": "Not a worth dime",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "verahul",
        "review_rating": "2",
        "review_title": "CANADIAN KOMER WORST MOVIE..",
        "review_detailed_main": "Worst movie of our DESHBHAKT CANDIAN Komer.. Worst story, worst acting, worst screenplay, worst direction."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "chirantanbanerjee",
        "review_rating": "5",
        "review_title": "Little disappointed",
        "review_detailed_main": "I was little disappointed from the movie.Its just tried to show the same old concept of Bollywood films.Last year Diwali was ruined by thugs of Hindustan and this year by Housefull4.Only some cameo roles of nawaz,rana,chunky was great.And some dialouge were good."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "mayanklouteriya",
        "review_rating": "5",
        "review_title": "Not that funny like old franchie movies, it's a ok ok film. - itsbymayank.",
        "review_detailed_main": "I read all the reviews to know people liked it or not but here more than half people are disappointed and giving bad reviews. I'll say my point of view about the movie, Don't expect anything from the movie just go to pass the time, That's it. Not that funny or logical. I went to watch the film with my brother Prabal Sakhre. We both enjoyed watching the film but its upto you that what's your taste is. I know it's a franchie so we expect more but this film doesn't deliver that comedy like his old movies. Acting is good, storyline is ok ok. The length of the film makes it boring. Akshay Sir is all over in the film. Songs makes the movie Lenghty. Movie doesn't need any song except Bala because this is the only song which make some people watch the film. Hahaha. I'll give 5 star because I enjoyed half of the movie of its runtime. Not that boring it is like people saying.. Its time pass movie. Review by - Mayank Bharat Bhushan Louteriya"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "kashishkumar51",
        "review_rating": "9",
        "review_title": "Full on Funny...",
        "review_detailed_main": "Don't go for negative reviews.. the film is full hilarious...dialogues are super funny....audience went crazy laughing..😂😁"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "havop",
        "review_rating": "1",
        "review_title": "Another bakwas from chindi kumar",
        "review_detailed_main": "Poor humor, dirty jokes, overacting. Chindi Kumar should retire."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "divyanshu9114",
        "review_rating": "1",
        "review_title": "Utter waste",
        "review_detailed_main": "Need not to make such movies, waste of everything. Sajid Khan was good till Housefull 3 but When Sajid Nadiawala took the responsibility of this part, he made this film in a hurry."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "abhijitkarmakar",
        "review_rating": "1",
        "review_title": "Crap",
        "review_detailed_main": "After half an hour of the movie u will start crying for your 300rs.. It is nothing just a crap where they tried hard to waste your 2hr and 25mnts ... DON'T go for this 1 instead try to spend those 300 on your diwali patakha u will feel happy"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "jatinsmintu",
        "review_rating": "1",
        "review_title": "Pathetic movie of the year",
        "review_detailed_main": "I wonder how such stupid movies end up making millions at box office. I watched it for about 30 minutes on tv and ended up with a severe headache. Taste of Indian audience seems to have reached a new low."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "harishnj",
        "review_rating": "5",
        "review_title": "Joy to watch",
        "review_detailed_main": "This movie is a joy to watch. Humour and comedy connected well in this film. Each and every person had done their role really well. The soundtrack from the film is a major advantage."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "shuklvineet",
        "review_rating": "1",
        "review_title": "Crap",
        "review_detailed_main": "Utter crap. Cheap comedy at it's best. I feel cheated I wish some of the authentic views where available before I watch this movie."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "ranasahasales",
        "review_rating": "1",
        "review_title": "Total Flop",
        "review_detailed_main": "Disaster loading. Biggest flop of this year This film will ruin your diwali so enjoy in your don't watch this movie."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "destinyboyromeo",
        "review_rating": "10",
        "review_title": "The movie is good , haters will hate",
        "review_detailed_main": "Foolish people will try to find logic in a comedy movie Its common sense that its a entertainment based movie But common sense is \"not so common\" these days\n\nEvery joyful n humorous person will enjoy the movie Unless some changes their mind."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "AbhiRatesMaybe",
        "review_rating": "1",
        "review_title": "Better to watch paint dry",
        "review_detailed_main": "If you are given an option to watch this movie or shoot yourself, do the later. This movie has no logic or reason or the need to be made. Bobby is that uncle who send lewd comments on young women's pics. Akshay is that guy who will overact at every given opportunity Ritesh is well Rietesh Kirti 1, Kirti 2 and Not Kirti should be happy to get the paycheck I guess no one bothered to read the script before signing. And as for Rana and Nawaz, only God knows why they agreed to do those awful roles."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "munibfacebook",
        "review_rating": "1",
        "review_title": "nonsense",
        "review_detailed_main": "Waste of time. There is no Zero in rating the movies on IMDB, otherwise I would give Zero rating for this movie."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "cooldwijen",
        "review_rating": "1",
        "review_title": "Movie written by more than 2 writers... A Joke in itself",
        "review_detailed_main": "I avoided going to cinema to watch this but when it was available online to stream I decided to give it a go to see what was the fuss about. The movie that runs over 2 hours doesn't have comedy for 2 minutes. Without naming actors I don't know how certain actors can even agree to do this atrocity. Keeping it short as there is nothing to add. But avoid like a plague"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "ibdpiskillinglife",
        "review_rating": "1",
        "review_title": "Housebroken 4",
        "review_detailed_main": "I don't understand whats wrong with this director and why are actors still signing for such torturing films. The precious sequels were more than enough of it to destroy it and on top of this there is another sequel for this movie is also coming up. I don't get it. Is this director trying to ruin the Hindi film legacy. If yes, he is doing a very good job. But we cant sit and just tolerate back. This film and film series are the worst Hindi film series I have seen in my entire life. Like why try to make this films more and ruin the Bollywood industry. I got more anger than laughter in this film. Such bakwas and time-waste. This movie is about everything that doesn't make sense. Watch this movie at your own risk."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "shendelenin",
        "review_rating": "1",
        "review_title": "Don't watch even on gunpoint",
        "review_detailed_main": "Even With hugh starcast, this movie is one the worst of all time... Akshay Kumar proved it again"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "usmaninadeem",
        "review_rating": "5",
        "review_title": "Comedy comedy comedy but worst story and dialouges",
        "review_detailed_main": "I loved the acting of akshay kumar and rest cast were theek taak. so according me sajid nadiaval should focus on production he is not story. Worst Story and dialouges but still you can go for akshay kumar acting"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "varinder7",
        "review_rating": "1",
        "review_title": "Bakwaas movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "mukesh-dhakar",
        "review_rating": "10",
        "review_title": "Must watch movie",
        "review_detailed_main": "Housefull4 what a movie . Comedy ,story and starcast everything is fantastic. akshay kumar character Bala is heart and sole of movie Love the Acting of akshaykumar, pooja hegde kriti sanon and Riteish"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "yasirmahmood-73073",
        "review_rating": "1",
        "review_title": "Worst ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "skarthikalve",
        "review_rating": "3",
        "review_title": "Bakwasfull 4",
        "review_detailed_main": "Waste of time. Housefull has become a waste of time since house full 2"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "vitthalmisal",
        "review_rating": "1",
        "review_title": "Waste of money",
        "review_detailed_main": "Nothing in the story itself doesn't make sense the actors of the movie are not able to act properly The director itsef is so dumb."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "shreyashsav",
        "review_rating": "1",
        "review_title": "The worst movie of 2019!!!",
        "review_detailed_main": "So in 2019 as expected bollywood have produce one of the most worst content just want to say that this movie is really bad. Please belive me if anybody in your friend circle liked this movie be as far as you can from that person please...."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "desaigautam",
        "review_rating": "1",
        "review_title": "Terrible movie",
        "review_detailed_main": "Not Worth watching. Story and acting is terrible.waste of time for family"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "pavanguptasm",
        "review_rating": "1",
        "review_title": "Ab kya hi bole",
        "review_detailed_main": "Comedy ka naam pe to ab kuch nh bcha lagat hai , isse acha tp old movies dekh lo aur enjoy kr lo."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "atanuadhikary-12021",
        "review_rating": "1",
        "review_title": "Maderchod movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "srivastava-ritesh55",
        "review_rating": "10",
        "review_title": "MAD COMEDY its like a cracker which will give you laugh busters",
        "review_detailed_main": "Respect for the writers, they've executed a 'certain' thing 15-20 times in the film & I laughed my heart every single time; courtesy - a touch of VFX and Akshay's acting. It also keeps you engaged because of the 'so bad that they're good' one-liners. It touches the slapstick zone many-a-times, but thank god it never stays there for long."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "chitraansh-68058",
        "review_rating": "4",
        "review_title": "Boring waste of time and money",
        "review_detailed_main": "This film is not good same story and script worst film waste of money and time."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "lasi-33905",
        "review_rating": "1",
        "review_title": "Garbage",
        "review_detailed_main": "Garbage movie. Thought the movie would be a nice for the budget but hell no. this is a totally garbage movie"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "krswarnkar",
        "review_rating": "1",
        "review_title": "Lauda lasan Aata mere khayabo me jab Dekho jab mile mere aur tere jubaan chaato me aake thoda chakh le kaan se much tak chaat chaaat Lauda 🤣🤣Kuch BHI India bekar ho hot h",
        "review_detailed_main": "Jalandhar Punjab India ke Babar I have to reschedule our call it invest the best way to the world Israel is winner we are same ex wife is a great deal to be greatness of the world differently to r to be great to have the same ex girlfriend and her family and nature of this message and any attachment s are confidential may."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "firoz-borle02",
        "review_rating": "3",
        "review_title": "definitely better than WAR",
        "review_detailed_main": "Good thing about this movies is that unlike \"war\" it doesnt pretend to be an intelligent movie. you pretty much know what you are getting into when you decide to watch the movie. akshay and rieteish are good bobby is as bad as he was chunky is good heroines are there to fill the slots"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "sathwikps",
        "review_rating": "1",
        "review_title": "!!??",
        "review_detailed_main": "Not even a Match compared to the first 3 movies. A total disappointment for me."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "tyagitoshi",
        "review_rating": "1",
        "review_title": "Totally pathetic",
        "review_detailed_main": "I watched this movie expecting it to be better than the last one....but it was really the worst movie of the decade.....It had some of those best superstars but its script was just a lame! It was hard to bear ut for the overall runitme of the movie...Total wastage of time!"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "gipopey",
        "review_rating": "1",
        "review_title": "Standard of movies is decreasing everyday",
        "review_detailed_main": "Housefull franchise has lost its standard. Akshoy Komor should stop embarrassing himself and retire."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "risi-61808",
        "review_rating": "10",
        "review_title": "Nice entertainment movie",
        "review_detailed_main": "Nice wovie with different story line. All the characters are played very well. Akshay and Ritesh both are king of comedy."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "ashwiniisutar",
        "review_rating": "1",
        "review_title": "Is it movie or joke",
        "review_detailed_main": "It's worst movie, I can't imagine how actors could takes such scripts, dialogues and acting both distasteful"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "vkap-13252",
        "review_rating": "1",
        "review_title": "Directors should be banned for life from making a movie!",
        "review_detailed_main": "How did Akshay Kumar & other well known actors even allow this to happen! It is not just boring but really bad and pure torture. I couldn't even watch it fully. It is full of potty humor that anyone over 10 will have no interest in.\n\nMost directors will not be able to make this bad a movie even if they are challenged. It may be the worst movie in Bollywood history and if it is not, I do not want to watch a second of a worse movie.\n\nWould have given negative stars (-10) if allowed. It cannot even earn zero stars!"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "meghagargmg-02284",
        "review_rating": "5",
        "review_title": "Dissapointment",
        "review_detailed_main": "I like housefull series but this one was bit over . Acting was perfect by every actor and settings were good too but it was not that funny as you expect from a housefull movie . Story could be really improved ."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "akileshrahul-31621",
        "review_rating": "2",
        "review_title": "Has lewd and cheap humor that surprisingly makes you laugh",
        "review_detailed_main": "Still a terrible film. Has a scene copied from a film \"The Dictator\". Obvious sex jokes and crude humor that may appeal to some audience. Avoid if possible."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "srkiantower",
        "review_rating": "1",
        "review_title": "Disgusting",
        "review_detailed_main": "Crap Movie.. One of the worst comedy flicks ever seen"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "ameyamainde",
        "review_rating": "2",
        "review_title": "Abysmal",
        "review_detailed_main": "Well, I am a big fan of Akshay Kumar and watch his movies always. Well, when I first watched the trailer of this movie, I didn't get a good vibe and thought it won't be any good.\n\nAnd I wasn't wrong at all. After watching this movie, I was shocked to know that this has broken all the records of previous Housefull.\n\nTbh, this movie can be awarded for the most offensive dialogues of the year 2019. People judging sexual preferences of other person, actress calling herself \"mein abla hu tabla nahi\" are one of the many disgusting lines given to the leads here.\n\nI was shocked to see that Akshay agreed to do such a movie which completely tarnishes his image as a person who is trying to give a social message by doing movies like \"Padman\", \"Toilet\" .\n\nThe only rating given by me is for the comic timing of Akshay apart from that this movie has absolutely nothing going for it. Sorry to see such a movie even being in theaters for so long forget about earning crores.\n\nSeriously, it's hard to understand that people thought it as a comedy as it shows the standard that the movies has degraded to these days"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "rock_cool",
        "review_rating": "1",
        "review_title": "Enough is enough...stop it pls",
        "review_detailed_main": "I simply do not understand why so called A listers run after monetary benefit just to serve all this useless scripts to to their fans. Pls stop just for ....sake stop pls. A human brain cannot take more of these....."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "sandipngawali",
        "review_rating": "9",
        "review_title": "Superb funny",
        "review_detailed_main": "It's best film of Housefull franchise superb funny all through must watch for comedy lovers Akshay kumar once again proved why he is comedy King"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "amankatariatu",
        "review_rating": "1",
        "review_title": "Oh my GOD WORST MOVIE of the DECADE",
        "review_detailed_main": "I want to ask akshay, do he become blind and deaf while listening and reading the script???? Is he in his senses while doing movie?"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "mahi00773",
        "review_rating": "1",
        "review_title": "Don't waste your 💰 money",
        "review_detailed_main": "Waste of time. Don't watch it. Less comedy Usual drama of Karan Arjun."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "yashvardhangoyal",
        "review_rating": "1",
        "review_title": "Worst multicasted movie of 2019",
        "review_detailed_main": "Doesnt matter how much this movie collected in box office but this was unbearable."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "awesome_lynx",
        "review_rating": "1",
        "review_title": "Watch for 20minutes and never continue",
        "review_detailed_main": "Dissapointed. I watched housefull 1-3 and this one is the worst"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "bhimanshu-17975",
        "review_rating": "1",
        "review_title": "Time waste",
        "review_detailed_main": "Don't watch it's waste of time and money. Poor direction and full of stupidity"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "aksonih",
        "review_rating": "1",
        "review_title": "Worst movie, i have ever watched",
        "review_detailed_main": "Worst movie, i have ever watched. No story, worst acting by all the actors. all characters looks like fake"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "YeTejaTejaKyaHai",
        "review_rating": "1",
        "review_title": "One word....Intolerable!!!",
        "review_detailed_main": "Waste of time and money. Don't watch even if you can watch if for free...."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "biswasjoydeep",
        "review_rating": "10",
        "review_title": "Outstanding movie",
        "review_detailed_main": "The movie is outstanding. Comedy punches are super. Akshay , jony and ritesh sir work is outstanding. This is diwali dhamaka. I think this is india's best comedy movie. All people must watch it."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "shwetagsalve",
        "review_rating": "1",
        "review_title": "Unbearable Crap !",
        "review_detailed_main": "Always love to watch Akshay Kumar in comedy movies but this is unendurable .Everything in this movie is rubbish."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "proffesionalvideomaker",
        "review_rating": "2",
        "review_title": "Kinda boring and annoying",
        "review_detailed_main": "Well this movie is not what I expected from it I thought this is going to be full of fun but no the beginning of this movie around 50-60 mins is super boring then the rest of the movie is a little funny otherwise this movie is annoying it gave me a headache for real well the only good thing is the story is kinda unpredictable that's it nothing much story is boring doesn't make any sense at the end it's clear this movie is just for fun"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "anushpupadhya",
        "review_rating": "2",
        "review_title": "Worst movie",
        "review_detailed_main": "Its one of the worst movie of 2019 and with many cringe jokes after watching this movie it gave me an headache I feel housefull1 was comparatively better among the 4"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "toushikpaul",
        "review_rating": "1",
        "review_title": "Don't waste your valuable time !",
        "review_detailed_main": "Totally Jerk! Bakwas story ! Worst movie ever I have seen from Akshay. Sir!"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "hisxlnc",
        "review_rating": "1",
        "review_title": "Stinking pile of garbage",
        "review_detailed_main": "The script was written by someone who lost his cognitive ability a long time ago . Calling it ridiculous would be an understatement of epic proportions.Entertainment doesn't get any lower than this .Avoid like plague"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "bornon2303",
        "review_rating": "3",
        "review_title": "Highly avoidable",
        "review_detailed_main": "One of the worst movies I have seen in recent times. I'm lucky I did not go to a movie hall to watch this highly irritating movie of all time. I could skim through the movie watching it online. I think this is one of most stinking franchises of all time. None of the housefull movie is good to watch and still they make it. Dont know what point they are trying to prove."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "anthony_fernandes80",
        "review_rating": "1",
        "review_title": "What should I say?",
        "review_detailed_main": "I don't want to sound like a snob but seriously, what was this? I don't even feel like writing a review, because it doesn't deserve my attention. But I watched more than half of this horrible excuse for a film. So much money was wasted into this. Terrible. Sad. Horrible. I could go on ..."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "shylonsaldanha",
        "review_rating": "9",
        "review_title": "Its funny. Enjoyed the entire movie.",
        "review_detailed_main": "One time watch though. Story is not up the standard. 9 Stars for Akshay Kumar acting and entertainment."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "manojhassanbhatia",
        "review_rating": "1",
        "review_title": "'Houseful 4' is Worst Houseful Francise Movie Ever Created",
        "review_detailed_main": "I have watched and enjoyed houseful 1,2,3. The acting and story line was always fine and enjoyable.\n\nWhile houseful 4 have not only been the worst movie of Houseful series, but also worse that any movie of all the actors in this movie.\n\nSuch a big waste of such brillant actors. Akshay Kumar is one of my favourite actors from industry, he once made a director drop on middle of Mumbai-pune express way, because he did not like the story. I'm no one to judge, but i wonder as audience, as how he agreed to this movie.\n\nJhonney Lever is such brillant comic artist, but he has been given such a pathetic role. Forget the laughter, it makes you feel sorry for such brillant actor.\n\nIf anyone fairly makes list of worst movies ever created, this movie can be included in that list.\n\nSuch poor direction, and totally non-convincing predictable story.\n\nBig waste of time, money, world resources and acting talent in creation of this movie."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "dhruvmodi-24230",
        "review_rating": "1",
        "review_title": "Don't waste your time",
        "review_detailed_main": "This wii happen when two directors direct the movie. This time Akshay choose bad script. Only Diwali can save this movie"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "rohanwk",
        "review_rating": "1",
        "review_title": "No link with previous movies lol.",
        "review_detailed_main": "Simply making series movie without any link. Bas naam ka farak hota hai . 1,2,3,4 koi b movie ka apas mai link he nahi hota. Poor Bollywood"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "anirudhsharma_me",
        "review_rating": "1",
        "review_title": "TORTURE",
        "review_detailed_main": "Huge disappointment of the year dont go for the movie it is just waste of time and money same story nothing like comedy in the film this time bad script choice of akshay"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "prateekmishra-61043",
        "review_rating": "1",
        "review_title": "Nakedness of girls body is filty,even when deemed in public nd its attribution to cinema is not entertainment",
        "review_detailed_main": "Nakedness of girls body is filty,even when deemed in public nd its attribution to cinema is not entertainment,\n\nHaving intimate scenes,having casual sex with anyone,showing cleavage in public is not womenhood,its pity nd shamefull\n\nTrying to potray women as deeming the surroundings as brothel is not a good act nd it never would be,\n\nNor the lavish modernization of customs would bring any good when it comes to society, Entertainment is a long go,\n\nCinemas should be build on the grounds of morals character nd sensibility,raised on the pillers of reflection of good deeds nd emotions with #shame as the roof of it\n\nThese kinds of movies deterioates the image of women,nd the most pityful thing is that,girls that are good,nice nd humble carrying their parents respect falls prey of these things,\n\nPlease dont do this"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "IPyaarCinema",
        "review_rating": "1",
        "review_title": "Bala Bala, Sar (Head) Dard kar Dala",
        "review_detailed_main": "This Movie is just a Waste of Time and Money. There is no script, no story, no sense. I've Watched All The Films in Housefull Franchise. Housefull was pretty good, Housefull 2 was decent, Housefull 3 was just a total disappointing and now Housefull 4 is the worst movie in the Housefull Franchise. It is worthless to talk about performance of any actor here as it is clearly visible they all have acted just to mint money for themselves and to just enjoy some good time with each other during shooting. If few things which are good in movie are few Comic dialogues, Beautiful actresses and Bala song in weird way.\n\nWasting your time, money and energy on a film like Housefull 4 will possibly make you swear to be off cinema for some time at least!"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "shiragaonkarshweta",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "Watching this movie is total waste of time with meaningless story. Akshay Kumar should read movie script before he agrees to act in such movies. It's such a crap movie story. There is no point in making movie sequels by stretching same story, Please stop Houseful 5 production."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "virajstone",
        "review_rating": "9",
        "review_title": "Fantastic",
        "review_detailed_main": "This is one of the best movie of Hosuefull Franchise ! Superstar Akki and team just nailed it off with its comedy timing , story and screenplay. This Diwali don't miss this reincarnation comedy ."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "sudiptobasu",
        "review_rating": "2",
        "review_title": "Pathetic nonsense",
        "review_detailed_main": "Comedy is a serious business and the story writer, director and producer of this movie probably didn't realise that. Super waste of time and complete nonsense."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "shyamsk-91163",
        "review_rating": "1",
        "review_title": "Such a waste movie",
        "review_detailed_main": "You guys spend a bunch of crores for this pathetic movie .The fact is unbearable , torturing and hell of a crap .Plss don't spend your (audience) money on this pathetic movie"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "greekdx",
        "review_rating": "3",
        "review_title": "Nice concept weird movie with past an present together",
        "review_detailed_main": "Now the story totally different then the remain with the same main actors. The story goes a few centuries back and mixed with the modern times in a place somewhere in India in a mythical place called Sitamgarh. Many of the scenes happened to Bala the main role (acted by Akshay ) have been made in his former reincarnation and as the strory unfolds after he 2/3 th of th movie affect the remain members of the story except . The ladies who understood\n\nThe ladies are more active than before as all ...\"have the karate belt \" .\n\n. .\n\n. .\n\nI m ...joking but this is true . All ladies are very capable to beat men ! This happens to more than 5 times in the movie .\n\nThe story concept is quite impressive even if the story is weird after near the first half in Sitamgarh and gets even more weirder as the story unfolds. Equilibrium is before end whre present and past coexist with all story members effected in this time-mix . A few examples:\n\nAksay is seen to discuss with the birds - something s omen?- later you see his friends do the same . Any other watching them thinks they are mad IN the same weird PoV the funny think man (Jony Lever ) identifies himself as a former dancing woman!\n\nThe today's Pappu identifies himself as a bad Hercules acting as Leonidas in the Marvel's movie 300 after the 3 friends identified him. Morphing CGI and a bit of fantasy helped for that. .Weird and funny together. Faulty by-remixing of Greek history in an Indian movie!!!\n\nMadhu + Bala = Madhubala the former names of the older pair. Very interesting word play (starring Akshay + Kriti) . Good also to notice Kriti is Crete in Greek and Madubala was one of the most famous Greek songs of the 60s era,\n\nBy closing here I dnt liked to the whole result. Ther are a a few horror scenes with full action with a very weird plot . Jut before the story revolution I felt well suffered from a rather boring plot although the end satisfied me in part.\n\n3/10."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "atanuadhikary-12021",
        "review_rating": "1",
        "review_title": "Housefull 4 flop movie of the year 2019 😂😂🤣🤣🤣",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "ravimansaying",
        "review_rating": "5",
        "review_title": "An improvement",
        "review_detailed_main": "The self referencial jokes and Akshay Kumar save this illogical disaster and make it the best in the franchise"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "geniusvarrnit",
        "review_rating": "1",
        "review_title": "Worst Comedy Movie",
        "review_detailed_main": "It is one of the worst Comedy Bollywood movie I had see. The only movie which is worse than it is Pagalpanti."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "mdnyzz",
        "review_rating": "2",
        "review_title": "Waste of time and money.",
        "review_detailed_main": "I am giving this 2 stars only for Papa ranjeets acting and jokes which was hardly 5 min. Rest all the movie was plain stupid with lame jokes. Jonny levers acting and jokes were very irritating. And bobby should stop acting completely."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "sachinkm-31572",
        "review_rating": "10",
        "review_title": "Better",
        "review_detailed_main": "Very exciting, entertaining and lots of fun. Loved it"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "tawaab",
        "review_rating": "1",
        "review_title": "Bollywood's level of comedy has taken a serious dip",
        "review_detailed_main": "One of the worst movies you can possibly watch, pathetic story, weak acting and absolutely no plot. Bollywood's level of comedy has taken a serious dip in past 10 to 15 years."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "milindmadan",
        "review_rating": "1",
        "review_title": "Hopeless 3rd grade",
        "review_detailed_main": "I was being generous to give 1 star..ugghhhh....none of the females knows acting....and the male stars are pathetically old...silly to the last bit"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "devkaran",
        "review_rating": "1",
        "review_title": "Worst movie ever seen in theatre",
        "review_detailed_main": "How can sumbody make such a low level movie in this era.It was such a sad movie was waiting for it to finish"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "chaitanya-16023",
        "review_rating": "1",
        "review_title": "Complete waste of time",
        "review_detailed_main": "No dialogue, no a story so lame movie. Don't watch and waste your time"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "saranshgupta-39419",
        "review_rating": "1",
        "review_title": "Worst movie of 2019",
        "review_detailed_main": "Bad experience watching this movie. Not at all funny. Too unrealistic."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "saadamanindia",
        "review_rating": "2",
        "review_title": "Inexplicable pain and nothing else",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "dbk-36829",
        "review_rating": "2",
        "review_title": "No fun, No comedy",
        "review_detailed_main": "Irritating from start, they have made crap in the name of comedy, I think it is an worst movie of this year for Bollywood. I advise you to do not waste your valuable time and money on this crap. And be aware of fake paid reviews, this movie is really don't deserve to be watch in theatres.\n\nThank you."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "archanatripathi-07355",
        "review_rating": "10",
        "review_title": "Definitely A must watch",
        "review_detailed_main": "Watch it, you won'watchret, finally something new it Indian cinema, i have just watcher it and I really loved it. From direction to acting, everything was perfect, akki is on fire."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "ryanrocks-71570",
        "review_rating": "5",
        "review_title": "Expctd more",
        "review_detailed_main": "Horrible, excpt akki all were bad.... i would rate 3 , only coz of akki my rating is 5.."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "bhagalpur",
        "review_rating": "1",
        "review_title": "Bawasir type movie",
        "review_detailed_main": "Is this a joke going on,,, no plot,, no acting,, director are senseless"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "rajbenz",
        "review_rating": "1",
        "review_title": "trashy, lazy and careless NON-cinematic experience",
        "review_detailed_main": "A pathetic and fractured effort. A sub-par and a horrific inversion of everything that a comedy movie stands for."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "nikeels",
        "review_rating": "1",
        "review_title": "Truly Ghathiya!",
        "review_detailed_main": "Please stop torturing the audiences. We can't beat such things."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "saada7005",
        "review_rating": "1",
        "review_title": "Bad",
        "review_detailed_main": "Bad, very annoying, very very bad. Very annoying and annoying and annoying and annoying and annoying and annoying and annoying"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "joinobjahan",
        "review_rating": "1",
        "review_title": "movie without a story",
        "review_detailed_main": "They took dialogue ,scene from others movie ....no funny scene at all"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "kwxbqmx",
        "review_rating": "1",
        "review_title": "Hopefully they stop this series after this",
        "review_detailed_main": "It's a typical Bollywood movie and no fun to watch.\n\nPlot is senseless and predictable. Chunky Pandey's role is super annoying.\n\nOnly if they got a better writer."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "kashishkumar51",
        "review_rating": "9",
        "review_title": "DAMN HILARIOUSS...😂😂",
        "review_detailed_main": "Super funny and hilarious😂😂.......a lot of Negative reviews have been given....but the movie is damn funny😂....story is Ok Ok.....but dialogues,acting everything was hilarious...esp Akshay Kumar...whole audience was laughing hard....watch once its full on entertaining...4/5 rating ❤👌"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "anuragayushi",
        "review_rating": "4",
        "review_title": "Intermittent humour",
        "review_detailed_main": "Some punches were good but not coming at regular intervals"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "navidnawaj",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "I couldn't handle the lameness after watching just half an hour.Total nonsense and lame story."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "LanternSwapnil",
        "review_rating": "4",
        "review_title": "All 4 Ratings Only for Akshay Kumar",
        "review_detailed_main": "Just think what this movie would be if there was no Akshay Kumar in it. He saved it from being a complete disaster."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "jeetdutta-29661",
        "review_rating": "4",
        "review_title": "Disappointed",
        "review_detailed_main": "Nothing to laugh except niel nitin mukhesh.no comedy at all"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "chhatrpal",
        "review_rating": "1",
        "review_title": "Movie review",
        "review_detailed_main": "Story line nothing, concept nothing,comedy very poor. Totally waste of money in multiplex. This movie doesn't deserve to watch. It should be ban in India"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "bkvora",
        "review_rating": "5",
        "review_title": "No meaningful Story",
        "review_detailed_main": "What is this ? There is no believable Story with proper characters. Gross Comedy with too many actors leading nowhere.\n\nIn the Houseful series this one is the worst. Not worth a watch even on TV."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "bhumilpalita",
        "review_rating": "5",
        "review_title": "⚡Only family entertainer⚡",
        "review_detailed_main": "Housefull 4 is a no brain comedy entertainer. The concept of the film is unique but the comedy you expect from the 'housefull' franchise, so they failed this time. First Half is very entertaining especially the character of \"Bala\" wins your heart. Akshay Kumar did his best. Ritesh Deshmukh also did a fantastic job. But in the second half you get irritated by the same story line as in the previous film, and there are a lot of repetitive scenes. Some dialogues and scenes are copied and tried to create laughter but it is very boring. Vfx are very weak, sometimes it looks like a cartoon film. Very disappointed with this film."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "susantamcacvrca",
        "review_rating": "9",
        "review_title": "#Bala",
        "review_detailed_main": "This is most hillarious movie of this decade. Bala o Bala."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "anubhavlovesfrends",
        "review_rating": "1",
        "review_title": "worst movie ever made",
        "review_detailed_main": "Worst movie ever made tried to make fun of hit movies even then it was not funny actually that is the main point the movie is suppose to be comedy but its not funny at all there is not even a pinch of comedy in this movie its just as pervert as sajid khan thats all."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "eworldk",
        "review_rating": "1",
        "review_title": "Disappointed,Worst. Fully garbage.",
        "review_detailed_main": "How did Akshay Kumar signed the film? Don't expect any comedy from this."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "agrawalaniket-86158",
        "review_rating": "9",
        "review_title": "LIT AF",
        "review_detailed_main": "The movie is lit. Experienced great comedy. Nawazuddin Siddiqui has a great cameo."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "jagabandhujena",
        "review_rating": "9",
        "review_title": "Housefull 4 honest review",
        "review_detailed_main": "Movie is definitely without logic and story but all that serves one purpose comedy, some good moments are there, it will tickle your funny bone. Super blockbuster, keep your brain in home before going to cinema Hall."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "ariftop",
        "review_rating": "8",
        "review_title": "Must watch",
        "review_detailed_main": "I seen this movie.. and it's a family entertainer. So thi diwali enjoy a good movie with your family."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "abhishekkempegouda",
        "review_rating": "10",
        "review_title": "Best comedy movie ever",
        "review_detailed_main": "I m giving this review as I am watching the movie. It's marvelous. Very good comedy. Yar people keep the mentality of airlift and go to watch the Housefull movie how will they like it it is the people's fault not movies. The movie is very good."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "ricorodriguez-04626",
        "review_rating": "10",
        "review_title": "You're senseless if you're trying to find sense in this.",
        "review_detailed_main": "Housefull 4 is a silly comedy movie, there is no point watching it for its story or if it makes some kind of sense. The main aim of the movie was to entertain the audience and it sure did. I enjoyed it with my friends and you can as well. Clear your mind and don't try to find logic in it, just sit there relax and enjoy the movie."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "nikulkhatri",
        "review_rating": "10",
        "review_title": "Full Entertainment",
        "review_detailed_main": "MY ONE WORD - AGAR HAS NA HE TO YE DEKHO.. OR RONA HE TO CRITIC KO DEKHO.... SUPER DUPER COMEDY.. SUCH GREAT TIMING FOR AKSHAY KUMAR COMIC PUNCH... I THINK ONE OF THE BEST COMEDY MOVIE OF THE YEAR"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "rahulshinde-96748",
        "review_rating": "9",
        "review_title": "Blockbuster movie....Akshay & Riteish acting superb",
        "review_detailed_main": "Blockbuster movie all time .... Excellent acting by Akshay kumar & Riteish.Blockbuster this diwali...!!!"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "mans-90711",
        "review_rating": "10",
        "review_title": "housefull 4",
        "review_detailed_main": "Amazing Movie #Mast hai. Must Watch for every one(Go and watch).\n\nThis movie is a perfect mixture of *Comedy+Entertainment+Epic+Romance+Emotion*. It is not an epic action movie but it is a paisa vasool comedy and you will get impressed by its unexpected plot twists and a really amazing immersive Story!\n\nA complete comedy entertainment, full of laughs, dashing dialogue timing and surprise sequences makes this movie highly outstanding. A great story presentation along with amazing historical scenes visualization.\n\nFantastic comedy twists displayed on many occasions with stunning acting from all the cast. Akshay kumar define himself to next level, and Bobby Deol is always a splendid actor, he must act more in future movies, Ritesh has performed equally important. All 3 heroines are pretty beautiful and acted very nicely, these 3 heroines must be given more movies in similar big budget because they are solid performers of present time."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "singhabhineet",
        "review_rating": "10",
        "review_title": "Hillarious",
        "review_detailed_main": "Ak at his besttttt..u will not get bored for 1 sec either"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "abhishek_lomesh",
        "review_rating": "9",
        "review_title": "Pure Diwali Family Entertainer Reincarnation comedy",
        "review_detailed_main": "Its hilarious ride of Comedy . Blockbuster. Please keep your intelligent brain at home and just laugh heart out in hilarious scenes. AKSHAY KUMAR as Bala and Harry will leave you in splits . RITESH , CHUNKEY AND JOHNNY LEVER will make your day with their comic timings .Diwali Bonanza must watch."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "sachinrajkot",
        "review_rating": "8",
        "review_title": "House full series amazig",
        "review_detailed_main": "The promo creation is zabardast, all the best team housefull4."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "kr786",
        "review_rating": "8",
        "review_title": "Good for laughs",
        "review_detailed_main": "Is you are going to watch this expecting a Jodha Akbar level film then you gonna be disappointed. This is a comedy plain and simple and doesnt try to be anything other than a comedy. The story is non existent and so far fetched that you should ignore it and just concentrate on the laughs.\n\nThe only criticism is that Akshay, Bobby and Ritesh with three young ladies seems a bit creepy but again the comedy element brushes over that\n\nWatch it for the laughs and nothing else and you will enjoy it"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "manirajshrsth",
        "review_rating": "10",
        "review_title": "Film review",
        "review_detailed_main": "See it as movie. dont try to watch it as real life moment... you will enjoy it... superb movie"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "manishbhangale",
        "review_rating": "10",
        "review_title": "entertaining",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "uddhabanaik",
        "review_rating": "10",
        "review_title": "enjoy every time every mument of the cinema",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "mohammedsulemanbalwar",
        "review_rating": "8",
        "review_title": "Bala Saitaan ka Saala",
        "review_detailed_main": "A set of three brothers are due to marry a set of three sisters, until one of the brothers starts to realize that they are all reincarnations from 600 years earlier and the wrong couples are ab"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "its-me6611",
        "review_rating": "10",
        "review_title": "Best comedy film of 2019",
        "review_detailed_main": "10/10\n\nPlot: Akshay, Riteish and Bobby plans to marry Pooja, Kriti Kharbanda and Kriti Sanon daughters of a rich man in order to pay back a gangster. All is going accordingly till their past life catches up to them.\n\nAfter seeing some reviewers bashing Housefull 4 and seeing a 3.3 rating on imdb I did not plan on seeing the film but my niece insisted so I had to. 10 min into the film and I am laughing already. I ended up loving the film and this is by far the most entertaining comedy film I have seen this year.\n\nAkshay is gold. He has done such an amazing job with his comic timing and expressions. I don't think anyone else could have done a better job. He is perfect for the role. He does two role with distinct personality differences and did a marvelous job. I liked most of the cast as well especially Chunky Pandey's work.\n\nThe set is gorgeous. The costumes are amazing. The film shows time period of 1419 and some gorgeous looking palaces. The film looks pretty, cinematography is excellent.\n\nSongs are nice. I liked Ek chumma and Shaitan ka saala. Dialogues are amazing. Most of the comedy relies on play on words and I found those hilarious. The most wonderful thing was that the film did not take itself too seriously there were some self-parody that I liked.\n\nI liked Housefull, and Housefull 3 but did not expect Housefull 4 to be this good. Very entertaining film. I haven't laughed this much in a while. The film deserves much higher rating than current 3.3."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "shingotetejas",
        "review_rating": "9",
        "review_title": "Nice Movie!!",
        "review_detailed_main": "Laugh Riot For Sure This Diwali!!! Great VFX in that Budget. One Disappointing Thing Is That Bhoot Song!! It Should've been written more better But Ending Of Song Is Very Comedy. Overall Great Comedy Movie. Ignore All Negative Reviews. Becoz these negative reviews giving people are those who Think URI is Hypertoxic Jingoism 😡. But In Fact URI was Also Great Movie."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "dpdas",
        "review_rating": "10",
        "review_title": "Blockbuster",
        "review_detailed_main": "Best ever comedy with reincarnation Full of comedy and also it's a visual treat for all the audience Akshaykumar coming timing and his expression is hilarious .. Johny lever comedy at its best .it's a must watch film"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "someone_official",
        "review_rating": "10",
        "review_title": "Indian version of inception",
        "review_detailed_main": "People who hated this movie clearly has no taste in movies or maybe wants to laugh at every scene possible if they are paying for a comedy movie. So to all those guys did u cry the entire time watching Titanic or your pants while watching Conjuring? Its the different flavor u get in a single movie that should be appreciated. Flame me with dislikes but i totally enjoyed the movie. And if you are expecting Al Pacino level acting and Quentin Tarantino level directing then you are just fooling yourself."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "maheshpol9",
        "review_rating": "10",
        "review_title": "Hillarious comedy",
        "review_detailed_main": "If you want to enjoy and laugh, you can go blindly to watch movie. Its too funny. It's hillarious. Paisa vasool film."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "rakeshkumarray-33496",
        "review_rating": "10",
        "review_title": "ENTERTAINER OF THE YEAR",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "rapstav",
        "review_rating": "9",
        "review_title": "Good entertainer movie",
        "review_detailed_main": "Movie story and cast is good. Although its a bit illogical but still a good comedy movie. A good family entertainer and family movie ."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "sachinrajkot",
        "review_rating": "8",
        "review_title": "Good comedy for family entertainment",
        "review_detailed_main": "Good comedy for family entertainment, the comedy of the film is very nice."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "mirajahmad-35306",
        "review_rating": "8",
        "review_title": "Comedy movie",
        "review_detailed_main": "Why people are saying that the movie Isn't good.....i think the movie is good and more than comedy....i like this"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "iamtk-92145",
        "review_rating": "9",
        "review_title": "A good comedy film 👌😜",
        "review_detailed_main": "I read many reviews on imdb bout the movie that it's a pointless movie, a waste of time,etc etc. But I had to try and get what's wrong with the film... But the reviews were proved wrong it's a Amazing film.. It will be an entertaining for u and ur family.. Trust me each and everyone in ur family will enjoy the film in laugther"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "sgauravchands",
        "review_rating": "10",
        "review_title": "Best Comedy Bollywood movie of 2019.",
        "review_detailed_main": "Best Comedy Bollywood movie of 2019. Funny characters. You will enjoy movie from start till end. Just watch and enjoy. Do not use your brain. There are other movies as well where you can use your brain. This movie is only for laughter. So watch, laugh and enjoy."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "kumarakki008",
        "review_rating": "10",
        "review_title": "Madness roller coaster",
        "review_detailed_main": "Laugh out loud.... Superb movie with great acting and awesome comedy..... Watch it for fund... And laugh out loud.."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "swamisundeep",
        "review_rating": "10",
        "review_title": "Don't read the reviews",
        "review_detailed_main": "Ultimate movie.....kya baat hai....must watch....:)"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "Pateldevnarayan",
        "review_rating": "10",
        "review_title": "It's a comedy movie",
        "review_detailed_main": "We know it's comedy movie. Akshay is full on entertainer. Reviewer looking for sense in movie and giving 1⭐ rating. I can say all movies not 100% real and all are senseless. We watch movies for entertainment. Don't compare movies with real life."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "tabrez-97781",
        "review_rating": "8",
        "review_title": "Housefull4",
        "review_detailed_main": "Full time pass movie Akshay Kumar evokes laughter every time he is on screen. Visuals and cinematography looks grand. Music is foot tapping and Peepy specially Bala, Chammo and Ek Chumma Special mention for Neil Nitin Mukesh Do not use brain / logic ALDAB"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "bmohanta-71757",
        "review_rating": "10",
        "review_title": "Must movie to watch",
        "review_detailed_main": "Hause full 4 is the best movie to watch with entire family. Very funny movie. Acting of akshay sir is so good in this film. There is comedy, action, historical monument in this film."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "dimriamit",
        "review_rating": "10",
        "review_title": "Best comedy movie",
        "review_detailed_main": "Love to watch housefull 4. I found this movie a masterpiece. I am laughing when I saw review like don't watch, no comedy, boring. I want to say to those guys are you seriously watching housefull4 or some other movie. Because in theater everyone was laughing and enjoying. So friends please go and watch this movie."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "Dhaval_Forever",
        "review_rating": "9",
        "review_title": "HOUSEFULL 4",
        "review_detailed_main": "Awesome Movie Super .... Recarnation Concept Was Nice Rana Daggubati Cameo APPEARANCE Super & Nawazuddin Siddiqui Always Best ....Kabhi Kabhi Lagta Hai Apun Hii J Bhagwan Hai Small Roll But Excellent..."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "arkbarua",
        "review_rating": "10",
        "review_title": "TRUE REVIEW OF HOUSEFULL 4",
        "review_detailed_main": "Housefull 1 was awesome starting of Housefull franchise and within time it came to the release of Housefull 4 which was epic and it was so much super awesome that It became the favourite movie of the year 2019...Even all the songs in the movie are awesome...I don't know why some people say it's bad which is absolutely wrong...HOUSEFULL 4 IS THE BEST MOVIE IN 2019 (ACCORDING TO ME) though everyone have their own viewpoints...Those who see this comments it's a humble request for them not to judge the movie by just a comment/review of the movie\n\nTrue Supporter of Akshay Kumar and True Viewer of the movies"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "bipinmishra-76218",
        "review_rating": "10",
        "review_title": "Nice movie",
        "review_detailed_main": "Awesome movie Family entertainer Climax is very funny"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "govindkg",
        "review_rating": "10",
        "review_title": "Amazing....",
        "review_detailed_main": "This movie is just amazing and madness comedy. Must watch and please ignore all the reviews of so called fu*king critics.. Just go and watch it guys..."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "mr_a-94004",
        "review_rating": "8",
        "review_title": "Akshay Kumar thank you for making me laugh so much.",
        "review_detailed_main": "For me this the best part of all Housefull movies. I like the genuine skill of Akhsay in making you literally laugh in all his comedy movies. I really than Akhsay and the crew for making this nice and light comedy movie."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "nishitkumar-48346",
        "review_rating": "8",
        "review_title": "Don't go into depth it's watchable and enjoyable",
        "review_detailed_main": "If you going with your family for some good time chuckling and laughing its a full pack... I believe the expectations are high but can say it's a good time pass movie."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "anantaswain",
        "review_rating": "10",
        "review_title": "Aswome",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "nabeelmaaz",
        "review_rating": "10",
        "review_title": "Hi the IP and I will be able and TV on the tuuuiy you have",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "ashishkk-76590",
        "review_rating": "10",
        "review_title": "Awesome Comedy",
        "review_detailed_main": "I love this movie because of the comedy scenes. Story of the movie is not good but the film will make you laugh. The Actors did their best to make others laugh."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "sashikantamishra",
        "review_rating": "8",
        "review_title": "BEST MOVIE FOR ENTERTAINMENT",
        "review_detailed_main": "Don't listen rabies,it's a best comedy movie,it's worth to watch this movie."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "Magow-Intermean",
        "review_rating": "9",
        "review_title": "Housefull 4 Review",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "dhrumitu",
        "review_rating": "9",
        "review_title": "Entertaining",
        "review_detailed_main": "Entertaining Movie 🍿, Story was okay, but acting of akshay kumar was awsome. 😇😇😇😇😇😇"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "gchumber",
        "review_rating": "10",
        "review_title": "Amazing movie",
        "review_detailed_main": "According to me it's a good movie... They did their hard work, i know different people have different choices but this movie is not that much bad..good family amd story is also different from the previous ones"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "chauhanakash-13470",
        "review_rating": "8",
        "review_title": "overall movie was good",
        "review_detailed_main": "Overall movie was good, do not find logic in the story. acting , location graphic dialogue was owesom"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "mishradebashis",
        "review_rating": "9",
        "review_title": "Good movie, slapstick comedy",
        "review_detailed_main": "Nice movie, don't know why critics or many didn't like. Nice reincarnation story. Engaging plot. Johnny lever and nawazuddin were not required in the movie. All the 3 leads did a Fabolous job. Good one liner comedy punch except few that could have been better. 1419 year should be more realistic and Mr. Sahni should have been little more serious. Bobby deol did good comeback makes me remember of his movie chor machaye shor.\n\nStory: Akshay Kumar forgets when something rings hard near him but goes back his past as raja bala. Ritiesh and booby are his brothers in 2019 who were nartaki and angrakshsk in their previous birth respectively. They were supposed to marry the three lead actress but due to something (see the movie) cudnt marry and now Akshay reminds rest 5 of them about their rebirth to get married.\n\nDidn't reveal whole story here. A must watch for Akshay, ritiesh, Bobby and housefull fans"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "rahulamin-21176",
        "review_rating": "10",
        "review_title": "8/10",
        "review_detailed_main": "Movie was Really Good , Was very funny and was worth watching!"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "varunsharma-66346",
        "review_rating": "9",
        "review_title": "Seriously don't heed the negative reviews if you like these kind of comedies!",
        "review_detailed_main": "This movie is full on entertainment, I was laughing almost every frame. There are too many things that you'll miss out in if you don't see this. If you like those 'leave your brain at home comedies' then this is for you!"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "jafrihammad",
        "review_rating": "10",
        "review_title": "Fun from starting to end",
        "review_detailed_main": "Comedy from starting till end. Akshay Kumar acting and Ritesh Deshmukh comic timing are the highlight of the movie...Joined 200 crore club"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "manikbhatnagar",
        "review_rating": "8",
        "review_title": "Vedaansh",
        "review_detailed_main": "Superb movie don't use logic in comedy movies it is entertaining movie not blockbuster but it is a hit movie and few jokes are amazing and few are not so it can't mean that this movie is disaster or flop it is entertaining and I give 7.5 /10"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "keshavkk-40835",
        "review_rating": "8",
        "review_title": "Funniest one",
        "review_detailed_main": "It was funnier than expected. Was just awesome. Giving it 8 stars just because the movie was to fast."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "arvind_maher",
        "review_rating": "10",
        "review_title": "Full of Housefull comedy",
        "review_detailed_main": "In beginning I was trying to avoid to watch this movie because of some idiots bad reviews for movie. But guys believe me it's worth watching and again Akshay has proved singh Is king..."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "habibmdjakaria",
        "review_rating": "10",
        "review_title": "Great movie",
        "review_detailed_main": "I enjoyed the movie. It was a great fun and entertaining. It is a great movie. I give it ten on ten."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "sunnydew-33257",
        "review_rating": "10",
        "review_title": "Superb",
        "review_detailed_main": "Like all the Housefull-Movies, this Movie is also a superb comedy. Akshay Kumar is outstanding in the Movie."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "atulgupta-79597",
        "review_rating": "8",
        "review_title": "Funny & worth a watch",
        "review_detailed_main": "Nice funny, some very good funny moments. Songs are good and Ritesh +Akshay combo has some real good moments"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "vikashvikashpaswan",
        "review_rating": "8",
        "review_title": "comedy drama mixed",
        "review_detailed_main": "Amazing Movie #Mast hai. Must Watch for every one(Go and watch). This movie is a perfect mixture of *Comedy+Entertainment+Epic+Romance+Emotion*. it is not an epic action movie but it is a paisa vasool comedy and you will get impressed by its unexpected plot twists and a really amazing immersive Story! A complete comedy entertainment, full of laughs, dashing dialogue timing and surprise sequences makes this movie highly outstanding. A great story presentation along with amazing historical scenes visualization.\n\nFantastic comedy twists displayed on many occasions with stunning acting from all the cast. Akshay kumar define himself to next level, and Bobby Deol is always a splendid actor, he must act more in future movies, Ritesh has performed equally important. All 3 heroines are pretty beautiful and acted very nicely, these 3 heroines must be given more movies in similar big budget because they are solid performers of present time."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "anantaswain",
        "review_rating": "10",
        "review_title": "Movie is very fantastic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "dineshkatariya-17078",
        "review_rating": "10",
        "review_title": "Blockbuster Comedy movie",
        "review_detailed_main": "#Housefull4 what an amazing reincarnation #comedy movie , 🌟🌟🌟🌟🌟 / 5💥 Movie."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "pavandhuppe",
        "review_rating": "9",
        "review_title": "A good comedy movie",
        "review_detailed_main": "Every comedy movie will not be hera pheri , chupke chupke or welcome and a lot like these . But this is good one to make audience laugh and entertain .\n\nIt seems like this movie is shooted at large scale . We see Various larger than life sequences . Very good looking Film😍. Somewhat writing is not to the point personly I feel . Good Performances . Music is awesome 🎶🎶.\n\nMusic locations are good and shooted well . Story is average somewhat old type but presented nicely and Don't make us feel bore . At last Farhad samji made a larger than life comedy movie with huge sets huge cast..."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "vgaendra",
        "review_rating": "10",
        "review_title": "One of the best comedy ever",
        "review_detailed_main": "Full entertainment for those having good sense of humour if you know how to enjoy your life you will surely gonna like this movie. Those who are having habit of searching flaws in movies please don't watch"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "hl-72661",
        "review_rating": "10",
        "review_title": "amazing full of joy",
        "review_detailed_main": "Win the comedian indian movie of the year. really I enjoyed it"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "choclateboyshubham",
        "review_rating": "10",
        "review_title": "Loved it",
        "review_detailed_main": "I realy loved the moviee .it was realy grasping Kept me engaged full on Ranjeet akshay ritesh and kirti kharbanda were realy amazing Rana dagubattis rolee as gama was super amazing Some Jokes were realy funny 'In shabdo ko sangeet main pironachaiyee scenes made me laugh even after the moviee"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "varunkrshnn",
        "review_rating": "10",
        "review_title": "Next level greatness.",
        "review_detailed_main": "You'll feel your IQ triple by the time the movie ends."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "ajaysilori",
        "review_rating": "10",
        "review_title": "Bala O Bala Bala O Bala😍",
        "review_detailed_main": "Best comedy movie in recent years👌 Akshay kumar killing it with bala & harry❤ TOTALLY HILARIOUS💕"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "rodzaakbar",
        "review_rating": "10",
        "review_title": "Hmm, it's okay, but nice.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "royr-70823",
        "review_rating": "10",
        "review_title": "Paisa wasool movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "sprihasengupta",
        "review_rating": "10",
        "review_title": "Average Film",
        "review_detailed_main": "It's a average film just like the previous 3parts of housefull. Not too much funny. You can say it a waste of money but i like it because it freshes my mind.\n\nThis can be a one time movie for some of you. But me & my mom like it.\n\nThe thing i hate the most the casting of Bobby & Two Kritis.\n\nI also hate the screening time of Chunky sir as Aakhri Pasta,its just for some few times. Not like housefull 2.\n\nSo, you guys can watch this if you guys want to clarified your curiosity. Nothing else!\n\nIt have just average comedy.\n\nYou can watch this with family. There's no doubt that it's a family movie.."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "stuartk-33632",
        "review_rating": "10",
        "review_title": "The Cast must be chosen wisely",
        "review_detailed_main": "Well in my opinion this movie was actually pretty good and I disagree with most of the negative reviews written. But the age difference between actors were standing out, and I found it really disturbing. But the Housefull series always had Akshay and the series wouldn't be the same without him in it. Yet they could've chosen a younger actor for Bobby Deol's character.(even though the movie tells about older men marrying younger girls)"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "mc-97775",
        "review_rating": "10",
        "review_title": "HOUESFULL 4",
        "review_detailed_main": "Industry One of the best verstile actor akshay kumar. My favourite actor khiladi kumar. He has a great personality & his action & comedy is mind blowing. His movies choice is very good & all movie is very insperatonal & motivational.\n\nAkshay is most popular actor in india. I have watched akshy, s all versatile movies but my favourate movie is patiyala house, all the khiladi series & my one of the favourate Baby. I love akshay personality & his way of talking or comedy sence. Akshay is true indian he is donate money every time for all disasters.\n\nI slaute for him he is a true indian & respectfull person for film industry."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "abzahidab",
        "review_rating": "8",
        "review_title": "Out of mind but funny",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "sagarkumarpoddar-31320",
        "review_rating": "9",
        "review_title": "Awesome reincarnation comedy",
        "review_detailed_main": "A movie with good story, entertaining and beautiful star cast. Every character has got an important role to play. The movie is full of fun, comedy, laughter, thrill, suspense, action, romance and much more. Akshay Kumar ,the lead actor has done enough to bring the audience on their feet. The story very much reflects around him and keeps him in front of the audience for most part of the movie. Rest of the five actors/actresses have got their part of the roles almost equally divided. The actresses not only add glamour and beauty but also a lot of comedy and emotions. Other characters like hotel manager (played by Johnny Lever), Akhri Pasta (played by Chunky Pandey), Maharaj((played by Ranjit),etc. are equally supportive and entertaining. The villain of the movie, (Suryabhan/Michael) also does play an important part in the movie. The movie brings a rare/different type of story for the audience and is a must watch."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "rocr01",
        "review_rating": "10",
        "review_title": "Excellent Comedy",
        "review_detailed_main": "This movie surprised me. A lot of funny scenes, dialogues etc. The references to a lot of 90s Bollywood is hilarious. The writers have definitely put in their hard work in trying to make every dialogue funny and with double meaning at times. The first half is crazy funny, the second half drags a bit, especially at the very end, but all in all a fantastic funny movie. The whole family will enjoy. Don't listen to negative paid reviews, none of them have really seen the movie, you can tell by their reviews. Go watch it with friends and family."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "pawanmodi-49009",
        "review_rating": "10",
        "review_title": "One of the best Movie",
        "review_detailed_main": "Best dialogue delivery, best comedy, full family movie. This is entertainer movie, don't apply your logic"
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "haklaster",
        "review_rating": "9",
        "review_title": "3.3 seriously?? I think there should be an end to the fake voting now",
        "review_detailed_main": "I'm giving it 9/10 because there are too many fake negative reviews posted by specific group of people. Some have genuinely disliked but then that's their opinion. But most of the 1* reviews are of those guys who have a specific agenda and this anyone can verify by visiting their profiles.\n\nComing to Housefull 4 review. My review 5/10. IT PROMISES ENTERTAINMENT AND IT DELIVERS. If Golmaal Again is ok Total Dhamaal is ok then Housefull 4 is definitely OK. A thumbs up for the team from entertainment lovers.\n\nIt has slapstick moments as well as some hilarious situational comic moments. The blend of period and comedy works well. It is the grandest comedy to come out of Indian Film Industry. It is the first Reincarnation comedy to come out from cinema.\n\nPositives: Bala and Harry, characters that will be remembered for a long time by comedy lovers. Some ROFL moments in Akshay Kumar style. IHIYEYEE whenever this thing happened the audience were guaranteed to laugh.\n\nKriti Sanon who perfectly fits in the drama as well as comedy scenes.\n\nVFX and locales. Its a movie to be watched in a theatre.\n\nJohnny Lever and Ranjit provide some genuine laughable crazy moments.\n\nBackground score is nice one.\n\nClimax is a laugh riot...right from the Mujhse Shaadi Karogi song played :P to the 4 knives xD.\n\nTreat to watch characters in 2 eras.\n\nNegatives: Badla kawali in 2nd half.\n\nRiteish Deshmukh was a bit underutilised.\n\nSongs this time aren't as peppy and foot tapping as previous parts.\n\nAs it has slapstick humor some jokes fall flat and some are like laugh when the audience laughs.\n\nBobby Deol is kind of misfit in this movie as comedy is not his cup of tea although he tries.\n\nComedy movies have been bashed by critics but enjoyed by audience. Be it Dhol, Phir Hera Pheri, Bhagam Bhag, Dhamaal or Bhool Bhulaiyaa all have been given negative reviews. Housefull 4 is not in this league but it's decent in parts."
    },
    {
        "movie_id": "tt7721946",
        "movie_name": "Housefull 4",
        "movie_rating": "3.6",
        "review_username": "chaahatshrii",
        "review_rating": "10",
        "review_title": "Nice comedy , Paisa vasool movie.....",
        "review_detailed_main": "According to me best comedy ever..Akshay Kumar, Ritesh deshmukh and kriti sanon part was best.I am giving it 10 out of 10 stars. Dialogues was fantastic. It's a family movie. Everyone can watch it.. and again Akshay Sir part was best... According to me everyone should watch it...."
    }
]