[
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "monilasso-1",
        "review_rating": "6",
        "review_title": "Not all that bad, worth seeing it for Karl Urban",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "ma-cortes",
        "review_rating": "6",
        "review_title": "Violent motion picture about a brutal army of Vikings invading North America",
        "review_detailed_main": "A little boy is left in a strange land and he's adopted by an Indian family. But a merciless, ambitious and cruel barbarians(Clancy Brown, Ralf Moeller, among them) suddenly appear and they are cruelly murdered . The starring(Karl Urban) observes the massacre from a distance and he manages to flee these murderers and reaches a village with other Natives whose inhabitants are worried if he has been able to hide his leads. Afraid of the violent savage warriors ,they decide to flee. Meanwhile the protagonist falls in love with a charming Native(Bloodgood). The young stays alone to revenge his families killers but he gets captured by the Vikings. Unfortunately , they get him before he can do anything and force him to lead them to the other Indians. He guides them and agrees to lead to the hiding place of his fellow villagers but he has a scheme to destroy the cutthroats barbarians before reach the camp.\n\nIt's the second version based on ancient folk-tale from Lapland, the first and classic version was directed by Nils Gaup in 1988, winning several prizes. This new adaptation is an exciting picture plenty of action, thrills, chills, roller-coaster ride, violence and breathtaking fights. The brutal Vikings with horned helmets deliver the goods, their appearance is spectacular and creepy, including the majestic horses doing pirouettes. Furthermore the astonishing killings are gruesome executed and grisly graphic. Special mention to Russell Means , he was born Lakota Sioux, a good actor Native American, he along with Graham Greene, Rodney A Grant, Tantoo cardinal, Eric Schweitz and Wes Studi appear in all movies about Indian themes. The evil Vikings are characterized in similar style to the classic 'Conan' by John Milius, as when at the beginning appeared James Earl Jones in an unforgettable scenes . The sombre photography by Daniel Pearl with a sort of never-ending dawn and dusk time is truly awesome. It's a kind of light mingled in a moody and foggy atmosphere. Many frames including the combats and cliffs scenes are made in a ¨300¨ style adding computer generator backgrounds. Stirring and evocative musical score by Jonathan Elias. Stunning and gripping realization by Marcus Nispel. He's a video hits director and expert on terror genre such as he proved ¨ Friday the 13th, Frankestein, Texas chainsaw massacre¨ but none of his movies have been based on original plot."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "mstomaso",
        "review_rating": "6",
        "review_title": "Dances with Vikings",
        "review_detailed_main": "Nipsel and company basically hybridized the structure of Dances with Wolves with a not-quite-historical fiction (more like radical speculation) plot about interactions between Norsemen and Native Americans during the 12th century A.D.\n\nGhost (Karl Urban) is a Norse boy left behind aboard a wrecked ship. He is adopted by the Clan of the Dog (the dogs who cohabitate with this tribe are historically inaccurate, but that's just one of many historical transgressions). As he grows up, Ghost's obvious difference and his history become something of a stumbling block for him, but he works hard to overcome them in order to be accepted by his adoptive people. Eventually, it seems, he must confront the demons of his past, and unfortunately, so must the Clan of the Dog.\n\nPathfinder is played well by Russell Means, and Ghost's love interest - Starfire - is nicely portrayed by Moon Bloodgood. Urban has great physical talent, but this story did not lend itself to testing his ability to create drama and mood, so there isn't much to say about his performance. Likewise, most of the Norse characters were so under-developed and one-dimensional that it is impossible to comment on the performances involved.\n\nAlthough the story relies on stereotypes to develop both its Norse and Native American characters, since so little is actually known about the Norse colonies, this seems forgivable. What is not really forgivable, in my opinion, is the reiteration of the trope established in Dances with Wolves and other similar works which suggests that it takes a European to effectively fight off Europeans. Although the characterizations of the protagonists in both films are adequate to explain their behavior, the character and behavior of the Native Americans attached to them is less well developed, and there is a lingering, inaccurate and disturbing shadow of inferiority implied in their apparent inability to strategize and effectively lead in combat.\n\nHowever, Pathfinder refuses to touch reality with any length of pole, so, sit back and enjoy the action, costumes and sets.\n\nThe film contains a lot of violence, most of which is convincingly shot. The costuming is excellent, and the sets are lovely. if you can get past the problems - which are several - you may just enjoy it."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "access_code_1",
        "review_rating": "5",
        "review_title": "Good action scenes wasted on terrible story, acting and editing.",
        "review_detailed_main": "What a waste.\n\nThe only redeeming feature of this movie were the well made action scenes (not all were good, but overall there were more enjoyable fight sequences than boring ones).\n\nThe story is clichéd and predictable. The acting is terrible (the main role is so horribly sketched out that you can barely blame the actor, the supporting roles all make a mark for their blandness). The main couple have no chemistry, the dialog is UN-enjoyably bad and the editing looks like it was done by a blind man. Scenes start and end with absolutely no flow. One scene was particularly bad (I wont spoil it for you, suffice to say its the one where the Indians charge into battle against the hero's wishes). That is the only scene when I laughed in the movie, and its supposed to be a sad/rousing scene.\n\nThe trailer of this film looked really pretty, but then again the consisted of mostly the fight scenes so I'm not surprised at all. The director seems to have had a good eye for visuals, but his effort has ended there.\n\nPathfinder = 5/10 Five for the fight scenes.\n\nI was trying to find a path out of the theater at many times during the movie."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "byrdman-6",
        "review_rating": "7",
        "review_title": "Not a bad B-movie",
        "review_detailed_main": "This is pretty good B-movie. If you want subtle plot and dialog then you should have figured out from the trailer and the poster that this show is not for you.\n\nYes, it appears to be inspired by a Frazetta painting (see Death Dealer) and is surely derivative of Conan and Tarzan. But how long has it been since a good Conan or Tarzan movie.\n\nLots of gore, lots of decapitations (but as Joe Bob would say, all necessary for the plot) lots of low key lighting to make the special effects easier to pull off but then again, it's not a chick flick.\n\nIf only we still had drive in movies."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "sobeit712",
        "review_rating": "5",
        "review_title": "Not as bad as some have painted it to be",
        "review_detailed_main": "If you went to see the movie expecting something like Mel Gibson's Apocalypto, you will be disappointed obviously. But why would you expect it to be Apocalypto if you've seen the trailer? It tells a mythical tale of a legendary Norseman who was raised by native Americans. They called him ghost. And it's this ghost who ended up protecting the tribes from the destruction of the Viking Clang who shared the same lineage with him. The plot line is just that simple. What kept me entertained was the action sequence, absolutely stunning cinematography and the overall presentation and atmosphere. The overall tune of the movie is dark, mythical and menacing, fit perfectly well for the theme. Vikings are presented more like beast than man, with giant statue and equally ghastly giant armors and weapons.\n\nSome may argue that the vikings in this movie kill senselessly without any purpose. Does having a purpose makes evil more sensible? I have good news for people who are looking for reasons behind evil: they all have purposes and reasons, so don't waste time seeking one for them. Bad news for you: it absolutely makes no difference! Throughout human history, all aggressors had plenty of reasons to invade, ravish and destroy other culture and lives, the list goes from Vikings to Hitler... and it will probably go on forever. But does having reasons and purposes to kill make the killing more sensible? Absolutely not.\n\nIn this movie, Vikings are symbolic evil. Giving it a reason to kill doesn't make any differences as I stated above: they all have reasons, pick one and get over with it. On the other hand, the movie was trying to suggest that not only there's this battle of good and evil going on in the physical world, there's also a battle of hate and love in one's heart. When asked: who would won, Ghost was given the answer: the one you feed the most. It's a very interesting theme that I wish the director would explore a little bit deeper. But in the end, violence prevailed the screen time. The thought of inner struggle and loftier redemption was lost in the midst of killing and vengeance. No sin was forgiven and no bad deeds went unpunished. Though it's a more satisfying end, but a shallow one.\n\nOverall, I enjoyed the movie for what it is. I'm not looking for complicated plot nor deeper character development. For an action movie, its visually stunning, fast paced and immersing. It kept me interested throughout the 90 minutes and left me pondering about some unfulfilled premises. It's not as bad as some have painted it to be."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "salad_days-1",
        "review_rating": "",
        "review_title": "visually arresting",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "GaiusMarius_4",
        "review_rating": "6",
        "review_title": "Not a bad couple hours",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "ps42",
        "review_rating": "3",
        "review_title": "Worse than I could have ever imagined.",
        "review_detailed_main": "I'm not quite sure how director Marcus Nipsel and company managed to take this screenplay, which had potential, and suck every ounce of life, drama and coolness out of it. They did, though. Pathfinder proves to be another completely forgettable historical action movie at best, generic as hell, right down to your cookie-cutter indestructible action hero (played by Karl Urban).\n\nMy biggest gripe with the film, and I have many, comes from how long it was pushed back for. If I remember correctly, it was first slated for release in January of '06. It was delayed well over a year, and I assumed that the crew were editing, re shooting and doing other things that might make the film better. I should have remembered what happens when one assumes. In reality, they were just waiting around for a good time to release the film, because it obviously didn't improve in that year and a half. At one point, they literally insert stock footage of an avalanche instead of creating their own CGI (or real) avalanche. Who are you guys kidding? There are about six words worth of meaningful dialog in this film. The Vikings don't even look human, nobody ever really explains why they're going out of their way to kill everyone. The Native Americans are portrayed as weak and stupid, little more than target practice. This film just lets the arrows fly and the heads roll.\n\nThe acting is horrendous as well. Its got some cool action scenes, but thats about it. It might have been a blessing having so little dialog in Pathfinder, because if how brutal the little that was present proved to be. It was like, Covenant bad. The script literally sounds like it was written by a child.\n\nOverall, Pathfinder wastes its potential and fails to prove itself worthy of anyone's time, let alone anyone's money. No amount of good action could have saved this film from its fate."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "i_know_i_die",
        "review_rating": "7",
        "review_title": "Cool movie",
        "review_detailed_main": "I don't know why so many people is saying this movie sucks because it is not history accurate. Hey it is just a movie. Can't you sit back and enjoy the movie and stop you complaining about all the history inaccurate thing?\n\nAnyway, Pathfinder is about a boy who was left behind by his clan because he somehow doesn't fit in the clan. Later, he was found by a girl who took him into her clan. They took him in and called him Ghost. Years pass and he is raised by the clan. Everything seems so well until one day, Ghost's old clan came back. They came, they kill and Ghost wants revenge. Then they fight and fight and fight.\n\nWhat I like most about this movie is the costume. After watching the movie, I want a toy company to create the Vikings. The armors are nice. I like the way they shoot the movie. Pretty cool. The script is somehow OK. It is good but not that good.\n\nA cool movie. Worth watching if you are into swords and armors movies. Fans of Apocalypto and Conan will enjoy this. And stop listen to all this history inaccurate crap."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "ecko_47",
        "review_rating": "3",
        "review_title": "One Lost",
        "review_detailed_main": "Twenty years ago, there was a terrific Norwegian action film called \"Pathfinder\" set in the Dark Ages and dealing with a boy whose family is slaughtered by marauders; villagers take him in. When the boy has grown into a young man, the marauders return, affording our hero the chance to repay his benefactors by avenging himself on the bad guys. It was brisk and chilly and had a real sense of mythic resonance. It was good.\n\nHere, now, is another film called \"Pathfinder,\" virtually identical in plot. And it is everything the original was not: muddled, ugly, pointless, silly, incoherent, overly familiar and exceedingly dull. It is not good.\n\nGerman director Marcus Nispel, who remade \"The Texas Chainsaw Massacre\" a couple of years back and likely is working on a lousy new version of something else now, has an eye: The film is handsome. But he has no ear or brain -- or at least not those parts of the brain that deal with such niceties as narrative, character, dialogue and logic.\n\nKarl Urban (Eomer to \"Lord of the Rings\" fans) stars a Nordic boy raised by Native Americans after being left behind in a Viking raid of North America. Probably the filmmakers (a dozen producers are credited) thought the introduction of Native Americans allowed for soulful depths. Actually, it allows for painfully dim clichés about prophecy, spirits and discovering \"who you are\" -- as patronizing in its way as the most insult-ridden cowboys-and-Indians movie of the '30s.\n\nOther characters include a heroic love interest (Moon Bloodgood), a wise elder (Russell Means) and a mute sidekick (Kevin Loring). These brief descriptions are about all the depth these characters ever acquire.\n\nMost of \"Pathfinder\" is given over to ridiculous chases and fights that remind you how skillful \"Apocalypto\" was at similar scenes. Someone who had never seen an action movie wouldn't credit a minute of it. In a way, it's perfect: You can't imagine anyone seeing this mess and not feeling lesser for the experience."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "mtess-1",
        "review_rating": "8",
        "review_title": "Could have been magnificent, but still a dark and fascinating movie worth watching",
        "review_detailed_main": "I wasn't expecting much when I started watching this, but that quickly changed thanks to the brilliantly lit scenes and grainy, pensive mood of filming. The acting, as well as the violence was well above average in quality and brutality respectively, and the story was refreshingly original.\n\nI believe three things could have elevated this movie to brilliance: 1. A more sweeping, bold orchestral soundtrack. 2. More sweeping, cinematic shots to give us short escapes from what, at times, became a claustrophobic atmosphere. 3. Authentic native language with subtitles, as was given the Vikings. I realize the choice not to do so (point #3) was probably based on perceived audience appeal, or perhaps even on the psychological identification with the \"good guys\", but it would still have added an element of greatness.\n\nOverall I give Pathfinder 8 out of 10 stars for originality, brooding (amazingly refreshing) filming, and an authentic truthfulness in telling what was a simple but bloody tale of revenge. I also appreciated the fact that the film took itself seriously, and did not toss in a heap of \"humorous\" moments that so many current action movies seem to rely on. This movie was relentless in its pursuit of telling a dark and bloody tale and, for the most part, succeeded in providing an excellent couple hours of escape."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "Doc Scot",
        "review_rating": "7",
        "review_title": "Karl Urban",
        "review_detailed_main": "While it is true not all film directors can envision and extract the best from the actors in their films, this Karl Urban performance was different from what we have seen him capable of as Vaako in The Chronicles of Riddick and as Eomer in the Lord of the Rings Trilogy. Karl as the Viking boy raised by an American Indian tribe gave a primitive and exciting performance but his portrayal of an Indian brave did lack some of the close up intensity we know he can deliver. In this story, the Vikings and American Indians were struggling for survival, so perhaps more action and less character development was called for. If battle minded Vikings landed on those shores, they would have taken the Indians by surprise, and then swarmed on foot, killing at will. If we were watching a film about Crazy Horse fighting George Custer at Little Big Horn, we wouldn't want character development to slow the pace of the battle; rich character development was not this film's goal. Having said that, we watch Karl Urban as he learns to conquer his fears and we see Pathfinder's daughter learn to trust Karl's character, the ghost. We have rich character development in film when those characters have more leisure time, not when they are fighting for the survival of their loved ones and their tribe!"
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "dpogue21",
        "review_rating": "1",
        "review_title": "Vikings and Indians just got less cool",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "themowg",
        "review_rating": "2",
        "review_title": "Hilarious!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "filmone1",
        "review_rating": "",
        "review_title": "A Very Great Film by the Excellent Director Marcus Nispel!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "zoofan9000",
        "review_rating": "7",
        "review_title": "Are you not Entertained? Are you not Entertained",
        "review_detailed_main": "I bought this movie because I thought it looked cool and when I got home I looked it up here and was disappointed by the reviews. I put off watching it because I feared how bad it would be. I am glad husband finally decided we should watch it. While it wasn't a great epic movie (it wont take home any Oscars, I thought it was quite good. I think it is human ego to pick apart a movie, editing, language, character chemistry. Just watch the movie. There wasn't anything dull, it never dragged. Not historically accurate, but so what. Blah, Blah, Blah. It's a movie for crying out loud, get a grip on yourselves, or get over yourselves. I, for one, was entertained, even if I wasn't moved, or uplifted, or enlightened."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "Jay_Exiomo",
        "review_rating": "2",
        "review_title": "Uninspired action movie",
        "review_detailed_main": "Based on a 1987 Norwegian film, \"Pathfinder\" stars Karl Urban as Ghost, a young Viking who was raised by a tribe of Native Americans after being left behind by his Viking father after a raid on the new world. Years later, a new set of Vikings set foot on their land, and Ghost feels obliged to defend his foster people.\n\nWhile the film's acting overall is as frigid as the environment, and that the actors are playing no more than stock characters where, \"Pathfinder\" makes no pretense in presenting itself as a more-brawn-than-brain kind of film.\n\nGranted it's perhaps the case, but the direction of Marcus Nispel is heavily uninspired. Whereas recent films like Mel Gibson's \"Apocalypto\" and Zack Snyder's \"300\" prove that a film with minimal plot can have its moments if it can build up on tension and sustain a viewer's attention, \"Pathfinder\" fails to do so. Action scenes are at most moderately entertaining and lacks a kind of punch that would elevate it into a cinematic status. Attempts to impart emotions fall flat and there's no chemistry between Urban and Moon Bloodgood who plays the the obligatory role of the female sidekick.\n\nOverall, \"Pathfinder\" is a film sorely lacking in impact, that it would leave the viewer in the cold more than it would excite."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "deedeeallstar",
        "review_rating": "7",
        "review_title": "Bloody, action packed and entertaining",
        "review_detailed_main": "I don't understand why this movie is rated so low. 5.4?! Sure it's not a Spielberg spectacular, but it has enough to keep you entertained. Clancy Brown is awesome as a vicious Viking, Karl Urban is good and Moon Bloodgood is one of the most natural beauties in Hollywood. The settings and scenery is gorgeous, the costuming is great and they kill a damn bear in it. Is it perfect?! No. But I am so bored of all the superhero movies that rely on cgi. This is def worth the watch. A solid 7/10."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "suntonova",
        "review_rating": "2",
        "review_title": "The Worst Movie I've Ever Been Dumb Enough to Pay to See",
        "review_detailed_main": "If for any crazy reason you saw a trailer for Pathfinder and thought, \"hey, cool, a viking movie!\" stop right there. This movie totally blew; it blew long and hard and I got no satisfaction from it at all. I actually found myself thinking, \"hmm.... should we just leave?\" I've never walked out of a movie theater, I still haven't, but that was the closest I've ever come.\n\nThe good parts- There was a scene where a guy got his face slashed and the eyeball fell out onto the ground and stared up at him... that was kinda cool. The viking costumes were kinda cool too. There was some good cinematography though- which leads me to the bad parts.\n\nThe bad parts- The editing was absolutely abysmal. My 6 year old niece could've done better with some safety shears and a roll of scotch tape. There were these massive avalanche scenes and some nice panoramic shots that quite obviously did not come from the same stock as the rest of the movie (picture Ed Wood's stampeding buffalo) Most of the fight scenes were so badly edited you weren't sure who was slashing whom and if a hit was palpable or not. In one Ramboesque sequence I wasn't sure if there were 3 guys or 21 guys that all looked like the same three guys. The score, while not technically horrible in its own rite, did absolutely nothing to convey the story. Character development was mediocre when it wasn't null. Acting- bad to horrible- though in some cases I wasn't sure if it was the fault of the actors so much as the Lucas quality script. Did I mention the horrible washed out filters they used? For a while I thought maybe I was watching a cam of the movie. I can see why they used the filters they used, to a point, all the snow scenes could have gotten overwhelmingly bright; that's why you add some color though- or at least you should. Even some face paint or blood or something.\n\nAnyway, that's my rant."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "Enchorde",
        "review_rating": "7",
        "review_title": "Brutal and violent",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "vampyrecowboy",
        "review_rating": "5",
        "review_title": "A good story with plenty of flaws",
        "review_detailed_main": "While the story is good, the flaws begin to stand out.\n\nYes, all the little things that should have been important to the filmmakers in production and in filming.\n\nLike - airplanes in the sky.\n\nIt seems to be winter or early spring but snow doesn't stick to anything, nobody's face or skin turns overly cold or white or purple due to it. Snow doesn't turn to water when collecting on anybodies's face, the pelts they wear do not freeze after they fall through ice into the river Natives have very straight, clean teeth and very clean hair and skin - even after going through battle.\n\nVikings wear heavy amour but move swift, fast and easily through the forest.\n\nClimbing the edge of a mountain, nobody is freezing wearing virtually no clothing.\n\nThere are tire tracks in the mud.\n\nEven though a slew of swords are used and arrows are shot, no horses get injured.\n\nThere are a bunch of things like that - after watching the movie, just begins to make you wonder how this can be thought out and actually given an OK.\n\nSnow that blows all over the place, but in some areas of open space, there is none and then several feet away there is several feet of it.\n\nCaves with light coming in from all directions.\n\nSwords that seem to weigh as much as a can of pop - being easily flung across a field or lifted and swung without much force or effort.\n\nI can go on,but I won't."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "Michco",
        "review_rating": "8",
        "review_title": "Don't think of this as a 'history lesson' ... just enjoy the story.",
        "review_detailed_main": "This film was very good. I really think the viewers should not even think about it being a 'history lesson' at all. It is very much a Frazetta style picture, with almost exactly the 'Death Dealer' painting portrayed. So with that in mind this is a movie of possible unknown 'raiders' who are just *way* too brutal and they just want to kill and maim and they need to be stopped at all costs by the natives of the land ... and so they need a hero.\n\nI think this film is at least twice as good as \"300\", and here's why: although it has almost exactly the same 'graphic novel' look and feel, I like this film more because the storyline was very engaging, great characters, costumes, and cinematography. As you watch the movie each scene is distinct and new and really is memorable, and if you *really* squint your eyes you might even believe it (like 'Lord of the Rings'). There is lots of gore (heads lopped off, etc.) but that is the current styling of films anyways; I could do with a little less of it myself.\n\nI loved the natives and how they're portrayed. The costumes and sets are fantastic! There's a bit of their mysticism, and honour (warriors are very 'brave'), and real sense of tribal bonding and family.\n\nPS. Watch the DVD extras and you really 'get' where they were going, (who cares about the vikings having horns??). It's just a great movie, and for story this is great! Thanks to the cast and crew !"
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "Aaron1375",
        "review_rating": "7",
        "review_title": "Rather good bloody action, however lots of dead scenes as well.",
        "review_detailed_main": "This movie was pretty good for the most part. Nice visuals and great action here and there. With that came a few pointless scenes (the strange dream sequences) and a conclusion that could have used a bit more sword fighting. The story, vikings have come to North America with seemingly no other purpose than to kill. What can stop them? Well looks like a storm took some out killing everybody on board a viking vessel leaving only a boy alive. He is taken into the care of the Indians. Well guess what? The vikings return and to their surprise one of the natives can take up a sword and slice and dice them. So what are you in store for, lots of head chopping and blood spurting. Unfortunately, at a certain point in the movie it gets a bit tiresome as the hero leads said vikings here and there trying to take out their numbers using nature. Not that it is all bad, but these scenes are a bit overlong and protracted. I preferred him hacking away with his sword. Still, it passed the time nicely and there were some great scenery shots too. The mountain looks particularly good. It probably helped that I watched this movie on blu-ray too, as this made the scenery shots really stand out. So despite its flaws and lack of any stars, for the most part this movie was entertaining and passed the time rather nicely."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "dvpumas",
        "review_rating": "1",
        "review_title": "END CONTAINS SPOILER -Historical nonsense, bad acting and lame action: here is the path you choose",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "Black_Wolf",
        "review_rating": "1",
        "review_title": "Insult",
        "review_detailed_main": "This movie must have been made as an insult to every cultural heritage it involves. Being a Norweigian myself, and having the Viking heritage i get really insulted by the way Vikings are shown in this film. I'm pretty certain the producers have only the faintest idea of what a viking really was. And I can only imagine how a native American must feel about this movie.\n\nI do not consider myself a movie critic, I can usually watch a movie and forgive just about any logic flaw and still enjoy the movie. But this one I really can't forgive. First of all there is the storyline (if any), then there is the fact that the vikings have horses and look like some characters from spawn or something. (Vikings never really used horses in war, and never actually brought them with them over the bloody Atlantic. And they sure as hell didn't dress up like some cartoon characters from hell. with horns and tattoo's and so on) Second there is the dialog's, every line performed by the Native Americans are flat, emotionless and sounds dubbed. Its like they made it all in one go. All the lines performed by the vikings seems like gibberish, except a couple of words here and there. The only thing they have put any time and effort into it seems is the totally mindless violence and scenery (witch is beautiful BTW.) Now Vikings were violent, but this is absolutely idiotic. They were raiders, not out performing genocide just to build a house somewhere. This is ridicules and I'm tired and angry. There's a shitload more I could say, but its just to much..."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "Carlyn N.",
        "review_rating": "7",
        "review_title": "Not a Complete Waste",
        "review_detailed_main": "I had a lot of negative expectations about this \"White man come to save the poor Indians\" movie going into it, but there were quite a few things in it that surprised me. While I won't be telling my friends that this is a must-see movie, I don't feel like I wasted my money.\n\nThe movie is based on a legend (which in themselves aren't known for historical accuracy) so there was no need to expect the History Channel version of the tale. The beginning was pretty much as I expected (Viking boy rescued by Indian woman, comes to be part of Indian people) and I thought the violence would be never-ending. Once more dialogue developed between the remaining characters and things sort of \"calmed down\", the story turned into a real survival tale that grabs and holds your attention, even if it's not Academy Award material.\n\nThe thing I really hated about some of the fight scenes in the beginning were that they were filmed in a way that you could not really see or understand some of the things that had just occurred. You know somebody got killed or sliced really bad, but it was hard to tell where or sometimes how. Some of the shots were so close to their subjects, they were a blur. The acting didn't strike me as being cheesy. I thought most of the performances were OK and Karl Urban made you feel for his character.\n\nOverall, it's not the best action flick out there, but there things in the plot that aren't totally predictable which makes pretty decent."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "lukem-52760",
        "review_rating": "5",
        "review_title": "A BRILLIANT FANTASY WARRIOR FILM & KARL URBAN IS EXCELLENT",
        "review_detailed_main": "\"Pathfinder\" is one hell of a brilliant intense historic warrior adventure film about a young boy who is saved & raised by Native Americans but is the last survivor of a Viking expedition & years later as a young man he must defend his village against another brutal Viking expedition. That's the basic set up for an Awesome ultra-violent warrior movie. This epic action adventure is visually stunning & striking with just fantastic cinematography & a scary dark look & Atmosphere, also this film is Directed by the BRILLIANT Marcus Nispel who directed one of the greatest Horror remakes of all time with his visually striking & terrifying \"The Texas chainsaw Massacre\" from 2003!!! That movie is even better than the original 70's CLASSIC!!! He is a visionary director full of style & an exciting vision, i love both of these films. Also we get the veteran actor Clancy Brown as the head Viking villain \"Gunner\" although you probably wouldn't know it because of his huge beard & helmet & Armour but he does make for a huge menacing presence on screen. The excellent but underrated KARL URBAN is fantastic here as \"Ghost\" the warrior with hate in his heart & a quest of bloody vengeance, mr.Urban is a great actor & screen presence & he blew me away with his portrayal of the tough futuristic Cop named \"Judge Dredd\" when he played him in the 2011 Cult Classic \"Dredd\" & he was excellent there & is excellent here in \"Pathfinder\" so yeah he's a great actor & I'm a big fan!!!\n\nThe look of this epic adventure is drained muted colours so it looks dull, gloomy, dark & scary almost like a Horror film & the big Viking warriors are scary as hell, they are huge with big metal armour & big horned helmets & animal skins & really look terrifying!!! The Vikings are merciless & savage as they slaughter their way through villages of helpless people including women & children, so it's AWESOME when our warrior hero \"Ghost\" starts to hunt them down & slaughter them in Cool ways with traps & weapons. Like i said the look is great & gritty with beautiful shots & scenes mixed with the Horror of savage killings & the killings are brutal & blood soaked, this is a very gory film as it should be & \"Ghost\" really delivers on his quest for bloody vengeance & the evil Vikings deserve their deaths.\n\nI was on the edge of my seat watching this excellent film as it was tense & gripping, \"Pathfinder\" is definitely one of the best \"Warrior\" films I've ever seen!!! Definitely one of the most entertaining & exciting one's too!!! I can see this is another way underrated yet brilliant movie with an excellent lead in \"Karl Urban\" but i loved it & consider this a \"Cult Classic\" in my opinion. Terrific,Tense & exciting"
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "peguerite",
        "review_rating": "7",
        "review_title": "Karl Urban",
        "review_detailed_main": "I've read quite a few of the other comments from other people and I must say that I think they should all take a look in the mirror and try making a movie of their own before they dog on someone else so badly. I wanted to see this movie because I think Karl Urban is a fabulous actor and I thought it was high time that they gave him a movie of his own. For those other nerds out there who remember him from Xena and Hercules, he played four or five different characters in those shows. I was so excited when I saw him in Lord of the Rings and even more so when he was in Chronicles of Riddik. I would like to say that, for those of you who keep whining about \"boo-hoo, the dialogue, the dialogue\" , it takes much more talent to act with a minimum of speaking. When you have to convey everything about a scene with just facial expressions, a look in the eye, or few words, that raises you above all of the mediocre actors who couldn't cut it if they had to do that. Remember that next time you want to whine about something. If you think it's so horrible, shut up and make your own movie and then let me be a critic. Children!"
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "TheEmulator23",
        "review_rating": "5",
        "review_title": "Not as bad as thought",
        "review_detailed_main": "I know movies plain and simple. Was this great... no, but was it pretty mindless entertainment...yes. My main complaint was that the original villain Kurgan Clancy Brown from the Highlander movie was barely noticeable through all of the film. He had so much beard, helmet, paint, and just plain armor and you couldn't tell who he was. Only way I knew him was because of his voice and Eyes. One of his best underrated and too soon canceled programs the Showtime series \"Carnivale\" showed just how good he is at being bad but at the same time kinda good. Anyway back to the movie, it's main problem is the awful editing, It had some pretty decent action scenes but they just cut so quickly and you never get a hold on what you are seeing! My other complaint is that all the Indians speak English. I can understand this happening 20 years ago, but are we really that lazy that we can't read subtitles? Especially in this day in age, do we have to put all films in English? It sounds ridiculous and remember \"Crouching Tiger, Hidden Dragon\" did over 100 mil. U.S. and it was subtitled! The script also seemed repetitive sometimes as well. And whose Idea was it to not give the main character any lines 15 minutes into the movie? Well just don't ask too much of the film and it should be OK."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "TheLittleSongbird",
        "review_rating": "7",
        "review_title": "Visually spectacular with stirring music and inspired action scenes; not so strong in the story and script department",
        "review_detailed_main": "On the whole, \"Pathfinder\" is a decent and watchable film. Far from perfect, but I personally didn't think it is as bad as people make it out to be. Visually and technically, there is next to nothing wrong with it. The sets are stunning, with towering mountains, tall trees and very white snow, and the cinematography is stunning. Also the costumes are wonderful to look at, and the makeup particularly on the Vikings is outstanding. The score is stirring and brings real dramatic weight to the more tense scenes. The action scenes are truly spectacular with heavy emphasis on violence and a lot of chaos. However, the script is not as strong not absolutely terrible but parts are a little stilted. The story here is simple, I have no problem with films that have simple stories, but while there are a number of fast paced action sequences, the slower scenes are rather drawn out and very little happens to maintain interest. Also the pacing is uneven, too stodgy in places, however the acting ranges from good to so-so, Rusell Means in particular is very dignified in the role of Pathfinder. Overall, decent film but not a masterpiece. 7/10 Bethany Cox"
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "norwegiangoat",
        "review_rating": "1",
        "review_title": "I never thought it was possible",
        "review_detailed_main": "Norway is not well known for making better films than Hollywood, but in this case they are. The Pathfinder is historical vomit and should never have been made under those circumstances. Vikings with bigger horns than swords. They looked like wrestlers on steroids. The action was boring, predictable and a mere copy of action sequences in b-films. The photography and lighting was cool. Except that the photography was so caught up in following the rules, that it was like watching a music video. And who wants to watch a two-hour music video? All in all, very little excitement. If you want to watch a better pathfinder - find the Norwegian version \"Veiviseren\". I got to go puke!"
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "ekawalaski",
        "review_rating": "8",
        "review_title": "Little Story Well Made",
        "review_detailed_main": "I have read many comments here that hated the film. One of my friends who accompanied me to the screening disliked it as well. He thought it was a waste of time, too. Unfortunately, many viewers, such as my friend, miss the point, as they in fact look for a point.\n\nUnlike the new trend of films of this era, \"Pathfinder\" did not submit to the theme of freedom, the political freedom. None of the characters pronounce the word freedom, such as the main character of the film, \"300,\" who shouted it out loud. Instead, the main character of the film, Ghost, battles himself and \"his demons\" in order to find his own freedom and to fit in. Ghost tries to look for the peace he was raised in.\n\n\"Pathfinder\" challenges the modern stage of film-making, and re-introduces a somewhat Western ideology that John Wayne's \"The Searchers\" had introduced in 1956. Therefore, the audience has to place themselves in a position to examine each character-groups' point of view. In that respect, the film offers some depth to the little story that is filled with violent battle scenes.\n\nThe battle scenes are enjoyable. There is a certain level of combat cruciality. That is also a part of the little depth the story gives us. Thus, the issue of good and evil surfaces in the film in how battle is a balancing aspect of the life each side's lives.\n\nOf course since this film is trying to appeal to the general audience, a certain degree of love and romance is involved. The love and romance of this film is actually not all-so-bad, although I am not quite found of. However, it brings a little strength into the issue of choice of life Ghost must endear.\n\nI think \"Pathfinder\" lives up to its own introduction, \"Legend.\" Therefore, it is filmed as such, an old legend. The film-makers saw it as such, and they wanted to let us see it too. I know I did. The dialogue(s) is not the perfect one, but must resemble the simplicity of older times. I do not think this is the greatest film ever made; however, it is a well made film which I think people will enjoy its little story, if they can go past the neo-ideology and \"what's the point?\" issue."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "kevinoreilly-47281",
        "review_rating": "7",
        "review_title": "100% historically accurate except",
        "review_detailed_main": "Bart the Bear was not using authentic Brown Bear Dialect of the time period which was highly offensive to the Grizzly community, an outrage. And I believe that one of the Native American actors was named Stephen which is not an authentic American Indian denomination, a travesty. I also noticed that Karl Urban was in the movie and he definitely wasn't around during the time period that was clearly defined by the film makers during the opening scene, very misleading. Also the stereotypical battle cries of the Native Americans were hauntingly similar to that of Ewoks on the Forest Moon of Endor which was very unsettling for most viewers. Furthermore at certain points during the film the American Indians were speaking English, completely contaminating the otherwise 100% historically accurate portrayal of the famous Viking/Indian war. But overall it was an enjoyable picture!....this was intended to be a parody of other reviews that complained of historical inaccuracies."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "hpipik",
        "review_rating": "1",
        "review_title": "Bad, Bad, Bad",
        "review_detailed_main": "Uninspired throw-back to the bad old days of stereotyping and demonization, except the people being demonized in this worthless film are Europeans.\n\nYoung Viking lad is left alone and scared on the shores of N. America and is adopted by the natives. Almost before the opening credits have finished, we learn that the natives are noble and the Vikings are savages. In fact, the Vikings do not even have faces. Even in the rare instances when they take off their bizarre helmets, you cannot see their faces through their beards and their encrusted filth. The natives, of course, have kind, open, beardless faces that radiate warmth and understanding.\n\nYears later, the boy is all grown up, just in time to fight another gang of Vikings, who appear to want nothing but to butcher the natives. The end.\n\nPlot: not much. Character development: forget it. Music: can't recall. Direction: pointless. Action: dull (yes, there is a lot of blood and gore, but somehow you just don't care).\n\nBlooper: early on, Ghost explains to his tribe that the invaders wear a kind of skin that cannot be pierced by stone arrows (i.e., armor), but for the rest of the movie we watch natives killing Vikings with---stone arrows.\n\nReally, if you want to see some great historical fiction about the Americas, forget this tripe and try: \"Black Robe\" and \"Apocalypto\" (I know there are some others, but I can't think of them right now). In fact, you might want to compare movies to see how great the others are and how awful this one is."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "filipemanuelneto",
        "review_rating": "2",
        "review_title": "A historian should not watch this film without a medical team nearby.",
        "review_detailed_main": "My problem with films set in the past, or about historical facts, is that my academic background in History prevents me from lightly accepting everything that the filmmakers want to make me swallow. That's why I was so harsh in the reviews I wrote about some films here, and everything indicates that, to major sadness of my heart, I will continue to have this problem. Okay, cinema must have its creative freedom, and it is also necessary to fill information gaps (we don't know everything about the past), but even creative freedom must recognize logical limits.\n\nToday, we know without a doubt that Scandinavian navigators - who have been called \"Vikings\" - were the first Europeans to arrive in North America. What we still don't know is whether they were aware of it! Could they have maintained contact with Native American people in the region where they landed? Personally, it seems clear to me. Were there conflicts? I don't know, archeology might discover more about this. Is it legitimate to say that the Vikings discovered America? Yes, if we find out that they knew they had arrived at another continent. Until then, no: not even Columbus had that awareness.\n\nThe film takes this first contact between Amerindians and Europeans and creates a story of blood and violence: on the one hand, the Amerindians are portrayed as simple, friendly peasants who live in harmony with nature and who have their land invaded, and the Nordics are bloodthirsty savages who kill for pleasure. Furthermore, the script uses the historical fact to draw a parallel with the future European colonization of America in which, supposedly, Europeans return to invade and massacre \"inferior\" peoples for the pleasure of seeing blood flow. These are parallels that I even understand, given the modern need to demonize any European colonization enterprise. Current society, especially in the Americas, feels the urgency to condemn the colonial past of the Old World, forgetting that it is a daughter of that same world and that it is not so different from what it was in the past, in vices and virtues. These kinds of parallels and revisionist needs reveal a lot about the way we see the past, and are enemies of historical truthfulness.\n\nIn short, this is what makes this film a piece of garbage that I don't recommend to anyone, and to these problems are added the usual untruths and factual errors about Vikings, from the damn horned helmet that everyone should already know is pure fiction to the indistinct use of any apparently medieval sword, apparently Arab horses and many iron armors, made with technology that would only appear four hundred years later. I'm not the best person to talk about indigenous people, but I believe that experts in the culture and traces of these people may have some heart problems after seeing this film.\n\nIs there anything good in this movie? Well, yes... the film was very well filmed and makes good use of the landscapes and filming locations. For action fans, the film has good fight scenes, well choreographed and quite creative (sometimes even too much). The soundtrack isn't bad, it does its job flawlessly. Russel Means was pretty decent in his role, but he's literally the only member of the cast to deserve any kind of spotlight, and I can't even consider him doing a remarkable job."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "nulir",
        "review_rating": "7",
        "review_title": "Could have been great",
        "review_detailed_main": "It could have been an excellent movie, if they hadn't gone so WAY overboard with the Viking armor. They look like they just left filming as uruk-hai in lord of the rings.\n\nBut if you can look past that and like Karl Urban and Clancy Brown, it's a fun film."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "hollyhawkz",
        "review_rating": "1",
        "review_title": "Insulting to both First Nations and Viking Nations!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "suprez",
        "review_rating": "6",
        "review_title": "Average movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "kaarvok",
        "review_rating": "1",
        "review_title": "SPOILER: There are no vikings in this movie.",
        "review_detailed_main": "I had been told that this movie was bad, but still I was unprepared for this incredible stupidity. There is not a single redeeming feature \u0096 or a single detail reminding me of my ancestors in this movie. Allow me to expand on that. Let me begin with the obvious. By now most people already know that the vikings didn't have horned helmets. Nor did they have spikes or wings on their helmets, or their ships! They used simple yet ingenious helmets of hammered iron or steel, sometimes with a nose-guard attached. They were used to fighting in close formations, so any unnecessary protrusions in armor would be avoided. They often fought much like the romans in close ranks with shields up front. From behind these shield-walls, they wielded long-shafted axes.\n\nThe vikings used plain leather and chain mail armor. If they ever used pieces of plate armor, it would have been salvaged from a battleground after a fight, like the plate armor used by the viking leader in the 13 Warrior.\n\nThe vikings never had the word «viking» in their vocabulary. It is a relatively modern term. The vikings who sailed to America were Christians with no intent for slaughter or pillage. They were traders and settlers. The viking era was behind them, ending in around 1030.\n\nIf you get the chance, see the original Pathfinder movie Ofelas, made around where I grew up. It is a lot better.\n\nNot much else to say. There are no vikings in this movie, and no story. «They came, they slaughtered, they \u0085» well, no spoilers here, but you get the idea. Bad dialogue, no direction, badly cut, horrible pacing, and the movie is too long considering the content. Would have been great as a power metal video on TV though."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "MLDinTN",
        "review_rating": "6",
        "review_title": "lots of fighting lots of action",
        "review_detailed_main": "Pathfinder was pretty good for an action film. It had lots of battles, limbs being severed, someone even gets drawn and quartered. Very gruesome. The Vikings are sadistic and love to torture the Indians. The main character, Ghost, was pretty cool. He was adopted by the natives when left behind as a young boy by the Vikings. When the Vikings come back to attack when Ghost is much older, he is now the hero. He manages to handle many vikings and kill them all. He also has the girl he likes and another Indian tagging alone. He eventually gets caught and must take care of the vikings before they kill the rest of the tribe.\n\nOne weird thing was the Indians speak perfect Engligh, while the Vikings are subtitle. And Ghost remembers how to speak viking, amazing.\n\nThe film is filtered to take out a lot of the light. Therefore, we don't have graphic gore since the blood almost looks black. But it gives the film a neat effect. It helps hide the low budget the film had.\n\nFINAL VERDICT: OK, certainly not one of the worst action films out there."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "KoscheiTheDeathless",
        "review_rating": "1",
        "review_title": "Would Indians even know what a dragon is?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "jdavisjdavis",
        "review_rating": "9",
        "review_title": "Completely underrated",
        "review_detailed_main": "Truly a gritty movie with great action, ancient culture, a little history, and a hint of fantasy. Loved it. I don't understand the negative reviews. Maybe people went in expecting a Spiderman movie or something overly cheerful and heartwarming. This isn't 1980s Disney, so don't expect such. This movie is about barbarism, warfare, clashing cultures, and the people that are affected by these things.\n\nLoved the main character. Loved the native American people that took him in. Dug the Dances with Wolves sort of vibe there... seemed really genuine and not overly stereotypical of the Indians. The vikings were awesome as nearly fantastical creatures, but actually just really \"evil\" men. But really they didn't overdo the good vs bad thing... it was enough to keep you rooting for the good guys, but it wasn't an Avatar-like pound a hammer over your head type of message.\n\nJust watch it if you like fantasy or action movies. Well worth it. Way better than a lot of movies out there by far."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "northernweasel",
        "review_rating": "6",
        "review_title": "Beautiful cinematography, good concepts, action?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "Tristan-21",
        "review_rating": "1",
        "review_title": "Hollywood Propaganda at its most Hamfisted",
        "review_detailed_main": "No one writes a book or a film without some sort of angle. Most, especially those who are only marginally talented, will write with one overarching objective: to get his screenplay made into a movie and have a tidy payday. How to do this? Appeal to the powers that be who hold the purse strings. With political correctness raging world wide with an unassailability not seen since the Inquisition, few studio honchos would allow a film to be released that portrays Norsemen in a positive light. Whether it be by fashion or plot, White people can only be evil in Hollywood's eyes, and those of Germanic heritage, be they Norse, German, or English, are the very worst of all. The message of course is to feel BAD about yourselves, White Folks... you are all evil. Your only salvation is to fight against your fellow Europeans on the side of political correctness and kill your evil white brothers in the name of whatever \"oppressed\" race is the social liberal toast of the day. If you watch this film, you will find it very hard not to see it for the \"hate whitey\" propaganda it is, since it is really one of the more blunt and offensive examples of this I have ever seen. If you want to see another, watch King Arthur. Same sort of anti-Germanic dreck, though somewhat more watchable than this awful film."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "macadam122",
        "review_rating": "5",
        "review_title": "Action in the snow",
        "review_detailed_main": "Just switch your brain off and go along for the ride. Strictly clichéd, but lots of action. Everything way over the top. Colossal amounts of gore, lots of gross-outs and in some places it's too dark to really see what's going on (if you're a gross hound like me). Karl Urban strips down well and should get his kit off more often. The baddies are clearly defined (liked them speaking Icelandic, by the way) the goodies are appropriately unable to fight back and our hero does all the hard work. Didn't love it, and wouldn't go out of my way to watch it again, but it was alright. In the great scheme of things, I've seen a lot worse. I've seen a lot better too, but it's not as bad as some of these other comments have suggested. As I say, clichéd, no surprises and probably one I'd be happy to watch on TV."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "deloudelouvain",
        "review_rating": "6",
        "review_title": "Good cinematography, plot could be better.",
        "review_detailed_main": "There are some good things and some lesser good things about Pathfinder. The cinematography was the best thing about this movie. Dark ambiance because of the dark images, nicely shot even though it might not please everyone. The fighting scenes are pretty brutal, which is normal if you want to tell a Viking story, as they were not really choir boys. As for the lesser good things I would say the plot. The story is okay but is just not that interesting. The acting could have been better as well. But overall it was a movie worth watching once, especially if you like it to be a bit violent and bloody."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "reventropy2003-1",
        "review_rating": "1",
        "review_title": "They didn't even take me out to dinner.",
        "review_detailed_main": "Before f***ing my heritage. The film starts out with a message to the viewer that reads something like \"600 years before Columbus Vikings tried to conquer the new world.\" Well, that's close to what happened, but not quite on the money. See.. A few viking (AKA homesteaders) ships left Greenland to set up camp in Nova Scotia because the Vikings were in search of better lands.. Some hostile Indians killed one of the Vikings and so they went back to Greenland. Maybe this isn't the most exciting story to tell, so I can deal with some embellishment. But hold on now.\n\nVikings that wear 50 pound horned helmets to look menacing. Vikings who speak bad Icelandic (I've only been studying it for a couple years and I could tell). Vikings who care not for plunder, but instead to simply destroy all that is beautiful in the world.\n\nI just want the reader to imagine a role reversal. Crazy savages bent on destruction invade a Viking encampment just to see what the blood of white skinned children tastes like. They dress in wolf skins, don't bathe, and laugh at any resistance while kicking over baskets of berries and burning everything in sight. You won't ever see this in a film made after 1940. Why? Not because it isn't entertaining, but because liberal Hollywood knows very well who it is PC to dress up as the villains. They know that sympathies for native Americans run deep because on some level Americans feel guilty about how they WERE raped and plundered by Columbus and his progeny of goons.\n\nNow is about when you are going.. Man.. You're taking this way too seriously. Look at it for it's entertainment value.\n\nFirst of all, people with this attitude disgust me. These are the types that think entertainment is more important than history. You are exactly the kind of person who is willing to be duped by Fox News propaganda and the country would probably be better off without you.\n\nBut... Needless to say I did try to be entertained. The sled chase scene ala Willow was pretty cool, but it's hard to enjoy a film where all of its redeeming qualities were plagiarized. See:\n\nPathfinder (the first one), Willow, Predator, Last of the Mohicans. etc.\n\nTo sum things up this film was a cut and paste version of several other films. The acting was the worst. The editing was a close second. The plot made no logical sense and was something I would even call racist in the 300 sense of the word. Don't even rent it if you value the fruits of your labor."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "joncha",
        "review_rating": "6",
        "review_title": "A comic book or video game",
        "review_detailed_main": "\"The 13th Warrior\" meets \"Prince Valiant.\" The is a comic book/video game treatment of a bloody, violent story where most of the budget apparently was spend on hand-to-hand (or sword-to-sword) fighting sequences. It appears there wasn't enough time to develop the story a little more, to give the film more depth. For example, \"Fifteen years later\" jumps quickly over the young norse boy's adoption by the Native Americans to him being a young man accepted by the tribe, appreciative of the love and devotion of his adoptive mother, and attracted to a beautiful young woman, with another man as his bitter rival for her affection. Some scenes could have been devoted to the rites of passage necessary to turn young boys into a warriors, and also of the nature of the boy's acceptance by the tribe as one of them. At least a \"B\" movie today (with mostly unknown actors) can have quality production values that make watching it a guilty pleasure if not an appreciation of quality filmaking."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "maralily",
        "review_rating": "1",
        "review_title": "Horrible movie",
        "review_detailed_main": "Most of it made no sense. The vikings were one dimensional with no motive for doing anything, nor any consequence, good or bad. The thing that annoyed me the most is that the viking child at the beginning had blond hair and blue eyes. The chief even pointed this out in a scene.\n\nHowever, Karl Urban has very dark, almost black eyes, and very dark hair. He almost looks like the Indians. My husband and I went to see it today and we both have placed it on our list of worst films. And I like Karl Urban, but this movie is awful.\n\nThere seemed to just be hack and slash with no plot. Was there a plot? If so, I couldn't find it. There was also no visual texture. Every scene looked the same, in a hazy blue filter with nothing to stimulate the eye, except some blood splatter."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "magratk",
        "review_rating": "6",
        "review_title": "Ghost is just this guy, you know?",
        "review_detailed_main": "I normally enjoy Karl Urban films way out of proportion to their reviews. Here, he was acting his heart out. I believed in him. He was defending a stunningly beautiful land. Props to the cinematographer. But the dialog was cringeworthy. The Vikings were unrecognizable. Don't get me wrong; that side of the family was a rapacious bunch. But they didn't \"purify\" lands. Simple pragmatism: there wouldn't be anyone to raid.\n\nI was amused by the Native Americans speaking English and the Vikings speaking . .. Icelandic? something that sounded like Old English. Good times.\n\nThat said, the dialog needed a final hard edit. I'm wondering if Russell Means had some sort of dialog approval, because all his stuff was just fine.\n\nSome quality violence. It was fine. I'm a girl who loved Doom, so it's not like my standards are all that high, at least if Karl Urban's in the film, but . . . man. The good guys are too good (with a few glaring exceptions) and the bad guys are too bad.\n\nI did like that our hero listened to Russell Means. People should."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "imbubbasmom",
        "review_rating": "5",
        "review_title": "Thumbs way down",
        "review_detailed_main": "I went to see this movie because of Karl Urban, who is seriously undervalued by Hollywood, in my opinion. After this movie, he still is. His character was badly written (in fact, ALL of the characters were badly done), the editing was horrible, and there was so much scenery-CGI it was next to impossible to see what was going on. Too many closeups during the fight scenes made for very poor watching, too. The whole movie was colorized to make it appear shades of gray, so that it was very hard to tell night from day. Except for Mr. Urban's, I couldn't tell from the characters' interactions if they even had names. All in all, I wish I had waited for the DVD to come out. Or not..."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "victor89",
        "review_rating": "9",
        "review_title": "A very decent outdoor action flick!!!",
        "review_detailed_main": "Overwhelmed Native Americans armed with stone knives and tomahawks versus vicious, bloodthirsty Viking raiders clad in leather skins and furs, heavily armored, and wearing fearsome-looking headgear brandishing long steel swords, steel arrowheads, and very pointy maces attached to long, heavy chains. They ruthlessly spare no one.\n\nThat pretty much sums up this worthwhile flick.\n\nVikings had conducted numerous raids against European towns and cities during the period's Dark Ages, plundering their wealth and sometimes slaughtering their inhabitants. It's highly doubtful that Vikings had ever molested native Americans in our hemisphere. In reality, however, from the 16th century up to the late 19th century, settlers and soldiers from the western European countries (ironically perhaps, many of them descendants of the Viking raiders' victims) will eventually do to them what the Viking brutes had fictitiously wrought against the Indians in this movie.\n\nIf you relish slaughterfest films such as those featured in the \"Conan\" and \"Lord of the Ring\" movies, then you'll like this one."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "fedor8",
        "review_rating": "",
        "review_title": "To kill a bunch of Vikings efficiently, it's best to convince them to go mountain-climbing.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "shushens",
        "review_rating": "7",
        "review_title": "Deserves Respect",
        "review_detailed_main": "A lot of people out there make big budget cliché-ridden movies all the time. A large number of them are not worth remembering. Some are not even worth watching. But in this movie, cost effective entertainment has been maximized. There is no big shot actor in here, but it is a well-crafted piece of cinema. Not deviating from what the movie is about, (Viking-exterminating while keeping the girl safe, of course!) director Marcus Nispel (evidently, he knows the appeal of gore!) never bores his viewers for a single moment. No nonsense dialogues, engaging score, low light environments with a touch of myth, (ash coloured filter does its magic) this movie is not at all a bad investment of time and rental money. Many has compared it with Conan or Tarzan. But this movie is better than any Conan any day, (apart from the consideration of nudity, since this movie really doesn't have any) because it showed all it could afford to show, i.e. a pure adventure movie, not a CG extravaganza that never really could set a standard for anything."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "keiichi73",
        "review_rating": "1",
        "review_title": "Follows the path of mediocrity",
        "review_detailed_main": "It's impossible not to think of 300 when you're watching Pathfinder. Both are very loose accounts of historical battles that seem to be inspired more by video games than history. To be fair, this movie was filmed and finished long before the film adaptation of 300 was, as Pathfinder has been sitting on the studio's shelf for almost two years before finally being released. This is also where the similarities come to an end. 300 was a gloriously stupid movie that still managed to entertain thanks to some striking visuals and well-staged sequences. Pathfinder, on the other hand, is so murky and muddy you almost feel like you're watching the movie through a dirty window at times. There's very little story to speak of, and no real characters to give anything resembling emotion. All the movie gives us is some ineptly edited action sequences, and a lot of over the top gore that isn't even presented very well to begin with.\n\nThe film attempts to depict a struggle between a noble Native American tribe and some vicious Vikings. Because the Native Americans are the heroes, they speak English, while the evil Vikings are sometimes subtitled, but usually speak in grunts and bellowing demonic roars that sound like they were lifted from a Godzilla movie. While exploring the ruins of a Viking ship, a woman of the Native American tribe discovers an abandoned boy that the enemy left behind. She takes him back to her village and raises him amongst her people, where he grows up to be an appropriately muscular and personality-free young man who goes by the name of Ghost (Karl Urban from Doom) because of his pale skin. When Ghost's original clan returns 15 years later to continue pillaging and plundering the innocent tribal people, he teams up with a small band of survivors to fight back. Numerous heads are removed from their proper place above the neck, blood and limbs fly at the camera, and we can't help but realize how dull and uninspired it all is.\n\nThe only surprising thing about Pathfinder comes during the ending credits, when we realize that the characters we have been watching for the past 90 minutes or so actually had names. Aside from the heroic Ghost, I do not recall a single other character's name being mentioned in the dialogue. Kind of makes it hard to figure out who played who at the end, since the entire cast is made up of faceless drones who all look alike and exist simply to be killed in the film's many action sequences. Besides not having names until the very end of the movie, the characters don't seem to talk much either. I wouldn't be surprised to discover that dialogue makes up maybe 40 minutes (and that's being generous) of the film's running time. The lack of dialogue make the characters impossible to identify with or even understand their slightest motives. Things keep on happening, but it leaves absolutely no impression on us. When the characters do open their mouths, what they say is often so laughably bad that we look forward to them being silent again. Ghost may be the hero, but he doesn't say a single intelligent thing in the entire screenplay. You get the sense that he's the lead by default, rather than for his personality.\n\nAll of this could have been forgiven if Pathfinder's action sequences were anything special. Unfortunately, director Marcus Nispel (2003's Texas Chainsaw Massacre remake) seems to have no idea how to stage or shoot a battle sequence successfully. He uses a lot of dramatic slow motion shots as the enemy approaches, and then whenever people actually start fighting, he suddenly shoots the battles so tight and so close to the action that we sometimes can't even tell what's going on. It's just a mess of blood and flying body parts that has been edited so sloppily that we can't tell who is decapitating who. A sequence where a man battles with a ferocious bear is particularly humorous in how badly the entire thing comes across. Since the fights make up a good portion of the story, I quickly lost interest and found myself asking why anyone would want to watch this. It is a 90 minute long black hole that sucks the time and money away from anyone foolish enough to venture into a cinema showing it. It can't be bothered to entertain or excite us, or even give us a very basic thrill. The film's visuals seem to have gotten about as much attention as the dialogue, and often look dark and bland.\n\nAt the very least, Pathfinder is mercifully brief and manages to go in one ear and out the other without leaving too much of an impression. A lot of money was obviously put into the project, and I can't help but wonder where it all went. Watching this movie is a lot like watching money being burned right up there on the screen for no reason at all. It can't give us a reason as to why we're supposed to be entertained, so all we can do is wait for it to be over. When the end finally did come, I didn't feel relieved or happy. I actually felt about as indifferent as I did throughout the rest of the film. Pathfinder accomplishes nothing at all and gets exactly the kind of reaction it deserves."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "Bill357",
        "review_rating": "3",
        "review_title": "Politically Correct Nonsense",
        "review_detailed_main": "This is probably one of the greatest disappointments ever filmed.\n\nIn an attempt to placate people constantly offended (like the always offended star Russell Means), a potentially excellent action movie was ruined by political correctness.\n\nIn Pathfinder the white European Vikings are portrayed as subhuman monsters that kill anything they come across, even when it would be advantageous to leave well enough alone, while the natives are portrayed as peaceful, intelligent hippies that don't know the first thing about fighting and live a communal lifestyle that would make the denizens of Haight-Ashbury proud.\n\nThe truth is that primitive man (all of them) were rather brutal to one another. The North Americans were no exception. In Pre-Columbian America the native people waged savage battles for survival, there was genocide, some cannibalism even. There were warring tribes and truces and treaties, some were even broken. They were just like primitives the world over. Apocalypto was closer to the truth.\n\nIt would have been more interesting to see the crazed Viking hoards battling real Indian warriors instead of the wimpy, neutered characters of Pathfinder of which Karl Urban miraculously (some would say magically) seems to be the only one that knows how to fight back.\n\nMaybe it's because white people are naturally brutish monsters, huh?"
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "ntsci",
        "review_rating": "",
        "review_title": "Apocalypse North, er, I mean Apocalypto North",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "anjelen",
        "review_rating": "7",
        "review_title": "not all that bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "gdane1508",
        "review_rating": "4",
        "review_title": "and I was actually looking forward to watching this movie....",
        "review_detailed_main": "What a joke- this movie has neither an interesting plot nor good acting (although you can't really blame the actors on this one)\n\nI can understand that Hollywood wants the Vikings to be gruesome etc, but this is ridiculous. They look like something out of the Willow-movie!\n\nAnd the fact that one man takes on like 30 vikings and drops them like flies..yeah...\n\nThe movie has some pretty decent action-scenes, but it's filmed so dark that you can hardly make out what's really going on.\n\nI have to add the fact that I like pure action like the Conan movies etc, but this movie doesn't even come close to that!!!\n\nDON'T WASTE YOUR MONEY ON THIS MOVIE"
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "life-shouldbfun",
        "review_rating": "7",
        "review_title": "I enjoyed this movie",
        "review_detailed_main": "I originally saw this in the theater when it first came out and enjoyed it very much. good special effects but not over used. Unlike many movies these days, there was actually a story in this one, and I think that makes a movie much better than just eye candy and loud noises to keep the audience interested. I thought the cinematography was excellent and loved the over saturation of color. I often wonder if the conditions were nearly as cold and wet as they appear in the film, and if it was,how uncomfortable it must have been to perform dressed the way they were. I will have to say that i had originally thought this was another WWF production with some of the acting skills in the movie. It often seemed like they were reading the lines. But besides that, I thought it was a good movie overall. In fact, I own it and enjoy watching it from time to time."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "huzn",
        "review_rating": "2",
        "review_title": "an absolutely terrible film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "chrichtonsworld",
        "review_rating": "6",
        "review_title": "Not that bad!",
        "review_detailed_main": "A movie like this always depends more on action than on story! So people who expect a decent story should find another movie to watch! The plot is simple but effective! It makes you care for the main character! Karl Urban doesn't say much but does have some serious screen presence! The supporting cast,especially the actor who portrays the pathfinder gives some comic relief! Other than that the movie is far too serious! If \"Pathfinder\" didn't take itself so seriously than it would have been better appreciated than it did! As I said earlier this movie is about the action! Bloody and gory! If you like that sort of a thing than you will love \"Pathfinder\"! I must admit that the action scenes have a certain style (slowmo blood like in the cut scenes of ps2 game \"God of War\")! Typical hack and slash! Nothing more nothing less!"
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "excalibur316",
        "review_rating": "1",
        "review_title": "I need a Pathfinder to lead me out of the cinema...",
        "review_detailed_main": "Seriously, the moment the movie started, i knew that this'll be a really long boring film, I felt like walking out. So basically, the plot is that Karl Urban is a viking son that was raised by Native Americans. Years later, the vikings invade the tribes, and now Urban must fight his own kind. I bet you fell asleep reading this. The action is slow and DARK, i mean DARK by you can't see a damn thing. And it looks like they used archive footage for avalanches. Don't see this film. PLEASE! A horrible movie, dark visuals, slow action, lame acting, and tasteless storyline, make up Pathfinder. Urban was better in Doom actually, but that movie sucked too. Don't See this film! It's a waste of time, worst film of 2007. 1 of 10"
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "helencorliss",
        "review_rating": "8",
        "review_title": "Underrated & very enjoyable",
        "review_detailed_main": "I dont get the vitriol about this movie. I'm a middle aged mum not a metal fan lol & I find this movie fantastic. I didn't go into it expecting a masterpiece, & enjoyed it thoroughly. Admittedly I'm a Viking fan in general & feel sentimental about Highlander.. so Clancy Brown was a treat. But I was invested in the characters & found they way they shot it atmospheric. A cross between Apacolypto, Highlander & Vikings.. its ultra violent & quite bleak at times, but never boring with action, romance & a well played out for survival. The Viking were truly unnerving. I liked how you didn't get to know them at all.. made it creepier. Overall it's dark but fun & very much underrated. Moon Bloodgood is great in this."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "PatrynXX",
        "review_rating": "6",
        "review_title": "Weak center, but juicy everywhere else.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "hsartretoocs",
        "review_rating": "1",
        "review_title": "Another White man is bad movie",
        "review_detailed_main": "Why this movie depicts WHITE vikings assaulting poor little Indians is unknown. Possibly just another ANTI-WHITE movie. The story is actually from the Saami folklore. The Saami are indigenous people of Scandinavia and it is about another tribe called the Tjudes. The Tjudes attacked the Saami and killed all but one boy. They used this boy to help them find the next Saami tribe. But instead he led them up a mountain and had themselves tied to one another so that they would not fall. It was dark and he threw his torch over the side and told them to follow him and they plummeted to their death. Both the Saami and the Tjudes are WHITE! Why does Hollywood always have to make movies based on their liberal ideology which always makes WHITE people out to be devils? This movie is horrible not for what it is but for what it is not!"
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "GreenbeardTheEx-Pirate",
        "review_rating": "5",
        "review_title": "good for what it was",
        "review_detailed_main": "I actually enjoyed this movie a good bit. The plot and dialog needed a little more work but all in all it was quite entertaining. People need to learn how to take it for what its worth. If you want a good a cinematic masterpiece go see the Departed, Pathfinder seemed like one of those movies going in that there wouldn't be much of a plot- just a guy fighting for his survival. Surprise surprise, it was exactly what it was. Yah it may not be historically accurate, but come on its a movie. It looked beautiful, the costumes were amazing, the only complaint I have for it visually is that the camera seemed poorly angled at time so as not to give you the best shot of the scene. All in all it was a good time."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "klohenning",
        "review_rating": "",
        "review_title": "Comments on the movie \"Pathfinder\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "dbborroughs",
        "review_rating": "6",
        "review_title": "Visually stunning this film is okay but never seems to be getting anywhere",
        "review_detailed_main": "Vikings come to America to raid the land and no one survives, except a boy who grows up to be Karl Urban. 15 years later more vikings return and the set about killing every Indian they find. Unfortunately Karl has now grown up and is willing to take on the intruders single handedly.\n\nA remake of an Oscar Nominated foreign language film in Lap that was based on the legend of a boy who promised to take an invading army to his people and managed to lead them into the hell of the wilderness, only reset in America 600 years before Columbus. While this makes for a visually stunning film it also makes for a film that is more style over substance.\n\nI saw this film a few months back upon its release to theaters and I found it better than the reviews made it out to be. Certainly no great work of cinema, it does have visuals to spare that are thanks to a completely historically inaccurate depiction of the viking raiders, these are the guys from Molly Hatchet album covers not Sweden or Denmark or Iceland. They are also incredibly vile and evil and completely unlike any accurate account of vikings I've ever run across- which means they are perfect movie villains. The problem is that with all the armor they where you can't tell one from another so the fact that Clancy Brown is their leader is ultimately pointless.\n\nWatching this film again in the unrated form I didn't really notice much of anything different other than copious amounts of blood and limbs flying about.Clearly some, if not all of it, was added digitally which makes me wonder was any of it really necessary. The addition of say 10 extra minutes didn't seem to add anything, except perhaps a sense that the film never quite gets on with it. I don't hate the film, but I really do wish that someone had thought to pace the film better, maybe an occasional fight in real time might have helped (every fight seems to be in slow motion which must add at least 15 minutes to the running time).\n\nIts an okay time killer, and probably something you can wait for cable for."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "jonhe219",
        "review_rating": "2",
        "review_title": "Terrible, terrible, terrible!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "gaeanprayer",
        "review_rating": "7",
        "review_title": "Not great, but....",
        "review_detailed_main": "...I don't understand why Pathfinder was received so poorly. Let's address some of the complaints:\n\nHistorical Inaccuracy - If you want historical accuracy, go watch a documentary. This movie wasn't made to inspire debate on history or for people to be offended by who their ancestors were and how they're depicted. This is a fictional story about one man versus a group of men who destroyed his family. I don't know if vikings were as obnoxious or evil as portrayed and frankly I don't care. No human is without his evil, so to become indignant about something like this is shallow and simple-minded. It's just a movie. Go with it.\n\nBad Acting - I don't see how bad acting can be when there is so little actual dialog in the movie. Perhaps that was the problem? If that is the case, then I would agree. The movie is made to be action-packed, yes, but I would have enjoyed some more in-depth dialog throughout. It seems as though a large portion of the movie's sound is just grunting and sword clashing. But did I believe the protagonist was upset his people were killed? Yep. Did the actors playing the vikings seem evil and unyielding? Yep. Were the battles fraught with real energy? Absolutely. Sounds like fair acting to me, at worst.\n\nRushed Scenes - This one, I agree with, to some degree. The story really could have used much more fleshing out. The movie seems to happen so quickly you may sometimes find yourself feeling \"lost in the sauce\", but not to a point that the movie becomes hard to enjoy. The plot was definitely moved along at a somewhat hustled pace, but it's not as if Pathfinder was to be some deeper-meaning movie that you'd need time to comprehend. It's about a guy that's peeved and wants revenge. How much depth could you possibly need? The scenes are lush and beautiful, the action is incredible, and movies are better fast-paced than sluggish from my point of view. If you cannot enjoy a movie, purely for its entertainment value, then I pity your jaded existence.\n\nI didn't watch Pathfinder expecting to learn something new or walk away thinking differently. I expected to be entertained for an hour or two, and I was."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "brimstone_fox",
        "review_rating": "1",
        "review_title": "Sure, I've seen worse films...",
        "review_detailed_main": "Okay, so just skim through a few of the comments others have posted, and what do you come up with? Horrible direction, shoddy editing, poor cinematography, pathetic dialog, hack-job screen writing, lame acting...\n\nOkay, stop right there. In defense of the actors (who obviously need to get new booking agents) allow me to say this...the director and screenwriter gave the actors unimaginative, clichéd caricatures rather than emotive, depth-filled characters. The actors had nothing to work with, so their work looks weak at best.\n\nIn defense of the screenwriter...well, given the inane dialog, I really have no defense for the screenwriter - except to say that this was probably picked up as a side project for just enough cash to buy a pound of weed and a fat bag of shrooms.\n\nTruthfully, the director and producers are to blame for the asinine waste of celluloid that was Pathfinder. They should be kicked out of the Hair Club of Hollywood, banned from film-making, and whipped in an torturously unpleasant, non-fetish custom for months on end. Then they should have to give us our money back, and pay restitution for emotional and intellectual damages, for we are sadder and dumber for seeing this film."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "ce70949",
        "review_rating": "6",
        "review_title": "IMDb mistake!",
        "review_detailed_main": "First of all, Vikings are from Sweden! Norway didn't even gain its independence from Sweden till 1902. Sweden also had predominant control over Finland up until the early 1800's.... there for, Vikings are Swedish (some Danish) and the language spoken by the Vikings is Swedish with \"smaland\" accent, you could say its Swedish with a souther accent which is where Denmark got their language from. Never the less, this movie has great special effects. Even though it shows the Native Americans \"dominating\" which is also not very factual... Bottom line this movie would be 10x better if it was more accurate. The appearance of the \"Vikings\" is far from the truth.. Vikings were covered in thick wool to keep them warm with long blonde hair and beards.. the whole hat with horns crap is a myth and it is said that very rarely would only the captain wear the horns hat, that still did not cover his entire face... If Steven Spielberg would of taken this project on it would have been a great success... not some woodsman director making it up as he goes along.."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "Stoli_Raz_N_7",
        "review_rating": "2",
        "review_title": "Skunk-beer-and-stale-popcorn Vomit.",
        "review_detailed_main": "Most of what was good about this story was completely ruined by poor direction from Marcus Nispel (director of The Very Best of Cher...if that tells you anything) and really wretched editing. From beginning to end, Marcus Nispel's drudgingly slow, poorly lighted work falls short on every opportunity to make either an artful movie, an action flick, or a dramatic film. Sadly, Nispel seemed to be going for the trinity without the experience or know-how to realize any one of the three.\n\nThroughout the film, none of the actors were given the dialogue or development necessary to bring their characters to life, so instead they simply drudge through the film merely hoping to reach the end...much like the audience. Any of the characters that could have been likable were virtually silenced and rushed in and out of their screen-time to make way for the barrage of extensively slow fight scenes. Unfortunately for the audience, Nispel seemed to love using the slow motion action sequence to an extremely unhealthy, nearly torturous degree.\n\nConsider, movie-lovers and would-be-directors, that the following points would have made the film so much better:\n\n1.) First, this film should have been brighter and more colorful in the emotional scenes, playing on the beauty of North America's forest lands (something akin to Last of the Mohicans). Instead, Nispel chose the constant dark din of an evil rain forest from Tim Burton's nightmares. It is understandable why Nispel did it, trying to convey the idea that this was a dark time for the peaceful, nature-loving Native Americans. But truthfully, even Burton would have favored some brightness and color over the constant bleakness.\n\n2.) Most of the action scenes should have run in real time like Jet Li's \"Fist of Legend\", or been sped up to have a harried urgency like Ridley Scott's \"Gladiator\" or the Jason Bourne flicks. More importantly, get rid of all the rehashed slow-motion stealth shots stolen from Stallone's \"Rambo\", Schwarzenegger's \"Conan\", and Norris's \"Missing In Action\" films. Those scenes have been done to death in modern movies! ***Note to all would-be-action-directors: Nothing makes the predictability of a crappy film more obvious than unimaginative action scenes stolen from bad action flicks.***\n\n3.) The characters should have been given more dialogue and an actual range of emotions, including supporting characters such as Jay Tavare's Blackwing and Nicole Munoz's Little Sister. We are never given the chance to care about these characters, so we never give a hoot about what happens to them, even though their roles are integral to the impact of the story.\n\n4.) The introduction of Ghost (Karl Urban) as an adult should have included at least five to ten extra minutes of his life within his own tribe, (before the onset of the Viking antagonists) for character development and emotional attachment to his adopted family. Without this, we again find ourselves not caring about important pieces of the story.\n\n5.) And finally, the Viking lords Gunnar (Clancy Brown) and Ulfar (Ralph Moeller) should have been given greater scope, so that they could be depicted as both incredible warriors and truly despicable beasts. We should be begging for them to die, yet admiring them for being truly impressive bad-ass bastards. Instead, they come off as no more frightening than Skeletor and the Shredder of the He-Man and Ninja Turtles cartoons, respectively. In the end, we feel cheated; especially considering that Brown has previously shown that he has the chops for playing versatile bad guys.\n\nAll in all, this film looked bad, played worse, and stank of skunk-beer-and-stale-popcorn vomit the whole way through, courtesy of one truly bad director. Unless the \"Alice\" project with Sarah Michelle Gellar comes away with an Oscar and the title of Highest Grossing Film of 2008, Nispel looks like he'll be joining the ranks of crap action directors like Uwe Boll, Renny Harlin, and Rob Bowman.\n\n***Note to all of the good and gentle Buffy fans: Pray for Gellar. She'll need it.***"
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "thilagaraj-96121",
        "review_rating": "8",
        "review_title": "Filled with action😊",
        "review_detailed_main": "Movie plot is very simple and filled with full of action scene. Though Movie does not bored and ended well. Just give a shot if u like action movies."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "tutorp",
        "review_rating": "7",
        "review_title": "If better equals more entertaining, this may be the best movie I've watched this year",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "risque_chances",
        "review_rating": "3",
        "review_title": "Unnecessary gore and violence. And I like gore and violence, and still I thought it was all unnecessary.",
        "review_detailed_main": "Unnecessary gore and violence. And I like gore and violence, and still I thought it was all unnecessary. It felt fake and boring, despite how many people were dying left and right, how much fighting and running and then more fighting there was. It was just... boring.\n\nThe most interesting part was the very beginning where he was still a boy. Once they did the whole \"fifteen years later\" flash, it just lost my interest entirely.\n\nAnd that's saying something, because I'll watch almost anything.\n\nIt felt forced, clichéd and ultimately just not very well done. I liked Karl Urbane in The Lord of the Rings and in the Bourne Supremacy, but for the life of me I could not watch him in this.\n\nDialogue was shoddy at best, acting was so-so, special effects were a rip off, and the only part I really enjoyed despite it all was the scenery.\n\nIf you're a fan of the old Cowboys and Indians cliché and the White Boy Adopted By The Natives line, then by all means check it out. But it 'still' won't be that good."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "kenalb",
        "review_rating": "5",
        "review_title": "Not Nice to portray danes like this",
        "review_detailed_main": "We all know that it was Skandinavians that first landed in America, but this film depicts the Vikings as savage ruthless monsters, well they still treated the Indians kinder than USA treats them today. Anyways it was not really what I expected, they did not even learn to speak danish or Norwegian, this was painstaking to watch, the story was ok, but casting an Australian to play a danish viking come on it's like casting a dolphin to play jaws, it's stupid an very American arrogance move. Mads Mikkelsen would have nailed it. But if you don't care watch it and enjoy a rampage you not seen since."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "jeremy_iu",
        "review_rating": "",
        "review_title": "Absolutely Terrible - Do not waste your time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "tomimt",
        "review_rating": "6",
        "review_title": "Vikings VS. Indians",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "anders-n-aa-larsson",
        "review_rating": "2",
        "review_title": "Vikings who look and sound like Orchs?",
        "review_detailed_main": "Had the filmmakers watched too much Lord of the Rings? Last time I checked my history books my Scandinavian ancestors didn't wear ridicilous helmets and masks like Orchs or talked with dark voice-modulated effects like Nailz in 1992s WWE."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "chuck_gregory",
        "review_rating": "7",
        "review_title": "Pathfinder is a lot better than you think",
        "review_detailed_main": "I usually don't bother to rate a movie unless I thought it was at least an 8, but there were so many bad reviews here I had to put my 2 cents in. It is not awful. It really isn't even bad. I enjoyed it, in fact, although I did notice some of the anachronisms and historical errors. I still thought it was well worth watching.\n\nSo there.\n\nPathfinder is a hard-hitting look at a terribly bloody time that might have happened, in the early history of North America.\n\nNot surprisingly, the Native Americans are the heroes here, and the big bad Vikings are the predatory invaders. It's a bit odd to see the Norsemen using bows, and the helmets are apparently inaccurate, but it's a pretty good story and it certainly kept my attention.\n\nTry it out."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "justmeandnobodyelse",
        "review_rating": "1",
        "review_title": "The word \"viking\" should not be mentioned in this movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "paul_haakonsen",
        "review_rating": "6",
        "review_title": "If you are not strong enough to kill the bear use the bear's strength to kill it...",
        "review_detailed_main": "Having seen \"Pathfinder\" about three times now so far, since it was released in 2007, I will say that the movie is actually entertaining enough to sustain multiple viewing with some years in between each viewing.\n\nThe story told in \"Pathfinder\" was anything but original, and it is something that has been seen in other movies, and it does bear great similarities to \"Dances With Wolves\", for example. And on that account, \"Pathfinder\" doesn't stand out for having an original and innovating storyline.\n\nWhat does work for the movie is the action throughout the movie, especially since the movie starts out in a good pace early on in the story and continues on in that lane throughout the entire movie.\n\nFurthermore, the costume department really managed to create something unique here. But while the vikings were about as far from being historically correct as it almost could have been, then it was still very visually pleasing. Why? Because they were dark, brutal, primal and menacing to look at. They had a very nicely done dark fantasy feel to them given the costume design.\n\nThe characters in the movie were generic, sure. But still, they were interesting enough to sustain the movie and keep it being interesting to watch.\n\nAs for the actors and actresses brought in to portray the various roles and characters. Well, I did enjoy watching Karl Urban as the lead role, and he did carry the movie quite well. Furthermore, the native Americans that filled out the majority of roles in the movie were really doing good jobs as well, and they brought so much realism to the movie. However, the people cast for portraying the vikings were essentially faceless throughout the entire movie, aside from two or three of them.\n\n\"Pathfinder\" is by no means a masterpiece, but it is surely entertaining for what it turned out to be. I was thoroughly entertained by it, and could easily return to watch the movie again at another time a couple of years down the lane. Just don't sit down to watch \"Pathfinder\" if you want to watch something that is historical correct."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "BA_Harrison",
        "review_rating": "2",
        "review_title": "Nispel does a 'Snyder'.",
        "review_detailed_main": "After his reasonably enjoyable updating of The Texas Chainsaw Massacre (which was designed to appeal to the ADD afflicted youth of today), it would appear that director Marcus Nispel has gotten ideas above his station: he now believes himself capable of delivering an epic FX laden historical action/adventure. It's a delusional state which I call 'Zack Snyder Syndrome'.\n\nNispel's effort tells of a Viking boy, Ghost, who is welcomed by a friendly Native American tribe after being abandoned by his own people. When, many years later, nasty Norsemen return for more raping, pillaging and all things Viking, the now-unbelievably-buff Ghost (Karl Urban) leads his surrogate family in a vicious battle against the hairy hordes from his homeland.\n\nLike Snyder's 300 (which followed his remake of horror classic Dawn of the Dead), Pathfinder suffers from an overblown script, dreadful acting, lousy dialogue, silly quasi-mythological elements, a complete lack of originality, and, worst of all, the over-use of digital trickery to imbue the movie with a 'style' that only serves to irritate\u0097in this case, desaturating the colour until everything becomes a bland shade of grey.\n\nAlso, like Snyder's film, Pathfinder proves to incredibly unexciting. Thanks to some particularly dreadful editing and Nispel's poorly considered direction, the movie's umpteen fight scenes are a confusing blur of flailing limbs and unconvincing CGI gore; likewise, the action scenes (most notably, a high speed sled chase sequence) are completely bereft of tension.\n\nAlso serving to annoy is the sickeningly predictable portrayal of the two warring groups: as has been the case ever since the early 70s, when Hollywood seemingly decided to atone for its earlier portrayals of Native Americans as bloodthirsty savages, the 'Indians' are shown to be a peaceful and noble race; the Vikings, on the other hand, are no better than animals. It's a case of double-standards that sticks in the throat (maybe, in thirty years time, Hollywood will reconsider its unfair treatment of Vikings, who will, from that point on, forever be portrayed as sensitive new-age types, unfairly judged by history).\n\nPathfinder is the sort of predictable trash that makes one long for the movies of yesteryear\u0097you know, the kind with a decent story... and colour."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "timothy-98",
        "review_rating": "8",
        "review_title": "great concept",
        "review_detailed_main": "I love the fact that they have taken the fact we know the vikings landed in north America. then taking what we know about the vikings and the indians of the time and come up with , though not likely to have happened, a still interesting story.\n\nI was not expecting it to be a spectacular Hollywood production because it was on a more realistic Canadian budget. I think they came up with a great story and a nice movie. sure there are some short comings that a 100 million dollars could have fixed, but all in all its watchable. I even enjoyed it and have seen it more than once.\n\nfor those of you expecting a high budget dramatic movie, don't bother, but for action buffs who like a few good fights and some great scenery... its pretty good.\n\nI hope people will keep supporting small production house movies so they never disappear!!! nice change from flag waving American productions...."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "chrisharper23",
        "review_rating": "7",
        "review_title": "Not a terrible movie",
        "review_detailed_main": "Thought I would pick this movie up the other day, ( just one more to the collection ). I finally got around to watching it, and its not a terrible movie, it won't win academy awards, but it was enjoyable.\n\nTurned out to be a fairly bloody film, which is to be expected. The story was decent, acting was OK. My only downfall to the film, is I didn't know any character names. I never even heard his name was Ghost. Did I just not catch it? I have no clue.\n\nI guess you could watch the movie and guess how its going to span out, but then again today you could do that with most movies. This one snuck under my radar but like I said I enjoyed it, no love for it, but yet no hate."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "bvchartrand",
        "review_rating": "2",
        "review_title": "Pathfinder: Unrealistic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "Richardc23",
        "review_rating": "2",
        "review_title": "Wonderful to look at, Terrible to Watch..",
        "review_detailed_main": "I saw a preview for Pathfinder while watching a lionsgate film and thought it looked very promising indeed, oh how trailers can be deceptive.\n\nPathfinder is the story of a young viking boy who gets abandoned during a battle between his Viking clan and a group of native Americans. The boy is then raised by the native Americans. A decade or so on the Vikings return and it is up to the boy to now protect his adopted people.\n\nThis film was horrible and may have been the worst film I have ever seen (second only to anything Uwe Boll has created). My first and biggest gripe was the spoken language, the vikings spoke in their native Swedish tongue accompanied by English subtitles which really added to the authenticity of the film. However on the other end of the film you had the native Americans who for some reason spoke in a sort of modern American slang... why exactly the director and team thought this sounded good I will never know.\n\nSecondly the acting was by far the worst I have ever witnessed there was no connection between any of the actors and at no point during the film was any emotion conveyed at all. Plus I can only remember about five lines of dialogue being spoken throughout the whole film.\n\nThe lighting in the film is also a major downfall, during some points of the film it is unclear exactly what you are looking at because it's so dark.\n\nOverall the film was so tedious, drawn out, disjointed and the worst thing is the film had a lot of potential, I just wish Zack Snyder (300 director) had directed it and then maybe this film would have been worthwhile to the movie industry.\n\nWith all that said and done I still gave this a 1.8/10 which means there most have been something that impressed me, well in fact there was two things, though they weren't significant enough to improve the film a great deal. Number one the setting for the film was fantastic, I believe the film was shot in Vancouver, Canada and it was simply beautiful. Number two and the final thing to impress me was the Vikings, they were the only authentic thing about the film; the costumes and the fact that they spoke in there native tongue was a great feature of the film.\n\nOverall, if I was given the choice of watching this film again or watching paint dry for two hours I would most definitely choose the latter."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "trustyvaliant",
        "review_rating": "",
        "review_title": "Viking B*****ds!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "ts-lado",
        "review_rating": "6",
        "review_title": "One-timer/Slasher",
        "review_detailed_main": "This movie worths to be watched just once, if you are a fan of slasher action movies with lots of sword-fighting and \"one-good-guy-against-many-bad-guys\" type of thing.\n\nThe movie had the potential. The plot is simple and predictable, but it's the way this kind of movies should be.\n\nThe acting is OK, not good, not bad... it just can't be good because of the roles itself, and it's not bad, because actors just couldn't do better from what they had in script... so this is the case, where if characters are not well developed, you have to blame script, not actors.\n\nThe cast is actually VERY good. Indians really look like Indians and not like their \"hollywoodised\" prototypes, but if they fit in role perfectly with their apparent, they fell to be natural in the way of their lifestyle and habits. They seem to have well democratised society with women having equal rights with men and with everyone happy and free before bad guys come to their land. Just unbelievable.\n\nGood thing about vikings (or maybe bad thing for vikings fans), that they're not idealised warrior heroes, but murderers, rapers and brutal savages as they historically were most of the time, (though I don't have anything against their idealised version too, painting them as just honorable brave warriors, sometimes doing good deeds. And I love their sagas and mythology, so I don't mean to offend if any Scandinavian is reading it, I respect Scandinavian culture)\n\nThe action scenes are good and bad same time. They are good, because there's obviously some great choreography, stunt effects and sword-fighting scenes, but bad sides of that is, that most of the scenes are happening during night/in dark valleys/in caves/during heavy snow when visibility is poor... So you start to think: \"what a hell, they spent so much money, and I feel that the scene behind this darkness on the screen is great, but I can't see it...\".\n\nSome low budget movies use the \"darkness tactics\" to cover up their low budget and don't show you that scene is not so good, but this movie didn't have the need in that, as clearly it is not a low budget movie, at least it doesn't look like that.\n\nDid you noticed, after almost every \"good\" of the movie, I used word \"but\", so these \"but-s\" are why this movie got only 6 from me, not higher.\n\nIf only the plot, not so much insulting simple... If only the fight scenes would be more visible... If only the characters would be little more developed... If only... if only all that, this could be one of the best movies of year... but now, just 1-timer, as I stated above"
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "saudek",
        "review_rating": "3",
        "review_title": "What the f...",
        "review_detailed_main": "Remakes are not always a bad thing. Insomnia was nearly as good as the original and Assault on Precinct 13 was kind of OK, but this time they really shouldn't have done it.\n\nI remember seeing the original movie when i was 15. I had never seen anything like it. The story was simple, gritty and violent and i still remember it as one of the best action movies i have ever seen. I mean, man, there was no cg backgrounds, only wast amounts of snow and you could feel the cold and the lonyless.\n\nSo i watched this new version with an open mind, perhaps it was OK. But oh no. Boy was i wrong. In stead of using the landscapes an simplicity of the old movie, they,ve created this Conan look a like with really boring action and no soul. I mean its winter for crying out loud and this poster boy viking is running around half naked. I am aware that its a legend, but even legends need some amount of realism. Maybe this movie is OK as a direct to video release on a lasy Sunday, where you have nothing else to do and cant find your old Conan videos, but please oh please do not relate it with the original"
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "nico_strachan",
        "review_rating": "6",
        "review_title": "If you want it",
        "review_detailed_main": "Pathfinder was good in the sense that it wasn't stupid. They made a real effort to keep the movie from being stupid. You could buy it on DVD without fear of regretting spending your money. On the other hand, it wasn't great. There was little to no duologue. Karl Urban probably had less lines in this than in Riddick.\n\nIt is about an hour and a half of just watching action irregularly punctuated with a conversation or two. However, if you get off on Viking pictures and you like yourself some He-Man/Conan/Barbarian action and you can't bide your time for Pitt to act in some reinvention of it, then it would be real good. It had some good action scenes in it. They actually had something like an 'action-based plot'.\n\nNo subtitles needed for this flick. you could be stone deaf and still get as much out of this picture as the next man. But if you could content yourself with just watching Urban, spend your money and enjoy. If you want Sean Penn kind of duologue and plot, try elsewhere."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "berryj6",
        "review_rating": "3",
        "review_title": "A linear, strange misfit of a movie stuck between fantasy and action.",
        "review_detailed_main": "Pathfiner is the story of Ghost, a young boy haunted by visions of bad, evil vikings doing bad things to good, nice village people. So Ghost goes out to do bad things to the bad guys. And that's pretty much it. It's Jason Bourne 1000 years ago. It's hard to think such as potentially great, brooding epic movie could be so linear and simple.\n\nPathfinder could have been a fantasy, but its not. Pathfinder could of been an action movie, but its splatters blood of dark vikings all over the white snow. It's an undefining film, it has no memorable action sequenced or fights. It has no moral fibre or brain. It is only the haunting vikings that add any depth to this movie, with their spine-chilling horns and deep Norse breath. The acting is also as chilling, but in the sense it's chillingly bad. Ghost has one, mediocre facial expression, and when in peril he looks like he's lost on the final level of Space Invaders.\n\nThough the darkness of the film and its attempts to frighten audience gather some merit, the filler between the heavy, samey action scenes is it's main pitfall. It questions nothing, does nothing, plodding along in the blindingly white snow, before plunging into the freezing water and never emerging."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "jcareyone",
        "review_rating": "7",
        "review_title": "Yeah/No - what he said",
        "review_detailed_main": "Too many critics and not too many critiques spoil the broth. Just watched this movie and I can't, for the life of me, see what about it which stirs a loin enough to hate it. The story's simple, editing is admittedly woeful, and the backdrop is stunning. The acting is stilted in places, but it's an action movie for goodness sake, and a bloody good one! Bits chopped and lopped off, heroes as clichéd as any other of the genre, and the padding of a love story. The camera-work was very arresting and as ugly/beautiful as the Black Robe (steamy, wet, darkly depressing but utterly gorgeous). A new twist to the discovery of the New World as a Norse Saga, and a laudable effort. But let's not get carried away with ourselves, it was a good, solid idea - much superior to others in it's sub-genre, but not a classic. The aesthetic criticism this movie gets is better reserved for the likes of Apocalypto and that New World drivel, Colin Farrell \"acted in\". It struck me as a bit of a Lord of the Rings in The Emerald Forest (a big story lost in a piece of heaven). Just sit back without preconceptions and enjoy, say I! It's only a movie!"
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "reddevil_inside",
        "review_rating": "5",
        "review_title": "could it been better! way better!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "Phantasy_star_4",
        "review_rating": "10",
        "review_title": "Great Movie! Visually and Fun!",
        "review_detailed_main": "I have to say this movie to me when i heard the plot from a friend sounded horrible. Then i sat down to watch it for myself. I loved the Visuals and Story, even though there was not a lot of talking, not all movies need to have loads of talking in it, and The plot is a little overused - the person coming to realize his own people are not good. To be honest that I'm pretty sure if you think about it, It happened a lot in history! So i do not mind the story one bit, i came to enjoy the romance of the movie as well. I have read a lot of reviews and they seem very Contradicting of this movie, a lot have said how bad this movie is with giving the exact same answer as the last guy right before him, \"This movie is a copy of so many others\" stop and think that ummm lets see, your writing the same review as everyone else with the same plagiarism. This movie Has Suspense, Action, Romance, and everything you could want in a good time viewing. I highly recommend this movie, Its definitely an acquired taste of movie delight (this is my opinion hehe) Definitely worth a rent, because i know eventually this will be a cult loving classic."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "kirkstir",
        "review_rating": "7",
        "review_title": "Why did so Many Reviewers Get it Wrong?!?",
        "review_detailed_main": "I rented Pathfinder not really knowing much about it other that the cool fantasy picture on the DVD cover. Actually there was not even a synopsis on the DVD case which is certainly a warning sign. Before I popped this movie into my player and experienced it on a large home theater I looked it up on IMDb (where else) and my heart sank after reading mostly negative reviews with an overall rating of 5.5. The most prevalent title was \"Worst Movie I Have Ever Seen.\" There are some terrible movies that for some reason I just love, so I hoped this was one of them. Well, it wasn't \u0096 not because I did not love it but because it was not a terrible movie! I was very impressed with the action scenes but what really made me sink into this simple story was the cinematography. The entire movie was shot in kind of a gray tone that made me believe it was 600 years ago. The acting was mediocre but that worked fine for this unimaginative storyline. Viking barbarians want to colonize an area populated by Native Americans and do it by killing and burning everything in sight. I did like the hero (a Viking child left behind many years ago who become the savior for the tribe). I even thought the romantic interest between the hero and Native American woman was done fairly well. All in all I had a great time with this movie and I don't think it was entirely because the reviews had set my sights so low."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "tor_toffel",
        "review_rating": "1",
        "review_title": "PATHFINDER (contains spoiler...)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "Lazy_Smoker",
        "review_rating": "1",
        "review_title": "Pathfinder is seriously lost.",
        "review_detailed_main": "One good thing about this movie is that it looks great. The costumes for both the vikings and the natives are interesting and believable, as are the weapons, but that's where it ends. This was supposed to be an action movie, but it was so poorly cut together, I couldn't tell what was going on or who was fighting who? It was like watching a naughty channel when you don't actually have the channel and you can't tell a boob from an elbow. As for the story, there is almost no explanation as to what is happening or why. Stuff just happens, and one scene doesn't necessarily go with the previous, as in, people and objects just appear out of nowhere. I guess the filmmakers expect the audience to use our imagination to fill in the blanks. It would have been a better movie if they cut the beginning and the end together and I imagined the entire movie. If you're looking for Viking action, play Rune instead."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "thinker1691",
        "review_rating": "",
        "review_title": "\" They are Norsemen, from the Land of Ice and Snow \"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "kooleshwar",
        "review_rating": "6",
        "review_title": "Almost good...",
        "review_detailed_main": "The trailer of this film was actually quite good. I've been craving for a good R-rated action film, with violence, action and corny dialogues in all its glory.\n\nThe fact this a full release B-movie (or lower A movie) made the prospect even more appealing.\n\nThe first thing that struck me about the film were its visuals, the dark twilight atmosphere has been exploited in many movies but this movie is up-there with the best as far as capturing the rustic beauty and well as the threatening nature of the far north. It may almost be old but the visual created in this film are still beautiful, the talent carries across in the cave scenes and indoor scenes as well with great shadows and all. This is the clearly the department in which the film excels throughout.\n\nAfter the first few scenes i actually expected much more from this film, and that may have affected the ratings a bit.\n\nThe movie is somewhat of an exploitation film, the real exploiters of the Red Indians were the whites/cowboys and clearly the exploitation continues till date thanks to the stereotypical portrayal of Red-Indians in cinema, this movie continues the trend with the prophecy, the elder, and what not. There is no way the real stories ever going to be told but its still a good change to see the Indians actually winning even its solely due to a white man (hehe).\n\nNot that any of the above matters, the story of this film, is merely and excuse for the filmmakers to display their abilities in a limited budget, with some brilliant visuals and some well choreographed but still realistic fights, some great (although historically inaccurate) costumes, a decent storyline and some decent actors.\n\nRomance rears its ugly head but surprisingly and luckily there wasn't a kiss at the end, the scene that was the staple of action films but is quickly becoming the staple of action movies nowadays.\n\nThe movie would have been better off if there were some less stereotypical drama and some more action, for a angry man Karl Urban had too many drama scenes.\n\nThe dialogues were mostly corny but there were some good ones like the spring and the winter one, once again this is a B-movie and the dialogues were definitely better than the ones in most B-movies.\n\nActing was decent and although Karl is good with the serious roles, he definitely has to work on some humour even is its cold humour, all action stars need to display a streak of humour and unless he does the same there is no hope for him.\n\nThe rest of the cast did a decent job as well but no one really stood out as being particularly bad or good.\n\nThe action scenes were the second best part of the film with the chase in the mountain particularly standing out.\n\nThe action was brutal and violent often purposefully so, but I'm not complaining,would have loved to see a better ending though.\n\nIn the end this is a decent B-movie that falls short of good thanks mainly to a really weak storyline, only decent acting and dialogues, and the lack of any defining moment or scene.\n\nThe forgettable nature of this movie is its main downfall and save for the great visuals,a couple of scenes and one dialogue its difficult to recollect anything really good(although nothings really bad) about this movie.\n\nAlso the editing seemed jarry and i don't know if it was because of the censorship issues in India or it was just bad.\n\nNot as bad as its made out to be and watchable if your a fan Action B-movies, a really good home-theater is a must to enjoy it though, as I only felt the slight impact of this move by watching it in the theater (at matinée prices off-course).\n\nRent with ordinary B-movie expectations.\n\n+s excellent visuals, a couple of good scenes/dialogues,meets low expectations,very brutal.\n\n+/-s decent acting and actors/actresses (my take what more can you expect its a B-movie),nothing is really bad (which can be counted as good).\n\n-s fails to rise above the ordinary, very forgettable.\n\ntotal 6/10 (met my low expectations but seriously after the first few scenes i expected more, even the adoption scene was actually good and i expected the drama too, to be of better quality then what was delivered, in the end my new expectations were let down, but the movie still managed to be OK.)"
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "cochranpr-1",
        "review_rating": "2",
        "review_title": "Almost walked out of this one",
        "review_detailed_main": "It is hard not to be sitting in the theater and not try to compare this movie with Conan the Barbarian. At the time, with no CGI, a barbarian world seemed believable and, mind you, the characters had flesh, bone and heart, you cared for them. The saddest thing about Pathfinder is that you don't feel anything for the characters. They are portrayed in such a cardboard fashion that it makes you wonder how most of the native Americans that act in this movie did not raised concern about their portrayal. The story was so disarticulated that I heard a couple of comments in the audience, \"I don't understand\". The story lacks in density and truth. Never are we presented with reasonable reasons to believe any bond, or lack of, of any of the relationships between the characters.\n\nIt is easy to blame the editing but I do believe that the editor was extremely limited by the material at hand. The fight scenes are incomplete in their coverage. There is no variety in camera angles and most of it seemed a repeat of shot after shot. Photography and wardrobe were good although the Digital Intermediate correction degraded the possibility of a visual feast. The best way to describe this movie is \"inconsistent\". I have walked out of a movie before, Masters of the Universe...I almost walked out of this one but still had a few handful of popcorn and a lot of soda to waste so I stayed."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "mhurleymusic",
        "review_rating": "7",
        "review_title": "Not too shabby",
        "review_detailed_main": "A fun, action-y, violent flick. While it's pretty predictable it's worth the watch. I like the dark and gritty tone and it still holds up in 2021."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "otherbox",
        "review_rating": "3",
        "review_title": "Lame remake of classic story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "lastliberal",
        "review_rating": "6",
        "review_title": "I'm not your kind.",
        "review_detailed_main": "It's not a classic, but if you like Apocalypto, then it is similar with two cultures clashing. Add a little Rambo, and maybe a little Bond in the sledding scene, and you have the makings of a watchable movie.\n\nThe cinematography was spectacular, and the fighting was bloody and gory. The vikings looked like something out of your worst nightmare - super costuming! Marcus Nispel (The Texas Chainsaw Massacre) did a very good job. It is going to be interesting to see what he does with Friday the 13th next year.\n\nKarl Urban (The Bourne Supremacy, The Return of the King, The Two Towers) was a believable Rambo character. He makes me look forward to his \"bones\" role in the new Star Trek.\n\nI certainly wanted to see more of Moon Bloodgood (Eight Below) but I understand that it was Winter. :-)\n\nI don't expect a lot of fans for this film, as they have no fart jokes."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "nvjs",
        "review_rating": "4",
        "review_title": "Poor Attempt at storytelling",
        "review_detailed_main": "From the start, Pathfinder was Bad. The direction was weak. Nispel clearly doesn't have the chops to do action. Which should say something since it requires the least experience to break into films. Nispel's other films were \"Frankenstein\", \"Texas Chainsaw Massacre\", and the re-imaging of \"Friday the 13th\". All horror films. Pathfinder hopefully will be his first and last attempt at making action films this bad. Like I've criticized Mark Steven Johnson for is the same as Nispel for printing the first and probably the only takes. The actors are of the amateur caliber under Nispel's direction with over/under doing it. But Pathfinder doesn't try to be anything it isn't. With that said, it doesn't try to make a concerted effort at the whole action theme either. What does salvage the film from being a total waste is Daniel Pearl's lush and rich color palette darkening that gives the film a moody and ominous look and feel. The art direction and production design are also to the film's benefit. The Vikings or Norsemen truly look feral and formidable with the anachronistic and faux pas goat horns and canine riddled helmets. This truly gives them a touch of aesthetics to help sell the idea that the Natives are over-matched.\n\nClearly, Nispel felt that the less we know about either faction, the less sympathy we'd have for either. It seems the Natives were meant, merely fodder for gratuitous (yawn) scenes which are gratuitous for the sake of gratuity and to make you feel contempt for the Vikings. The whole \"story\" is that the Vikings, for sheer boredom decide to satiate their inexplicable desire to just kill \"savages\". There isn't any \"McGuffin\" here to help move the story forward, no exposition for the characters, little if any semblance for the hero, Ghost's dramatic arc where he learns something about himself for personal growth, and a page ripped from the Michael Bay book of film making: Tell the story without cliché'd words. Use action and random explosions as the characters,story, and plot. By the way, Michael Bay was a producer on \"Texas Chainsaw Massacre\". So if Nispel's learned anything from him, it's how to emulate him. That is NOT a compliment."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "irongiant1219",
        "review_rating": "10",
        "review_title": "Don't Miss!",
        "review_detailed_main": "I put this DVD in the machine at about 2:00 a.m. so I could fall asleep,but instead it kept me up all morning till the end.I'm a huge fan of these Viking flicks but what I always find is that the first thing a director always gets wrong is the scenery,this movie kicks ass for it's stunning background and foreground shots,from the way the forest scenes are shot,the mountain shots,just very stunning visuals.I thought everyone cast was PERFECT,and honest in their delivery of spoken words,this is one of those movies that flew under the radar and should be talked about.The slaughter scenes are very realistic,this movie is a great way to have a bottle of wine with and get your head lost in a great story."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "Robert_duder",
        "review_rating": "7",
        "review_title": "Has a lot going for it...really....a lot and yet something is off the mark",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "hensocr",
        "review_rating": "1",
        "review_title": "This movie was very inspiring",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "nbouscal",
        "review_rating": "2",
        "review_title": "Prime example of modern-day Hollywood",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "Teknopath",
        "review_rating": "6",
        "review_title": "Ignore the haters",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "toroandbruin",
        "review_rating": "1",
        "review_title": "Don't waste your time watching",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "monogatari82",
        "review_rating": "7",
        "review_title": "Campy movie with good cinematography",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "KivenTheBlackClad",
        "review_rating": "1",
        "review_title": "Odin Hates This Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "sherry71168",
        "review_rating": "6",
        "review_title": "well made film",
        "review_detailed_main": "I thought that this movie was very well made. To those who whine about its darkness and gray-scale colors. THEY DID IT ON PURPOSE folks. Its like what they did with underworld or 300. They only had one or two colors bright to make them stand out extra well. Plus the times in which they lived were quite harsh. Yes the movie is violent , but again it also goes back to the times back then being quite violent. The battle scenes are REALLY WELL done.They are very visually appealing (as is the main actor) I like the fact that they use languages the peoples would have really used, or at least something close to it. Like apcolopto it adds a degree of realism. For people who are bothered by violent movies I would suppose this movie is probably not for you. If you can see a beyond the violence to other many aspects that make it a pretty decent movie, then I think you will like it. It also doesn't hurt that the lead male is SO FINE its almost a crime."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "neil-476",
        "review_rating": "4",
        "review_title": "Pathloser",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "ghost-9",
        "review_rating": "10",
        "review_title": "Loved this movie!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "RenlyStannis",
        "review_rating": "6",
        "review_title": "Has aged better than expected ..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "RobinCook70",
        "review_rating": "1",
        "review_title": "Was There A Path?",
        "review_detailed_main": "Let's see, what was the story? Bad men dressed in tank armor supposedly resembling a cross betwix Mayan and Nordic (.. and maybe Viking somewhere mixed in there), who are referred to as \"beasts\" which have only one goal in life, which is to eradicate all human life forms in their path. Then, the good men are dressed in various types of Indian garb with a determination to have the dirtiest hair on the planet. Story? Well, mix both bad men and good men with metal versus wood weapons, and \"enjoy\" the slaughters from one scene to another long scene of butchery. But, you'll be lucky if you know which is doing what as the camera bounces so much you end up saying to yourself that it's not important because there'll be another senseless ten minute string of it upcoming soon ... time to snooze.\n\nI believe the one main draw for me to see this movie was the coloring used on the art ... blue hues mingled with black are eye candy, but this movie left a sour taste behind.\n\nThis was one of the worst movies I've encountered in a long time where it has nothing to offer except pretty colors (and gore if that's your thing). Oh, and there is a love thing in there that was nurtured through sadism. As far as there being a path or a pathfinder in this movie, I think the director of this movie was clueless to find one as well. At least there was pretty colors and photography, but the cameraman cut those off as well. AVOID this movie."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "beeltink",
        "review_rating": "5",
        "review_title": "Good action, REAL Nordic language, bad research",
        "review_detailed_main": "What I really liked about the movie was that the vikings actually spoke old Nordic, which is an old-fashioned version of Icelandic, which was spoken in the western parts of Skandinavia in the past. This makes the movie interesting for people who actually study Scandinavian languages. A big mistake were the clothes the vikings were wearing: in the movie they had horns on their helmets, however, vikings did NOT wear horns on their helmets in reality! This is a common mistake made in movies. VIKINGS DID NOT WEAR HORNS ON THEIR HELMETS! THEY NEVER DID! Some archaeologists made that up when they found an old Viking-helmet with a drinking horn next to it. As for the story: it's packed with nice action, however I can't understand that the Vikings were so violent and dumb. They were explorers, fishers and traders, not the violent warriors like in the movie."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "keesha45",
        "review_rating": "6",
        "review_title": "Sometimes you eat the bear, sometimes the bear eats you",
        "review_detailed_main": "The above line wasn't in the picture, but it's always been one of my favorite sayings. You just never know how things might turn out when you do them, and often they end up either pretty well or quite awful. I was hoping going into this viewing that I might see something very worthwhile like a Rambo version of a young Viking turning his back on his countrymen in a battle for survival in the deep woods. Or they could have gone with the Fenimore Cooper story of the Deerslayer hero raised by his chosen people who must battle both the bad Indians and the bad white guys. Instead, they pretty much followed the plot line of the kid leading the bad guys away from the villagers as the original PATHFINDER had done in the Norwegian film of the same name 20 years earlier. In doing so, they made just a fair remake of what could have been a great story. There was very little back story of the Ghost's Viking life and even less of his formative years spent with his new foster family. This would have given the Ghost character much more depth and made him someone we could care about. As it was, he was just the sword-wielding Indian wannabe taking on the evil Viking raiders,so who could blame his erstwhile allies from totally buying into his newly discovered loyalty to them against his own race. The romance lacked much spark between the hero and his girl, and the action scenes were only marginally effective, except for a very good chase scene down the mountainside. The set director, however, did a fine job of recreating the ancient villages and the costumes were quite good, even if they were a bit fanciful from an historical notion of how the Vikings might have looked. At first, I disliked the black-and-white effect of the lighting, but I think it added more than detracted from the visual effect of the film overall. This was, after all, an unusual way of looking at how the first encounters between the two cultures would have gone, so seeing history in a different light was done here literally. As for the historicity of the film, I think there could have been just a little bit of humanity shown by the Vikings and maybe a bit of the savagery by the Indians that they possessed before this encounter and especially how these raids would have engendered more of a warlike spirit if they had been relatively peaceable heretofore. As a lover of westerns, it was refreshing to see the roles reversed in this early saga of cowboys versus Indians. I would say I got the better of the bear this time, but it did its share of gnawing on me before the battle was over. Dale Roloff"
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "liamlapointe-imbd",
        "review_rating": "1",
        "review_title": "What a piece of junk",
        "review_detailed_main": "Please, for your own sake if you are thinking about renting / buying / going to see this movie, DON'T. It's not as if I expected it to win any Oscar's when I set out to see it but I figured that if it had enough action it would keep me mildly amused.... I was wrong. The Plot was horrendous; I've never seen a cheesier story line. I'm not sure who wrote this thing but my guess is they haven't graduated grade school yet. And as for the editing, I think whoever was in charge of that probably was drinking on the job. I mean I'm no expert, but I figure someone should have caught the fact that in one shot there's ferns, moss and assorted vegetation all over the place and the next shot the whole place is covered with snow. I swear they didn't write a script but must have made up the movie as they went along. My guess is they just added the snow when it suited the story line.\n\nP.S. Adam, you owe me $13 for making me go see this piece of rubbish, that's money that could have been spent on beer."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "OMTR",
        "review_rating": "7",
        "review_title": "Barbarian Invasions",
        "review_detailed_main": "A good epic action film that nicely balances action and adventure with Amerindian wisdom, which protects Amerindians against Western barbarian invasions."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "davide-q-ramos",
        "review_rating": "1",
        "review_title": "terrible story",
        "review_detailed_main": "One fact remains about viking history, it's rich both in historical facts and legend.\n\nI really don't understand why the viking culture is rarely explored in movie-making. Instead, they have chosen to arrange a ridiculous plot to another poor movie.\n\nKarl Urban is a good choice for a viking face. He has the looks, the build and strong character to portray the warrior-type. Unfortunately he's lost in this movie.\n\nA viking defending the local indians from vikings? Ridiculous.\n\nMaybe that's the reason why he doesn't have a proper beard, like any viking was proud to have, he became more of an Indian than of a viking warrior? Don't mock the fighting capabilities and experience of a viking warrior, this guys bowed to no one and were deadly in combat.\n\nTo put them face to face with indians, being killed one by one by a former viking is both dishonorable both to the Indian culture and the Viking culture.\n\nPerhaps the upcoming \"Beowulf\" (CGI based) will compensate this kind of rubbish, i doubt it though."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "viamillitaris",
        "review_rating": "6",
        "review_title": "A glad day dawned",
        "review_detailed_main": "A Viking boy, Ghost is left behind battles a Native American tribe. Raised within the tribe ( Dawsons ), he ultimately becomes their savior in fight against the Norsmen ( The Vikings ) A. K. A The Dragons. However, the truth was that Vikings'd been burgled Britannia, Ireland and coasts of America ( approximately 600 years before \"The Conquest of Peradise \" 1492 A.D. ) happening. So, if I'd understood everything right, Americans should be thankful to the Vikings, because they were American dawning consciousness. Sincerelly, yours Dushan Petrovic ( Jurija Gagarina 143/92, 11070 New Belgrade, Yugoslavia"
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "Rectangular_businessman",
        "review_rating": "1",
        "review_title": "Painfully bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "starbinks-1",
        "review_rating": "8",
        "review_title": "Pathfinder",
        "review_detailed_main": "I found this movie very entertaining. My objective in a film is not to pick it apart over every little costume mishap or geographic mistake but to sit and be entertained. I enjoyed the 13th Warrior, I enjoyed Pathfinder, for 90-120 minutes I did not have to think about anything other than the characters in the film. I found the characters likable, although I do not remember any quote concerning Ghost saying he was dieing and Pathfinder saying don't complain to me about it ???? So if you just want a couple of hours of action packed revenge, with a love story thrown in, then this movie is for you. Sit back, relax, and enjoy."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "Bloodwank",
        "review_rating": "7",
        "review_title": "Solidly entertaining mindless historical adventure kicks",
        "review_detailed_main": "I'm not really a fan of historical adventures, as most seem to me to do little more than weave inaccuracies and racial stereotypes into tedious action. Pathfinder is pretty much the epitome of this style which I dislike, yet I bought it, watched it and enjoyed it enough to not regret the purchase (it was second hand, always a bonus). I remember seeing its trailers back when it first came out and I remember it dropping off the map with remarkable speed, despite being by a young director who seems to be regarded as bankable (Marcus Nispel) and generous helpings of crowd pleasing things like old school heroism, simplistic plotting crazed fighting. I guess the historical adventure is a devalued genre these days, or perhaps people simply didn't like this one, its hard to tell. Anyhoo, Pathfinder gives us the story of a young Viking abandoned as a child to the New World and brought up by American Indians. He goes native and has the sort of experience one would expect of somebody adopted by a pretty much alien people, but proves to be of great assistance when his Viking brethren return with genocide on their minds. No prizes for guessing how it all unfolds, original and innovative plotting is not high on this ones list of interests, what it does do pretty nicely though is mindless and intense battle scenes adorned with bits and pieces of fun bloodletting. Marcus Nispel seems to like tightly edited and closely shot action, something which can really spoil a film (like it did his Friday the 13th effort) but here it works out well enough, the camera catches the rough and ready choreography with fair visual coherence and the editing does a nice job in joining moves and their bloody pay-offs and then stringing a collection of these sequences together. Its an approach that doesn't work so well in the films two bigger scale action scenes but still works out okay, helped out by the lack of shaky cam. Cinematography is generally solid here, coldly forbidding and epic, has an impersonal feel typical of Daniel Pearl's work in these sorts of films but it works well enough, while effects work is quite fun, with the muted tones of fighters contrasting nicely with the more vivid red of the CGI blood. And as for acting, well it does the job. Badassery and a few emotional surges are all the acting required here and the cast pull it off, there is a tiny skein of self realisation lurking in the quieter moments of the film for the cast to briefly chew on, but nothing requiring acting on anything higher than an 80's action hero level. Karl Urban is a decent hulky and laconic hero, Moon Bloodgood an attractive tough cookie as a strong willed Indian lady, Russel Means a convincingly wise elder and the ever badass Clancy Brown as a Viking badass. Altogether it's solid mindless fun, I had a surprisingly fine time with it, there's some fun slaughter and tip top silliness (especially a scene involving sleds), it may be indefensible from a historical point of view and probably offensive as well, but as pure entertainment I reckon it does the job."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "veloso_sn",
        "review_rating": "1",
        "review_title": "1 star",
        "review_detailed_main": "really this title is a lost of time in life. I love cinema, and i thought that there aren't bad movies in cinema but movies that one don't like. However, this movie is really, really lame. Since the start, there are scenes that are not concluded and there were left floating in the air. The acting is really boring, the storyline NEVER started. The dialogs, what can i say about them, i could sleep between each line. In many parts, there were scenes that could premedit future scenes. i dunno why people like this movie. There could be a change in the Indian-viking language to be more realistic.\n\nSry my bad English."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "krzysiektom",
        "review_rating": "2",
        "review_title": "a wasted opportunity",
        "review_detailed_main": "It all looks artificial, I think most of the outdoor scene surroundings were CGI. The plot, script or whatever u call it is very poor, weakly thought through. The \"Vikings\" come as cartoonish almost, one dimensional brutes, carrying almost all the time ridiculous helmets. And they all seem much bigger than the Indians, even the white \"Indian\" who is one of them. The biggest disappointment was the fighting scenes, poorly edited and shot. The entire premise of the Vikings insisting on chasing the Indians who fled from one village even across the mountain ridge and away from the seacoast is so ridiculous it indicates the director is a pretty dumb person and thinks the same about his audience. And this is yet another film when the native Indians come across as some fantastically interesting, deep, spiritual, polite and likable people. In fact maybe James Cameron watched this film a few times too many. This script is similar but even worse than Avatar's."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "wsskfqy",
        "review_rating": "7",
        "review_title": "Very interesting",
        "review_detailed_main": "Beautiful scenery, except it looked very cold!\n\nGood fight scenes, especially one dangling from ropes on the side of a cliff.\n\nStoryline was solid. Acting was good,\n\nCostuming and sets were good.\n\nIt's a shame they were East Coast Northern tribes I wonder how they would have reacted if they were tribes who wore buffalo headdresses with horns & were suddenly confronted by vikings in horned helmets?\n\nAnd wouldn't the Vikings take off metal helmets in arctic weather? Wouldn't the metal make them too cold to wear? I suppose if they were fur lined. But they didn't seem to be...\n\nIt was an entertaining film & the scenery was beautiful.\n\nCertainly a better film than many I've seen."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "teeeester",
        "review_rating": "3",
        "review_title": "Frustratingly entertaining",
        "review_detailed_main": "It was a vapid, entertaining piece of tripe. That said, Marcus Nispel should be embarrassed he put this out.\n\nWhat director loses track of seasons as they relate to story line? We go from lush lowland seascapes to avalanche prone rigid peaks in seconds. Frigid snow covered hardwood forests to leaf covered villages set in treetops, supposedly all with short walking distance!? This is first year film school crap that a seasoned director should NOT have overlooked. Did he even story board this or just shoot and run? IMHO Nispel should return his paycheck. If my work was as ill thought out I'd be collecting unemployment right now\n\nNevermind that the characterizations were far fetched and ridiculous. It's a fantasy epic.....that's expected."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "bednarro",
        "review_rating": "6",
        "review_title": "Worth to see",
        "review_detailed_main": "Idea was great. Main character was great. Dark theme was great. Story was a drama."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "mbrooks-8",
        "review_rating": "1",
        "review_title": "Karl Urban to the rescue",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "thejamppa-94521",
        "review_rating": "6",
        "review_title": "A dark fantasy, that doesn't live up it's potential.",
        "review_detailed_main": "Firstly, this film belongs to my guilty pleasure list, despite all of its flaws.\n\nWith talents of Russell Means, Clancy Brown and Karl Urban, there's quite potential in this film. Released about year after 300, Pathfinder tries to use similar making: heavy green screen background. Stylized color palette and slow motion. However where Sepia toned worked in 300 to capture feeling of the comic, the Grey color palette manages to sometimes make film look beautifully bleak but most often just murky and not capture look of the dark horse comic\n\nWhen you add shaky cam with unnecessary zooms and super fast cuts with color palette, the action become hard to follow and loses a lot in action scenes. With wider shots and less quick editing, action scenes would have been more cohesive and easier to follow.\n\nOutside these problems with predictable plot, this is still quite enjoyable movie. Russell Means is great as always, Glancy Brown is truly scary, even very two dimensional villain.\n\nThere are some nice details in pitted and marred swords of vikings and their armor. Leather looks worn. Helmets are like ripped off Conan film but really well made giving vikings demonic look. Native Americans use stone weapons... there really is attempt and great production value in clothing and sets that are not overstylized front of the green screen. Score is better than you could imagine from film like this.\n\nSo in summary: this is enjoyable turn of your brains popcorn flick. It loses a lot potential in fast editing and camera works. But Urban, Means and Brown carry this film, where camera works fail.\n\nI recommend the comic book to see potential of the story."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "alisslangridge",
        "review_rating": "5",
        "review_title": "Conan the Barbarian meets Apocalypto with quite good action scenes",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "darkwolf788",
        "review_rating": "9",
        "review_title": "Get a Grip",
        "review_detailed_main": "I understand the history buffs being upset, but seriously this is stated as being based off a \"Graphic Novel\". It's by the same people that did Blade and Ghost Rider. Dark Horse isn't interested in history, they are interested in telling an entertaining story. There are many stories based on similar scenarios. I can name 5 off the top of my head. All had pictures of the horns on helmets. Even the books written in the 1800's had that error. Basically just enjoy the entertainment. Then when they invent a method of time travel you can go straighten out the first guy to add those horns. I'd rather listen to 100 idiots tell me about a movie then 2 history buffs, basically because an idiot can just enjoy and get a thrill out of the story without analyzing it. I have an IQ over 140 and found over-thinking just makes life dull."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "Poe-17",
        "review_rating": "1",
        "review_title": "Way way way bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "kosmasp",
        "review_rating": "5",
        "review_title": "Mislead (Die hard with a Veangeance)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "bigbadduude",
        "review_rating": "2",
        "review_title": "Pathetic piece of dog-scheisse",
        "review_detailed_main": "The cinematography and special effects were awesome...and that's about it. Their Vikings look like a cross between a water buffalo and an Ork from Lord of the Rings. Not only that, they look like they were dumber than a bag of hammers. Nice. And I'm pretty sure I saw a BLACK Viking sewing another one's wound....hmmm....Watching this crap I couldn't help but wish I could transport a few real Norwegians from 1000 years ago to the present time and show them this stupid excuse for a movie to see them die laughing. Ooops..almost forgot...the story. \"8 Below\" looks like \"Scarface\" next to it. Makes you wonder how many miles of dick that writer had to suck to get this s$@t made...either that or the big Hollywood execs have pasta alfredo instead of their brains. 2 stars for the DP and the special FX"
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "tullstig",
        "review_rating": "1",
        "review_title": "Crap!!",
        "review_detailed_main": "This is the worst kind of crap I have ever had displeasure of wasting my time on. First of all the horses, Norwegian horses was small and the Vikings did not use them in battle. More over the language is appalling!!! It is not Norwegian and not old Norwegian??? The helmets are just ridiculous. Tis is just to mention a few of the things that are wrong. The film this is \"based on\" 'Veiviseren (Ofelas )' is an excellent movie and Nils Gaup must be turning in his grave, and he is not dead yet! There are some good violence in the movie but all over it is just crap. I wish somebody would refund the 50kr I paid to rent it. I must recommend all to rent or buy the original film as this is a piece of film history and excellent entertainment."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "powerslave421",
        "review_rating": "2",
        "review_title": "Awful Waste of Good Landscape",
        "review_detailed_main": "Where to start... This movie is full of clichés, from the classic \"finding yourself\" or \"facing your past demons\", but this only added to the pain i was being put through. It felt like i was watching the Last Samurai, which wasn't that bad in my opinion, and looked good visually. The reason i say this is...in Samurai... The main character is scrutinized by his party of origin, he is then brought in to the enemy, and lives with the enemy for years, he becomes one of them, and then in the end, gloriously fights back against his origins, not completely winning but...making an impact. Alright, now take the same plot build up...and insert Vikings as the origin, and native Americans as the \"enemy\", get the point? Alright, lets move on, the casting for this movie was terrible, Karl Urban is so cheesy, not to mention half the natives are played by pacific islanders or Latinos, maybe Apocalypto has spoiled me by having REAL Natives play the part of Natives. OK, now lets look at historical accuracy, the Natives completely over powered the Vikings in real history, sure the Vikings might have killed their share, but in violent conflicts, the Norsemen meet serious resistance, and it is not the complete Norse Domination that Pathfinder sets it as. Not to mention in real history, there are many interesting facts one could read up on about the Vinland colonization, but ill save that for a different time. The ONLY and i repeat ONLY reason I didn't give this movie a 1 is for the landscape, the backgrounds throughout the movie just look cool as hell, also, the costume design is pretty sweet. In terms of an Action movie, its terrible, who directed this? ever heard of a widescreen angle? Every time there is a fight, the camera zooms in to the faces and weapons and spins and transitions wildly so all you hear is a blade clash and then you see the after effect, but hey, maybe Tarantino and Rodriguez have set my standards high, or too high for Pathfinder at least. What a waste of an original idea and setting, this movie could've been great if done from a different perspective, and lacking all of the corny lines and disgusting dialog, not to mention the unreal strength given to \"Ghost\" in his ability to slaughter countless dumb Vikings."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "casper_janeway",
        "review_rating": "8",
        "review_title": "Not boring🇳🇿",
        "review_detailed_main": "Sometimes I feel that I did not watch the same movie as the folks who review them. This is not by any means a Hollywood blockbuster...so you have to view it as entertainment and I for one was very entertained by Pathfinder. There's action, adventure and friendship to be had and a touch of romance. This was my second viewing, first time back in 2007 and second 2018 and I imagine they'll be a 3rd sometime in the future..enjoy as I have"
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "linemanbear",
        "review_rating": "2",
        "review_title": "GEOGRAPHY makes this movie horrible",
        "review_detailed_main": "While I was mildly entertained, my mind kept going back to geography. I have been up and down the entire east coast in the USA and Canada and one scene we see them at the beach, then at a lake, and then in snow capped mountains. The closest mountains with snow like those depicted in the movie are at least 100 miles inland from the coast in New Hampshire and Maine. Anyone who lives in New England and Atlantic Canada would laugh at this movie almost from the beginning.\n\nDear movie makers, please do not save money by filming in British Columbia. If you would have spent a little extra money and filmed on location at the Atlantic coast, the movie would have actually have been believable."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "editor-299",
        "review_rating": "2",
        "review_title": "Revisionist history and poor filmcraft collide",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "Elarell_87",
        "review_rating": "1",
        "review_title": "worse piece of crap ever",
        "review_detailed_main": "No plot 2. No character development (I don't think Carl Urban made one facial expression. He has four lines.) 3. No emotion 4. Nonsensical violence (the movie is just an expression of poor Hollywood tricks) 5. Computer animated blood 6. Um, lets see, the camera was out of focus 7. 600 years before Columbus...no one in America had seen a horse ...keep that in mind movie makers 8. oh, and how's sledding down a mountain on your shield for a good 15 minutes while effectively not being shot with arrows and steering under every single fallen log? Way cool. 9. Or killing off everyone in your village twice because once wasn't enough and you really want to be like Gibson's Apocalypto 10. No. The best thing is falling off a mountain and surviving. Nothing beats that."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "christianortbrink",
        "review_rating": "2",
        "review_title": "One bad Movies...",
        "review_detailed_main": "One of THE worst Movies ever. Scenografy might be THE worst.. God actors through. Plot needs a lot more..."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "ian-jones",
        "review_rating": "1",
        "review_title": "Crap crap crap crap crap",
        "review_detailed_main": "Hmmm.....where do i begin. Not at all sure whether i should bother. As with most films i don't like trying to push my opinions of films on to other people. I believe you should all watch a film and judge for yourself. With this film however, I feel i should save you the time you would waste on it. As my summary suggests this film is for want of a better word \"CRAP\". Karl Urban was a good baddie in the \"Chronicles of Riddick\" but sucked in \"DOOM\". This guy already has the stereotypical brooding image and so he will always be cast in a role with few words which is just as well coz he cant act for S**t. All in all this film is dark, moody, gory and that is it. 100 mins of bad acting, bad scripting and very bad lighting,it even looked like a cam-like rip off for a while it was so bad. There is even a 2-3 minute sex scene with our hero and the local totty which was sooo out of place it was slightly embarrassing to watch. All in all not a good film by a long way, Most of the actors involved will be hiding there faces all the way to the bank, and if there not they should be."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "NateWatchesCoolMovies",
        "review_rating": "8",
        "review_title": "Underrated, atmospheric Viking saga",
        "review_detailed_main": "Marcus Nispel 's Pathfinder is a stark, stylized glimpse far into the past, with the story straying from a straightforward, fact based approach and venturing on a dark, primal voyage of near supernatural viking warriors. Way before North America was colonized by Europeans, fearsome Nordic warriors showed up and laid waste to the land, pillaging and destroying the homes of the Natives. On one of these excursions, they leave one of their own behind, a young child who grows up with the Natives as one of their own, and is given the name 'Ghost'. He grows up to to be a warrior, and when the Vikings return to finish what they started years before, he turns against his own kind to protect the villagers who are now his family, and begins a personal war of vicious carnage and furious retribution on them. Karl Urban plays him with the virile intensity and unmistakable frown he has become known for, and is almost like a force of nature, hiding amongst the lush, dampened foliage, a dormant piece of the terrain until his enemy stalks past, and he is galvanized into action, hacking and slashing his way through an army of spectral marauders like a juggernaut. Russell Means (RIP:() plays the chieftain of the settlement with his usual gravitas, and stunning Moon Bloodgood makes an impression as well. Urban's sleek, dog like heroics go head to head with the brutish, blunt force trauma dealt out by Gunnar, the chief of the Viking army. He is a growling monster played by an unrecognizable Clancy Brown, adorned with a flowing beard and a demonic, nightmarish helmet. Brown played the evil Kurgan in the classic Highlander, and there are shades of that character here, a relentless pursuer without mercy or reason. Much of the film happened at a frenzied pace, leaving you to catch up on the action which comes at a frenzied pace, and is shot in dark, cold colors that give it a striking comic book style edge. Critics slammed this one out of the gate; don't listen to an idiotic word they say. This is one icy blast of sword and snow violence with breathtaking cinematography, refreshingly inventive violence and a dialogue lite/atmosphere heavy vibe of primal mystery and savage deeds amidst the snowy forests of a land yet undiscovered."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "julli100",
        "review_rating": "1",
        "review_title": "Pathetic version of Vikings and Native Americans that has ever reached the silver screen",
        "review_detailed_main": "Historically inaccurate in so many ways, the Native Americans had a peaceful relationship with the Vikings and even traded with them until an \"incident\" occurred that aroused the anger of the Native Americans (some believe that it was the trade of milk products to the Natives but they did not have milk product and may have been lactose intolerant forcing them to believe they had been poisoned)and caused the Vikings to drift away from the area since they were not welcome. This movie is in one word PATHETIC in it's acting, fight scenes, historical context, costumes, direction, selection of actors, script, and everything else pretty much. It is a definitive DO NOT WASTE YOUR TIME, these were the worst hour and a half I have spent in my life...!"
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "garyvanhorn",
        "review_rating": "1",
        "review_title": "This is about as bad as a film can be.",
        "review_detailed_main": "You might think, as i did, that the concept of a brutal Viking invasion of North America circa A.D. 900 might be rather interesting. To see the legendary Indian braves face the feared Norse berzerkers would certainly pique my interest, but alas Pathfinder fails to deliver on all fronts. There is basically no plot that the audience can comprehend. The cinematography is terrible, everything is dark and murky and the shaky \"action camera\" does not help at all. As for the action, (i hesitate to use that word) is mind numbingly boring and ill choreographed, but at least it's better than the dialogue, which is as pointless and banal as it comes. If you see this movie for free, you paid waaaaaaay too much."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "Kriss-kevin21",
        "review_rating": "3",
        "review_title": "Could not finish this horrible movie",
        "review_detailed_main": "I could not finish Pathfinder when i tried to watch it. The acting is terrible, the writing is terrible , the whole thing is just plain bad.\n\nThe camera shakes the entire time which is ceaselessly annoying. They break all the rules of continuity and during the action sequences , and the whole movie, it is way to difficult to tell what is happening. For a movie that is mainly about action you think they could have gotten at least that right.\n\nMarcus Niespeil is a horrid director, and it makes me cry that he is doing the new Conan. That will most likely be a half retarded shakefest as well.\n\nCarl Urban, what are you doing here?\n\nI whole heartedly do not recommend this. i recommend that if you find a copy you burn it."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "Angus-8",
        "review_rating": "3",
        "review_title": "\"It's not your fault you're white\"",
        "review_detailed_main": "The above is a misquote from the lovable, bigoted patriarch of All In The Family. No points for guessing which word I changed, and what it was before. But what was funny in the 1970s is now a cliché Hollywood attempt at catering to white guilt.\n\nThis movie pretty well follows the same formula that Quigley Down Under and, more recently, Avatar follow: the Dances With Wolves formula. The story is about a child-Viking who lands in North America and gets separated from his people. Raised by Indians, he eventually leads them against his own sinister race, when it returns to bring oppression and genocide. His new nation, while noble and virtuous, is ultimately helpless and backwards, (that's right--it's not entirely about political correctness) and would be facing a route and certain extinction were it not for this great white hope.\n\nNow, I'll tell you what would be novel: a movie based on the hypothesis that the indigenous Vikings of Greenland where exterminated by the ancestors of the Inuit. I'd love to see that! (In the same way I'd love to see the Toronto Maple Leafs win a cup: not gonna happen.) What I'd not like to see are the riots that would follow."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "bleeding_llama",
        "review_rating": "1",
        "review_title": "The least enjoyable cinema experience of my life.",
        "review_detailed_main": "It's been five years. Five long, hard years, and me and my friends still joke about that day... that dark, unforgettably horrible day where we went to see pathfinder.\n\nThere was nothing enjoyable about this film. I don't even need to review it. It was literally the worst day I've ever spent at the cinema.\n\nThere are 'worse' films that exist. Some are 'so bad it's good', but sometimes you burst through that and fall into 'so bad it's utterly terrible'. This film falls into the latter category.\n\nIt's been a while and I wasn't quite the film fan that I'm training to be today but the problems still linger in my mind even now. I'll break down what I remember into five, easy to digest problems. Problem one, the sound. The 'score' was terrible the entire film. I believe there's about 17-22 seconds of tribal drums that are on repeat throughout the whole film and that's it. There's very little dialogue (problem two) but no action to replace it so you better get used to that beat. Problem three is poor characters. Not much needs explaining here, we've all seen these sorts of films where the characters have less dimensions than the women of 1884 novella \"flatland.\" I'll finish up briefly with: problem four, the final nail. Plot could not be more terrible.\n\nDo I recommend this movie? No. Do I dare you to watch it? Yes."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "darthlisa14",
        "review_rating": "8",
        "review_title": "Worth seeing",
        "review_detailed_main": "I saw Pathfinder last night and I was nervous that it would be awful since the release had been pushed back so many times, but I liked the film. I have to say the dialouge left something to be desired but other than that it made a good showing. The fight scenes were well done, especially the the ice sequence. I enjoyed that the main character Ghost (Karl Urban) wasn't made into some kind of super hero, just a regular guy caught in a bad situation. Karl did well with his role despite the afore mentioned dialouge, using his facial expressions and body language to further the emotional aspects of each scene without going too far and looking silly. Moon Bloodgood held her own, as did most of the other cast members. Overall, it was a good movie. As someone who practically lives at the theater I can tell you Pathfinder is better than most of its competitors. Nice job"
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "MiketheWhistle",
        "review_rating": "1",
        "review_title": "OMG this was horrible",
        "review_detailed_main": "I usually force myself to watch a movie once I start and this one was no difference except that I used fast-forward which made it bearable.In some ways it reminded me of Apocalypto (2006) which I really enjoyed but this completely missed the mark."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "wakinyaska",
        "review_rating": "4",
        "review_title": "Isn't this a comic book????",
        "review_detailed_main": "I love comic book movies despite what is being said ( or not said ) by the critics. Look, the idea is a little far fetched but well in keeping with Native ways. The costuming is imaginative if not historically accurate. The action was designed for a brutal American audience and will probably not be in theaters long.(We get enough of this fare in the news these days ). The acting is good enough and Carl Urban has the look. Not getting a Native girl for the lead smacks of the old days when Italians played Indians. A flashback, maybe. Russel Means probably needs the frogskins. Obviously, Conan the Barbarianisms are seen through out. I will buy it when it comes out in DVD but will wait till Blockbuster puts it on sale for 4.99."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "abbo-67915",
        "review_rating": "1",
        "review_title": "Just too terrible to watch",
        "review_detailed_main": "Switched off after 10 minutes, couldn't bear the stupidity anymore. Just about everything is wrong, depictions of both natives and vikings, ships, clothing, horses, arms etc etc."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "Chris0184",
        "review_rating": "1",
        "review_title": "Snooooooore...",
        "review_detailed_main": "I am usually a massive advocate of \"It's a film, it's made up or they are using artistic licence, so get over it and enjoy it\". However, in the case of Pathfinder I simply cannot.\n\nI have now attempted to watch this twice, the second time assisted by a bottle or two of wine and still have been unable to make it past 40 minutes.\n\nThe story is terrible, the acting poor and the \"Vikings\"?!?!? They look more like something out of Mad Max or Chronicles of Riddick.\n\nThe CGI effects, especially during fight scenes, are extremely poor - a sword clearly touching someones back provides us with a massive splash of CGI blood that is just unrealistic.\n\nSimply appalling. I won't be trying a third time with this rubbish!"
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "ShadowKalypso",
        "review_rating": "1",
        "review_title": "Worst movie I've ever seen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "DarkVulcan29",
        "review_rating": "8",
        "review_title": "It's no Braveheart or 300, but still good none the less.",
        "review_detailed_main": "This movie is has intensely violent has they come. The story of a boy who is left behind by his viking father, is adopted by American Indians. 15 years later when grows into a man(Karl Urban of The Chornicals Of Riddick, Doom) is feeling left out,cause he is not an Indian. But then the Vikings that abandoned him years ago led by Gunnar(Clancy Brown) slaughters the whole village that raised him. He soon declares revenge on them. Karl Urban does pretty well in this role, he looks like a combination of Tarzan and Conan, and he is built like an athletic swimmer. And Clancy Brown is good as the villainous Gunnar, he shore has not forgotten how to use a sword after Highlander(1985), not to mention he looks like Darth Vaders ancestor. The direction was a little sloppy. But still a great film, and the action was great also."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "jptradehome2",
        "review_rating": "1",
        "review_title": "Holy lord, this is a bad one.",
        "review_detailed_main": "Where do I start.....I have been a faithful \"reader\" of Internet Movie Data Base for many, many years. Out of all the movies I have seen in the duration, this is the first one that has inspired me enough to \"comment.\" I'm embarrassed for anyone who was even affiliated with the film. The only thing good about it was when I farted halfway through. It relieved a lot of pressure in my gut, but it sure smelled bad though. Even with eating Chipotle tonight and my stomach not feeling well, the smell of my fart was no where near as bad as the writing. This movie doesn't even deserve as many words as I have already written, so I will say only two more; \"Hot Garbage.\""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "marauder761-1",
        "review_rating": "1",
        "review_title": "Jeez",
        "review_detailed_main": "I don't know what to say about this film , except how awful it was. It cost me and a friend 20 dollars to see this heap of crap. The acting was \"wooden\" and unprofessional at best.The plot was thin to begin with stretching it even more by the plodding screenplay. It seems maybe the players were cast from a junior college drama dept. The only thing this film had going for it was the scenery....hardly a reason to watch a movie. The portrait painted of the Vikings was hilarious...they may as well have made them space aliens or monsters. I would pass on this movie once it comes to video as well,. I'd take a rainy Saturday afternoon watching golf or fishing shows over agonizing through this sh*t again!"
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "grantss",
        "review_rating": "3",
        "review_title": "Very disappointing",
        "review_detailed_main": "Started well and gave me high hopes for the movie, despite its no-star cast. But the further one got into the movie, the more hole-ridden and formulaic the plot became. Very disappointing in the end."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "speartackle89",
        "review_rating": "3",
        "review_title": "The Downfall of Karl urban",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "refdan",
        "review_rating": "3",
        "review_title": "If you like realistic scenarios then skip this",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "wanbliwinyan",
        "review_rating": "9",
        "review_title": "Fun and Action Packed",
        "review_detailed_main": "My grandson and I went to see this movie today . . .so while it is fresh in my mind, I will give you the opinion of a adult and a teenage young man.\n\nWe both truly enjoyed the movie. We both enjoyed the \"film noir\" appearance, which truly captured the essence of the movie. It is NOT a happy movie, so if that's what your looking for you sure came to the wrong show.To have it all filmed in color would of ruined it as far as we were concerned.\n\nMost of the Native American actors I have seen in other movies and they were great here. My first time to see Kevin Urban, he was truly believable in his part as were all the actors.\n\nI have only two criticisms, the \"vikings\" we're a bit on the silly side and the CGI goes on way too long.I don't want to write a spoiler, so will let it go at that.\n\nI have that issue with most \"action\"movies today. They take a scene that full of edge of the seat action, then just keep going with it.I say, make your point, scare the pants off us, then move on.\n\nIf you like action movies and you like anything Native American, you will like this movie.\n\nSincerely, Linda Hayes (Choctaw/Cherokee Nations)"
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "Darkweasel",
        "review_rating": "4",
        "review_title": "Dances with Vikings - In Slow Motion",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "xxryanxx-2",
        "review_rating": "5",
        "review_title": "A different kind of action movie",
        "review_detailed_main": "I have to say this movie was okay in the sense that it WAS different from other action movies.\n\nI find things about Vikings really interesting. During the movie you get the idea that these Vikings were almost monsterish and inhuman by the way they act. I liked the way they were portrayed. This movie reminds me a bit of the classic \"Beastmaster\" in a way, or at least the main character does. It's a little slow to get started in the action, but works up to an average entertaining plot.\n\nThis movie follows in the path of movies like the recently re-made 10,000 B.C. Pathfinder came out at the same time 10,000 B.C. did, and undoubtedly, lost the battle at the theaters. I picked up Pathfinder for $10 at Wal Mart and I personally enjoyed it. It has a bit of a romantic plot to it at as well, and that always meaningful \"life lesson\" to be learned in the movie. It's kind of long and as I said, can be quite boring until the last hour of the movie. For $10, I think it's worth the watch but overall I have to give it a 5/10."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "dadwise_gamgee",
        "review_rating": "2",
        "review_title": "I Lost 88 minutes of my life that I'll never get back",
        "review_detailed_main": "Okay, so I gave it a two. That is only because there was an attempt made to make the battle scenes exciting. That was it.\n\nThis movie seemed to be an attempt to gather the best of some really good films and lump them together in a feeble try to make a blockbuster. Most notably \"300\" and \"Conan The Barbarian\". The movie is factually inaccurate on almost every level. Not to mention I found it extremely funny that while the Indian's were able to speak perfect English, slang included, the so called Vikings had to be sub-titled.\n\nAt one critical moment in the film, critical only because my eyes were open at that time.....the lead character \"Ghost\" is asked whether the location chosen for their stand against the barbarians is a good one...is response is...\"Yeah\". Powerful! What writing!\n\nThere is a moment where a young Indian girl is being chased through the woods by the barbarians, and at one point she pauses and turns to see her pursuers and gives almost the same exact look at you see from Macauly Caulkin in \"Home Alone\"....same scream, same look on her face, all that was missing was for her to slap her cheeks as she yelled.\n\nSwords floated gingerly down to the bottom of a lake....A wise Indian proverb is uttered...something to the effect that the only battle in a mans heart is between Love and Hate.\n\nWhat else to say? This movie had the potential to be a wonderful epic had they spent a lot more time on the writing, direction, music, and story in general.\n\nI wouldn't waste the cost of a Netflix transaction on it. You will come away with a blackout in time."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "marulez",
        "review_rating": "1",
        "review_title": "Total Garbage",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "wox-one",
        "review_rating": "9",
        "review_title": "A stunningly artistic film",
        "review_detailed_main": "I thoroughly enjoyed this movie for it's beautifully stunning and original cinematography, intelligible symbolic casting, stage design depicting era-esquire yet artful representation.... A very beautiful film. The costume is phenomenal; exaggerated, and portrays extremely barbaric foreign invaders. The natives are portrayed as extremely organic and peaceful warriors. Though the only downfall is that it is not historically accurate as proof has been discovered that the viking and Old Norse folk were farmers who very much lived in harmony with the land and explored looking for \"free\" land in which to live; land outside of royal taxings so it is less than probable that they did any pillaging at all."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "davidmvining",
        "review_rating": "2",
        "review_title": "What an ugly movie.",
        "review_detailed_main": "I don't know what drove the director to take the lush colors of the forest and drain everything out of it, but he did. Instead of deep greens, bright whites, and vibrant blues, we get muddles of grey. From beginning to end, Pathfinder is just a pain to even look at. It doesn't help that the rest of the movie is a joke.\n\nA Viking child gets adopted by some Native Americans and grows up to be a strong member of the tribe, though not quite of it at the same time. Vikings come and ravage. Ghost, the former Viking, leads the fight against the Vikings. It's a really simply story, but the problem is that everything that the filmmakers try to hang on that simple story is kind of terrible.\n\nThere are no characters to speak of. The only one approaching character status is Ghost himself, and it feels like an afterthought. He's lead action man for most of the film until near the end when he gives some boilerplate and short speech about how he knows who he is. It's a question he hasn't been struggling with through the movie. He's identified with the Native Americans from the start, never siding with the comically villainous Vikings, so when he makes his declaration that he's against the Vikings it's an obvious statement of fact instead of some kind of denouement to a character arc.\n\nWell, it's supposed to be a full on action movie, so that's what we need to hang onto, right? Well, the problem is that the action is never more than adequate. In fact, most of the time, it's outright bad and incomprehensible shaky cam filmed three inches from the action. Geography makes no sense as Ghost appears and disappears without any sort of logic. I got serious Predator vibes from the middle action section, but Dutch's fight with the Predator in his film was clearly established and executed while Ghost's fight against the Vikings is against an unknown number of enemies (they seem to have an infinite supply of canon fodder until the end) with traps that don't get established all during action that makes no spatial or sequential sense. Oh, and it's hideous to look at.\n\nThere's a moment a little more than halfway through that made me laugh out loud. Ghost, at the end of this Predator-esque trap and action scene is standing on an incline, ready to lead the Vikings into a massive trap that will end them. He's been alone save with one helper, and then every Native American warrior from the local village pops out of nowhere and they all fall into the trap themselves. Ghost didn't set up the trap, it was there already (unless he dug a 6 foot deep trench a few dozen feet long in a few hours) so there's a good chance they should have known about it just like he did. But even if they didn't, the lack of coordination and the fact that they all fall into the trap at once is silly to the point of comedy, except it wasn't intended to be funny.\n\nLaughing at the stupidity was the only source of enjoyment from a dour, ugly, and depressingly unstructured film."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "tryggvikr",
        "review_rating": "1",
        "review_title": "I am icelandic, the language they speak is raw and ugly icelandic so this movie is quite funny",
        "review_detailed_main": "I have nothing to say about this bad movie Lalalalalalaalalaak"
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "Fat_Achilles",
        "review_rating": "3",
        "review_title": "Nice viking hats",
        "review_detailed_main": "Not much to say about this movie. It was a waste of time and resources. The fact that a studio chose to produce this script and allowed Marcus Nispel to direct I find really frightening.\n\nThe Viking costumes were the most redeemable quality the film had. Doubtful if they were historically accurate, but when a whole movie is bogus, what difference does it make if the costumes are embellished. The Vikings reminded me of the orcs in Warcraft (the video game series by Blizzard) and the Death Dealer character of the great fantasy artist Frank Frazetta.\n\nI would not recommend this movie to anyone (unless I knew they were specially interested in fantasy art/costume design)."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "Slarkshark",
        "review_rating": "5",
        "review_title": "Not As Good As I Remember",
        "review_detailed_main": "Actually it's a lot worse. I seem to recall this film being a solid entertaining action film. That's what it aims to be, but falls very flat. It came out the same year as '300' and almost seems like it's going for the same filter look and dark imaging. And to be clear, '300' is a 10/10 for me. So it may have been trying to be within the same vein, but just ends up with no heartbeat.\n\nI'm a huge Karl Urban fan, but this is near the beginning of his career and the script throughout is horrendous. Clancy Brown and Moon Bloodgood are usually great as well, however, once again the script... and you can hardly recognize Brown anyways.\n\nHistorically speaking there's also a lot of inaccuracies, though I'm not a huge stickler when it comes to historical accuracy in an action movie. They're made to entertain, this one just does a poor job at both."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "Vartiainen",
        "review_rating": "4",
        "review_title": "Muddled and lacking in focus",
        "review_detailed_main": "The biggest problem with Pathfinder is that it's style over substance. It feels less like a movie and more like an hour and a half long heavy metal music video. And on some level that's awesome. It has native Americans fighting demonic vikings, on majestic mountains, in the middle of a raging winter storm. As I said, heavy metal.\n\nBut, even though I know I have to turn in my male membership card for saying this, it needs more. It needs to have characters that have actual, well, character. It needs to have dialogue. Because there actually is very little of that in here, it's mostly just wordless action. As I said, music video. It needs to have a plot beyond basic good guy kills bad guys. There really are no actors, only stunt men. The location is unrealistic, the vikings laughably over the top, it suffers from the oh so enraging \"in the end it takes a white guy to solve the problem, even when the problem is the white guys\" syndrome and it's about the definition of brainless.\n\nThen again, did I mention the demonic vikings. Because they're cool, they're really cool. I cannot deny that a significant part of me went \"Oh yeah!\" more often than not while watching this film. And sure, the visuals are needlessly dark and muddled, but the action itself is pretty cool to watch, the designs got a lot of things right and there is some \"so bad it's good\" value to this. It's dumb, but if you've ever wondered what it would be like if your favourite heavy metal music video was longer and had something resembling a plot, this might be worth a watch. Pop in some Amon Amarth, turn down the volume of your TV and enjoy."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "omorg-pub",
        "review_rating": "9",
        "review_title": "highly underrated",
        "review_detailed_main": "brutally torn apart by the official critics, Pathfinder is both my favorite Karl Urban performance and a classic story of the outsider finding his place and his identity in this world through courage and companionship. Anyone who can't identify with this plot has been through too little trouble in this world and little self-searching. It may be true that there is little originality, but has it not also been said there there are no truly new stories to be told in this world? and that was said many centuries ago. not the best film to be made in modern times, but far, far from the worst and there are more highly rated films and TV that are vastly worst."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "pempel",
        "review_rating": "1",
        "review_title": "Don't trust your first impression...",
        "review_detailed_main": "... when you see this flick in a video store, which should be something like 'Well maybe this isn't the best plot but there might be some good action to see, it's Sunday evening, why not ...' Just turn around and walk away. Quick.\n\nWhen a friend of mine chose the movie to watch I was highly skeptical. And within the first 5 minutes of the film, I knew I was right to be so. Read the previous posts for all the shortfalls the filmmakers created including a lame plot, poor acting, very bad editing and so on. And go see 'Apocalypto' if you're interested in such kind of plots.\n\nBut what makes this movie nearly impossible to watch for me is the hole style of cinematography the film was shot in. What might look nice on the cover is a pain in the a*** to watch. Almost the entire movie is shot with an annoying amount of back-light to every scene. You can't hardly tell what's actually going on in the foreground in every single take. Combined with the ridiculous editing even the fight scenes are wasted. Oh yeah the fight scenes... they're entirely shot in slow-motion. Probably that's the reason why the editing went out of control trying to add some pace to the action... which failed big time!\n\nIn my opinion it seems that neither the creators wanted to make an aspired blockbuster nor an intentional B-movie. It is neither controversial nor fun to watch. They just made a movie that's not worth to mention ever again. It's pure waste. I can only guess that the producers needed a good opportunity to depreciate some money."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "kt411",
        "review_rating": "1",
        "review_title": "More bad than I ever thought possible",
        "review_detailed_main": "Given that my sister has terrible taste in movies I did not have high hopes when she suggested watching this movie. Any hopes I had that it would be at least watchable were all too soon extinguished.\n\nI actually got more entertainment out of reading the reviews than watching this movie. Absolutely no redeeming features to this movie. The acting is horrendous, the 'vikings' are caricatures as are the native Americans.\n\nWith no plot it is really hard to have character and story progression. I feel like this movie is exactly what is wrong with Hollywood - the time, money and resources that were spent making this movie should be an embarrassment to all involved.\n\nDo yourself a favor and read a book instead of watching this crap."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "damianphelps",
        "review_rating": "5",
        "review_title": "Should Have Been More",
        "review_detailed_main": "Urban works the role well.\n\nSadly though the film doesn't plunge into the depths of depravity that I wished it had.\n\nThe film needed to have more anguish and pain, blood, gore and some sex appeal. Its portraying an existence of struggle but the struggle is not enough :)"
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "astrobill1968",
        "review_rating": "3",
        "review_title": "* So Disappointing *",
        "review_detailed_main": "I was incredibly disappointed in this film.\n\nI watched this expecting it to be a smart, historically-based film about what might have happened if the Vikings -- who we know settled in Newfoundland and New England for a time -- had left behind a boy to be raised by Native Americans. Would he be found years later by later Viking expeditions? Would he fit into Native American culture? What later conflicts might ensue? Or might he serve as a bridge between two cultures?\n\nInstead, the movie is a crazy mish-mash of over-the-top sword-based gore, and little else. The \"Vikings\" look NOTHING LIKE any actual Vikings at all, with costumes, gear, and helmets that are more inspired by Frank Frazetta fantasy paintings from the 70s and 80s than any actual Norse history. Their evil, ferocious behavior in the film is completely fabricated as well. These are just about the most UN-Viking people one could imagine. Moreover, their longboats are about three times larger than any actual Viking longboat found to date...just non-sensical.\n\nEven the Native American villages seemed to depart from known facts about them as well.\n\nThe combat scenes were over-the-top, repetitive, and non-sensical as well, with little self-consistency or grounding in reality.\n\nI'm disappointed in Karl Urban for agreeing to act in this film and wonder if he ever read the screenplay before taking the role.\n\nI sincerely HOPE someone makes a decent movie about what might have been based on a bit more real-world facts about the known Viking settlements in North America.\n\nIf anyone is interested in a SMART, dramatic, historically accurate, well-produced series about the Norse who conducted raids on England (i.e., went \"viking\"...it's a verb, not a noun, in truth), I strongly recommend History Channel's dramatic fictional series \"Vikings.\" Even the acting kicks butt, with Gabriel Byrne playing a key role in most of the first season. The cinematography is breathtaking...especially in the second half of the first season. Moreover, the textured, nuanced portrayal of the peculiarities of the REAL-WORLD Norse culture of centuries ago are fascinating and, at times, shocking."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "ottoskorzeny-53649",
        "review_rating": "2",
        "review_title": "Painful",
        "review_detailed_main": "If i had paid to see this, id be pissed. It's not often i don't make it all the way through a picture, because i want to see the whole thing and give an honest review. Couldn't make it through half. Was board and mind was wondering about five mins in. The 5x too long combat scene reminded me of a ridiculous 70's bruce lee choreographed fight scene, where no one tires and it lasts forever. Question: when did horses get to north America? Answer: Apparently before the Europeans according to this movie."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "mrlennertz",
        "review_rating": "9",
        "review_title": "Expected Nothing, Got an Entertaining ACTION movie.",
        "review_detailed_main": "I watched this one with NO expectations. I enjoyed the action and the minimalist qualities. The film looks great, and the action is enjoyable. It is a film where a little is a lot. The natural settings are great, and the lack of well-known actors is a blessing.\n\nI read some reviews complaining about historical accuracy and absurdities in the plot. My response: Who cares! It is an ACTION movie. The genre is absurd.\n\nRegarding offending Native North Americans or those of \"Viking\" background, lighten up. The film is just an ACTION movie. Yes, the Vikings are blood-thirsty savages who looks wonderfully scary (perfect ACTION movie villains) and the Indians are too \"wise\" yet out-gunned and need a \"white\" man to help them. So what! It is an ACTION movie trying to do something a bit different.\n\nIf you like ACTION movies with different settings and want to go on a mindless, fun journey, watch this movie...just don't expect it to be something it wasn't intended to be.\n\nIt is just an ACTION movie after all."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "travelducky2",
        "review_rating": "4",
        "review_title": "Utter stinkfest...and yet....",
        "review_detailed_main": "Let's see...the acting sucked, there was no continuity or logic in the storyline, the action sequences were too choppy and too short... And I could just go on and on with the things that this movie DIDN'T do. And yet....I kept watching. Even though I constantly pointed out to myself how bad this thing was, I didn't entertain the thought of hitting the 'stop' button. I don't know why.\n\nSo why the 4 stars? Partially because of the fact that it DID give me my 1 dollar's worth of distraction, and partially for the movie that this COULD have been. The concept of a captive using the land that he knows (his only weapon)to slowly whittle down the numbers of his captors, could have been amazing if it was expanded upon by a competent storyteller.\n\nOh well."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "mach37",
        "review_rating": "4",
        "review_title": "Special effects, good, but too much repetition spoiled the film",
        "review_detailed_main": "Some kind of record must have been set for number of decapitated heads rolling in one film; likewise, gallons of fake blood spraying during the decapitations and limbs being severed. All pretty realistic except the volume of blood spraying was a bit much. All in keeping with the film-makers decision to use horny helmets on the Vikings in spite of known to be inaccurate.\n\nTen minutes were spent cliff-hanging by a rope, with the rope refusing to fail until it finally had to be cut with a knife/sword. This was the darkest film I have seen since \"The 300\" - apparently a feature required when setting graphic novels/comics for the big screen."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "girlocelot",
        "review_rating": "1",
        "review_title": "See the original by Nils Gaup",
        "review_detailed_main": "Nils Gaup created the original Pathfinder. It's only on VHS tape, it may be very hard to find, but find it you should because it's beautiful, rich, exotic, heartfelt, exciting, frightening, strong, clear.\n\nWhen you've finished reading reviews of this film, find reviews of Gaup's & read them! I noticed that the director of this new version credits Gaup for having inspired the new Pathfinder. Pitifully, he wasn't really inspired to make a good film, because he he punctured & deflated a timeless story made by a real artist.\n\nThis current version modifies the story line but doesn't improve on it, & takes the bare-bones of a common experience in all cultures - the rough male hunters with better weapons killing the settled, family-based tribal groups, & turns it into a sappy, unconvincing, feckless exercise in Big Bad Guys & Nice Good Guys.\n\nYou will enjoy the original - the reality of the story will feel somehow familiar. You may remember playing hide & seek as a child, or simple chasing games, thrilling precisely because they are real. You will admire & appreciate the young man who becomes the Pathfinder in the original - he defines what it means to have greatness thrust upon you. You will like the elder who instructs the young man. You will appreciate the silence of the snow, the forbidding landscape, that everything's made by hand, the view of primitive life that is yet not so different from ours in its simplest elements.\n\nThe original Pathfinder features dialog in Sammi, & uses exotic looking actors. The village people are fresh, simple. Watching them almost feels like a documentary.\n\nThe bad guys in the original are very scary - big, strong, dark, relentless. They have lots of big metal swords, they have tough clothing, they have good boots. All those details are done artistically & beautifully. The scariest thing about them is not their \"beserker\" outlook, emphasized in the remake, but the hard fact that they have planned out the annihilation of their prey dispassionately. You don't simply hate them, you fear their strength of will & their vision of utter destruction.\n\nThe young hero is as terrified as anyone would be by seeing these cruel & massively powerful killers come closer & closer to his loved ones. How he handles his fear, & what he does to become the Pathfinder, is especially what's missing from the remake.\n\nBut I'm not going to even talk about this current version since I think it's not worthy of conversation. As an adventure movie, it's just OK, nothing great. But you might want to see Conan the Barbarian instead.\n\nNope, there's nothing remarkable about the new Pathfinder, but if it gets Gaup's film released on DVD, it will have been worth the effort it took to make it.\n\nWatch it if you must. But then, Please! Find the original!"
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "shumwam",
        "review_rating": "1",
        "review_title": "Nothing but a string of cinema cliches",
        "review_detailed_main": "Dreadfully stupid mash up of Seven Samurai, Die Hard, Gladiator, and Tarzan memes, with all the popular action movie cliches represented, and all poorly acted. The main actor simply could not be any more wooden. If it weren't for the dozens of ridiculous jump scare attempts, there would be no drama at all.\n\nIf I were forced to say something nice about this movie, it would be: The Viking costumes are kinda cool? As long they are exclusively shown in ultra-high contrast \"stylistic\" monochrome, that is.\n\nOh, and the accidental use of the comically large shield as a snow coaster sled gave us a bit of classic \"Bond battling hordes of baddies on the slopes\" action, so there's that... Oof, this one stinks."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "willcundallreview",
        "review_rating": "3",
        "review_title": "Pretty Awful action film with little feel to it",
        "review_detailed_main": "Pathfinder is an action film that although has some well choreographed fight scenes, never does much better than that, and also the only reason I didn't rate it lower. With poor acting to contribute to the already negative sounding movie, you can't help feel whilst watching \"who ever thought this or that was a good idea\". At least it was a short movie, probably one more reason it isn't nauseatingly bad, I felt it was just about a bad movie, and here below is why so.\n\nThe story is one that isn't always seen, but nevertheless is still played out very badly and never gets to the point I feel it wanted to reach. I did enjoy(slightly) some of the action scenes scattered around, mostly in the middle it has to be said, and they can actually make you want to keep looking at the screen. It could have been better if it had put in more action, it may sound like a terrible formula but even over the top fighting would probably have saved this movie just a little bit.\n\nKarl Urban is not the worst actor, and been in some blockbusters before, but here he seems out of place and very still like, almost as if they cast George of the jungle to be the main character. Russell Means as the Pathfinder is really quite good and is probably the only actor in this that puts in a serious display, sadly he is wasted in most of his scenes. Any chemistry the makers wanted never comes to fruition either, even when people are angry at one another they still seem to be good friends for some strange reason.\n\nThe directing is pretty bad but not the worst thing seen here, some scenes at the end and of course any action is well done and so the director isn't all at fault. The writing is bad to say the least, just not one piece of dialogue seems to be any thing other than basic, the thing is some parts are set up quite well just to be wasted by the script involved. Special Effects are unneeded but used, instead of building sets which are pretty simple they decided to digitally do certain things, which make the film look very cheap but also ruin what could have been decent parts.\n\nI said before about the action, not too bad and well done in most parts when not ruined by effects or acting. One thing that is well done are the grim scenes, any part which is meant to be a dark and horrible bit is actually done quite well and you can at time feel genuinely bad for the people on the wrong end of the scenes. Other than those points and Russell Means acting, not much more positivity to give I'm afraid.\n\nIf you want to see an action filled film, and don't care about the script, directing and acting, then this could be for you for sure. If you also like blood and guts, I guess partly this could be for you too, not so much guts but very bloody when in fighting. If you want to see a well worked drama piece then stay away, this is possibly a great definition of bad drama, working with over used fighting.\n\nOverall it is just about a Pretty Terrible movie and one that so nearly is just \"Bad\". As said It isn't long and so it means you aren't too annoyed you wasted your time viewing it by the end, although you may have a few choice words by the time it is finished. I must stress there are worse movies out there so don't think this will make you puke in disgust, well maybe you will a little."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "twoods6523",
        "review_rating": "8",
        "review_title": "i really liked it!",
        "review_detailed_main": "just finished watching the movie on DVD and i have to say i really liked it... i am surprised to see it got such a low rating on here.. someone commented on 300 being better, and honestly 300 may have been a visual masterpiece but i found PATHFINDER much more interesting... it had a decent storyline and lots of battle gore.. it is basically a good old fashioned action adventure film.. if your looking for an Oscar contender than your looking in the wrong place, i myself try not to be overly critical of movies.. i try too see them for what they are and judge them accordingly.. if a movie is entertaining and does what a movie in its field is supposed to do than i am content.."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "horseradish_bw",
        "review_rating": "1",
        "review_title": "Better go to church...",
        "review_detailed_main": "The worst movie I have ever seen!!! Only pictures are OK, rest is a total crap, the worst thing is a screenplay. The movie is inconsequent from the beginning till end. I cannot even name this crap a 'movie' better thing would be a slide-show with background music and dialogues. First hour is just mega-boring, and when comes to action it's even worse. I really can't understand people who say that this movie is good, is wasn't even entertaining and funny. It was miserable. I thought that the worst movie I've ever seen is \"Wiedzmin\" (The Witcher), but guess what, \"Pathfinder\" is much worse!!! OMG this is impossible you will say, but OMG it's true!!! I advise you to watch this crap just to see and understand how bad the movie can be. After one hour of watching you will say that AvP is an Oscar creation. Have fun!!!"
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "sarastro7",
        "review_rating": "3",
        "review_title": "Poor Karl Urban",
        "review_detailed_main": "I am a big fan of Karl Urban, especially since his cool role in Doom. I know it was a fairly crappy movie, but I really liked Urban's character. He's been good in other stuff, too, of course, but I'm kind of waiting for him to get his big break. Pathfinder certainly isn't it. A vague remake of the excellent Norwegian 1987 movie \"Ofelas\", Pathfinder is the quintessential commercial Hollywood remake. The Samic people are now Native Americans, and the marauders are now monster-like vikings in a kind of horn and skull-adorned armor that would seem to have escaped from one of Richard Wagner's nightmares. And of course the violence and action are now CGI, making for plentiful splattering of blood and mud all over the place. Subtlety is a concept unknown to this production, and one wonders what good actors like Urban, Brown and Bloodgood are doing here. They're certainly not providing great cinema, that much is a fact.\n\n3 out of 10."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "chewuup",
        "review_rating": "1",
        "review_title": "Omg Worst Film Ever",
        "review_detailed_main": "really cant too many words on this film , i brought it for £6 in discount bin , i even took it back it was that bad. the only other film that was close to this bad was naked lunch and i walked out while watching that in cinema . its not a new film but wanted to let everyone know Don't WATCH IT !!! i would rather put salt in my eyes than put myself though that again , im still angry that i put myself though it. if anyone has seen it and is more angry about it than me would like to hear about it lol. it was my own fault i was watching it bed and controls was too far away (too lazy and cold to move) hope this helps my rant is over now"
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "Beard_Of_Serpico",
        "review_rating": "4",
        "review_title": "So much potential ruined by bad direction and shallow plot.",
        "review_detailed_main": "Pathfinder has a great cast including the criminally underrated Karl Urban and Clancy Brown and the set up is really intriguing.\n\nI love dark and violent historical and fantasy movies so i was sure i was in for a good time. It does look great with bloody action and the vikings look huge and intimidating. Seriously they are like WWE wrestlers in armour, it's very cool.\n\nHowever the direction is awful especially in the action scenes. There's so much shakey cam and some scenes are so dark it's legit hard to tell what is supposed to be happening. Just hire a decent action director or stunt coordinator, it really makes a world of difference.\n\nShaking the camera around doesn't make your movie more intense and exciting, it just makes it annoying to watch.\n\nSo much wasted potential, this could have been a very cool movie."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "Wuchakk",
        "review_rating": "5",
        "review_title": "Great-looking action/adventure flick is dramatically weak and banal",
        "review_detailed_main": "Vikings come to North America hundreds of years before Columbus bringing death & destruction to the Beothuk people in what is now Newfoundland. One of the latter, Ghost (Karl Urban), is actually a Viking by blood, a survivor of a previous Viking expedition.\n\nI thought this was going to be some low-budget Syfy flick but, no, \"Pathfinder\" (2007) is a theatrical release with stellar production values. The first thing I noticed was that the director is Marcus Nispel, who went on to direct the 2011 version of \"Conan the Barbarian.\"\n\nThere are some glaring derivative bits sprinkled throughout, like Tarzan, \"Conan the Barbarian\" (1982), \"Rambo 2,\" \"Last of the Mohicans,\" and so forth. This isn't helped by forced lines, like the exchange about the two wolves within each individual. Clichéd bits like this CAN work, but they have to be better executed.\n\nThe antagonists are the Vikings, who are depicted as comic booky inhuman monsters, whereas the natives are virtuous. This brings up the whole nature vs. Nurture issue as Ghost is of Viking heritage but because he's brought up by the spiritual Beothuk people he isn't corrupted by the Vikings' ways. This suggests that evil or immorality is socially spread.\n\nRussell Means, who played Chingachgook in \"Last of the Mohicans,\" is on hand as the elder Pathfinder. It's great to see him still truckin' along at almost seventy years old.\n\nThe film was shot in British Columbia in mostly forest settings, but with occasional mountains that don't look much like the Northeast; some do though. Despite this flaw, \"Pathfinder\" is a visually striking film from beginning to end, and I don't just mean the scenery. Nispel knows how to make a spectacularly good-looking movie, that's for sure. In fact, it's so awe-inspiring it's worth the price of admission.\n\nUnfortunately, I can't say the same for the story. Everything is here for a quality movie, but somehow the story just isn't all that captivating like \"Last of the Mohicans\" or the original \"Conan the Barbarian,\" although it's serviceable. Some complain about the extreme violence but it's not necessarily a case of violence for the sake of violence as there are dramatic valleys to contrast the violent highs. Depth is hinted at, it just needed more. Meanwhile the overkill action sequences needed reigned in.\n\nThe film runs 1 hour, 39 minutes.\n\nGRADE: C."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "sbevelle",
        "review_rating": "8",
        "review_title": "IDENTICAL TO COMIC! WOW! IMAGERY!",
        "review_detailed_main": "I waited for this for a very very long time. I won the comic at a movie theater conference. I had always thought the comic had the most amazing imagery color choices theme. All of it was there. I have only recently found this movie, which has been out for 15 years and I did not know, but however, they did this, and made it like the comic is truly, a skill even acting fits in with the theme of Vikings, although made simple end understandable the filtering and costumes. There isn't anything I have seen that is almost like the book or comic like this. I am truly going away with the time it must've taken."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "tricoven",
        "review_rating": "4",
        "review_title": "Fails in comparison",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "Tweetienator",
        "review_rating": "5",
        "review_title": "The Origin of Rambo?",
        "review_detailed_main": "The production and action is okay, the hero of this movie must be the grand-grand-how-many-grands-I-do-not-know-father of Rambo. This is in my view the weak point of the story/movie. It's just not believable and the Vikings hunt him like idiots. The historical inaccuracies do not matter, that's at least my opinion, because Pathfinder is simply just one action fantasy like many and not an historical movie. All in all okay, if you need to kill some time with mindless fun."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "kusko44",
        "review_rating": "2",
        "review_title": "Watch the Original!!!",
        "review_detailed_main": "Please don't waste your time watching this movie!!! The foreign film by the same name that was made in 1987 is leaps and bounds better than this movie. I would say maybe an 8.5 out of 10 in my book. I'm sure the budget for the Norwegian made Pathfinder had about a 100 times smaller budget(seriously!!) but it is 100 times more enjoyable than this POS. The acting is way better and realistic. The bad guys in the original are not covered in skulls and 8 feet tall but their realism makes them a lot scarier then the \"video-game esquire\" villains in the 2007 version...I could go on and on..but watch the original...and if you still want to watch the new one..go ahead..you'll get a good laugh at the irony of pumping millions of dollars in to a remake which can't even lay a finger on the original."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "radoslav-2",
        "review_rating": "1",
        "review_title": "If i made this shite of a movie, i'd be embarrassed and change my profession into a butcher or something",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "tsmithjr",
        "review_rating": "3",
        "review_title": "Karl Urban, how could you?",
        "review_detailed_main": "I titled this \"Karl Urban, how could you?\" for a reason. Karl Urban's done so many great movies and is an all around great actor. Okay, yes everyone loved the Lord of the Rings trilogy. But he's been great in many others too. And Clancy Brown was in Pathfinder too. How could you lose I say? I think you can tell I expected a lot from \"Pathfinder\". Well, it never delivered. Not even close!!! The acting was as good as it could be. But the writing (stay on strike, whoever wrote this) was awful. And worst of all, were the sound effects. The biggest sound effect joke came at one point when Karl Urban was running over some hills and in the background, from a distance, you hear grunting which, instead of reminding one of running, was more fitting for a porn movie!! It was purely dreadful.\n\nThe whole thing simply didn't click. Pathfinder is a waste of your time and money. If you know what's good for you, you'll clear a path and find your way to any other DVD in the store or any other movies you can find in the trash bin."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "darrenbjones",
        "review_rating": "8",
        "review_title": "It does exactly what it says on the label.",
        "review_detailed_main": "If you're looking for an historically accurate film that deals sensitivity and sensibly with the Viking arrival in the New World then this isn't the film for you. If however you're looking for an action packed movie with terrifying Viking marauders then step right in, the water is great. Fun, exciting and always entertaining, this is a great popcorn movie."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "Buddy-51",
        "review_rating": "3",
        "review_title": "uber-violent action film",
        "review_detailed_main": "With scenes lifted straight out of \"The Last of the Mohicans\" and \"Alexander Nevsky,\" \"Pathfinder\" is little more than a 107-minute-long exercise in nonstop gore and bloodletting.\n\nLocated in a sepia-toned forest that looks like a leftover set from the \"Lord of the Rings\" movies, \"Pathfinder\" chronicles the ongoing battle between a tribe of peace-loving Native Americans and a bunch of blood-thirsty Vikings who invade their land. As the movie opens, an Indian woman stumbles across a frightened little boy, the sole survivor seemingly of a Viking raiding party. She takes him to her tribe where he is brought up as one of their own. Then, after the boy has grown to full manhood, a new group of Viking warriors lands on shore to once again rape, ravish and pillage the native population ad infinitum and ad nauseam. The young man now gets to defend his adoptive people against his native one.\n\nOnce we get beyond the corny, self-reverential dialogue and all the pantheistic mumbo-jumbo common to movies of this type, we're pretty much left with just the violence in the film, which is so constant and so over-the-top that it becomes utterly ludicrous after awhile. The mud-soaked, grungy look so painstakingly established by the costume and makeup departments is almost completely undermined by the fact that all of these 9th Century savages have the most amazingly glittery, perfectly aligned teeth this side of a Crest Whitestrips ad.\n\nDespite this rather amusing orthodontic anomaly, I'm afraid your enjoyment of \"Pathfinder\" will depend largely on just how many decapitations and impalings you're willing to put up with in a two-hour period."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "deadite-girl",
        "review_rating": "2",
        "review_title": "Dire.",
        "review_detailed_main": "Such a disappointment.\n\nThere we were,looking forward to a new film portraying a little understood episode in Norse history and what we got was an anachronistic, fictitious disaster that is an insult to both Viking and Native American cultures.\n\nWe looked for redeeming factors. Really, we did. But even the charms of a half naked Karl Urban or the serious efforts of an almost unrecognisable Clancy Brown were not enough to salvage what could have been an historical epic if handled properly.\n\nDon't mis-understand me, we weren't expecting a documentary presentation of history, but what we have is so far off the mark it would be funny if not for the sad fact that hundreds of people out there have a tendency to believe everything the silver screen throws at them. (Look at the amount of people who treat Braveheart as gospel.) Yes the fight scenes are good. War is not pretty. There are plenty of mutilations and buckets of blood to keep even the most hardened of us horror fans entertained. But towards the middle of the film it's becoming gratuitous, and by the end predictably boring. The script is bad (Karl Urban enjoyed the Conan approach to learning scripts as it takes him about half an hour to open his mouth.) The editing is bad. The photography is bad. And as for the costumes, well think of every inaccurate stereotype and multiply by ten.\n\nEven if treated as pure fantasy, it's poor.\n\nSimply awful."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "djrobwarner2",
        "review_rating": "2",
        "review_title": "Totally disappointing",
        "review_detailed_main": "Pathfinder was hyped as an epic film but was an utter disappointment. It has my nomination for worst film of 2007 - The editing was inconsistent, the acting average, the story a mess with large holes in the story.\n\nThe film it feels like the cinematography and editing styles were changed repeatedly and maintain no consistency throughout. The scenery often changes in seconds from muddy forests to snowy plains and back again leaving you wondering whether the editing was by three people who refused to work together.\n\nLead actor Karl Urban, after his last effort in Doom, has only a few chances to make good on a promising start to his main-stream film career. This film will do his career no favors and I totally agree with the comments made in Pete Simone's review here."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "evanesp23",
        "review_rating": "1",
        "review_title": "Let's charge into the spike pits!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "Med-Jasta",
        "review_rating": "1",
        "review_title": "Stupid",
        "review_detailed_main": "This movie being historically accurate or not is irrelevant. Not only is it a movie but also at the start it says that this is based on a legend. This is bad because it's stupid and made by a crappy director. It's poorly written with no talent at the helm.\n\nIt seems like there was no research put into Vikings or Indians. Which would have made for a better movie to portray these interesting people. Instead they are just like us but from two different cultures and from 1100 years ago. Movies like this are far better when you're thrown into a different lifestyle.\n\nThe costumes are very cool looking. Totally inaccurate but very cool. Karl Urban... I don't know if he's bad but he sure makes some dumb faces. He's not terrible but he's not good.\n\nAnd he worst part of is the director, Marcus Nispel. He's terrible and incapable of making a good movie. He wants to be this great visualist but he sucks. He does a lot of weird editing things, slow mo and shakey cam. All signs of a bad director. I don't understand the directors that put work into visuals that you can't really see."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "DarioTheSweeper",
        "review_rating": "10",
        "review_title": "A Viking movie.",
        "review_detailed_main": "Another movie about Vikings. It is a work about a very warlike human race that lived a long time ago.\n\nThe Vikings from Norway made voyages far west across the ocean. They looted a lot and were very bestial. This tells the story of how they arrived in America. At that time, Indians lived there, the natives of America. The main hero of this movie is a Viking who was raised by a tribe and lived as one of them. He decides to protect them and fights almost alone against the invaders. The Vikings look very real and not like those in many works nowadays. Some famous actors have dared to act in this movie.\n\nNot for every nerve but very successful in the presentation. I don't understand the reviews."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "gregory_harpell",
        "review_rating": "2",
        "review_title": "Potential that went unrealized,,,,,,",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "mark_cranford",
        "review_rating": "2",
        "review_title": "I should have just seen shooter for the 4th time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "adamlouie",
        "review_rating": "1",
        "review_title": "Worst Movie Ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "MickeyTheConstant",
        "review_rating": "4",
        "review_title": "Dark and Gloomy",
        "review_detailed_main": "Now I love a good Viking movie. Vikings Vs Native American Indians is right up my street. This movie though just felt really cliche and flat. It could have been so good but just wasn't that convincing. Dark and gloomy, most shots were at night. The vikings were not that interesting and neither was the hero. Urbans Tarzan like character just didn't cut it for me. I didn't really care if he survived really which is not great for a hero. The fights and action sequences were quite basic and flat and not very inspiring. The sane with the bog standard run of the mill script. It all felt a bit like I have seen it all before in hundreds of other b rate action movies. Give it a miss."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "SnoopyStyle",
        "review_rating": "4",
        "review_title": "dark bloody uncompelling story",
        "review_detailed_main": "A Viking boy is discovered by Native Americans after his longboat is shipwrecked. He is adopted into the tribe after the Viking marauders are massacred. He is given the name Ghost (Karl Urban) and grows up using his Viking father's sword. He falls in love Starfire (Moon Bloodgood) who is the daughter of a friendly tribe chieftain Pathfinder (Russell Means). Then his tribe is attacked by new Viking raiders led by Gunnar (Clancy Brown).\n\nThis is Conan the Barbarian in Native North America. It's dark, brutal and messy. I can see where the graphic novel is coming from but the translation to the screen is not compelling. I do like the crazy Viking style and the bloody gore which I'm guessing comes from the comics. The dark brooding mood and music do wear thin. Director Marcus Nispel, who is more known for his music video work, does badly with the narrative. It's not compelling. Karl Urban is a great actor but overall the acting from everyone is poor. This is a dark bloody mess from an intriguing graphic novel idea."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "demonsdespaire",
        "review_rating": "10",
        "review_title": "Though historically inaccurate it was a sweet movie",
        "review_detailed_main": "First of all i cant help but notice how out of all the people who voted it seems its a love hate movie. You ether loved it or hated it. I for one loved it. I mean ya the trailer made it out to be a movie more about the Norse men then anything else but when has a movie followed the adds. Vary rarely in my experience vary rarely.\n\nThe hole movie is based around a young Norse boy who was left behind after a Norse raid. A native women(not sure what tribe) finds him and adopts him into the tribe. He's isn't excepted into the tribe truly though. Later the Norse come back and he has a chance to prove himself.\n\nThe movie had a few problems people keep pointing out that i cant seem to figure out myself. I mean ya the scoring wasn't the most memorable thing ever and i wouldn't buy the scoring but I'm fine with the with no scoring like in the old school horror movies which had the most minimal scoring ever. There was nothing wrong with the acting that i noticed but i don't have a major in theater like some people. I mean if you want bad acting thats not the actors fault go watch Bloodrayne. That move had an excellent concept behind it and actors that could back it up, but they got that director who has messed up every movie he's ever made. Pathfinder was fine unless someone wants to nitpick. The only problem the movie had was its release date which was right after 300 which destroyed its box-office scoring. 300 may I point out did excellent even this its inaccuracies. This movie was more accurate then 300 in many ways though the Norse men didn't dress like Space marines(warhammer 40k reference) or Orks from WarCraft but there has to be some artistic license when there making a movie thats not a documentary."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "brooz",
        "review_rating": "3",
        "review_title": "bad slo'mo' action movie",
        "review_detailed_main": "I almost died of boredom during this movie.\n\nIt doesn't stand on any point of view. The plot is terrible: vikings cross the Atlantic in order to kill indians. They don't seem to prey on anything. Only kill and occasionally rape. They hate indians so much that they come a 2nd time fifteen years later to kill the survivors.\n\nThe visuals are overall good but lack of innovation.\n\nCountless flaws on historical details; and weather; and any domain in fact.\n\nThe script and the characters are terrible. As an example I d say that a viking is viciously wounded by Ghost, but later on, when he has many opportunities to take revenge, he is just absent of the movie.\n\nAction scenes are rather good, but don't make any effort to be believable. Its is all filmed in very short scenes, closed up; so the viewer may be surprised by such and such event, but apart from the hero, everyone else is always as surprised as the viewer. This lame trick is used at least 40 times.\n\nSome commentators blamed that the tribes were cliché hence the flick was racist. I don't agree with that. In fact the good guys say \"Vikings have hatred. They have it in their veins. They cannot be different.\" hence the flick is racist."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "Readerwoman",
        "review_rating": "1",
        "review_title": "Yuck!",
        "review_detailed_main": "I do not know much about the history of these times - but this was gratuitously violent, with no rhyme or reason for it except for the sake of gore, gore and more gore. Yuck. I stopped watching it after 1/2 an hour, although hubby stuck it out until the end (he wasn't impressed either!) I thought the movie was going to be a historical look at a time 600 years prior to Columbus, and to show some interesting perspectives from both the Viking and Native viewpoints, instead of a mindless, dark (cinematically as well as thematically) piece with no redeeming features. A total waste of celluloid. I have taken mental note of the producers and director, and will avoid future movies with their names on them!"
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "jagc1969",
        "review_rating": "1",
        "review_title": "Norwegian original film is way too better than this one.",
        "review_detailed_main": "The Norwegian original film is way too better than this remake. Bad acting, ridiculous script, bad filming... Even action scenes are not too thrilling really. Even CGI has poor quality. Hollywood seems to be running out ideas and they had decided to take others' ideas and adapt them for American market. Sometimes it works and sometimes don't. This time is a failed one. This film is only a waste of time and resources.Really disappointing. Watch the Norwegian original !"
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "michaelarmer",
        "review_rating": "3",
        "review_title": "Lost its Path",
        "review_detailed_main": "In reference to another review, \"It is as bad as its painted to be\".\n\nThey made a good film, crap! Its a remake of a Norwegian film, but a poor one. Apart from all the factual errors, there are two other major problems with this film, its too dark, and the camera work is too close, when we need to see wider shots. I know its set in winter, but the darkness is too much, its like a Tim Burton horror/fantasy, maybe they wanted to copy that style, but for me its not good in this film, and the close ups are too close, we need to see more, not just the gory faces. Karl Urban was ok, and its good that they got real indigenous actors to play those parts, but most of everything else was off, the mountain shots were not real, or from archive footage. The action was ok, but a bit too gory, but it seems they intended that, but that goes against the subject material, Vikings discovering a new land, yes there would have been some killing, but nothing like this. The only saving grace was that it was not overlong. They could make a much better film at about 2 1/2 hours by turning it into more of an adventure with more colour and better camera work, but that does not save this film.\n\nDo yourself a favour, if there nothing else available, listen to the radio, and save yourself from this dross."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "mikkiparker",
        "review_rating": "3",
        "review_title": "Bad choice",
        "review_detailed_main": "The movie was bad, I will admit that. The only reason I have decided to watch it, even though the trailer was not good, indicating what the movie will be like, was Karl Urban. From what I know, he is a great actor (Lord Of The Rings; The Boys; Star Trek trilogy; ...). However, I don't know if his character, Ghost, was supposed to be so shallow and lacking emotions, but it was a real turn down. It seemed like Karl didn't even want to be there and his acting was bad. He got better, he is way better now. The storyline was also pretty stereotypical. Native americans with their prophecies and signs. Not a good choice. Ghost, played by Karl, being indestructible and surviving what a normal human being would not survive wasn't the best. The movie was dark as well and I had a hard time seeing literally anything on the screen. I didn't like it. It lacked acting, storylines, visuals and everything in general."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "alz06",
        "review_rating": "10",
        "review_title": "Epic Viking Battles",
        "review_detailed_main": "... are frickin' sweet. I knew i was in for a treat when I looked across the Blockbuster store-room and saw almost every copy of Pathfinder in stock the day after it came out. Beaming at me in a glory of viking berserker rage were clashing sword and battle ax. Fur clad and blood thirsty vikings beckoned me to grasp the DVD case to my tingling bosom. When I could finally tear my eyes away from the epic battle scene (complete with a viking warship) on the front cover... I read with uninhibited frevor the synopsis of this movie. \"...graphic, hard-core, action -- packed with extreme battle footage -- plus an army of kick-a*s (YES! it said kick-a*s and they were kick-a*s) deleted scenes and special features! Savage Viking invaders bent on death and destruction...\" I was already wet with anticipation but by the time I read the words \"breathless, primal violence\" I practically ran to the check out counter. This movie rocked my world, I sat with my own battle ax rested in my lap as gruesome scene after delightful gruesome scene pleasured my eyes and ears. Sure I focused more on my bowl of crunchy snacks during the useless plot scenes... but when those viking battle sequences exploded onto the screen I was held in rapt attention. Don't listen to those whiny a-holes complaining about plot or dialog or anything else. Those battle scenes made my nipples hard and thats a fact. Severed heads, fighting bears and frickin' blood thirsty VIKINGS: what more could anyone possibly need in a movie? If you have an answer to that question I dare you to e-mail me a better pick for a movie night."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "BlessedB_uk",
        "review_rating": "2",
        "review_title": "An insult...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "swiley-9",
        "review_rating": "2",
        "review_title": "Don't waste your time.",
        "review_detailed_main": "I don't go to the theater very often and, when I do, it is usually to see a romantic comedy. My sister and I planned an all day shopping spree, complete with lunch and a movie. As there were no romantic comedies to choose from, I chose to see Pathfinder. I thought that the idea of vikings and Indians sounded pretty good. Yes, the idea was good. Unfortunately, I do not care to see heads chopped off and people brutally tortured and killed. I could only watch about 15 minutes of the whole film. The rest of the time, my eyes were looking at the side wall of the theater, as killings were taking place. I guess I watch too many old movies at home where your imagination takes the place of vivid slaughter on the screen. My sister, who goes to the movies quite often, told me that this is the way most movies are today. Next time my sister and I go out, I'll skip the movie and do more shopping."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "realmccoy05",
        "review_rating": "2",
        "review_title": "Hands down, awful. Period",
        "review_detailed_main": "To quote Grindhouse, If you are thinking about seeing this movie, DON'T! Not only is the acting sub-par, but the movie is just plain ridiculous. Don't waste your money, go see Grindhouse instead. The movie is full of no name actors, the film style gets very difficult at times to follow, leaving you wondering who just hit who is fights, and there is a scene where Vikings are following the main character down a snow covered mountain on sleds. People walked out 30 minutes into the film, and everyone else should have followed. By the end of the movie everyone in the theater was mocking the film together.\n\nDo Not See This Movie.\n\nSeriously.\n\nThat is all."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "veriaamiri",
        "review_rating": "3",
        "review_title": "Just entertainment",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "Neenee-b",
        "review_rating": "5",
        "review_title": "Viking invasion fails to impress",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "skotiiarikos",
        "review_rating": "10",
        "review_title": "Enthralling, vivid and exciting.",
        "review_detailed_main": "Action packed and quick-paced. I couldn't keep my eyes off the screen. Karl Urban looks great and every scene in Pathfinder was brilliantly shot. Very realistic and beautiful. From beginning to end I was on the edge of my seat(or couch). When I saw the trailer to Pathfinder I thought, \"W-o-w, this is a creepy one.\" It wasn't what I expected, In fact I didn't have a clue what was the plot. I just knew a man rebelled his own people. I watched all the bonus features via DVD rental from Blockbuster, and the physical effort it took these actors was making me tired! Good work everyone, and kudos to you especially, Urban! I give it a 10!"
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "pspreng-56973",
        "review_rating": "3",
        "review_title": "Geography?",
        "review_detailed_main": "I really only have one question. Where does the east coast of North America Have These mountains. It's like the alps and Rockies on steroids. Lord oh mighty"
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "zetes",
        "review_rating": "2",
        "review_title": "Why shy away from it when your only selling point is the violence?",
        "review_detailed_main": "People who watch only good movies tend to exaggerate how awful a movie is when it is just average. Most film buffs don't see the truly terrible. Sometimes I do. Sometimes I enjoy the pain. Pathfinder is the worst major release of 2007 that I have seen at this point. And there are so many I have thus far avoided, many that looked far worse than this one, judging by their trailers. Honestly, I thought Pathfinder looked like it could be decent. The premise is serviceable: a Native American (well, actually a white guy, but the backstory ain't worth explaining) fights against monstrous Viking intruders. If kept short, this could have been a moderately entertaining B-movie filled with all sorts of gleeful carnage. If one can tolerate such a movie, it can be fun enough. 300 did an okay job of it (just ignore the rampant fascism, if at all possible). But, no, director Nispel fails miserably. Maybe not entirely his fault, though. It feels as if it's been edited for content. Severely edited. Violence is its only selling point, but the film cuts away pretty much any time anything remotely cool is happening. In general, the editing is poor. It's often difficult to tell what's going on. The characters are deadly dull, so I really couldn't care less whether the Norsemen slaughtered the Natives or not. With nothing to hold my attention, I started to drift away. Because, you know, sleep, that's where I'm a Viking."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "s190895",
        "review_rating": "3",
        "review_title": "Not worth your time",
        "review_detailed_main": "The other day I was with my girlfriend at Walmart. We usually make a stop at the $5 bin to see if there is anything interesting in it. I was rather surprised to find this film in it because it was such a recent release. I'll simply state that if there was a $1 bin at Walmart, Pathfinder would be in it.\n\nShortly after I got back home, I decided I would put the DVD into my XBOX 360 and enjoy a nice, hot cup of hot coco while watching some Vikings ruthlessly slaughter Native Americans. (note - I am not a racist. I am implying the amounts of gore and not the innocent killings of many Native Americans.)\n\nThere was nothing that ever really grabbed my attention while viewing this film. We never found out why the Vikings were there in the first place. It appeared that they are savages who hunt humans instead of deer. The editing wasn't very tight and the film really dragged along throughout the entire production. Perhaps this is why I fell asleep while watching or perhaps it was the amount of alcohol in my system, but probably not the latter. The only other movie I have ever fallen asleep to while watching for the first time was Terminator 3.\n\nThis film is not worth your time. I thought it really looked entertaining when I saw the preview, but I was greatly let down when I watched it. I would much rather spend my time watching Transformers for the special effects than watch Pathfinder."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "con-23",
        "review_rating": "3",
        "review_title": "disappointing Hollywood-ized remake",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "juhojeesus",
        "review_rating": "4",
        "review_title": "It was not that good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "SerpentMage",
        "review_rating": "9",
        "review_title": "Classic Conan, and Loved Every Moment Of It",
        "review_detailed_main": "This movie is an illustration of the new Vikings and Indian movies, and it does not disappoint. It is classic Conan the Barbarian and if you are into that type of movie you will enjoy every moment.\n\nThough I must warn it gets violent! When I was watching it at the airport kids kept wanting to watch it (even though I had headphones on) and I had to keep reminding parents that this is a violent movie not intended for younger audiences.\n\nThere is the question of realism, and I have to say it was quite realistic. To get an idea of those times you should read the works of Farley Mowat as he outlines clearly what Vikings were like in that period.\n\nThe plot is simple and the plot outline of the movie is about all you get."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "dont_b_so_BBC",
        "review_rating": "5",
        "review_title": "Wonderful Art Direction, but...",
        "review_detailed_main": "...runs a like over 100 minutes of \"prologue\" or \"highlights\", which I wish there was \"more\" to. There wasn't enough set-up to the characters or the setting for me to \"get into\" the movie, because that would require more than a series of beautifully framed shots. Even the action sequences suffer from this problem-- whether in choreography or editing, things just happened too \"quickly\" or \"easily\" on camera to convey any real sense of \"cinema\".\n\nI understand the whole approach with muted sounds, sepia tones and slow motion, etc., was meant to convey a mythical, dream-like atmosphere, but it meant that I mostly enjoyed looking at it as an animated graphic novel. I would have preferred it as a more detailed, \"real-time\" action-adventure, but this was still a good-looking movie-- probably done to show-off the art direction more than anything else (like script, stunts or story). I've seen a making-of clip where the director claimed he wanted to push the envelope-- NOT.\n\nAlthough I think it's just a passable \"5\", I don't understand why some people trashed this movie for being \"historical fantasy\"-- when they will accept almost any kind of trash sold to them as \"science fiction\". I suppose there just isn't an established tradition and audience for historical fantasy like the historical wuxia or fantasy fiction/ films in Asia-- where they run amok with history/ reality and just have fun with it."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "steve_newby",
        "review_rating": "4",
        "review_title": "Enough of the dark filters",
        "review_detailed_main": "Infuriatingly this film was spoiled by a director who felt the need to make the cinematography so dark in almost all the scenes that it was often hard to see what was going on.\n\nThe concept of the film is great and.it could have been really enjoyable. It is the telling of a legend supposedy set when the vikings landed on the shores of America and ransacked the native American Indians.\n\nUnfortunately the director obviously felt this was some sort of vanity project and decided to focus on style over substance at the expense of the viewer. This is also apparent in the costumes of the vikings who would have looked much suited to a Conan the Barbarian film than what they really would have looked like in that era.\n\nSome good action (if you can see it) but don't go out of your way to watch this movie."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "goldenarrow-99823",
        "review_rating": "3",
        "review_title": "Meh...",
        "review_detailed_main": "I liked the concept of this but wasn't impressed with the execution of it.\n\nLighting was crap so everyone looked alike."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "rjmeyll",
        "review_rating": "1",
        "review_title": "Vikings on horses?????",
        "review_detailed_main": "Nope no horses in vikingland. So how did they learn to ride then?????"
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "jvzm",
        "review_rating": "1",
        "review_title": "A real Turkey",
        "review_detailed_main": "What a plot! A bunch of Vikins who had nothing better to do than to murder a bunch of Indians. Did Laeta Kalogridis (screenplay) and Nils Gaup ever bother to find out what the Vikins were actually doing in Vinlandia? There are actually accounts of this: Greenlanders' Saga and The Saga of Erik the Red which tell of the Viking discovery of North America. Greenlanders' Saga describes a voyage made by Bjarni Herjolfsson, the first Norseman to see the shores of North America, and the subsequent voyages of Leif Eriksson, his brother Thorvald, his sister Freydis, and the Icelandic merchant Thorfinn Karlsefni. Oh, yes, horses. Were there already horses in Greenland at that time? Actually, the second voyage to Vinland was made by his brother Thorvald, he did not bring horses, but he did bring cows. The Indians loved to drink the milk."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "lyriclinda",
        "review_rating": "9",
        "review_title": "a great action and story, well made",
        "review_detailed_main": "I totally like the movie. It's well made, well acted. The plot is great,touching, perfectly making sense. Great scene, picture is amazing, impressively artistic, beautiful. Action is great as well, very catchy, love it.\n\nThere are some killing scene might be disturbing, but it is still well worthwhile watching it.\n\nI am really surprised that this movie was not in theater for long. I guess commercial was not done enough, I never heard it. Suggest to market it well before the premier.\n\nLast, I'd like to recommend this movie to you. You will love it."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "pumpkinofuo",
        "review_rating": "2",
        "review_title": "Literally Falling Asleep Watching This",
        "review_detailed_main": "This story was so slow, and slooooooow. Did I mention it was slow?\n\nI was literally falling asleep trying to finish it. It felt like an 80's film that ran out of budget.\n\nThe plot, the climax, whatever (did it have either?), just was not worth the watch. I'm not sure how it ended up on the \"Popular\" section of Hulu, other than there is literally nothing good to watch at all on Hulu.\n\nI kinda feel like it was on Hulu for a reason, and not a good one. I regret taking the time to watch this,\n\nI'm literally fishing for words at this point as to how horrible this movie was so that I can actually post this.\n\nDo not watch. Total waste of time. You'd be better off watching paint dry."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "dav-37489",
        "review_rating": "8",
        "review_title": "I guess some people need it spelled out for them...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "darrenbjones",
        "review_rating": "8",
        "review_title": "We need a toyline",
        "review_detailed_main": "When the final movie is filmed and the list of the greatest movies of all time is released it is safe to say that Pathfinder will be nowhere to be seen. This is as it should be though, the director of Pathfinder wasn't setting out to make art. You won't finish this movie and be inspired to change the world, you won't look for this at the next Oscars. You might however be inspired to strap on every pot and pan in your kitchen and pretend to be a Viking.\n\nThis is the gift of Pathfinder. In a world where every movie is expected to say something, win something or bring in more money than God, Pathfinder says NO. Instead Pathfinder says sit down, switch off and enjoy the ride. Huge scary Vikings attack Native Americans and it is up to Ghost, a Viking child abandoned by his own people and raised by the Native Americans to turn the tide in a series of great set pieces.\n\nYou'll wish there was a toy line for the characters so they can take on your treasured Clash of the Titans action figures in a battle to the finish. This is a fun movie that you'll look back on fondly in years to come, but get the Unrated edition because, well, more gore is always a good thing.\n\nThe performances are all solid and Karl Urban appears to be the inheritor of the Kurt Russell gift of aging to suit the movie you are in. This film is lots and lots of fun and this unashamed style of movie making deserves to be supported."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "cat-589-604201",
        "review_rating": "8",
        "review_title": "I thoroughly enjoyed this movie...",
        "review_detailed_main": "I loved the story line of the Viking boy being raised by the Native Americans and his plight for survival. He bonded with his new family, he faced trials against man and nature. I loved the diluted color of the movie, and the language captions, it amplified the gloom and treacherous terrain, the angst of the era. I enjoyed the cultural rituals, costumes, the battles, hooves pounding, swords clanking... I was completely entrenched. I don't understand all the bad reviews, maybe I'm not as schooled on the comparisons or data mentioned, but as a watcher who enjoys medieval and native American type movies...I really liked it. Some of my old time favorites include; Excalibur, Lady Hawk, Lord of the Rings, 13th Warrior, and thought this one was just as good."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "steveguy-4",
        "review_rating": "8",
        "review_title": "Excellent addition to the sword and moccasin genre",
        "review_detailed_main": "I really enjoyed pathfinder.\n\nLike '300, Pathfinder is based very loosely on reality, so if a person has the expectation that it is a historical movie, they will likely be disappointed.\n\nPathfinder's almost surreal styling come across as a legend as told by the same native people perhaps many generations after the original events. As a result the Vikings appear almost like mythical monsters whose barbarism and inhuman acts serve as a warning for current and future generations.\n\nOne only has to look to current and past wars and conflicts to see examples of how enemies both real and perceived are dehumanized as a defense mechanism.\n\nBottom line: A very effective action movie, whose influences are obvious, yet unique in it's own right all wrapped up with some great effects and sometimes breathtaking cinematography."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "CathodeRayTerrors",
        "review_rating": "9",
        "review_title": "Waited 13 years to review!",
        "review_detailed_main": "Pathfinder is unique to me. Unique because normally I can gauge how much I'm going to enjoy a film by the first or second viewing. Marcus Nispel's speculative Viking outing took me 13 years and dozens of viewings to come to the realization that I really enjoy this film.\n\nOther reviews question it's authenticity. There have been many books written that give weight to its narrative. To me it doesn't really matter how much of it is historically accurate or not because when you watch films such as Pathfinder watch it for entertainment. Is it engaging? Is it entertaining? The answer to those two is a big hell yeah.\n\nMy issues with the film has always been about how dark the film was shot and it's hyper muted colors. Although not as difficult to watch (physically) as his Conan, this is one film you want to enjoy in a darkened room and on as large of a screen as you can afford. The acting is decent but it won't blow your socks off...nor does it have to. Where this film shines is in its lavish costumes, breathtaking locales and visceral brutality. I wish there had been less cg blood and more real blood, but it's not a deal breaker. And while it is graphic I have read Viking lore that is way more explicit.\n\nThere have been criticisms of its lackluster character development. True, it's no Vikings (TV series) but to me it doesn't need that much character development; it does well enough. There are 'Dances with Wolves' similarities but it's unfair to compare the two because Pathfinder's tonality is completely different.\n\nUrban and Brown do kick some serious ass as well!\n\nWhy did I take so long to review? I don't know. Some films I don't like reviewing because I can't make my mind up on them. This one took me awhile to wrap my head around but ultimately it was worth the wait I hope. I hope this helps anyone who...so many years later, still hasn't seen this film. Give it a chance."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "jbpn",
        "review_rating": "9",
        "review_title": "Quite a good action Movie.",
        "review_detailed_main": "After reading many of the comments about this movie, I was prepared for the worst. Instead people prove to be either too stupid or too blind get the point. First of all, to those of you complained about the historical inaccuracy, WELCOME TO THE MOVIES. IF you want historical accuracy, watch Gettysburg, or Patton. This movie was designed to be a myth, a legend. It was not marketed as a historical movie, nor does it make any claim anywhere to be a historically accurate film. Second, lets try to remember that this is a set as a legend. Intricate dialog would be out of place in such a setting, not to mention incorrect for the time period (which would no doubt give some people more to grumble about). Third, this movie is an ACTION movie. IT is SUPPOSED to be full of action, NOT lots of character development. In fact, for an action movie, this one has a great deal of character development. Finally, there was NOTHING wrong with the acting. Sometimes we Americans forget that not every culture favors expressing emotion as readily as we do, and this movie is a great example of that. The actors do a fine job with the role they are given. All things considered, a fine movie, and even better when compared with other action counterparts."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "westreal",
        "review_rating": "8",
        "review_title": "Path to Find a warrior",
        "review_detailed_main": "It is a spectacle of light and shade this movie.The story even tough not so convincing and with a Hollywood end is nice and plain and gets you out of your seat in some scenes but the cinematography of the movie makes it a lot more special than the rest..and the thundering roaring sounds completes the scenes.Pretty good acting also..from Karl and the rest of the crew..specially the Pathfinder.I was also let down by some unsuccessful scenes but all in all it is a movie worth watching by my opinion.Not the best of it's genre but pretty original.Go watch it and enjoy it as it is. PS : Just for the fans of the genre..and don't expect too much skin :) !"
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "zitzy2000",
        "review_rating": "8",
        "review_title": "Why does everyone dislike this movie?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "freakfire-1",
        "review_rating": "8",
        "review_title": "Karl Urban and Moon Bloodgood: nice pair.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "solri",
        "review_rating": "8",
        "review_title": "Ought to be terrible, but actually good fun",
        "review_detailed_main": "Pathfinder ought to be a terrible film. It's about as historically accurate as Braveheart and completely unoriginal, being essentially a remake of the (very good) Norwegian film of the same name, with bits of First Blood, Kato's Land and Fuqua's King Arthur thrown in. But if you can stop yourself going \"Dude, Vikings didn't have cavalry!\"* and suchlike, you can enjoy it as a straightforward action/fantasy film. It's the usual story of the bad guys who burn the village and the hero who stops them, which means it has funky barbarian costumes, cool weapons** and traps, spectacular landscapes and of course lots of fight scenes, and the fight scenes are done really well. As a bonus, it's beautifully filmed.\n\n* OK, Vikings did sometimes use horses as transport, but they didn't take them on their ships; they stole them when they arrived, and in America there would have been no horses to steal.\n\n** Including one-handed flails, which didn't appear until the late Middle Ages."
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "jltaylor175",
        "review_rating": "",
        "review_title": "Action Flick sells our First Peoples short.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "mgrepresents",
        "review_rating": "",
        "review_title": "no good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "Kirpianuscus",
        "review_rating": "",
        "review_title": "dark. in too many senses",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "glen_esq",
        "review_rating": "",
        "review_title": "Kooky Geography",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "destinymagazine",
        "review_rating": "",
        "review_title": "Swedish outrage against racism in this film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "jones24-2",
        "review_rating": "",
        "review_title": "Original?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "TxMike",
        "review_rating": "",
        "review_title": "Six hundred years before Christopher Columbus landed here.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0446013",
        "movie_name": "Pathfinder",
        "movie_rating": "5.4",
        "review_username": "lee-lrich1",
        "review_rating": "",
        "review_title": "Pathfinder",
        "review_detailed_main": ""
    }
]