[
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "danmossman",
        "review_rating": "6",
        "review_title": "Don't know why this is so hated",
        "review_detailed_main": "So much of the plot and script of this film is absolute trash, but shaggy and scoob are so perfect it cancels all the other rubbish out. Even aged 25 I got so many belly laughs out of the CGI Scooby's antics. I also thought the monsters were pretty cool and the CGI is an improvement on the first film. I also really respect how directly out of the cartoon the characters and outfits are. With that being said, if you aren't ready to turn your brain off and watch a CGI dog in a fake afro do a choreographed dance. This may not be the film for you. I am surprised there was never a third film or a reboot of this franchise."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "shanfloyd",
        "review_rating": "6",
        "review_title": "Better climax.",
        "review_detailed_main": "After the disappointing effort of the first Scooby-Doo film I wasn't much enthusiastic about this \"Monsters Unleashed\". But to tell the truth this film handled the characters better and the climax more interesting, at least in terms of the identity of the villain. It remained true to the original cartoon storyline in the sense that the character of the villain appeared earlier in the film. The dialogues also got better, though abandoning thick sense of humor was impossible. It failed to develop enough chemistry between the members of the gang, which is in fact faithful to the cartoon where in my opinion the characters are quite one-dimensional.\n\nThe CGI of Scooby himself has improved only slightly. The monsters could have been designed better, although there are touches of nice imagination e.g. the candy floss monster. The most irritating parts were unnecessary hip-hop dance sequences. Besides such points, Scooby Doo 2 deserves more praise than its prequel."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "Boba_Fett1138",
        "review_rating": "6",
        "review_title": "An improvement over the first.",
        "review_detailed_main": "I had seen the first movie and didn't liked it at all. Still I decided to go and give this movie a chance, to see if they had improvement anything. I was pleasantly surprised to find out that they actually did. The story is better and more interesting and the monsters and CGI-effects in general are more convincing looking. The humor has also been improved and this movie actually does have some entertaining and funny moments in it.\n\nNot only the story itself has been improved but also the storytelling. The pace is good and the characters work better for this movie. Also the actors seemed more at ease in their roles. Freddie Prinze Jr. and Sarah Michelle Gellar certainly improved their acting compared to the first movie. Still best parts are played by Matthew Lillard and the perfectly cast Linda Cardellini. Plus of the movie is that it also has actors Alicia Silverstone, Tim Blake Nelson and Seth Green in it.\n\nThe monsters are enjoyable and are good looking. There still are some 'fake' moments but on the other hand there also are some truly spectacular looking sequences involving monsters. The character of Scooby-Doo himself is also looking more convincingly this time.\n\nIt's not really a memorable or great movie but it is simple good entertainment to watch.\n\n6/10\n\nhttp://bobafett1138.blogspot.com/"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "ma-cortes",
        "review_rating": "5",
        "review_title": "Second part with lots of fun and as amusing as the first",
        "review_detailed_main": "Live action update of Hanna-Barbara's early 70s animated TV series with lots of entertainment and amusement . The film concerns about our friends ¨the Mystery Inc.¨ group with Scooby Doo , Shaggy ( Matthew Lillard ) and the remaining group (Sara Michelle Gellar , Freddie Prince Jr, Linda Cardellini )and takes place an eerie museum of criminology where are robbed some stuffed monsters for nefarious purposes . Meanwhile , Daphne falls in love with the museum curator (Seth Greene). The equipment members are going out to investigate with its van towards a dark mansion , whose owner is a suspect old man (Peter Boyle) . A reporter(Alicia Silverstone) accuses them as responsible a robbery . The Mystery Inc soon realize that they cannot resolve this case without help from each other .\n\nIn the picture there are comedy, tongue-in-cheek , slapstick , humorous moments , mild diversion and is pretty amusing . All are given a preteen treatment which means no gore and no bad language just some old-fashioned sympathetic scares ; being funny watching humans meld into the CG characters . However , it contains bad taste when takes place a contest about fart jokes between Shaggy and Scooby . Of course , coward Scooby steals the spectacle as food-obsessed canine anti-hero with its grimace , faces and gesture . Many gags are good however the tale sometimes drags . Special mention to gags as the tournament between Fredd ( Freddie Prince) and the monsters , besides those intervening Shaggy-Scooby , they make a likable and superb comic couple . There appears even an electrifying monster similar to ¨Forbidden planet¨ film monster . Movie combines live action with computer generator animation on Scooby Doo creation , special effects are well done . The motion picture is regularly directed by Raja Gosnell who also realized the original . Kiddies may find the corny , flat humor as bemusing , but most adults will be disappointed , exception the fans the classic cartoon series created by Hanna Barbera . It is clearly aimed at the junior audience . Protagonists' antics might provide the silly smiles , but this cartoonist physical comedy is mostly ineffective . Rating : average but entertaining with lots of fun and as amused as the first , and it will be best appreciated by preteen enthusiasts of the cartoon movies .\n\n."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "TheMovieMark",
        "review_rating": "",
        "review_title": "Dastardly deeds and CGI hijinks ensue.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "gftbiloxi",
        "review_rating": "3",
        "review_title": "More Like Overworked Taffy Than Cotton Candy",
        "review_detailed_main": "The original live action SCOOBY DOO was rather like the cotton candy you buy at the fair: pretty to look at and fun to scarf down. But a little goes a long way, particularly when all the air has been beaten out and it emerges as overworked taffy.\n\nFreddie Prinze Jr., Sarah Michelle Gellar, Matthew Lillard, and Linda Cardellini repeat the roles of Fred, Daphne, Shaggy, and Velma. Once again, Prinze and Gellar are hardly inspired but at least they play with tremendous energy; once again Lillard and Cardellini are so dead on target that the effect is almost spooky. They are supported by Seth Green, a truly talented actor who gives a very nice performance indeed; unfortunately, Peter Boyle is largely wasted and Alicia Silverstone is, well, Alicia Silverstone.\n\nSilverstone aside, the cast might have recreated the lightness of the first film--but once you mix in a story about stolen costumes that come to life, huge sets, wild outfits, a dance number, and a ton of CGI effects they pretty much get lost in the shuffle. It's all about as much fun as a carnival after the crowd has gone and you're left alone with gum on the bottom of your shoe.\n\nKids probably won't notice the shortcomings, and older fans will be glad to see numerous references to the original cartoon series--and to be fair the film does have its moments, largely thanks to Lillard, Cardellini, and Green. The film is available to the homemarket via DVD... But by and large this is the sort of thing you watch once and then let gather dust on the shelf.\n\nGary F. Taylor, aka GFT, Amazon Reviewer"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "disdressed12",
        "review_rating": "5",
        "review_title": "lacks the charm and warmth of the first one,and it's also less fun",
        "review_detailed_main": "i was rather disappointed in this movie.i just felt it didn't have the same charm and sense of fun as the first one.i think it tries to take itself too seriously at times.don't get me wrong,there are some funny moments,but there are less of them and they don't work as well this time around.i think they just got old.there's also a bit of a subplot which i didn't think had much point.there are a lot more monsters in this one,so it should be exciting,but it it really isn't.in fact,i found it slow at times.it doesn't have the same pacing as the first one.this movie also gets into the \"just be yourself,we're all OK\" syndrome.now there nothing wrong with that.it is a good message.but this movie shouldn't really be the forum for that.this is a type of movie that should just be fun and entertaining.beside,it throws off the pacing of the movie.also,there is a bit of innuendo,some sexual,some not.it's very subtle,but it's there.any way,i can't give \"Scooby Doo 2:Monsters Unleashed\" more than 5/10"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "tabuno",
        "review_rating": "7",
        "review_title": "Funny and Comical Live Animation",
        "review_detailed_main": "28 March 2004. What makes this movie delightful is the ability of the direction and live actors to capture the essence of the animated action found in the original cartoon series. A number of the scenes appear to be lifted straight out of the cartoon series like where Scooby Doo and Shaggy are prowling around in a house and you find them carrying each other just as in the cartoon version. There are a number of such scenes that really hit the animated button and is a treat to actually see it transferred onto the large screen with real actors. Though not perfect, this movie has its obvious flaws where some scenes are so overboard that it detracts from the flow of the movie and in some places it drags abit. But overall, the tone, flavor of the movie, even the flairs of emotional drama and simple moral and juvenile dilemmas that the cast face about being a nerd, being cool, being loved add an enhanced quality to this movie targeted towards children (except for the obnoxious product placement at the beginning of the movie). Seven out of ten stars."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "TVholic",
        "review_rating": "4",
        "review_title": "The curse of the remade TV show",
        "review_detailed_main": "I didn't think it was possible but this film actually made less sense than any Scooby Doo episode. I was a first generation Scooby fan, watching it every Saturday morning year in and year out in the early 1970s, until Scrappy Doo drove me away. We got to know and care for those characters. Amazingly, they're not here. Who are these people, this redhead, blond and brunette? They're certainly not Daphne, Fred and Velma. Freddie Prinze, Jr. was simply channeling Owen Wilson. Helium-voiced Sarah Michelle Gellar is all wrong for stunning Daphne. And Linda Cardinelli was too whiny to be calm, collected Velma. I'm not even going to ask about all the sudden techno-wizardry and the fighting skills. Not to mention the original Mystery Machine gang NEVER went up against actual ghosts, not even once. They always exposed the ghosts to be a fraud. This wasn't Scooby Doo. It was Ghostbusters meets Buffy the Vampire Slayer. The only good thing about this movie was Matthew Lillard, who was the only cast member to truly capture the spirit (and voice) of the cartoon character.\n\nIf you want to see a good kids' monster movie this Halloween, I would suggest \"The Monster Squad\" from 1987 instead. It was a much better and sadly overlooked film."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "shauncatania",
        "review_rating": "7",
        "review_title": "Great family movie",
        "review_detailed_main": "I have to admit as an early adult I would have rated this movie a 4. And this is where i think allot of the bad rep comes from. Adults who grew up with this and have moved on are the ones who this would have attracted only to be let down by the childish nature of the movie.\n\nSitting and watching it with my 6yo and 3yo, they love this and the first one because as they say, it's fun like the cartoon. And they are watching both the old and new iterations of the cartoons. This captures the spirit of the show and will keep the kids entertained. In my case, over and over again. I am glad Netflix has allowed us to rekindle the flame for some of these movies that were released with old school family entertainement flair in a time where the nostalgia effect didn't line up with the dark movie trend at release.\n\nShaggy and Scooby easily still the show. Watch it with your family for some fun entertainment."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "Wuchakk",
        "review_rating": "5",
        "review_title": "Slightly better than the first movie",
        "review_detailed_main": "Released in 2004, \"Scooby-Doo 2: Monsters Unleashed\" has the Mystery Inc. team taking on monsters from their past adventures brought to life by an evil masked figure.\n\nAs with the first film, Matthew Lillard and Linda Cardellini shine as Shaggy and Velma. Freddy Prinze Jr. is pretty good as Fred while Sarah Michelle Gellar as Daphne doesn't quite fit the role, although she's likable and serviceable. I'm sure she got the part because of her popularity at the time. Seth Green and Peter Boyle have significant peripheral roles, as does Alicia Silverstone, who's a highlight but unfortunately underused.\n\nWhereas the first movie was shot on the east coast of Australia this sequel changes the locale to the Vancouver area of British Columbia. Of course, it's location is Coolsville in the story, wherever that's supposed to be. In any case, the extreme switch in locale changes the dynamics a bit.\n\nThere also seems to be more emphasis on action and paying homage to the cartoon, which makes it marginally better than the first movie, for me anyway. Plus it emphasizes the obvious – that Velma is sexier than Daphne, at least with Cardellini as Velma and Gellar as Daphne. There are some worthwhile morals as well, like simply being yourself and not trying to be someone else.\n\nThe film runs 93 minutes.\n\nGRADE: C+ or B- (5.5/10)"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "bizkuigamer",
        "review_rating": "10",
        "review_title": "Best movie ever. Can't wait fir the new scoob movie",
        "review_detailed_main": "This movie provided me with my tar monster fetish. Its epic"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "rohanumpleby",
        "review_rating": "7",
        "review_title": "7.3/10",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "TheOtherFool",
        "review_rating": "4",
        "review_title": "Despite it's crappyness still an improvement...",
        "review_detailed_main": "For the whole 'bringing Scooby to the big screen thing': They shouldn't have. And now that they've done it, they better stop now. And I mean Right Now.\n\n'Monsters Unleashed' is a silly and childish sequel to the even worse 'Scooby Doo' two years ago. The actors (in particual Lillard) try but there isn't much joy to be found in this film. There isn't a lot of anything found in it come to think of it.\n\n'The Gang' are faced with all the monsters they've uncovered over the years, somebody is clearly trying to stop them from doing their job. Now, from minute one on, it is completely clear who that person is, but never mind that. Film rushes through all the obligate scenes (with a good effect or two), makes sure Scooby and Shaggy do some silly stuff (the best parts in the film) and there's some sort of love story and 'being yourself' idea put in as well. I know, boring.\n\nI'd better stop now. Please follow my lead, Gosnell. 4/10."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "williethegray",
        "review_rating": "",
        "review_title": "This should have been the first one",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "callanvass",
        "review_rating": "5",
        "review_title": "I didn't think it was too shabby, better than the original",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "Hayden-86055",
        "review_rating": "3",
        "review_title": "No where near as fun as the original 2002 live action",
        "review_detailed_main": "The sequel is more like an action film than Scooby Doo. Sarah Michelle Gellar basically plays Buffy the Vampire slayer in this and unlike the original where she is more action based, here they go overboard and it's very ridiculous. There were some fun chase scenes but a lot of it was rather boring. The dialogue and jokes were a lot worse than in the first one and the plot wasn't interesting and the conclusion was just out of the blue and didn't make sense, the villain was not a good villain and although some of the ghosts and ghouls were funny and creative it's not enough to redeem the film.\n\n3/10: Kids might like it but it's not very good at all."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "sweetwolf18",
        "review_rating": "3",
        "review_title": "Very Frightening, Even for ME!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "LeathermanCraig",
        "review_rating": "6",
        "review_title": "Not as good as the 1st but not as bad as some say!",
        "review_detailed_main": "OK.... So it's not a great 2nd edition of the potential franchise.... But it is NOT as bad as some people want you to believe it to be, either! If this had been the first film, I think that many would have thought it was much better, but, when you weigh it against the original 'Scooby Doo' movie, it pales....\n\nWe still have the cast of \"Mysteries Inc\" running around in the Mystery Machine van - with Scooby Doo (created in CGI), Fred (Freddie Prinze Jr.), Shaggy (Matthew Lillard), Velma (Linda Cardinelli) and Daphne (Sarah Michelle Gellar). This time, they're joined by some old favorites: Seth Green (as a love interest for Velma), Peter Boyle (as the classic 'Old Man Wickles'), Alicia Silverstone (as a great foil for Daphne), 'Inside Edition' host Pat O'Brien shows up and even 'American Idol' alum Ruben Studdard gets a turn to show us his acting chops.\n\nThe story line revolves around a reappearance of some of Mystery Inc.'s old school monsters coming back around in town. Alicia Silverstone plays a hard charging, up and coming news caster, trying to get the next big story - and she doesn't care who she crushes in her way up. Seth Green shows up as a curator of a museum to the greatness of Mystery Inc., and cares for all of the monsters that they've caught. It's HIS museum that gets robbed and the monsters come back to life!\n\nThe CGI here is just as good as the first time - but there seems to be a bit more of it.... Sure, the story isn't as flashy as the first one, but it's still pretty good on its own merits. There's a lot of flash and sizzle to this film, but it's more like a diet version of the first... still not bad, but sometimes leaving you wanting for just another bite!"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "jlewiskaczor",
        "review_rating": "1",
        "review_title": "Bad bad bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "Allierubystein666",
        "review_rating": "7",
        "review_title": "Sexy Velma vs. the World",
        "review_detailed_main": "An incredible entertaining and nostalgic endeavor- Scooby Doo 2 gives the fans of th cartoon exactly what they hope for- even if the end result is a bit uneven. Personally, i've always enjoyed this one more than the previous film. It has tons of characters, and somehow is able to actually execute the bigger=better formula unlike so many other sequels. My main problem with the film lies with the tone, that can be all over the place at times, towards the end losing a bit of its rhythm, but thankfully by its conclusion it finds itself again and manages to still be quite fun. The CGI is also much better this time around compared to the previous film, although most audiences will still notice it is a bit dated. There are tons of good jokes and humorous moments in this one too that work way better than they should- and the references to characters and other things in the cartoon feel so cool to see on the big screen. All the performances were also fun and campy as before this time around, although the supporting cast is thankfully a lot better, even if they can be a bit overdone at times. In the end, Scooby-Doo 2 is far from perfect- but it is a very enjoyable little flick. It somehow approves upon the original to be an uneven, but quite fun little ride.\n\nMy Rating: 7.2/10."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "Smells_Like_Cheese",
        "review_rating": "1",
        "review_title": "You have got to be kidding me",
        "review_detailed_main": "Oh, I wish I had my $8.75 back. Now, I did somewhat enjoy the first Scooby Doo, I had no interest to see the sequel though. But my best friend called and she badly wanted to see it. It was plans, and who knew? I might have liked it. We decided to see the 10:30 (at night) show, thinking there would be no children in the theater. Boy, were we wrong. What parents bring their 4 and 5 year old children to a 10:30 show?\n\nThe jokes are really stupid. The plot is nearly unbearable. And the leading actors have hit an all time low in their careers. I was starting to wonder about Sarah Michelle Gellar, where she was going to go. Same with Freddie, Matthew, Alicia, and Seth. I couldn't believe what they have done to themselves. The movie is a success at the box office hitting #1. But if you ask me, I think this should be on the bottom 100.\n\nVery lame.\n\n1/10"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "TheLittleSongbird",
        "review_rating": "8",
        "review_title": "A superior sequel to an above average film.",
        "review_detailed_main": "The predecessor honestly wasn't that bad at all, but was flawed in terms of story and scripting. I really wan't expecting the sequel to be better, and it was. The plot was better, more focused, and a little more faithful to the Scooby Doo cartoons. One thing I appreciated here was that the director sensibly focused on Shaggy and Scooby, and that added to the film's charm, as nobody could resist Matthew Lilliard's goofiness as Shaggy. Sarah Michelle Gellar, Linda Cardellini and Freddie Pinze Jnr were very good too, there are some decent jokes and there were some very good action sequences. Out of the supporting cast, Seth Green was a standout as Patrick, and Alicia Silverstone is likable too. My only complaints were that one or two of the monsters could have been designed better, and also some scenes felt a bit rushed. Other than that, an enjoyable film, with an 8/10. Bethany Cox."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "jpintar",
        "review_rating": "6",
        "review_title": "Better than original",
        "review_detailed_main": "The original Scooby Doo was bad. It couldn't decide if it was a straight live action version or a parody of Scooby Doo. That movie had an obnoxious tone to it. The sequel, however, is better. The action seems to be moving faster than the original. There are no fewer than three of the famous foot chases that Scooby Doo is famous for. The movie doesn't make a lot of sense, but it is going too fast for anybody to notice. The actors seem more comfortable in their roles this time around, especially Freddie Prinze, Jr. as Fred. Prinze was incredibly smug in the first movie. This time he seems to have dialed it down more. The actors are performing more as a team this time. These are people who like each other in this movie and not as five individuals. This is not a great movie, with unnecessary amounts of grotesque humor. Alicia Silverstone is wasted in a minor role. Overall, get a free ticket if you can to see in a theatre or rent it on video. 6/10"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "TBJCSKCNRRQTreviews",
        "review_rating": "5",
        "review_title": "A step up?",
        "review_detailed_main": "I suppose I was never that crazy about the show. It just didn't really grab me. I don't have a problem with others enjoying it, and I can see the logic in making these flicks for those who loved it. The main problem is just that it really doesn't have anything to offer for anyone else. It does, in both of them, try to offer it up, and were it further developed, perhaps coupled with less thin, stereotypical characters to work with, I think they could really have something interesting. The acting tends to be over the top, which is not to say that there are no good performances, or at least moments of such. Green is a nice addition. There are more monsters than in the first one. The CGI is at the same level of quality, that being quite good. This has fairly well-done cinematography and editing. The jokes and gags are almost exclusively silly, and if you're watching this, hopefully you enjoy bodily function jokes. This has a pretty decent plot, and throws some genuine surprises your way. The twist is reasonable. Designs are imaginative and fun. The music is cool. So is it better than its predecessor? I guess it averages out to them being about equal. I recommend this to fans of Scooby-Doo and co. 5/10"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "inspector",
        "review_rating": "",
        "review_title": "JINKIES!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "bensonmum2",
        "review_rating": "3",
        "review_title": "Where is the real Scooby Doo?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "Buddy-51",
        "review_rating": "2",
        "review_title": "What a Shame to Foist This on Kids",
        "review_detailed_main": "\"Scooby Doo 2: Monsters Unleashed\" is even more vapid and boring than the original \"Scooby Doo\" from 2002. Fred, Daphne, Velma, Shaggy and Scooby return as the unlikely quintet who used to do their crime fighting in the two-dimensional world of cel animation but who now enjoy the advantages - or disadvantages - of three-dimensional real life sleuthing (albeit abetted by a bevy of high tech special effects). In this outing, they are attempting to uncover the villain responsible for turning monster costumes into actual monsters.\n\nApart from some first rate art direction and costuming, both of which employ a pleasing primary-colored palette, this misbegotten and utterly unnecessary sequel offers virtually nothing of value for either fans of the original cartoon or newcomers to the scene dragged to the experience by well-intentioned but misguided youngsters. It's a shame that Hollywood feels compelled to foist dopey, lame brained movies such as this one onto innocent, unsuspecting children, and one shudders to think what the future movie going audience will be like having been nurtured in their formative years on cinematic dreck like the \"Scooby Doo\" franchise. Even Matthew Lillard as Shaggy, who was the one bright element in the original film, becomes simply annoying in this installment. And Scooby himself has to rank as one of the least beguiling and charming figures in the history of movie animation - CGI-spawned or otherwise.\n\nBeware \"Scooby Doo 3...4...5...6...\""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "Jeffnusa",
        "review_rating": "1",
        "review_title": "Worst Sequel of the Year",
        "review_detailed_main": "This movie was just plain awful. Daphne is Buffy the vampire slayer. Fred is an air headed Prince. The only actors true to their parts are Velma, Shaggy and Scooby. The 3 can't make up for the other 2. In this case Daphne and Fred sink the show. It's a shame the cartoon is a classic; the made for TV will only be fit for the trash can. Save your money, avoid this movie. Summary of movie: Mystery Inc is living the high lift basking in their new fame as super detectives, when a villain they put behind bars shows up. He has created a recipe for creating ghosts, takes their fake ghosts they defeated from the past and turns them real. Mystery Inc now has to fight the fight of their lives, too bad they could not act as well."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "CuriosityKilledShawn",
        "review_rating": "7",
        "review_title": "Better than the first.",
        "review_detailed_main": "As a Scooby fan I may be a bit biased but how anybody can deny that this is just great entertainment is beyond my understanding. It ain't high are but it's loads of fun, and there are plenty of in-jokes for the wiser viewers. The movie is fairly mindless, otherwise it would lose its kid audience. but that doesn't mean there's no good humor or plot to it.\n\nGranted, the plot is dumb (the gang go up against all the monsters from the first season of the TV show, only this time they're real). The manic set-pieces just bombard us, one after the other. Once again, there's not a moment of boredom, but there are enough quieter scenes with the Mystery Inc. gang. The main stars are, as usual, Shaggy and Scooby. Matthew Lillard is dead-on as Shaggy, so much so that he actually replaced Casey Kasem as his animated voice.\n\nOne moment that requires major suspension of disbelief is not any scene featuring sludge monsters or a cotton candy ghosts but a scene in which Velma utters 'I'm not hot'.\n\nNOT HOT!!!???? WHAT??? She's a total babe, more so than Daphne. Every frame of her is a work of art as far as I am concerned.\n\nThe CGI effects this time round are thankfully superior to the trashy effects of the first film. It's a much better movie all round and will not fail to amuse anyone of any age."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "snapperlarry21",
        "review_rating": "1",
        "review_title": "awful",
        "review_detailed_main": "almost the worst film I've ever seen in all my life. this was made with the quality of a nickelodeon movie, and released as a box office draw? get real whoever released it, not even my 5 yr old sister likes it. if a third comes out ill take lives, and then ill think of something worse to do after that. not only has this film got jokes that weren't even new during the time of the first scooby doo movie, its also got the same actors. now, don't get me wrong, i think they're all OK, and have appeal, but they're havin the p**s taken out of them in this film. Freddie prnz is gd, he has appeal, he should stick to not being able to act in proper films. Buffy is buffy no more said. Velma should marry me because shes hot, and she also carries a lot of the action, she didn't get that much air time in the cartoon. shaggy? the guy was annoying before he was shaggy, hes good as shaggy, but should try and up his game, itll be good for the world. the films are just far more colourful than the cartoon, there's no more pastels and muted colours, its all bizarre acid trippy colours, which kids even feel unsettled by. if they take the next film seriously, which i hope they don't even consider, they should approach it from the film point of view, not the franchise point of view, and film outside of nickelodeons facility range. this film should be shot. xx"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "BA_Harrison",
        "review_rating": "7",
        "review_title": "More silly, spooky fun with Fred, Daphne, Velma, Shaggy and Scooby.",
        "review_detailed_main": "Someone has been using Randamonium to create real life monster versions of Mystery Incorporated's notorious foes. Blaming themselves for a series of screw-ups by Mystery Inc., Shaggy and Scooby attempt to prove their worth by trying to solve this case on their own.\n\nThe gang are back for more spooky fun and, although this one isn't quite up to the standard of the first movie (which I thoroughly enjoyed), it still packs enough action and laughs to ensure a good time. The story is perhaps a tad hard to follow at times (for small kids), but the plethora of great creatures and continuous supply of (admittedly unsophisticated) laughs mean that the film is still enjoyable fluff for the whole family.\n\nReprising their roles from the first film, Sarah Michelle Gellar, Freddie Prinze Jr., Matthew Lillard and Linda Cardellini look like they are having a blast. Gellar looks great and gets to perform more of her Buffy-style high kicking moves; Cardellini gets to act sexy, as she attempts to romance nerdy museum curator Patrick; and Lillard is, once again, brilliant as Shaggy. Scooby hasn't improved any in the CGI department, but that didn't spoil my enjoyment of the film.\n\nIf you enjoyed Mystery Inc.'s first live-action cinematic foray, then the chances are that you'll like this one too."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "Edvis-1997",
        "review_rating": "2",
        "review_title": "2",
        "review_detailed_main": "Doo the right thing and don't waste your time watching this crap, thank you."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "anthonywltrs",
        "review_rating": "9",
        "review_title": "Why do people hate this movie?",
        "review_detailed_main": "I never understood the hate for Monsters Unleashed and still dont understand why people hate the first movie either. It's like with my review on ' The Country Bears' movie. Do people seem to hate fun movies? Im starting to believe that is the case. While I do love the first Scooby Doo movie, I've come to believe Monster Unleashed is not only better than the first movie but is underrated\n\nThe CGI and special effects for the costumed monsters brought to life as their own entities has aged pretty darn well in my opinion. The story sort of de constructs ours heroes, pulling back the curtain and getting to why the characters of Fred, Velma, Daphne, Shaggy and Scooby are the way they are and why we as the audience love them for who they are\n\nFor Fred he doesnt need to always be the macho cool sophisticated man who isnt afraid of anything or anyone. For Velma it's about following her heart instead of always relying on logic and facts for her beliefs and decisions instead of taking actual risks and doing what she wants. For Shaggy and Scooby they come to realize they arent screw ups or a joke, they are valuable to Mystery Inc as the rest of the gang. For Daphne she doesnt always have to be tough and reserved or not to fit herself as the so called damsel in distress\n\nThis great movie and the story is complimented with the editions of Seth Green, Peter Boyle and Alicia Silverstone who all help make the movie great and fun just like with our main cast. The music is great, humor is still spot on and man who doesn't love that clubhouse in the middle portion of the movie Mystery Inc made years ago."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "RosanaBotafogo",
        "review_rating": "7",
        "review_title": "Quite silly, but very cute...",
        "review_detailed_main": "Quite silly, but very cute, the effects of the little monsters are adorable and captivating, they certainly entertain and thrill (or scare) the little ones, not very captivating for adults, except for the nostalgic, referring to the delightful childhood of the animated mornings of the duo Shaggy and Scooby, Quite silly, but very cute, the effects of the little monsters are adorable and captivating, they certainly entertain and thrill (or scare) the little ones, not very captivating for adults, except for the nostalgic, referring to the delightful childhood of the animated mornings of the duo Shaggy and Scooby... Quite silly, but very cute..."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "Mightyzebra",
        "review_rating": "4",
        "review_title": "Not especially good. The first one is slightly better.",
        "review_detailed_main": "Genre: Slapstick filmed film based on the Scooby Doo series (only MUCH less good).\n\nMy thoughts: I didn't like this very much. In fact, I think I've only watched the whole of it two or three times, even though we've had it since 2004 on VHS and my brother keeps watching it. Usually, I only watch the beginning, but even that isn't worth spending 25 minutes for really.\n\nBasically, I think this is a pretty lousy, boring, incomprehensible sequel and I think that the first is better (only slightly). I don't think there's anything particularly interesting about this film, it is just not really my thing. Actually, I think the fact that Scooby and Shaggy try to be like the rest of the gang is pretty good, but it just isn't QUITE enough to grab my interest. So there.\n\nWho I recommend this to: People who liked the original A LOT and people who like slapstick or are completely and utterly addictive eat-sleep-drink to Scooby Doo.\n\nWhat happens: The gang have their own museum just for them \u0096 WOW YAAY. A pterodactyl monster comes along to ruin everything - BOO HISS. What will happen..?"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "raypdaley182",
        "review_rating": "5",
        "review_title": "Biggest mystery, why make it?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "hellholehorror",
        "review_rating": "3",
        "review_title": "Really stupid moments",
        "review_detailed_main": "Apart from a few funny and a few impressive moments this was a standard ghost story with some really stupid moments that were beyond belief. Making one movie of Scooby-Doo was going to be a stretch at best and making two movies is just plain stupid. And that is exactly what we got. It was totally stupid."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "D4V1D2411",
        "review_rating": "6",
        "review_title": "As original as the first one",
        "review_detailed_main": "I have the same opinions on these 2 movies, I think they are completely underrated and deserve a little more love for what they accomplished to be, original movies that explore other sides from the original cartoon and takes them to another level. The humor on this one doesnt have as many adult jokes as the first one but there are still some, and those make you laugh. The story is also a good as the first one but this one clearly has a downgrade in CGI for scooy at times. Overall, another good entertaining movie you can watch a weekend if you have nothing to do but want to spend a fun time."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "Uxbridge",
        "review_rating": "2",
        "review_title": "Mind numbing",
        "review_detailed_main": "Loved the cartoon as a kid. Big, stupid dog with 4 dorky kids investigating spooky things. It works when you're 7 because you don't know any better. I went to this film with my niece and fell asleep. That didn't happen in Shrek or Shrek 2 (which were both funny and entertaining, unlike this junk). Cardellini, Lillard, Prinze and Gellar all good actors stuck with an asinine storyline that's neither fun nor funny. It's like some made for the Disney channel movie that happened to have the good fortune to be released in theatres to make a bit of cash. If you truely in need of a fix of amusing family type movie, see Shrek 2 again. This dud was a waste of time."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "studioAT",
        "review_rating": "6",
        "review_title": "Scooby and the gang return",
        "review_detailed_main": "Love it or loath it the first live action Scooby film was a hit and therefore it is no surprise to see a sequel.\n\nPleasantly it is an improvement on the original with more humour, more depth and more monsters. Even the 3D Scooby looks more life like.\n\nThere are some new faces such as Alicia Silverstone and the dearly missed Peter Boyle but by and large it falls upon the talents of Matthew Lillard and Linda Cardelllini to create the movies' magic moments. Lillard is as close to the original character as you could get and it is no surprise that it is his antics that dominate the film most though the sub plot about Velma and a possible love interest is also very sweet..\n\nOverall an enjoyable film for fans of the original series as well as those discovering Scooby for the first time."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "anthonyf94",
        "review_rating": "5",
        "review_title": "Not too bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "angel_nikk2003",
        "review_rating": "10",
        "review_title": "An amazing performance",
        "review_detailed_main": "This movie was a funny look back at all the episodes of Scooby-Doo. I thought that putting all the evil characters from their other mysteries was brilliant. In this movie Daphne is much smarter. Sure she has a few stupid moments, but overall she has intelligence and wit. Sarah Michelle Gellar did a wonderful performance as this character. Shaggy and Scooby were of course you're regular brainless heroes who somehow end up saving the day. Mathew Lillard was exceptionally well in playing his role, and didn't overact. Velma,(Linda Cardellini) was still the same old Velma. Linda Cardellini fit the role expected of her and made the movie well rounded. Freddie Prinze Jr.(Fred) made his character less Narcesistic as he was before. Fred is still the committed leader who loves his admirers and especially Daphne.\n\nMy rating on this movie is a 10 because it was like watching a cartoon episode of Scooby-doo, only being a motion picture. The characters were funny, and the actors did an amazing job as portraying them."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "GiraffeDoor",
        "review_rating": "7",
        "review_title": "I so love Velma...",
        "review_detailed_main": "People aren't optimistic about live action versions of classic cartoons. And even less so for their sequels.\n\nI liked the first one (despite everything) and I enjoyed re-watching this as part of the same trip. It's a fairly well thought through story with a good deal of mystery and the humour works more often than it doesn't.\n\nI really wanted to see Cardelli's Velma one more time and I got it. She is so adorable and yet still so cool.\n\nIf you can manage any patience for this kind of movie at all, then you could do so much worse than this."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "RECB3",
        "review_rating": "4",
        "review_title": "A Second Instalment Film That Needed More Work",
        "review_detailed_main": "The crew did not add enough effort and strength when they were creating this second instalment film. This second instalment film did not make complete sense. Everything about this second instalment was weak and failed. The storyline of this second instalment film did not have any real direction and did not make any sense at all. The cast selection could have been better and stronger. They did not exactly fully commit nor connect to the storyline nor to their respective characters. The chemistry that was displayed between the cast members was weak and did not work at all in this second instalment film."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "Victor Field",
        "review_rating": "",
        "review_title": "Scooby... Dooby... Don't!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "nicver",
        "review_rating": "5",
        "review_title": "It's not that bad",
        "review_detailed_main": "I took my daughters to see it and I have to say it was nice family fun. Old fans of the series will recognize some of the monsters from the very first seasons. Just as in the first episode, it goes against the rule that everything has a rational explanation. Supernatural forces are yet again called to animate the bad guys.\n\nThe story is not that bad, the animation and special effects are a bit too much for little ones to follow, but they all seemed to have a blast.\n\nThe acting is the bad point. It seems these actors are tired of the franchise already and seemed to be tied by a contract for at least one more episode. And you can tell they are bored. Plus they look awful and tired! Only Lillard makes an effort."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "Gamingboy",
        "review_rating": "5",
        "review_title": "Saw a sneak preview and it's better then the first! (Spoilers)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "SnoopyStyle",
        "review_rating": "4",
        "review_title": "Should concentrate more on their friendship",
        "review_detailed_main": "Scooby and the gang Fred (Freddie Prinze Jr.), Daphne (Sarah Michelle Gellar), Shaggy (Matthew Lillard), and Velma (Linda Cardellini) have become the toast of the town in Coolsville. The Mystery Inc members are the guests of honor at the grand opening of the Museum of Criminology where they celebrate the gang's previous successes. Patrick Wisely (Seth Green) is the curator and Velma is in love. That's when a new villain appears with an all-too-real Pterodactyl ghost to wreck havoc on the event. Devious TV reporter Heather Jasper-Howe (Alicia Silverstone) makes them the laughing stock and they must solve the case to redeem themselves. Then there is Old Man Wickles (Peter Boyle) who is the obvious suspect.\n\nThis movie deviates from the well known franchise in two big ways. First they start out as popular and famous when they are always Those Damn Meddling Kids. The second is that the monsters are actually real. This is more Ghostbusters than Scooby-Doo. While change is often good, these are pretty big changes.\n\nI've never like this incarnation of Scooby-Doo and Shaggy. They are too outrageous. For all the crazy hijinx they get into, the funniest thing in this movie happens when Fred calls Daphne fat. I still like the group chemistry. Velma actually has a good storyline. Their friendship remains the best thing about the franchise. As for the mystery, Randomonium says it all. It's very random but that's what you get from Scooby-Doo. Most of the CGI are cheesy although it's expensive cheese. There is a couple of good moments in an overall weak effort."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "generationofswine",
        "review_rating": "6",
        "review_title": "An Honest Review",
        "review_detailed_main": "It is slightly better than the first movie.\n\nHowever, it falls victim to the exact same problems, it tries too had to be a cartoon and, as a result, fails to be a live action movie.\n\nIt tries too hard to be a cartoon that it forgets where the humor behind Scooby Doo comes from.\n\nAnd it plummets to the annoying just as fast as the first movie did. Like the first one, it transforms itself into a monstrous Scrappy Doo guaranteed to be hated by fans for just as long."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "Tracy_Terry_Moore",
        "review_rating": "3",
        "review_title": "So much for 'Scooby Doo 3'",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "leplatypus",
        "review_rating": "7",
        "review_title": "Scooby 2 Much (DVD)",
        "review_detailed_main": "As it was released during my first year on the job that explains maybe why i didn't go. Now i watch the DVD and i realized that i lost a good time.\n\nUnlike other franchises that equate sequels with changes, here the same ingredients apply and remain unchanged: ideal cast, bright colors and \"cliches\" from the classic show.\n\nFollowing the previous movie, the story has (a bit of) reflexion about the team and the cement that makes friendship. Here, Sammy and Scooby (much better looking in CGI) think they are leftover because they are (a bit) dumb! Morever, the writer pays homage to the original show because i think the monsters came from it.\n\nI think this movie is thus made for the fans by the fans and maybe doesn't reach to grasp the modern audience. However, I had laughs all along (above all with the table tools on Scooby's head and the door barricade) and i thought I was back into the 80's with \"Ghosbusters\" floating around.\n\nUnfortunately, we can't have as much movies as cartoons and actually this franchise seems really ... dead .... Will Mystery Inc. be come back from the grave this time ?"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "MB-reviewer185",
        "review_rating": "2",
        "review_title": "Talking dog",
        "review_detailed_main": "I didn't like the first movie and I don't like the second one either, but I found this at least a little easier to watch. I still gave it the same rating.\n\nThe CGI effects on the monsters and on Scooby were still bad but they looked like they were improved on since the first movie.\n\nThe actors are still just ok playing the Mystery Gang but they are still over the top, It still has cringey scenes but at least it has very small scenes that could be funny.\n\nNot worse or better just stupid and at times annoying."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "mrusty5",
        "review_rating": "10",
        "review_title": "Better than the first film.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "RobTheWatcher",
        "review_rating": "6",
        "review_title": "Good sequel",
        "review_detailed_main": "This was a great sequel that kept a lot of the same energy as the first one. It was a really creative concept that tied in a lot of the past Scooby experiences into one entertaining and funny movie. It still has it acting flaws and quality issues but you can get over that for what it is."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "questl-18592",
        "review_rating": "5",
        "review_title": "Scooby 2",
        "review_detailed_main": "No amount of cast perfection and chemistry can keep this from suffering intense sequel-itis. Is everything great about the first movie, ramped up and overblown with an effort to try and one up the original only to feel horribly forced and hollow to me.\n\nShallow and frustrating as it may be, there's still some fun here because this cast really is incredible. On strength of the cast alone this is worth checking out if you enjoyed the first one. It's not awful, just bloated and overdone, so you should still have a bit of fun."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "psi_fla",
        "review_rating": "",
        "review_title": "DOO THE RIGHT THING...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "doras33",
        "review_rating": "4",
        "review_title": "Fun but getting old way too quickly.",
        "review_detailed_main": "The first Scooby-Doo was a decent live action film that incorporate a slick sense of fun, and manages to keep things in perceptive insight of the fact that it was still based on a classic cartoon. This movie does keep things light on its feet but lacks the POW that made the first film a much better experience. The original Cast is back which includes Sarah Michelle Gellar, Mattew Lillard, and Freddie Prinze Jr, but the chemistry is gone, and the wow factor is gone as well. The movie tries to incorporate a lot of the bad guys from the earlier cartoons but it does not handle it successfully, and becomes sensory overload after the first twenty minutes of the film. I give some respect to those who tries to bring a sense of fun to story but its about time they shook up the formula before it gets tired, and its getting tired rather quickly."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "vip_ebriega",
        "review_rating": "4",
        "review_title": "'Scooby 2' gets **.",
        "review_detailed_main": "My Take: A mediocre sequel to a similarly lackluster original.\n\nPerhaps the only thing I'm glad about in SCOOBY DOO 2: MONSTERS UNLEASHED, perhaps one of the most inexplicable sequel of 2004, is that it isn't much of the total fiasco the original SCOOBY-DOO was. 2002's SCOOBY-DOO, might I say, was a total mess. Everything, inside and out, is a total disaster, a typical example of what's wrong about commercial film-making. Even under the presence of a delightful Matthew Lilard as Shaggy can't save a movie that pisses on your childhood. Although I never was a fan, I remembered how much I used on tuning in on the original Hanna/Barbara series as kid. And SCOOBY-DOO, in that movie, wasn't anything my childhood was.\n\nSCOOBY-DOO 2: MONSTERS UNLEASHED does a much better job, I'm afraid. Everything the original fails, this sequel manages to refill into much better. Still, whilst better than sub-par predecessor, It still ain't much of a good film, per se. While it can be said that our kids got much better, adults will still wonder why anyone still got work in doing these below-average family entertainment excuses. While Lilard still shines as Shaggy, the laughs are dry, there's not much of a plot and everything else is just... blah! The new \"story\" is much faithful to their source however. The original monsters in costumes are back, only they're real this time. Made real by a machine that transforms the costumes into the real thing. Once again, the Mystery Inc. gang of Freddy (Freddie Prinze Jr.), Daphne (Sarah Michelle Gellar), Velma (Linda Cardellini), Shaggy (Lilard) and that mumbling and bumbling CGI Scooby are back in the game trying to solve the case, even after becoming a total embarrassment at the press. Shaggy and Scooby finds themselves responsible for the gang's credibility downfall and decide they change their goofy ways and act as real mystery busters. Whilst Lilard is a delight in doing so, it hardly accounts for much of the things about this film that's bad. Alicia Silverstone co-stars as a sleazy lying reporter while Peter Boyle and Tim Blake Nelson play the ex-men with masks.\n\nThe premise sticks much closer to home than the bland predecessor, but even so, this film rarely is a decent effort. Tired jokes and forgettable antics doesn't a good movie make. Worthy rental for kids though.\n\nRating: ** out of 5."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "Mysterygeneration",
        "review_rating": "5",
        "review_title": "A Mixed Bag of Nostalgia and Goofy Antics with a Dash of Missed Potential",
        "review_detailed_main": "Scooby-Doo 2: Monsters Unleashed, directed by Raja Gosnell, aims to revive the beloved cartoon series but falls short of its predecessor's charm. The film features the Mystery Inc. Team confronting monstrous villains in Coolsville. Despite its goofy humor and references, it struggles to maintain a cohesive plot and often relies on slapstick gags. The visual effects are mixed, with some creative creature designs but some dated CGI. The film's strength lies in the chemistry of the cast, with Freddie Prinze Jr., Sarah Michelle Gellar, Matthew Lillard, Linda Cardellini, and Neil Fanning delivering lively performances. While it offers nostalgia for fans, it may leave others seeking a more substantial plot and fewer over-the-top antics."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "cesbanbelubo21",
        "review_rating": "7",
        "review_title": "O.k",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "nikolajsblack",
        "review_rating": "2",
        "review_title": "Who paid for the product placement?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "KalKenobi83",
        "review_rating": "7",
        "review_title": "An Amusing second Act for The Live Action Scooby Doo",
        "review_detailed_main": "Watched Scooby Doo 2:Monsters Unleashed Featuring Matthew Lillard(SLC Punk! ) as Shaggy Rogers , Freddie Prinze Jr(Shes All That) as Fred Jones,Sarah Michelle Gellar(Buffy The Vampire Slayer) as Daphne Blake ,Linda Cardellini(Legally Blonde) as Velma Dinkley, Neil Fanning(Crocodile Hunter:Collison Course) as Scooby-Doo, Seth Green(The Italian Job) as Patrick Wisely, Peter Boyle(Doctor Dolittle) as Jeremiah Wickles, Tim Blake Nelson(Holes) as Dr.Jonathan Jacobo and Alicia Silverstone(Clueless) as Heather Jasper- Howe. I actually didn't mind this film but I felt it was cheesy and cartoony the characters weren't bad in second act as expected the second act was darker but i also enjoyed the Humor as well .Score by David Newman(Galaxy Quest),Cinematography By Oliver Wood(Freaky Friday) ,Screenplay By James Gunn(The Specials) & Direction By Raja Gosnell(Home Alone 3) An Amusing second Act for The Live Action Scooby Doo 7/10"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "jessihebby2",
        "review_rating": "5",
        "review_title": "True to the cartoon",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "TheOvereducated",
        "review_rating": "10",
        "review_title": "Fun & better than the 1st one!",
        "review_detailed_main": "I recently rewatched Scooby-Doo 1 (2002), 'cause I didn't remember it and I really like the animated series. In that movie I liked the characters a lot (they were faithful to the animated series' characters), but I really disliked the supernatural story, exactly because it was supernatural. The classic \"big reveal\" at the end had no realistic explanation as in the animated series! That said, I had to rewatch Scooby-Doo 2 after that too... and it's what I wanted 1 to be! It's really fun, with the same awesome characters brought to life from the animated series and with a much more appealing Scooby-Doo-relevant mystery story!"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "libbyplant",
        "review_rating": "7",
        "review_title": "A trip down memory lane",
        "review_detailed_main": "I remember scooby-doo 2 being my favourite film as a kid. Recently re-watched it and I enjoy it just as much as I did when I was young. Such a great film and the cgi was a big step up from the first movie. The casting was great. And the jokes weren't that bad either. It's such a fun film and it deserves more love than hate. It's still one of my favourite movies and I've never forgotten about it :))"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "qball_82",
        "review_rating": "4",
        "review_title": "Disappointing sequel.",
        "review_detailed_main": "We all know the rule - sequels generally will suck. I'm sorry to say Monster's Unleashed is one such sequel.\n\nThe first film was a neat package. A nice storyline that engaged you from the start, gags for all ages, gorgeous visuals and good performances from all. Whereas Scooby Doo was a film for all ages, Monster's Unleashed is very much a kids-only movie. A poor story with not one iota of depth and and fart jokes aplenty. Nice visuals, I'll give it that.\n\nI was really looking forward to this flick, but I came out very disappointed."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "tedg",
        "review_rating": "",
        "review_title": "Back to the Future",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "JokerMichel",
        "review_rating": "4",
        "review_title": "Bad",
        "review_detailed_main": "Awful Awful This can't even make kids entertained No plot, no script, poor action scenes and horrible CGI The end left me in tears , I couldn't believe they could make a bad movie like this"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "jace_the_film_guy",
        "review_rating": "4",
        "review_title": "Should have been the first movie?",
        "review_detailed_main": "In a weird way, Scooby-Doo 2 might have been better as the first movie than the sequel. Is this better than the first film? No. That being said, the events in this movie would have fit well in a first installment:\n\nMuch more nostalgia (shows the old villains).\n\n\nComplete disregard of what happened on Spooky Island.\n\n\n\n\n\n\nTake away whether this would be a better first or second movie, and the fact remains that it is not a good movie. Full of weird slo-mo moments (sexualized Seth Green?), cringey dialogue (\"Who's your mommy?\") and an abundance of misdirection, Scooby-Doo 2 is a below average, childish movie.\n\nBest Character: Daphne Best Scene: Investigating Wickles' manor Best Quote: \"We're gonna die!\" - Shaggy. \"Think Positive.\" - Velma. \"We're gonna die quickly.\" - Shaggy.\n\nBest Piece of Score: \"Search for Clues\"\n\nAdditional Note: I don't think I'm a Alicia Silverstone fan."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "vincemusic",
        "review_rating": "5",
        "review_title": "Very okay",
        "review_detailed_main": "If you've seen the first movie then you know exactly what to expect. A goofy story, with humor to match, dated special effects and okay acting. The biggest thing I will give this film, and it's sequel, credit for is how well they respected the original material. If you're a fan of the old Scooby-Doo cartoons then I'll think you'll enjoy the little nods and references to the original. The live action characters actually do a good job capturing the look and general personality of the original characters. The music also has a few motifs from the original cartoon that get thrown in every so often.\n\nWhile not a great film, or even necessarily a good one, it did manage to keep me at least partially interested for a large majority of the run time."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "evening_nightshade",
        "review_rating": "6",
        "review_title": "A movie for your inner child...",
        "review_detailed_main": "Sequels mainly fall into two categories: those who surpass the original, and those who fall flat on their faces. To me, Scooby-Doo 2 was neither - it wasn't as good as the first one, but in no way was it a failure. As a fan of the cartoon series since childhood, I felt that the movie achieved its purpose - to entertain.\n\nIt *was* a funny movie - maybe not hilarious, but I certainly got a few laughs out of it. Some of the gags were predictable, and some collapsed before they even began, but I felt that the good outweighed the bad.\n\nPerhaps the plot was a bit thin (most viewers with any common sense will have sussed out the bad guy long before the end), but it is, after all, a movie based on a children's TV show. It was never going to be the next Sherlock Holmes or Hercule Poirot, nor was there going to be some totally unexpected twist. If you're willing to let your inner child loose in the cinema, you'll enjoy this movie. Otherwise, go see something else.\n\nPersonally, I loved Linda Cardellini's Velma. Let's face it, the roles in this movie weren't exactly Oscar-worthy performances, but I felt that the characters were better developed, especially Velma. We saw a bit more to Daphne and Shaggy too, but Fred was left pretty much alone. If there is to be a 3rd Scooby-Doo movie, I'd like to see the writers tap into him a bit more. Most of the actors seem to capture the cartoon series characters, but Freddie Prinze Jr. has to go a little further to recreate the Fred I remember.\n\nIt was nice to see some of the monsters I remembered from the TV series transferred to the big screen. OK, so they weren't even remotely scary, but hey - neither were their cartoon incarnations.\n\nOverall, I'd have to give 'Scooby-Doo 2: Monsters Unleashed' 6/10 - not a bad movie, but not the best I've ever seen. However, if all you want is children's movie that's not too taxing, then this is for you."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "AngelHonesty",
        "review_rating": "5",
        "review_title": "More of the Same",
        "review_detailed_main": "If you like the first Scooby Doo live action movie then you will like this one too. They are very similar."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "MartianOctocretr5",
        "review_rating": "6",
        "review_title": "Routine Scooby adventure",
        "review_detailed_main": "This second episode of the live Scooby adventures is a little better than its predecessor. Probably because the story isn't burdened with the whole soap-opera sub-plot the other one had. Also, it sticks to the approach of the original cartoon series as well: Team finds monsters, monsters chase Scooby and Shaggy, team seeks clues, monsters chase Scooby and Shaggy, Velma discovers the solution, trap set up for monsters, monsters chase Scooby and Shaggy, get caught in trap, true identity of monsters unmasked.\n\nThe interaction of the Mystery Inc. characters is constructed well. The silly moments are fun for the kids, and the the suspects are all amusing characters. Like the first movie, Linda Cardinelli and Matt Lillard bring Velma and Shaggy to life amazingly well, while Buffy and her hubby are just in tow. Scooby's animation is not bad, and the monsters, taken from the original series, were all designed and utilized extremely well. The story rolls right along, with a pretty decent conclusion for a kid's movie.\n\nSilly fluff, but entertaining."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "KnightLander",
        "review_rating": "4",
        "review_title": "Not really the highlight of the actors' careers ...",
        "review_detailed_main": "With the success of the inevitable success of the first Scooby-Doo, it was predictable a sequel would follow. Unpredictably, however, the sequel is better than the original.\n\nThe film begins with the gang attending the opening of a museum featuring the costumes of Mystery Inc.'s old enemies. The opening is soon shattered when one of the costumes comes to life and begins destroying the exhibit. To add to the ruination of the museum opening, the Gang's reputation soon begins spiraling downwards. It's up to frustrated Fed, doubtful Daphne, love-filled Velma and disheartened Shaggy and Scooby to save the day - and Mystery Inc.! I myself had seen low ratings for the film, and therefor hadn't much interest in seeing it. The family went, though, and so did I. As the film began, I was expecting a film pretty much like the first, possibly slightly worse. As it turns out, Scooby-Doo 2 is the opposite of that.\n\nThe part of the film I enjoyed the most was Matthew Lillard's performance as Shaggy (he also stole my attention in the original movie). Lillard is perfect and frequently funny. The animated Scooby-Doo is particularly enjoyable as well; bite me if you will, but I found the \"Conclusion: Bunny\" sequence pretty funny.\n\nThe rest of the cast is fine, although SD2 is probably not the highest point in their careers. I found Sarah Michelle Gellar's rendition of Daphne boring - and I'm a SMG fan! The humor was pretty low, and generally unfunny, although the film does have its moments. The direction is fine, and the special effects are pleasing. The creatures will be enjoyed by the younger audience.\n\nSpeaking of younger audience, SD2 is clearly aimed at a younger age range than the first film. The soundtrack was fine, and David Newman's score was very nice. It created a mysterious and kookily fun mood for the film.\n\nIs Scooby-Doo 2: Monsters Unleashed better than the original film? In some ways, yes. It has more entertainment value, that's for sure. Will kids like it? Yes, they'll definitely like more than the first. But will you like it? That's something only you can answer."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "jayson_loves_music",
        "review_rating": "10",
        "review_title": "Scooby Doo Is Da Dogg!",
        "review_detailed_main": "I saw this movie on opening day. To let you know I am a total Scooby Doo fan, and was totally excited about Scooby coming to the big screen, so when I saw the first one I was in total Doo heaven, and then the news about a sequal made my heart skip to the happy sounds of joy. So when I saw this movie I was totally pleased with this sequels outcome. There was so much more in this one then the original. Especially the whole dancing Scooby in the whole soul getup. Thought I was going to pee my pants from laughing so hard. So for all those who don't know what a good movie then you need to really get yourself a reality check. This movie is for kids, and for the adults who have the little kid in their hearts."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "navycutx",
        "review_rating": "6",
        "review_title": "Not as bad as I expected",
        "review_detailed_main": "But that does'nt mean that it is good. Porting Scooby from 2D to 3D itself was a pretty dumb idea and no body really expects it to work. And it does'nt work. You should probably ignore Scooby for this entire movie as it is bad CGI and the 3D avatar far froms shows as convincing. However, there are some decent performances by the guy who plays Shaggy very impressively and some others. By far the most impressive thing about this movie are the monsters which have been very very very well done and are sheer fun to experience. Don't go expecting any great story or anything great and just go see it for mindless fun. There's nothing wrong with mindless fun is there?"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "angelic_gal01",
        "review_rating": "4",
        "review_title": "Mindless entertainment with too many cliches.",
        "review_detailed_main": "I saw Scooby Doo 2: Monsters Unleashed this weekend at an advanced screening. I never saw the first one because of the bad reviews it received, but given the opportunity at hand, I was willing to give this one a shot.\n\nThe storyline itself proved to be rather unimaginative. The movie's plot lines have been used so many times before that they have become boring and meaningless, and the viewer is left in a dull slump, only occasionally coming out of it to chuckle at the movie's more humorous points.\n\nI will give Scooby Doo 2 that much; there were some funny moments. I won't mention them specifically, but some of the jokes got the whole theater laughing. They seemed to generally be done in the same style as the cartoon, although I admit I have never actually laughed at a Scooby Doo episode.\n\nHowever, this was exactly the problem with the movie. If it had maintained a consistently light-hearted mood throughout, it would have been much more effective and entertaining. However, because of it's bad transitioning between humor, romance, and drama, it failed to work. The humor made the movie's attempts at drama and romance fall flat and come off as seeming desperate and stupid. I remember cringing a lot; especially during the final scenes of the movie.\n\nThe special effects were less than stunning. The monsters were not very scary, which is disappointing considering that, you know, they're monsters. Additionally, most everything looked very fake and rushed. Of course, it's not reasonable to expect fantastic CGI and other effects in a movie of this type, but there was quite a lot to be desired.\n\nOverall, I give Scooby Doo 2: Monsters Unleashed one and a half stars. My advice is that if you've got nothing to do one day and a few extra bucks on hand, go ahead and see it. Otherwise, don't waste your time."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "moviesfan11",
        "review_rating": "",
        "review_title": "I don't understand why everyone is hating this??",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "Voltoma",
        "review_rating": "5",
        "review_title": "A Review from Years Later",
        "review_detailed_main": "I had last viewed it in my childhood. Upon revisiting the film years later, I discerned that my recollections of it had significantly diverged from reality. For example, Velma appeared considerably more attractive.\n\nIt's typical American flick. Feels like you're watching a cartoon, but if we're talking actual movie standards, it's kinda low on the quality scale.\n\nThe actors performed in an exaggerated manner, much like one would see in a children's theatre, which somewhat patronizes the audience. However, considering it is a children's film, this is actually normal.\n\nThat said, if you can just park your brain at the door, you might end up having a blast with it."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "joelgodinho",
        "review_rating": "4",
        "review_title": "\"You never should have locked those locks. Now you're stuck in here with me, the Cotton Candy Glob!\"",
        "review_detailed_main": "Scooby Doo 2: Monsters Unleashed is a 200¤ sequel to 2002's Scooby Doo, it was directed by Raja Gosnell and stars Matthew Lillard, Sarah Michelle and Freddie Prinze Jr. Despite having some enjoyable stuff, I didn't really like Scooby Doo (2002) and that's exactly what I felt about this film, although I did like it a bit more. I still think that Matthew Lillard is good as Shaggy but aside from him the acting isn't great and besides the gang no character is memourable in the slightest. The CGI and special effects are still pretty bad but I think they're a little better than in the first Scooby Doo film. 4.1/10"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "thomasmitilis1995",
        "review_rating": "5",
        "review_title": "SCOOBY.. DOOBY...DO...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "thebeasteboy",
        "review_rating": "7",
        "review_title": "I feel awkward...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "dee.reid",
        "review_rating": "5",
        "review_title": "A brief review",
        "review_detailed_main": "\"Scooby-Doo,\" the canine detective who was the creation of William Hanna and Joseph Barbera during the 1970s, was and still is a childhood favorite; unfortunately for us, the audiences of 2005, this isn't the same with the movies. So far, the 2002 live-action adaptation and its sequel \"Scooby-Doo 2: Monsters Unleashed\" (2004), both directed by Raja Gosnell, have been pretty mediocre.\n\nBut one thing has remained consistent: they retain the camp humor and self-referential attitude of the original cartoons from the '70s. How's that for animation loyalty? While remaining more praised for its camp much rather than any industriousness, the films, like the cartoons themselves, are still watchable - somewhat.\n\nDoo himself looks just how he did in the cartoon, and has the junk-food and Scooby Snack appetite down pat. This time the gang - Fred (Freddie Prinze, Jr.), Daphne (Sarah Michelle Gellar), Velma (Linda Cardelleni), and Shaggy (Matthew Lillard) - are back in form again, somewhat. In this sequel, they are investigating strange things going on at a newly opened museum. With the aid of a geek (Seth Green) and a reporter (Alicia Silverstone), they go about solving another ghostly mystery.\n\nActing and good script writing were never admirable qualities of the original \"Scooby-Doo\" cartoons and here it's no different. It's painfully mediocre and the jokes are so-so. But Lillard, as the ambiguously stoner Shaggy, seems perfectly cast, as well as Cardellini as Velma.\n\nBottom line, watch only if you are a die-hard for this sort of stuff.\n\n6/10"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "davispittman",
        "review_rating": "6",
        "review_title": "Not as good as original.......",
        "review_detailed_main": "This movie was pretty good....... Certainly not great. I enjoyed the original Scooby Doo from 2002 better than this sequel though. This movie has the same actors playing the same characters as last time, and like last time, they fit their roles perfectly, and do a good job portraying them. I enjoyed the movie's plot and action, both were great fun to watch. This movie explores the characters a little more, especially shaggy and Scooby, so that was nice to see. The effects were pretty good, not incredible, but not cheep. This movie did give Velma a love interest which is good, I kinda wish it would've been a different actor to play his character, but he wasn't awful. Alicia Silverstone does well with her material as well, I liked seeing her in the movie, I enjoyed her performance. So overall, not as good as the first one, but not bad, and for the most part, family friendly. 6/10 for Scooby Doo 2: Monsters Unleashed."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "jboothmillard",
        "review_rating": "3",
        "review_title": "Scooby-Doo 2: Monsters Unleashed",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "irrigeoth",
        "review_rating": "10",
        "review_title": "Mastapiece",
        "review_detailed_main": "If I could give an 11/10 I would. Simply the best movie ever made"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "rcavellero",
        "review_rating": "6",
        "review_title": "SCOOBY DELIVERS ON SCOOBY TERMS!",
        "review_detailed_main": "I think anyone giving this film a bad review should not have gone to see. You see these films are tailor made for a specific audience and I'm not saying me per say. Although I did find the film to be somewhat clever and abduntantly cute with some believable dramatics flying around. Like the first one this film is just a lite ball of fluff made to put grins on people's faces adults and children alike. The film isn't overly intelligent or even clever and the spfx look very cartoonish and anti scary at best but the group's workable friendly chemistry and tehf ilm's underrated ability to have infinite fun gives it a pulse unlikely to be enjoyed by stuck up people in the mood for a much more serious take on scooby doo. This one picks up as Mystery inc. popularity has skyrocketed and they find themselves ina n upheaval. As all of the ghouls they have arrested in the past come back to hunt themd owna nd destroy the city. In addition to all the hi jinx and supposedly hidden drug references Velma is given a nerdy new love interest in Seth Green and tries to play it sexy. New dimensions are raised in Daphne and Fred's relationship and their is arch evil reporter played by alicia silverstone and a cameo performance from Ruben Studdard. All in all not a great flick by any means but this Scobby definatly delivers on Scooby terms."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "Pjtaylor-96-138044",
        "review_rating": "5",
        "review_title": "You're pushing your luck, Scoob.",
        "review_detailed_main": "'Scooby-Doo 2: Monster's Unleashed (2004)' isn't as good as the first film. It doesn't feel like a sequel or even an adaptation of its source material, really. In some ways, it seems 'straight to DVD', with only the returning cast and comparable CGI signalling it to be anything else. Perhaps it's the now somewhat garish set-design and costuming, the odd story structure and lax character development or maybe just the over abundance of young-skewing, child-pandering and plainly unfunny humour. The biggest cause, I think, is probably the fact that it isn't really a satire anymore, aside from one or two brief moments (mainly concerning the show's long-running 'unmasking' trope). Whatever the reason, this piece feels decidedly cheap - or low-effort, perhaps - and decidedly less interesting because of it. I guess Gunn got onboard with the neutered final result of his first go (or, he just didn't care) because, here, things are definitely aiming for a broader audience. There's no real subversion, it's filled with bland and basic character-work and the fan-focused deep-cuts are far and few between. In a way, this makes the experience more consistent. It feels far less two-minded, probably because the original script wasn't R-rated, and there are less 'inappropriate', faux-'edgy' moments (though there are still some here and there). It makes the affair less charming, though, because it feels like it was engineered as the most basic version of a live-action 'Scooby-Doo' film. It isn't devoid of entertainment and there are a couple of chuckles, to boot (mainly surrounding Peter Boyle and Tim Blake Nelson's new characters), but I'm sad to say that Shaggy isn't quite as good as he was last time around, either. Lillard turns in a perfectly fine performance and acts well off the more dog-like yet far too focused-on Scooby Doo, but something's ever-so-slightly off (I think it's the writing) and he isn't necessarily the highlight of the piece. It's difficult to say what is, however (perhaps Boyle's 'Old Man Wickles'). Most of the flick is generic and, quality-wise, average, at best. It doesn't really feel like anything at all, good or bad. Still, a bit of 'Scooby Dooby Doo' never did anybody any harm. 5/10"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "Drew-Barrymore-Obsessed",
        "review_rating": "",
        "review_title": "Better than the first.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "anaconda-40658",
        "review_rating": "2",
        "review_title": "Pathetic Film Unleashed.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "Fluke_Skywalker",
        "review_rating": "4",
        "review_title": "Doesn't scare up many laughs",
        "review_detailed_main": "'Monsters Unleashed' is certainly an accurate description of this second live-action Scooby-Doo flick. Unfortunately, though it features much better F/X work, more \"star\" power (Seth Green, Alicia Silverstone and an under/misused Peter Boyle), a better handle on the characters by the returning cast (though none come close to matching the sheer brilliance of Matthew Lillard's Shaggy) and a story that makes good use of iconic baddies from the original animated series, it still only adds up to a marginal improvement over the first film.\n\nLittle ones may enjoy the loud and zany antics, and Gen-Xers will surely get some nostalgia from seeing the various old school ghouls, but there's little here to recommend for anyone else."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "BIGHAIRY-1",
        "review_rating": "5",
        "review_title": "Why?",
        "review_detailed_main": "After sitting through this turd of a film I began to wonder why?\n\nWhy have I paid £25.00 to see this? Why is my ass aching? Why am I here? Why was this made? Why aren't there any farting dogs? These were just some of the questions going through my head whilst watching this movie. Scooby Doo The Movie (the first one) worked on a couple levels, namely the farting dog & the excellent Matthew Lillard (he is Shaggy). However in the second film these fun elements are mainly overlooked for cheesy dance scenes, Freddy Prinze Jnr & plot (sorry just kidding about the plot). The afore mentioned plot involves someone bringing to life all of Mystery Inc's most famous foe's & the gang trying to solve the mystery (well there's a suprise). The unmasking of the villain at the end is so obvious that even my 7 year old daughter knew what was coming, and the so called adult nudge nudge wink wink jokes rarely hit the spot. There are however a couple of plus points. Matthew Lillard is again excellent (& under-used) as Shaggy & the gorgeous Linda Cardellini is also very good. The CGI effects are also very impressive & there are a couple of good action set-pieces, the Pteradactyl Ghost chasing the Mystery Machine standing out a mile. Overall this is a movie that only appeals to under 12's. My 3 daughters enjoyed it for the most part, but even my youngest commented that \"Scooby Doo didn't fart very much\". So you see the farting dog did appeal at some level, even if it was at a 32 year old man's & a 3 year old girl's."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "OllieSuave-007",
        "review_rating": "6",
        "review_title": "Jinkies, it's a slower sequel.",
        "review_detailed_main": "Monsters Unleashed brings back the Mystery Inc. gang who must save Coolsville from an attack of past unmasked monsters they had dealt with including the Black Knight Ghost, Pterodactyl Ghost and the Tar Monster, who were brought to life by an evil masked figure.\n\nThis is a somewhat adventurous movie filled with ghosts and goblins, with Scooby filmed in CGI, and Freddy Prinze Jr., Sarah Michelle Gellar, Matthew Lillard and Linda Cardellini returning in their respective Mystery Inc. gang roles; each did a creative job in portraying Fred, Daphne, Velma and Shaggy. I especially enjoyed Daphne, as Gellar portrayed her as a typical blonde, but also being clever and witty. It was nice seeing Alicia Silverstone make an appearance in the movie; it is too bad her role was only confined to a TV reporter role, which didn't contribute much to the story.\n\nLike the first film, the special and visual effects were colorful and and flashy, and I thought the ghost action was executed pretty well. The story was, though, a little whimsical and the dialog and jokes were somewhat off-the-wall. The plot was a little slow, and wasn't as exciting and lacks the charm and spirit as the first movie.\n\nIt is still great to see one of my favorite cartoons come to life in this sequel, which I think is a serviceable movie, but falls short of entertainment as in the first one.\n\nGrade C+"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "lemon_magic",
        "review_rating": "5",
        "review_title": "Still watchable, but if the quality continues to drop, SD 3 won't be",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "chasman99",
        "review_rating": "6",
        "review_title": "Only for the kids",
        "review_detailed_main": "I recall going to see the Brady Bunch movie, longing to relive my days as a young kid. It worked, and was so hilarious I was waiting for the second one to come out for sure.\n\nWith Scooby Doo things are different. I have kids and wasn't all that pleased with the first one. As time moves along and I watch SD1, it is tolerable and campy enough that it reminds me of my days watching the cartoon.\n\nSD2 fails miserably for me however.\n\nThe negatives are: Daphne: Sarah Michelle Gellar couldn't act her way out of a paper bag, and Daphne has been ruined. Sure she was the \"hot chick\" and internet jokes have always pitted her and Fred together, but in the show she was also intelligent and a believable mystery solver. In the movie, we don't know if she's a pin up doll or wanna be scholar who gets lucky from time to time. I also never knew she was Jackie Chan!\n\nFred: Sorry Freddie Prinz, you can't act either (see paper bag reference to Daphne). Like Daphne Fred is lost. Again, he was the ascot wearing good looking fella, but remember this was the 70s. So to make him more modern and hip is just wrong. The whole be yourself theme is just plain goofy, and he and SMG have ZERO chemistry.\n\nOverall story was not true to the cartoon. Underneath the ghosts and chases was a totally horrific \"be yourself\" message. If I wanted that I'd rent a John Hughes movie. For Scooby Doo, I want goofy chases and gaffes, and lots of food consumption.\n\nThe good:\n\nMatthew Lillard, again. He IS Shaggy, and shockingly has a real place in Hollywood as a decent character actor in films. He's rarely going to steal a scene but he always seems to pull off his characters exactly as he should.\n\nPeter Boyle was fabulous, the monsters were totally cool and Seth Green was excellent. You never quite knew if you could trust him, and that is a credit to how he played his character.\n\nAll in all, it was not true to the Scooby Doo feel and theme, so it was disappointing. One note though. I have a 6 year old and a 3 year old. They both really enjoyed the movie. The ghosts can be scary for some kids who aren't very aware of what is fake and what is real. I'm lucky in that regard. They got a real kick out of the movie and yes, the fart jokes.\n\nFor the kids, I say , yes. Go see it. If you are looking to relive some old time fun, watch cartoon network or something.\n\nThe final thing that makes this movie livable, is no Scrappy Doo. He had his place and we poked fun, but thank you for not bringing him back!"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "hdoerr-02108",
        "review_rating": "4",
        "review_title": "My Disappointing Experience Watching Scooby-Doo 2: Monsters Unleashed",
        "review_detailed_main": "I watched Scooby-Doo 2: Monsters Unleashed for the first time when it came out in theaters during my childhood. While it had some entertaining moments, it was underwhelming overall. The storyline lacked the depth and intrigue I was hoping for, and the characters lacked the charm and wit that made the original cartoon so beloved. I also found some of the jokes to be cheesy and predictable, detracting from the overall experience. However, the movie did have some redeeming qualities, such as the fun and colorful visuals and the lively musical score. Overall, I would give Scooby-Doo 2: Monsters Unleashed a 4 out of 10 stars. While it had its moments, it ultimately fell short of my expectations and left me feeling a bit disappointed."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "lesleyharris30",
        "review_rating": "9",
        "review_title": "One of my personal favorite family films.",
        "review_detailed_main": "Scooby Doo 2 Monsters Unleashed is a funny,light hearted family film that stays true to the Hanna Barbera series.Its one my favorite family films and one I remember fondly because I loved the series as a child and I enjoyed the way they combined different monsters from the series and put them into one big adventure for Scooby,Shaggy and the gang.I like it more than the first one,which I also enjoyed but feel it doesn't have much of what you would usually see in the series and don't like how they take a huge stab at Scrappy Doo.\n\nScooby Doo and the gang face there biggest adventure yet as the costumes of monsters the mystery gang are brought to life after getting robbed by the Coolsville Museum Of Nstural History,the gang investigate while Shaggy and Scooby try to be better detectives and take there job more seriously,Velma falls for a history geek played by Seth Green and Fred keeps getting exploited by the media."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "Norway1",
        "review_rating": "7",
        "review_title": "Actually a lot better than I expected!",
        "review_detailed_main": "I took the kids to see the first Scooby Doo movie 2 years ago. We all liked it okay, but I was very disappointed with the ending. And I HATED Scrappy Doo!\n\nNow on to Scooby Doo 2:\n\nBeing a huge fan of the animated series, I wish they had stuck a bit closer to the character appearances (Fred's hair and voice, Velma's attempt at femininity, Scooby's whole body). In addition I didn't like the \"Mystery Machine Limo\" that cameo'd in the opening scene, or their ultra cool hipster clubhouse-hideout loaded with expensive gadgets. I haven't seen every single episode of the cartoon, but I don't remember them having a \"clubhouse\" at all. Didn't they just cruise around in their van all the time?\n\nBut these complaints are small things that I can accept and overlook in view of the \"bigger picture\" which is: the story; the effects; and the delivery (acting and directing) of the presentation.\n\nOn these merits, the movie scored very well! Director Raja did an especially decent job sticking to the visual and storytelling style of the animated series: There were at least three of the infamous Scooby-trademarked chase-scenes; two scenes where Shaggy and Scooby royally screw things up; Shag and Scoob eating ten times their weight in junkfood; the typical \"bait and switch\" technique in finding out who the baddie was; and NO Scrappy Doo! (Yes!!)\n\nThe monsters were all taken directly from episodes of the cartoon. Their realization on the \"big screen\" was exceptional in every case.\n\nThe special effects - while not \"Oscar-worthy\" - were very well done. The opening-credits scene alone (where you follow a pterodactyl flying it's way through a maze of alleys and back-streets to the museum where we meet the \"gang\") is worth the admission price!\n\nGo see it if you like the cartoon series AND are open minded enough to accept some lewd humor (fart jokes, puking, and the like) and some slight character differences from the cartoon.\n\nMy 7 year-old son loved it too and was quoting some of the funnier lines as we walked to the car after it ended.\n\nI gave it 7 out of 10 which is about the most a movie like this could possibly expect for a rating. (I believe I gave the first Scooby Doo movie a rating of 4 or 5 out of 10.)\n\nCan't wait for another sequel! :)"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "ChasSaur",
        "review_rating": "3",
        "review_title": "Cool monsters, but that's about it",
        "review_detailed_main": "For the hard-core Scooby Doo fans, this is an okay movie. Seeing the various ghosts given a CGI makeover is rather fun....that being said...\n\nThere was no need for either the \"Scooby and Shaggy must redeem themselves\" or the \"Fred and Daphne have inferiority complexes\" plot lines. Very little screen time was spent on the actual mystery solving. There were a few good points, mostly related to creating visual pieces that remind you of the cartoon (exaggerated sneaking, Scooby/Shaggy carrying each other). For the guys, there's the sight of Velma/Linda Cardellini in a red leather catsuit, though not much for Sarah Michelle Gellar fans. Her one fight scene looks like it was lifted from a Buffy episode.\n\nUnless your child or inner-child are clamoring to see the movie (or you want to see the Harry Potter trailer), then you can wait for the video release."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "suspiria10",
        "review_rating": "",
        "review_title": "Ruh-oh...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "ian-535",
        "review_rating": "7",
        "review_title": "A highly polished, highly developed sequel",
        "review_detailed_main": "As sequels go Scooby Doo 2: Monsters Unleashed is a good film. It's plot is a highly contrived, and tightly interwoven blend of modern day American youth struggling to combat the pressures and stresses forced upon them by outside influences. In this cinematic production, a great deal of that pressure is forced upon them by the cunning media moguls that closely follow their every move. I believe that this successfully conveys the pressures we can all feel from time to time from ones close to us, like our parents, for example. Teen angst is also explored thoroughly in this film when Velma (the intellectual one of the group) begins to doubt her sexual appeal to the males present in her life, in particular Patrick whom she meets during an exhibition being held at the city's museum.\n\nThrough adversity Velma battles to forge her place on the plain of existence within the very real world in which she dwells.\n\nShaggy and Scooby are the real centrepieces of the performance. They are ideally placed for illustrating to us all how each of us tries to 'fit in' with society, even though society itself can sometimes not be what we're looking for and can appear both bland and boring. Through these 2 characters alone the director, Raja Gosnell, takes his viewers on a roller-coaster of emotions, including self-doubt, lack of confidence, a wanting to please others and ultimately a triumphant return to form and the adoration and respect of those closest to us in our lives. Something I believe we are all striving for.\n\nScooby Doo 2 justifies the use of modern day cinema as a medium for conveying to us, the public, the difficulties of living and coping in today's world. But, it also shows us that with a little bit of self-belief and the support of others, we can achieve our ultimate goals and be accepted as an individual within society as whole.\n\nThe special effects rocked too."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "mfellipecampos",
        "review_rating": "6",
        "review_title": "Nice",
        "review_detailed_main": "For this sequence, all of the production and actors were kept, and that was very positive for this second adaptation, which this time is more grand than the previous one. This time the group that has a greater challenge when a mysterious masked man shakes the group that ends up in a disaster at a city exhibition becoming the target of criticism from the media and the population, it is up to the group to solve the mystery. Again scripted by James Gunn and directed by Raja Gosnell who evolve in history that manages to be superior to the first in practically everything including the villains who are very good different from the questionable choice of the first film, here we see several references of the animated series with famous monsters like Black Knight, Monster of 10 thousand Wolts, Bubble of Cotton, Frankenstein and Miner of 49. The cast in general is very good and the script manages to be funny and again provides a fun plot with the duo Sausage and Scooby very funny. The special effects are still weak, although they are better than the first.\n\nFilm seen on October 10, 2020."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "justinprather-65935",
        "review_rating": "9",
        "review_title": "As a scooby doo fan I enjoyed this movie",
        "review_detailed_main": "It's fun an exciting not super high quality but definitely fun and light if your a scooby fan I recommend this movie."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "gcursor-1",
        "review_rating": "7",
        "review_title": "Just like the TV series",
        "review_detailed_main": "This is the movie that the first Scooby-Doo should have been. The characters are all back in force and the gang has never been better. It's a great film when you compare it to how the TV series episodes were done. This one involves you in the monster mystery from the very beginning and it's a suspenseful spooky ride to the very end. Not everything always goes right for Mystery Inc. but in the end the movie proves to be truer to the original than the previous movie could even attempt to do. Go to have a good time and laugh along as the gang gets chased through all sorts of mysterious encounters. Don't go looking for the next Academy Award winning picture however."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "the-movie-guy",
        "review_rating": "",
        "review_title": "Kids love Scooby",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "GrantReedIII",
        "review_rating": "7",
        "review_title": "Much Better than the First.",
        "review_detailed_main": "Remember the good old days when Fred wasn't an idiot, Daphne wasn't self-conscious, and Scooby always seemed to save the day? It finally happened in a live action Scooby Doo.\n\nI didn't like the first \"Live\" Scooby Doo movie, the characters seemed, well, out of character, the plot was all out of whack, though the ending did improve a bit on the story, and the cut scenes on the DVD helped a little.\n\nIn Scooby Doo 2: Monsters Unleashed we have a lot of the elements that made Scooby Doo so memorable. There were music scenes, masked villains, an actual mystery, secret passages, a spooky mansion, humor and some of the lore of the multiple Scooby Doo series.\n\nThe CGI was better, and the character of Scooby seemed \"more realistic\" when compared to the rest of the cast. Matthew Lilliard and Linda Cardellini were still the best cast as Shaggy and Velma, however Freddie Prinze, Jr. and Sarah Michelle Gellar greatly improved upon their original performance as Fred and Daphne.\n\nOverall, I quite enjoyed Scooby Doo 2, and if you enjoyed the original Scooby Doo cartoons, but felt cheated by the original Scooby Doo live movie, I highly recommend this one."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "rowe-27464",
        "review_rating": "7",
        "review_title": "Scooby-Doo 2:Monsters Unleashed is very Entertaining, but does loose focus near the end",
        "review_detailed_main": "Scooby-Doo 2:Monsters Unleashed is up there with the classics, everything is very good about this film. They also added the backstory to our Characters and shared some memories. Old ones, which us Scooby fans can connect with. The film sure does have some faults but it's a good fun time. And the Villains, pretty much every single one of them turn up to seek it's revenge on the gang. Which, is very exciting. And the Villains design still holds up to this day. The best part about the film is how entertaining it is, and the pacing is very good. The story doesn't hold back and Scares, humour and some nice work between the cast who share some good chemistry and evoke on there childhood. The story is also a well told one, it relates to the early years of Scooby, and hear it's a he'll of a good time."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "moviefan69",
        "review_rating": "8",
        "review_title": "Surprisingly good family fun.",
        "review_detailed_main": "When it comes to deciding what movies to see, critics are the last ones you should listen too. Why? Because they are all so concerned about the construction of a film, that they no longer know how to have fun with them. This is especially true when it comes to family movies. Not every movie can be The Lion King or Finding Nemo. Nor should they be expected to be. Family movies should be one thing, and one thing alone...fun. Scooby Doo 2 delivers this and then some. I thought the first film was barely mediocre, so I had very low expectations walking in to this one. I went only because my children loved the original and were excited to see this one, and I wanted to see them have a good time. What I didn't expect was to actually like the movie myself. The sequel far outdoes the original. There are several reasons for this. First off, the cast has become comfortable with their roles. In the first movie, only Matthew Lillard appeared to be having any fun, and his dead-on performance as Shaggy proved it. Here all the remaining cast has lightened up and joined in. So the performances are good all around. Secondly, the special effects are much improved. Scooby blends in more seamlessly even though you know he's CGI. There is an incredible shot of a ghostly pirate ship emerging from behind the buildings of the dowtown city that is amazing, and very reminicent of the Stay-Puft marshmallow man from Ghostbusters. Third, as a fan of the cartoons growing up, this one looks more like true Scooby Doo. In the first movie, the monsters were not very interesting. But here, to see so many of the classic animated monsters brought to life, was a thrill. Critics have made the complaint that it's too \"cartoonish\". Um, hello? It's based on a cartoon! What were you expecting? The movie is also very funny, although it does rely on fart jokes one too many times. Plus anyone over the age of 5 will figure out the villian's secret identity 10 minutes into the movie. But all in all, this is exciting family fun. Family movies exist soley for families to have a good time at the movies. This is definately a good time for kids of all ages. *** out of ****."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "QueenoftheGoons",
        "review_rating": "6",
        "review_title": "Zoinks!",
        "review_detailed_main": "So the usual theme been done before try to break up the team. Again Geller is Geller and Prinze Jr is just Prinze Jr. It was too obvious who the bad guy was but oh well. The music was very good, oddly. Lillard did not get on my nerves again unless i am just used to hearing him on the cartoons since he replaced Casem. What i loved was the bad guys they brought into it - Miner 49er, Tar Monster, Black Knight, yes i did like that. A few more would have been good too. Again liked Velma, liked when Shaggy and Scooby drank potions. It was a good movie, long overdue in watching, now that its what 20 years old. But yes, good one."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "tfrizzell",
        "review_rating": "",
        "review_title": "Scooby Doo Can Doo-Doo, But Jimmy Carter Is Smarter.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "complexmind5151",
        "review_rating": "7",
        "review_title": "Why the hatin'?",
        "review_detailed_main": "I don't get all of the hate being spewed on this site about this movie. It was fun to watch animations of Saturday mornings past come to life on the big screen. Watch those old cartoons, and I think you'd agree this was pretty good considering the subject material. It's not like they were adapting Shakespeare. Yes, its cartoony, but thats the way its supposed to be. And if Matthew Lilliard isn't Shaggy, I don't know who is. The characters seem pretty dead on, and it was awesome to see the black knight ghost come to life. Seems like I've seen that old episode at least 100 times. I don't understand the anger. Just watch it and have fun. Be a kid for two hours, its good for you."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "christophersoteriou-58209",
        "review_rating": "9",
        "review_title": "Awesome just awesome",
        "review_detailed_main": "I love it one of the best movies I've seen in a while pretty boring start but the climax is 500000000/10 i love it."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "lucasloveswinnie",
        "review_rating": "7",
        "review_title": "The originals are always the best",
        "review_detailed_main": "While I gave this the same rating I gave the original 2002 film, this one isn't as good as that one. Granted it is enjoyable but not as good as the original, and well you know what they say its the title of this review aswell. The originals are always the best (in most cases atleast). This movie is still funny like the first one and not as much CG as the first one which is a highlight due to there not being as much dodgy CG as there was in the original, but again it is 2004 so it's not going to be the best CGI ever. Overall this movie isn't as good as the first one but still delivers an enjoyable experience. 3.5/10."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "Avoura",
        "review_rating": "6",
        "review_title": "Fun and enjoyable film",
        "review_detailed_main": "This was not quite as good as the first film, but still worth watching.\n\nIn this film we see some super villain bringing to life various old \"ghosts\" from the cartoon series using a special formula that creates life out of nothing. Plot is not as great as the first Scooby Doo movie, but the acting is very good, so are the special effects and costumes. I think the idea of the past enemies of Mystery Inc all being at a party which is then crashed by Shaggy and Scooby was good and well made.\n\nI think this film had more of a feel of being for the kids than the first film, but I enjoyed it anyway."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "shulmanator",
        "review_rating": "6",
        "review_title": "A fun kid's film!",
        "review_detailed_main": "Yeah, I know it's not the best film in the world, and it may be very commercially driven, but it's WAY better than the first film. This is what the first film should have been, if not better. There's no Scrappy Doo ruining it for fans. There's better soundtrack songs plugged into the film.\n\nBetter character focus, although there's too many \"violin scenes\". There's much more nostalgia for the fans, as the original monsters are in it this time.\n\nFred was an appendix in the first film. This time he actually brings some entertainment and purpose with him.\n\nDaphne's action scenes are more suited this time around, and the action has a little suspense this time.\n\nLinda Cardellini's performance is perfect as Velma. She's the female Clark Kent.\n\nShaggy and Scooby have never been more buddy-buddy.\n\nThere's plenty of color and silly monsters to go around, so the kids with short attention spans will have plenty to pacify them. Check your brain at the door and enjoy.\n\n6/10"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "thegamerproject",
        "review_rating": "10",
        "review_title": "Scooby-Doo 2: Manhood Unleashed",
        "review_detailed_main": "Key talking points: . Scooby is a dog . Shaggy and Scoob have a really emotional character arc that i will not spoil here. Made me shed a tear. . Potentially the best on-screen romance between Velma and Seth Green. The chemistry was there for all to see. . Velma wears THE suit in the movie and i'm fairly confident that the scene was responsible for my growth spurt. Potentially the best film of the decade, make sure you have tissues at hand. For the emotional narrative. Not the Velma scene you dirty dog."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "sufyaanrashid95",
        "review_rating": "6",
        "review_title": "A Spooky Sequel Full of Fun",
        "review_detailed_main": "Scooby-Doo 2: Monsters Unleashed is a delightful continuation of the beloved franchise, offering a spooky and entertaining adventure that builds upon the charm of its predecessor. The film reunites Scooby, Shaggy, Fred, Velma, and Daphne as they confront a new mystery involving the resurrection of their most notorious foes. The plot, while formulaic, is elevated by its self-aware humor and nods to the original cartoon, creating an engaging and nostalgic experience for fans of all ages.\n\nThe cast's performances are as endearing as ever, with each actor bringing energy and charisma to their respective characters. The chemistry between the gang members feels genuine, and their camaraderie shines through in both comedic and suspenseful moments. The CGI portrayal of Scooby and the imaginative creature designs add to the film's visual appeal, enhancing the supernatural elements of the story.\n\nVisually, the movie is a treat, with vibrant and creatively designed sets that capture the whimsical and eerie atmosphere of the Scooby-Doo universe. The special effects are well-executed, bringing the larger-than-life monsters to vivid and entertaining life. The film's pacing allows for moments of levity as well as suspense, striking a balance that keeps the audience engaged throughout the mystery.\n\nScooby-Doo 2: Monsters Unleashed successfully expands upon the themes of friendship and teamwork, central to the franchise, while also offering a deeper exploration of the characters' personal growth and insecurities. The humor is clever and family-friendly, catering to both longtime fans and newcomers.\n\nIn conclusion, Scooby-Doo 2: Monsters Unleashed is a spirited and entertaining sequel that effectively captures the spirit of the original cartoon while offering a fresh and engaging adventure. It's a fun-filled romp that celebrates the timeless appeal of Scooby and the gang, delivering a blend of humor, mystery, and heartwarming camaraderie that is sure to leave audiences of all ages with a sense of nostalgia and satisfaction."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "lisafordeay",
        "review_rating": "6",
        "review_title": "A Silly entertaining flick based off the Cartoon show of the same name",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "Calicodreamin",
        "review_rating": "6",
        "review_title": "Fun scooby sequel",
        "review_detailed_main": "Definitely not as good as the first scooby-doo live action movie, but still a fun mystery inc. movie. The actors are so well cast that it makes these movies so enjoyable to watch. The plot and action scenes were a shade more ridiculous in this movie, which takes away from the movie a bit. Overall, its a mindless action/comedy with a killer soundtrack."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "g-bodyl",
        "review_rating": "8",
        "review_title": "Better Than the First!",
        "review_detailed_main": "Scooby Doo 2 is more enjoyable than the first one. I think the jokes and the special effects were even better. I liked how they took some villains from the cartoons and brought them to the big screen. That was pretty clever. After the first film which was decent, I had no intent to see this. But, I eventually gave in.\n\nThe gang is facing trouble in their town. The town is about to be taken over and they have been getting hit hard with criticism especially by this good looking TV reporter. The gang have to save their town before it's overwhelmed by evil.\n\nThe acting is okay maybe on par with the first film. Matthew Lillard as Shaggy annoyed me more in this film than he did in the first. The others I think brought up their game. Alicia Silverstone and Seth Green are welcome additions to the cast.\n\nOverall, this is a better movie than the first. Too bad they are not making Scooby Doo 3. I rate this film 8/10."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "Rob_Taylor",
        "review_rating": "6",
        "review_title": "Scooby Doo: Deadwood 2",
        "review_detailed_main": "Well, that's what it felt like to me. Seems like Scoob went down to Deadwood and picked himself up a couple of logs. A couple of logs by the name of Prinz and Gellar (aka Fred and Daphne). Talk about useless characters! This pair did nothing of any consequence in the entire film. Perhaps for Scooby Doo 3 the writers will recall that, in the end, the Scooby Doo cartoon was just Shaggy and Scooby and not all the pointless hangers on. Of course, there was Scrappy Doo and Scooby Dumb, but we won't go there.\n\nBut as for the cast, once again Matthew Lillard excelled as Shaggy and Linda Cardellini was a decent Velma. Scooby was, well Scooby, and pretty well done. In fact, the CGI for once was reasonable.\n\nBut as for the rest.....\n\nIt's a shame that the writers didn't have more imagination when they decided to \"re-imagine\" the Daphne character. Because all they've done is re-imagine her as Buffy and it's just retarded. So much is she that, in the future, when you're channel surfing and come across this movie you might not realize its Scooby Doo at all but think you're catching Buffy on a re-run.\n\nAs for the movie itself I guess its OK if you're a kid. But the charm of the cartoon was that the gang never faced real monsters. It was always someone in a mask. Whilst it was nice to see some of the old characters from the show being given the CGI treatment, the fact that they were now supposed to be real was a little boring.\n\nThere is some good humour fairly early on but it doesn't last long and the whole thing becomes a somewhat tedious slog to the finish which is made even more dire by the awful attempts to introduce a love interest for Velma and the whole character \"development\" thing pitifully attempted (and failed) for Fred and Daphne. At least the series was over in thirty minutes or so.\n\nThis sequel is neither worse nor better than the original, just more of the same. Only Shaggy and Scooby keep the film going for adult viewers and as for Gellar and Prinz......well, lets hope the writers remember why its called Scooby Doo next time."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "Jordan9282",
        "review_rating": "7",
        "review_title": "Not a bad movie",
        "review_detailed_main": "This movie was definately not one of the best movies that I have seen but it still was an entertaining movie. First, I would like to say that whoever did the casting for Scooby Doo deserves a huge raise. He found the perfect people to play the different roles. The best fit will have to be Shaggy. This guy was born to play Shaggy. Something I still don't understand is where did Daphne (Sarah Michelle Gellar) learn how to fight with the martial arts and learn to fight with weapons. She never had that power in the cartoons, but that's Hollywood for you. Anyway, I thought this sequel was better than the first one, mostly because they didn't have a good guy (Scrappy) playing the villian and the plot was pretty good and it still had its humor. Anyway, thats about all i have to say about this movie. Overall, this was an entertaining movie."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "earlebob",
        "review_rating": "7",
        "review_title": "Kids Loved It",
        "review_detailed_main": "We took our children to see this, and although it was an okay movie for my husband and self, the kids were absolutely rolling in the aisles. Our 7 year old was hysterical throughout most of the movie. We liked that it contained the monsters from the cartoons, especially one of my favorites the Black Knight. The plot was cheesy, but let's face it, aren't the cartoons the same?! Our 3 year old sat through the entire film without squirming around and this says that it truly can hold its own as far as a family film is concerned. I hate to say that one thing that disappointed me was that there was no sign of a Scooby Snack that I could tell. (I might have missed it, since I was shushing the kids.) I like the new updated looks and the fact that they are not playing Velma as being a lesbian. In fact, most will see a truly new Velma. Matt Lillard is an excellent Shaggy! All in all I will say that we were glad that we went."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "burkeaustyn",
        "review_rating": "10",
        "review_title": "One of the best kid-friendly movies of the 2000s",
        "review_detailed_main": "I watched this film so many times as a kid that I had to come here and make an effort to fix these reviews. It's hilarious, and the characters actually have character. Shaggy and scooby have some sad reflecting moments which never come up in any of the other iterations that really developed them as characters, and many of the jokes even land 15 years later. This movie deserves more credit, and James Gunn should have made more family movies because this really shows his potential which he demonstrated again with Gaurdians of the galaxy. This movie wasn't really a 10/10, realistically I'd give it an 8 or so, but these unfair reviews are not a good reflection of the quality of the movie."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "memoryvixen",
        "review_rating": "7",
        "review_title": "Good fun for the family",
        "review_detailed_main": "I went to see \"Scooby Doo 2\" today with my 26 year-old sister, 60 year-old father, and a theater full of kids ranging from 6 to 13 years of age. And guess what? We ALL enjoyed it. This movie isn't \"Hamlet,\" but it's not meant to be. Remember that it's based on a CHILDREN'S cartoon, so much of the humor is geared towards children, and the little boys sitting in front of me were having a ball!\n\nBut parent's needn't fear! The humor might be geared towards the kiddies, but with the exception of some crude toiler humor, there's nothing offensive or unpalatable to your average adult. I was laughing hysterically more than once! Everyone really kicked up their funny bones a notch for this one: Freddie Prinze, Jr was hilarious as the shaggily-coifed Freddy, and Sarah Michelle Gellar turned in another great performance as debutante Daphne. Linda Cardellini (Velma) had a very sweet romantic subplot with Seth Green's character, and Seth Green ALWAYS makes a movie ten times better than it would have been without him. Alicia Silverstone turns in a delighfully hateful performance as a spiteful entertainment reporter out to take down Mystery, Inc. And the best small part in the film comes from Peter Boyle (of \"Everybody Loves Raymond\"), who plays a bitter ex-rival of the Scooby gang.\n\nI love Matthew Lillard, but I thought he overplayed Shaggy in this one, letting the character's eccentric ticks and speech patterns get in the way of many of his scenes. But when he wasn't trying to be deliberately goofy, Lillard turned in a touching performance as Shaggy and Scooby begin to doubt whether they - the perennial \"screw-ups\" of the team - qualify as \"heroes,\" like the rest of the gang. And he had what was by far the best line in the entire film; it STILL has me laughing!\n\nSHAGGY: This ties as the most terrifying day of my life!\n\nVELMA: Ties with what?\n\nSHAGGY: Every other freaking day of my life!\n\nThe movie was a great day out, and I wish they'd released it during the summer, because it's perfect summer fare. They gave it enough of the cartoon elements without making it unbelievable, and each of the actors were perfectly in character. And beyond all that, the movie puts across a tastefully done message that it's important to embrace who you are and love yourself for what makes you YOU. This is something that kids should NEVER stop hearing, and if they have a good time while hearing it, than all the better. I give this one a thumbs up!\n\nPS - The second funniest scene in the entire film involves Freddy, the Black Knight Ghost, a mock-joust, and Bon Jovi's \"Wanted: Dead or Alive.\" I won't go into detail. You've got to see it to understand. ;) LOL!"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "mateimiu",
        "review_rating": "7",
        "review_title": "It's a Scooby Doo movie.",
        "review_detailed_main": "What more could you want from a movie that has such a banger ride as the Mystery Machine Limo?"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "kevin_robbins",
        "review_rating": "7",
        "review_title": "This is a step down from the first film in terms of storyline and overall film but a huge step up in terms of special effects and monsters",
        "review_detailed_main": "Scooby-Doo 2: Monsters Unleashed (2004) is a movie my daughter and I recently watched together on HBOMAX. The storyline involves the gang attending a crime museum opening when a villain appears and releases several of the gang historical nemesis'. Meanwhile an evil scientist has created formulas that create monsters. How does all of this tie together? This movie is directed by Raja Gosnell (Big Moma's House) and stars Freddie Prinze Jr (I Know What You Did Last Summer), Sarah Michelle Gellar (Cruel Intentions), Matthew Lillard (Scream), Linda Cardellini (Broke Back Mountain), Seth Green (Robot Chicken), Peter Boyle (Red Heat) and Alicia Silverstone (Clueless). The special effects, CGI and atmosphere of this film is absolutely perfect for the content. The storyline is okay, and the writing for the characters other than Scooby and Shaggy is pretty mediocre; however, Scooby and Shaggy are hilarious and well written and delivered. The casting is well selected and fit the characters to perfection and the attire remains well selected. Overall this is a step down from the first film in terms of storyline and overall film but a huge step up in terms of special effects and monsters. I would score this a 6.5/10 and recommend it as a fun family film."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "kellysuenash",
        "review_rating": "10",
        "review_title": "I LOVE IT!!!",
        "review_detailed_main": "So good,if you don't like it I won't like you. Leave a like and comment."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "masonsaul",
        "review_rating": "8",
        "review_title": "Really fun sequel",
        "review_detailed_main": "While it lacks the the unique charm of it's predecessor, Scooby-Doo 2: Monsters Unleashed is still a great sequel that's really fun whilst also being a more traditional Scooby-Doo film. Matthew Lilllard, Sarah Michelle Gellar, Linda Cardellini and Freddy Prinze Jr. are all once again perfect and Seth Green is great. The CG is slightly better than it's predecessor but still weak. Raja Gosnell's direction is really good, it's well filmed and extremely well paced. The soundtrack is also really good and the music by David Newman is good."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "brooke-98054",
        "review_rating": "10",
        "review_title": "This one steps it up!",
        "review_detailed_main": "This whole movie has heart, fun, and action! It goes through many character developing moments. The jokes are funny once again and the casting is great! The monsters add excitement and joy to the film. Along with the fight/action scenes. This movie is fantastic and should be watched by every Scooby doo fan!"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "gianmarcoronconi",
        "review_rating": "10",
        "review_title": "Underrated",
        "review_detailed_main": "Very underrated film which is clearly superior to the first both for screenplay and for fidelity to the original work. The casting done for the characters as for the first film is wonderful and they all play their part in a masterful way, showing themselves perfectly able to adapt the iconic characters of the animated series down to the last detail. Because what this film manages to do more than all the others of this type is to be able to maintain extreme fidelity with the spirit of the original work, managing to entertain the viewer from beginning to end and in my opinion winning the title as best adaptation of Scooby-Doo."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "WeAreLive",
        "review_rating": "9",
        "review_title": "Childhood memorise as a scooby doo fan",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "moist-68355",
        "review_rating": "10",
        "review_title": "the best film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "carlinofranzoniacosta",
        "review_rating": "10",
        "review_title": "10/10",
        "review_detailed_main": "The best movie ever. Even the greatest film critic ls mark knows that this film is a masterpiece."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "Brooklynsmagicmike",
        "review_rating": "8",
        "review_title": "Not as great as the first but still very good",
        "review_detailed_main": "Im big fan of Scooby Doo and I enjoyed both movies in this film series however I feel compared to the original this lacks in few ways.\n\n1.)I feel like this film was a little Claustrophobic. I do understand however that could be do to this movie having a lower budget compared to the first one.\n\n2.)The jokes in this were def okay but weren't as good and felt forced at random times.\n\n3.)The premise in the first one was alot more fun and flowed nicer. In the second I felt it was dry at times.\n\nOverall besides this movie is def enjoyable and I personally loved it I just don't see it as massive upgrade over the first. If anything I personally feel it regressed hence why the third was cancelled."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "pbrugalett",
        "review_rating": "8",
        "review_title": "Getting back to their cartoon roots",
        "review_detailed_main": "While checking director Raja Gosnell's (`Scooby-Doo 1 and 2') resume I learned he had been editor of the little known comedy-horror classic, Troma's 1987 `Monster in the Closet.' So before I go on, forget what you think you know about Troma films to find and rent `Monster in the Closet.'. Meanwhile, in this second `Scooby Gang' installment we find our five heroes (Freddie Prinze Jr. as Fred, Sarah Michelle Gellar as Daphne, Linda Cardellini as Velma, Matthew Lillard as Shaggy, and Scooby Do) getting back to their cartoon roots when a mysterious masked madman brings a collection of monster costumes (worn by previous Scooby-Doo cartoon bad-guys) to life to terrorize the town of Coolville, home of the Mystery Machine. Someone on the last film's production team must have read the reviews of `Scooby-Doo 1' and listened because `Scooby-Doo 2' follows the cartoon formula that gave the television series it's signature style. Back are the locations we've come to expect: an abandoned, condemned mining camp; a desolate, decaying, haunted mansion, and a spooky, foggy swamp. And, as in the cartoons, our gang needs to unmask-unmask (if you're a fan of the cartoon you understand otherwise wait to see the film) the madman behind this who-can-it-be mystery, while Shaggy and Scooby try to prove to themselves that they too are heroes. Don't expect a work of art, but do expect lots of cartoon comedy, fart jokes, whacky chase scenes, and a few lines and scenes thrown in for the adults. One of my favorites was at the opening of the museum exhibit when the Scoobys walk the red carpet. Various groupies attached to each of the heroes greets them and, of course, the group that greets Shaggy is definitely stoned. The monsters unleashed are more funny than scary, which makes this a good intro to horror for little ones. (We need to start raising the next generation of horror fans.) They even added some depth to this cast with Seth Green (Austin Powers and Buffy the Vampire Slayer) as the museum curator; Alicia Silverstone (Batman and Robin, The Baby Sitter) as the Reporter; and the great character actor, Peter Boyle as Old Man Wickles. Fans of the Scooby-Doo cartoon series will certainly enjoy this film while others will get some cheap belly laughs."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "joshuadrake-91275",
        "review_rating": "9",
        "review_title": "Better than the original Scooby-Doo!",
        "review_detailed_main": "Now, I move on to the sequel to the 2002 film, SCOOBY-DOO 2: MONSTERS UNLEASHED.\n\nI mentioned in my previous film review for the first Scooby-Doo film that the film was negatively received by critics, but was a hit with audiences and made a profit of $275 million dollars against it's $84 million dollar budget.\n\nSCOOBY-DOO 2: MONSTERS UNLEASHED is the sequel to the first film once again directed by Raja Gosnell and written by James Gunn.\n\nThe plot shows the Mystery Inc. investigating the plans of a masked villain who wants to control the city of Coolsville using a machine to create monsters.\n\nUnlike the first film, this film featured several of the monsters from the television series, including the Black Knight, the 10, 000 Volt Ghost, the Pterodactyl Ghost, the Miner 49er and Chickenstein.\n\nThe story is amazing and I think the writer once again successfully translated this script into a film that I enjoyed. James Gunn did a really good job with the script and Raja Gosnell directed this movie brilliantly.\n\nThe visual effects, costume and production designs are really great, especially the way they created the monsters and it was really amazing and the CGI on the monsters and Scooby-Doo is just freaking awesome.\n\nMy favorite scene is when Daphne fights the Black Knight. That was really cool, especially for Sarah Michelle Gellar, who was on Buffy the Vampire Slayer during the filming of this movie.\n\nThe acting is just incredible. The returning cast are really amazing this time around, I just wish they kept the deleted scenes in this movie and the film is just really amazing and fantastic. The music by David Newman is once again amazing. The newcomers are Seth Green, the late Peter Boyle, Tim Blake Nelson and Alicia Silverstone and they done really great performances.\n\nThe special features is really amazing in this film. You have the deleted scenes, again with and without commentary, two music videos, how the visual effects creators made Scooby-Doo dance, an insider's tool of the making of this movie and the movie-making process with Scooby-Doo, a True Ghoul Hollywood Story, two games on this film and trailers for the other movies released by Warner Bros. include THE POLAR EXPRESS and HARRY POTTER AND THE PRISONER OF AZKABAN and I will review those.\n\nOverall, I give SCOOBY-DOO 2 a 9 out of 10, while the DVD's special features gets a 9 out of 10 as well."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "bigmanmalcolm",
        "review_rating": "10",
        "review_title": "A Cinematic Masterpiece",
        "review_detailed_main": "Scooby Doo 2 of is genuinely one of my favourite films of all time and the fact that I have seen this film at least 20 times makes me upset."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "foxwitkennels",
        "review_rating": "8",
        "review_title": "Great kids movie, meant for kids.",
        "review_detailed_main": "I couldn't care less what the reviews say about both the 2002 and 2004 live action movies. 6-7 year old me loved those movies, so late 20s year old me still love the movies. Hope were clear.\n\nWith this said I can surely understand why adults watching the movie don't find it funny or appealing, but that's the thing, it's not meant to be funny or appealing for adults. Count yourself lucky if they were giving a handful of gag that were only understandable to adults like some kids movies do nowadays, that still doesn't mean it was meant for adults. If kids love it, then it's a great kids movie. It's not that deep."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "jmalham-07186",
        "review_rating": "10",
        "review_title": "It's scooby doo as scooby doo should be",
        "review_detailed_main": "Is this movie a technical marvel? No. Is the direction Oscar winning? No. Is it amongst the great examples of film-as-art? No. But this movie sure as hell encapsulates everything about Scooby Doo. I love this movie more than 99% of my memories from when I was of the ages 4-6 and that's only because the other 1% are memories where I watch Scooby Doo 2: Monsters Unleashed. Little did I know it, but Matthew Lillard's portrayal as Shaggy molded me into who I am today. Just kidding. I cut my hair a while back and now I look like any other white dude. But alas, I still fall engrossed with his impeccable performance upon every viewing. If I were to guess what the eternal bliss and tranquility experienced by Mormons upon their entry into the Three Kingdoms felt like, Matthew Lillard as Shaggy would be that guess. So for those of you who, like me, go and hide away from any windows whenever the Mormons coming knocking at your door because you really don't feel like talking to anyone that day, let this movie be the one true source of light in our lives. And so, I ask that, as one, we all hope and pray for Scooby Doo 3: Oh No, The Monsters Escaped From Their Enclosures!\n\nIn the name of the Shaggy, And of the Scoob, And of the Scrappy Doo,\n\nZoinks."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "Movie Nuttball",
        "review_rating": "10",
        "review_title": "Very good film! Arguably better than the first!",
        "review_detailed_main": "Scooby-Doo 2: Monsters Unleashed is a very good film that has a good cast which includes Freddie Prinze Jr., Sarah Michelle Gellar, Matthew Lillard, Linda Cardellini, Seth Green, Peter Boyle, Tim Blake Nelson, Alicia Silverstone, Neil Fanning, Pat O'Brien, and the Tazmanian Devil! The acting by all of these actors is very good. The Mystery Inc. gang are really excellent in this film. I thought that they performed good. Boyle and Silverston are very good too! The action thrills is really good and some of it is surprising. There are many hilarious scenes! The movie is filmed very good. The music is great by David Newman and great directing by Raja Gosnell!. The film is quite interesting and the movie really keeps you going until the end. This is a very good and thrilling film. If you like The the first Scooby-Doo movie and the classic cartoons, Freddie Prinze Jr., Sarah Michelle Gellar, Matthew Lillard, Linda Cardellini, Seth Green, Peter Boyle, Tim Blake Nelson, Alicia Silverstone, Neil Fanning, Pat O'Brien, the Tazmanian Devil the rest of the cast in the film, Comedy, Action, Adventure, Thrillers, Family, Fantasy, Sci-Fi, Horror, Dramas, and interesting Halloween seasonal films then I strongly recommend you to see this film today!"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "husnain_05",
        "review_rating": "10",
        "review_title": "The gang are back in their second movie but this time it's even better.",
        "review_detailed_main": "FANTASTIC FILM.Everyones acting was fantastic, Freddie J Prince, Sarah Michelle Gellar, Linda Cardellini, Matthew Lillard and everyone else. It was a bit of a creepy film but it is very funny. I Love the Scooby Doo cartoons and I think this movie was great. The first Scooby movie was great to but this one is more like the cartoons. The Voice of Scooby Doo was fantastic because it went with the image of Scooby Doo. I love the part at the end when Shaggy is wearing a mask of a monster and Scooby Doo thinks it is a real monster. I also like the bit when the gang fights with the monsters and Scooby Doo saves everyone.I loved the film and if Scooby Doo 3 will come out it will make it even more awesome."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "MLDinTN",
        "review_rating": "8",
        "review_title": "more entertaining than the first one",
        "review_detailed_main": "Sure, this movie doesn't require brain power, but I found it fun and entertaining. I thought it was funner than the first one. In this one, the gang must stop a villain from bringing monsters they have captured back to real life. And Shaggy and Scooby decide they will be real detectives. I found myself laughing several times. One scene that comes to mind is when Fred is facing off against the knight and says bring it on. The knight beats him silly, and Fred says \"you brought it\" and falls down. Or Fred's interviews on TV. And the gang busts up Old Man Winkles meeting and come to the wrong conclusion. I even laughed at Seth Green's introduction. Velma even tries to dress sexy but ends up making some \"weird\" noises. Scooby searches for clues but just picks up a lot of stuff he wants. Shaggy says \"those aren't clues\". Funny. And I could go on and on.\n\nFINAL VERDICT: I recommend it for anyone looking for a fun film."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "bevo-13678",
        "review_rating": "10",
        "review_title": "Yeseree",
        "review_detailed_main": "A great follow up with a new Velma losing her glasses gag and shaggy and Scooby getting scared"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "BloomingtonAdam",
        "review_rating": "8",
        "review_title": "The cartoon comes to life",
        "review_detailed_main": "On the very short list of movie sequels that are better than the original, you will find this movie. It is funny, sweet, and charming all at the same time. As a live action cartoon, it hits the mark perfectly. Not only was it fun to see the cartoon monsters brought to life, it was also fun to see how much the animators enjoyed giving them life. The morality tale of \"always be yourself\" was prevalent throughout, making for a wonderful message. Many people are overly critical of a movie like this, expecting things movies like this aren't meant to deliver. It is pure silly fun and not much more. For those unaware, the kids are blamed as things seem to go wrong in Coolsville. Determined to make things right, they track down the person behind the reappearances of old villains. Shag and Scoob trek out on their own determined to prove they can be good detectives. Down the road the gang meets up learning more about themselves along the way. Through teamwork and perseverence they (of course) get to the bottom of the mystery, unmasking the villain in classic Scooby Doo fashion. I am happy to say I had a completely enjoyable time at this movie, and was pleasantly surprised, as I hadn't expected much going in. In the wide world of moviedom, if you go in expecting Batman <The original with Adam West> instead of The Matrix, you should be in for a treat."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "mqrrgpese",
        "review_rating": "10",
        "review_title": "Greatest Sequel of ALL TIME",
        "review_detailed_main": "This movie is the greatest sequel movie and one of the greatest movie of all time. If you want to watch a movie and laugh, smile, BOLSTER OUT OF YOUR SEAT FOR, and even be brought to tears, this is the movie for you. The Two Towers is the only sequel that can be in the discussion MAYBE. If you love Scooby Doo you will love this movie."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "leonrsell",
        "review_rating": "10",
        "review_title": "BEST MOVIE SINCE MORBIUS 29 MORBING OF THE MORB",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "JosephAndrewThomas",
        "review_rating": "9",
        "review_title": "Monsters Unleashed: A Refreshing Turnaround for Scooby-Doo #JusticeforScrappyDoo",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "cheyannefox",
        "review_rating": "9",
        "review_title": "Top 10 films of our generation",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "lukem-52760",
        "review_rating": "8",
        "review_title": "It's Colourful, It's Light & It's Fun!!! A Super Sequel That is Full of Stars of the late 90's to Early 2000's!!!",
        "review_detailed_main": "Scooby-doo 2: Monsters Unleashed is a good time of a movie & one super superior sequel. This funky film is full of stars we grew up watching in the 90's & early 2000's!!!\n\nI have alot of love for this particular Scooby-doo movie because me & one of my daughters watched this film constantly when she was little & i loved it just as much. Scooby-doo 2 is a kids film but it's also a joy for any adult that watched Scooby-doo as a kid. I've always loved Scooby-doo the cartoon & so my middle daughter got into it & loved it.\n\nThere's some great Scooby-doo films that we love, such as Camp Scare & Zombie Island & The Witches Ghost to name a few but it's Monsters Unleashed that is the best of the live-action movies.\n\nThe cast is perfect with the great Sarah Michelle Geller (Scream 2, The Grudge, I Know What You Did Last Summer) she was a big star during the 90's that i grew up watching in Buffy the Vampire Slayer & those films mentioned above. Sarah is a great actress & brought Daphne to life perfectly. Also Freddie Prinze Jr was a 90's star i grew up watching as he starred with Sarah Michelle Geller (his real life Wife) in the classic slasher \"I Know What You Did Last Summer\" & it's sequel, he made a decently fun Fred. Also another 90's star was Mathew Lillard from Scream &13 Ghost's & many more things & really went all out & brought the crazy Shaggy to colourful life. Lillards performance as Shaggy is excellent & the greatest performance from the whole cast!!! The girl as Velma was new to me as an actress but she was great.\n\nThe legendary Scooby-doo is brought to life with CGI & he looked great for its time in 2004. Of course CGI has advanced massively but his look is Nostalgic for me now. Great memories watching this super sequel over & over again.\n\nThere's also a little role for another 90's star, Alicia Silverstone (Clueless, Batman & Robin) as a Coolsville Reporter, this movie really now is a time capsule of its era with its then popular stars.\n\nI love the story here about a masked villain that brings to life some of the most famous Scooby-doo monsters & how Coolsville turns against Mystery Inc.\n\nI love the big expensive & beautifully designed sets such as Mystery Inc's HQ & the big old spooky house & the villainous bar & the museum of Mystery Inc's captured monsters. The film looks fantastic as expected for its big lavish budget. The movie is colourful & full of fun. The CGI monster are fun with some also brought to life with rubbery costumes that gave it an old school 80's feel. There's lots of silly humour that is harmless & there's a real sense of friendship fun & fantasy adventure.\n\nAlso amongst the cast is another star of the time, Seth Green (Knockaround guys, Austin Powers) as Velma's love interest.\n\nAlso the great veteran actor Peter Boyle has a small fun role.\n\nThe Mystery Machine looks beautiful.\n\nEverything this about this film is fun & full of heart, yes it's often very cheesy because it's aimed at kids & some of the gags are abit too silly but you can't help but enjoy it all.\n\nI have many fond memories of watching this film with my daughter & i will always have a soft spot for Scooby-doo 2 in my movie loving heart."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "aesgaard41",
        "review_rating": "9",
        "review_title": "Enjoyable But Fair Sequel",
        "review_detailed_main": "I loved this movie as much as I enjoyed the first one. The dizzying opening is enough to provoke headaches, but its worst criticism is that its inspired from the worst end of the Scooby spectrum - the ridiculous cartoon parody Scooby became rather than the Gothic masterpiece it was meant to be. Lillard is again excellent although Shaggy now has an identity crisis as well as selective amnesia. Thinking he's not worth anything to the team, he's forgotten he has found important clues in the past. Cardelini's presence still shines through her Velma disguise and Sara is also a gracious presence, but Prinze still falls short playing Fred as a stuck up and short-sighted playboy. Alicia Silverstone is a welcome presence even playing a \"rhymes with witch\" although I had would have preferred a different and much more grand end to her character. Seth Green, however, just sorts of wanders through his scenes though. I big complaint I have as I did with the first movie is that since the Scooby Gang started in the Late Sixties/Early Seventies that they would be in their Forties today. Scooby would be 259 years old (37 in people years). The plot has a lot of fake science and far-fetched magic goes into creating the ghouls from the TV series, but there's not enough images of the classic creatures. I would have preferred to see The Headless Specter, the Giggling Green Ghosts, Ebenezer Crabbe and the No-Face Zombie among others. Continuity and established facts are now out the window as the movie makes up its own history as Aggie Wilkins is now a brunette and C.L. Magnus is missing his fortune. The Miner '49 can now spew fire, but then it doesn't look the guy from the cartoon. I'm not sure if the bald thing was supposed to be the Creeper or not, and where the heck did Chickenstein and the Cotton Candy Ghost come from? Worst among the plot points is that the Pteradactyl was actually John the Caterer from \"Hang In There, Scooby Doo.\" Who the heck is Jacobo? Well, that's creative license for you. The writers can screw up everything they want to make their movie. I just hope Scooby Doo III can live up more to the cartoon series than the first movie did."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "leobarrett-47676",
        "review_rating": "10",
        "review_title": "BEST. FILM. EVER",
        "review_detailed_main": "INCREDIBLE!!!!! the best movie hands down, so much better than the first one. Scooby doo: the movie walked so that scooby doo 2 monsters unleashed can run. and i am being 100% serious no memes, genuinely one of my favourite movies i watch it every couple of months to keep it fresh in my mind, ugh its so iconic. seth green, \"who's your mommy\", \"scooby, doobie. DOO\", the soundtrack? *chefs kiss* what a brilliant film. the rating on here is WRONG!"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "neil-476",
        "review_rating": "8",
        "review_title": "Another success",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "kenyae-cagle",
        "review_rating": "8",
        "review_title": "I enjoyed re-watching this movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "gypsyrain",
        "review_rating": "10",
        "review_title": "Enjoy the movie in spite of yourself....",
        "review_detailed_main": "Come on folks. This movie is not supposed to be rocket science. This movie was made to appeal to the kid in all of us. We are not looking for deep emotional meaning in the movie, we are looking to see if they can bring the cartoon we loved as children on to the big screen and in flesh and blood. Why can't we take this movie at face value - just enjoy it for it's campy humor and be happy in the knowledge that they have remained true to their characters and plot lines.\n\nIf you are looking for substance, you shouldn't watch a movie based on a cartoon. If you are looking for a chance to, even for just a short while, return to the innocence and happiness of your childhood - look no further.\n\nMy children enjoyed this movie for exactly what it is supposed to be. Great family entertainment."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "dickinsonjason-34081",
        "review_rating": "10",
        "review_title": "Good",
        "review_detailed_main": "This was a good Movie I liked a lot but yes the first one was a lot better don't get me wrong this one was enjoyable as the first one"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "wall_e91",
        "review_rating": "9",
        "review_title": "it was WICKEDLY funny!",
        "review_detailed_main": "I am ashamed to say that as much as I find the cartoons annoyingly stupid (the way they walk most of all) the film was brilliant. I must have watched it at least 20 times and the (slightly ridiculous) jokes make me laugh every time! especially 'scooby-doo, what's your conclusion?' 'BUNNY!!' The scene at 'The Faux Ghost' is great too, Scooby dancing is something I never thought I would see! It is a well known fact that the first film in a series is always the best, but in this case I think this one is better, as it contains more humour and brilliant cast members, including obsure ones. If you enjoyed the first film there is no doubt you will like this one too, if not more. The unmasking actually surprised me unlike the cartoons which may as well begin with 'WARNING!!! CONTAINS PREDICTABLE CONTENT!!!' Great for all ages."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "canalanonymous",
        "review_rating": "10",
        "review_title": "Very good",
        "review_detailed_main": "Very good!! I loved the pursuit scenes. Mainly the characters development."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "AlmondJoyy",
        "review_rating": "10",
        "review_title": "Scooby-Dooby Doo!",
        "review_detailed_main": "This review is going to be in line with the review I left on the first movie that came out a couple years before this one. You can't be disappointed if you watch this from the perspective of the original cartoon. It follows the humor, the running around constantly, the monsters, and most of all the heart of the show. The CGI did not improve from the first movie, but it didn't get any worse at least. The negative reviews really make me wonder if any of them are a true fan of the original cartoon. The episodes were silly but extremely enjoyable and I always looked forward to choosing which episode to watch after school. This brings nostalgia and everything I need in a live action film. Don't take it so seriously and you might actually enjoy it. It's a fun film and hits the nail on the head."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "erminahotmail",
        "review_rating": "8",
        "review_title": "better than the first",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "iancrompton-12481",
        "review_rating": "10",
        "review_title": "Classic Film!",
        "review_detailed_main": "Always loved this film since I was a kid! Funny and a great cast!"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "paperjamthepuppet",
        "review_rating": "10",
        "review_title": "This movie made my childhood",
        "review_detailed_main": "There is just so much love and care put into this movie. The acting is amazing and I love how Shaggy is able to act alone but make every scene so meaningful. Anyway this movie is great. I love it. It's so good. Please watch it."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "tasteysnacksaregood",
        "review_rating": "10",
        "review_title": "this movie is cinema",
        "review_detailed_main": "If you love Scooby doo and dumb crap then you will definitely enjoy this film"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "pumphreyowen",
        "review_rating": "8",
        "review_title": "Eh it's fine",
        "review_detailed_main": "This movie was a good sequel, I couldn't stop watching this. Honestly it was a little better than the first one but The first one is still Good, It was also really cool to see the old villains return!"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "DeonhasMoved",
        "review_rating": "10",
        "review_title": "Not just an improvement, a significant one at that.",
        "review_detailed_main": "Monsters Unleashed is everything I could want out of a Scooby-Doo movie. It's super entertaining, funny, has a lot of heart, and truly captures the spirit of the source material. If I have any complaints, it's that the CGI has aged pretty poorly for the most part. But regardless, it's better than the first in every other way, and is my favourite Scooby-Doo movie period.\n\nI have to fill out the review, so I'll add a few things:\n\nZombie Island is a close second if you're wondering.\n\nThat potions scene is iconic. Enough said.\n\nThe tar monster looks like B. O. B. From Monsters vs. Aliens.\n\nYour mum."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "jbowslee",
        "review_rating": "8",
        "review_title": "Not a masterpiece, but fun",
        "review_detailed_main": "When I went to see Scooby Doo 2, I was not expecting a revolution in the film industry. I was not expecting to leave the theater emotionally jolted. I went to have fun and laugh. And I did.\n\nThis was a fun movie. Let's be honest. Nobody goes to this film to watch Fred, Daphne, or Velma. We go to watch Shaggy and Scooby. They are the ones that make us laugh. They are the ones that take our minds off the real world for a couple hours. And they did their job.\n\nMatthew Lillard becomes Shaggy for the second time. What he is able to do in this film is incredible. You forget he is Mr. Lillard because he fully becomes the character he portrays. That is the highest compliment you can give an actor (minus a 20 million dollar check).\n\nScooby again is a riot. The writing allows him to remain the lovable character we grew up with as kids. He alone is worth the price of admission.\n\nThe story? Well, I have eaten swiss cheese with less holes in it than the plot. But, who really cares? I can watch The Godfather whenever I want a flawless film. But, The Godfather does not leave me in a better mood after I finish watching it, no matter how great it is. I saw this movie relax and have a good old time.\n\nI am not ashamed to say that my wife and I went to see this together. We have no children...WE wanted to see it. And we both enjoyed it very much. It was a pleasant way to spend the evening. But don't take it from me. Take it from the dozens of small children that were in there, laughing and shrieking through the whole film. You could hear how much they were enjoying themselves. Come to think of it, that was worth the admission price in itself."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "buffylover111",
        "review_rating": "10",
        "review_title": "Scooby fans will be in for a treat!!!",
        "review_detailed_main": "Scooby Doo 2 is much more in depth with relationships between the characters. That is what I liked best about this film. You got to know more of them and their personality. Although this was a great movie, I still liked the first Scooby Doo better. I felt the first one was more creative and fun. I didn't like how Scooby Doo 2 ended (I won't say how) and I thought it was obvious who the villain was. I love both movies. Hopefully there will be a Scooby Doo 3. I know Linda Cardellini and Matthew Lillard are ready to sign on but Sarah Michelle Gellar and Freddie Prinze Jr. are having second thoughts. Also, Scooby Doo 2 did have better special effects. Check this movie out and you'll love it no matter what!"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "mt-65784",
        "review_rating": "10",
        "review_title": "Is mark",
        "review_detailed_main": "Ls mark told me to rate it 10 sub to ls mark please"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "buffyboy",
        "review_rating": "10",
        "review_title": "batter than the original",
        "review_detailed_main": "Raja Gosnell did a much better job on this film. Although I'm slightly biased for this film (due to the fact that I watched some of the filming in Vancouver and Stanley Park) I believe this movie felt more like an episode of \"Scooby-Doo Where Are You?\" than the first. Characters and plot are greatly developed. This movie was especially brilliant in that the characters and story were able to be more complex all the while it stuck to it's basic roots. Monster/see the gang (exposition) - Masked figure Problem/who's to blame (rising action) - more thefts/ find monster source (climax) - destroy the source/unmask the masked figure (conclusion). The comedy (though dry on a couple jokes) was much better and unexpected at times than the first. My conclusion: Bunny."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "ello-poppet",
        "review_rating": "10",
        "review_title": "loved just like the cartoon *spoilers*",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "jayson_loves_music",
        "review_rating": "10",
        "review_title": "Scooby Doo 2 Rocks",
        "review_detailed_main": "Alrighty folks. I am true blue Scooby Doo fan. Have been since I first began watching the cartoons on televisions (thank you re-runs). And when I heard that Cooby was coming to the big screen. I was so for this project. The first film was freaking hilarious, and new that the second was going to topple that one, and boy did it. More laughs, more scares, and more Doo. The whole plot was unique, and was totally fabulous to watch. I was laughing so bad that I was in tears. The whole 70's Dancing Scooby, I thought I was going to pee my pants from laughing so hard. This movie is the one to watch. It kept true to the old cartoon. I wished they added some more Ghosts from the original series. Oh well there is always Scooby Doo 3."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "BHorrorWriter",
        "review_rating": "9",
        "review_title": "Reminds me of the cartoon...",
        "review_detailed_main": "Much, much better than the 1st attempt to bring Scooby Doo to the big screen. Though, if you read my review for the first film, you will see I give it a good review. Which at the time was very accurate. However, after having seen the second film - I wish I would have not been so liberal on the review.\n\nI truly did enjoy this film much more! It had the look and feel of the old cartoon. The characters seemed more cartoonish, the plot, the sets, etc.\n\nThis could very well have been the first film, if not tweaked slightly. This one blows the first out of the water."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "milletary",
        "review_rating": "10",
        "review_title": "Great for kids",
        "review_detailed_main": "My daughter loves it and that's all that matters to me. She watches this movie as well as the first one over and over. Slight adult sense of humor for the grown-ups watching the continuous kid loop. Scooby Doo connoisseur's also commend it's true representation of the cartoon. From what I remember they're right. Mysteries are on par with original episodes with a nice spice of originality. Movie is well filmed using bright colors and appealing personalities. All actors and actresses do a wonderful job of playing the characters, emulating voices and overall presence. The two that really stand out are Matthew Lillard and Linda Cardellini, they are outstanding! The others are good too, but Matthew and Linda really bring it home!"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "stealthspyguy",
        "review_rating": "10",
        "review_title": "Excellent movie...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "dalylink",
        "review_rating": "10",
        "review_title": "Son Loves It",
        "review_detailed_main": "I'm really reviewing for my son who is 9. The movie has great chase scenes, funny moments and good music. You should see him playing the air guitar to the music and running along with Scooby and Shaggy. He just loves this movie. Very slapstick.\n\nFrom an adult perspective, I appreciate the slapstick as well. While the story may be formulaic, I still like the results. I am still amazed at the match the studio was able to get between the live action actors and the cartoons/voices from the originals cartoons. I also appreciated the Buffy links through Alicia Silverstone, Sarah Michelle Geller, and Seth Green. 7 stars from my view."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "biffbifferman",
        "review_rating": "9",
        "review_title": "Still better than the cartoon",
        "review_detailed_main": "Nice little escape film. Better than the cartoon. Seth Green dragged it a little but wasn't too much a detriment. Visual gags are clever and well-executed. Don't take it too seriously. A hot Velma always works with me. Daphne is cute too. Scooby animation is better than the best cartoon work. It is Scooby antics that help sell this film. Since this is based on a cartoon, don't over-analyze the plot holes, just willingly suspend your disbelief. It made $83 million in the box office. A moderate success, IMO. Lillard saying the box office was disappointing and that's why there will be no Scooby 3 doesn't seem true to me."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "ramflores",
        "review_rating": "10",
        "review_title": "\"A very funny and adventurous movie\"",
        "review_detailed_main": "First of all,Scooby Doo 2 was great and one of the funniest movie. Because, the graphics and effects were awesome in this movie.Also,the actors did a great job on making the movie similar to the animated version. Next, the characters were funny and cheerful just like in the cartoon shows especially Scooby Doo and Shaggy. Third, Vilma,Fred and Daphne were interesting and very serious about their investigations on each case they faced. Overall Scooby Doo 2 was fantastic and surprising since you'll never know who the real monster/bad guy is until the conclusion of the movie.\n\nIn conclusion, I gave Scooby Doo 2 a 10/10. Thanks to the actors,directors and performers who helped this movie to become possible.Plus, the Mystery Machine vehicle looks authentic and pretty much the same as the ones in the animated shows of Scooby Doo.\n\nIn addition,it was fun to watch over and over again and without a doubt you wouldn't get bored while watching it."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "kylehaines96",
        "review_rating": "10",
        "review_title": "Doo The Fright Thing.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "jaemiewaters",
        "review_rating": "10",
        "review_title": "it is laugh out loud",
        "review_detailed_main": "it is a laugh out loud movie for the whole family it is a fantastic movie it has some great songs on it like Wanted Dead Or Alive by Bon Jovi it is a great movie it is a two thumbs up movie you and your family will like this wonderful movie a lot it is a hoot i have never seen a movie quite like this before it really is a laugh out loud this movie is hilarious it is one of the best movies ever made it is a big hit i never saw anything like this in my life you will say cool it is a laugh out loud movie for the whole family will enjoy i know so it is a great family movie i never saw a movie like this in my life it is one of the best Scooby Doo movie you just have to see this masterpiece of a wonderful movie this movie is outstanding you will like this movie a lot i never saw a movie like this in my whole life you just have to watch this wonderful movie that i call a masterpiece this movie should be back out in theaters but in RealD 3D and IMAX 3D now that would be cool have a fabulous day everyone"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "EmperorNortonII",
        "review_rating": "8",
        "review_title": "Scooby's Back, And So Are Some Real Monsters!",
        "review_detailed_main": "I enjoyed the original \"Scooby-Doo,\" and was looking forward to the sequel, \"Scooby-Doo 2: Monsters Unleashed.\" However, I didn't enjoy the second movie as much as the first. I thought the theme of unmasking, i.e., pretending to be something one isn't, was a bit overdone. But still, the movie had its good points. I found the visual effects well done. And the use of villains from previous \"Scooby-Doo\" cartoon episodes, such as the Black Knight and Captain Cutlass, shows great potential. I admire that the movie adheres to the spirit of the cartoon this way. To true Scooby-Doo fans, \"Monsters Unleashed\" might be a disappointment, but not a complete one!"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "jessegehrig",
        "review_rating": "10",
        "review_title": "Ours is the dream life and sleeping is what's real",
        "review_detailed_main": "Not a sad movie but attached to a larger more imposing sadness. It's a very watchable movie for me but for sad reasons. It is as though the movie serves as a constant reminder that failure is the most natural thing in the world. Like if you graph it, the line goes up for a bit and then it starts to go down and continues going down until the line is finished."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "WTH_MovieFan",
        "review_rating": "9",
        "review_title": "Ruh Roh, Scooby is Back!",
        "review_detailed_main": "Well I was excited about getting to see this film being a big fan of Scooby Doo. I liked the first one but it lacked alot of the Scooby elements, with this sequel, I felt like I was watching an actual Scooby Doo cartoon episode with them running around creepy mansions and a town with monsters on the loose. It was also wonderful getting to see some of their old villains come back and I really liked how they played that up. I agree with what was said in an early user's comment about it getting bad reviews because of the people who are reviewing it, they're basically looking for Oscar nominations not the fun side of things. I usually tend to enjoy the movies thatget bad reviews the most. I was proud of Sarah Michelle Gellar, she wasnt as annoying as she was in the first. One problem I would have to say I had with them film was there were too many sappy moments where they had to give each other pep talks and tell each other that they are worth something or they'll mope around feeling sorry for themselves, some if it is good to have but it seems they broke off from the action to include one of these scenes. As a whole, I really liked this movie and I was laughing more then I did in the first one."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "stefanantonie",
        "review_rating": "8",
        "review_title": "Better than the first movie!",
        "review_detailed_main": "Gotta admit, this sequel is good! It could've been better. 8/10 to me!"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "lea-1",
        "review_rating": "10",
        "review_title": "Mysteries and monsters, that's what Scooby Doo 2 is all about",
        "review_detailed_main": "I have just returned from having seen Scooby Doo 2: Monsters Unleashed in a packed theatre, not a single seat left empty. Families with kids from toddler to teen populated the dark interior. There were some moments during the movie when I cringed, expecting to hear the frightened shrieks of the younger, more sensitive members of the audience but was relieved to hear not one single cry, not even when the sound effects got loud, not even when I jumped a couple of times at the unexpected.\n\nThe quick (and correct) plot summary is: Mystery, Inc. has donated costumes to the Coolsonian Criminology Museum. These costumes were worn by the various schemers and crooks over the years that Mystery, Inc. has unmasked when solving assorted mysteries. Someone has devised a way of creating real monsters by using these costumes and a substance called randomonium and that same someone is determined to completely destroy Mystery, Inc. and Coolsville with these new monsters.\n\nThere were some really cool moments in this movie, the Pterodactyl ghost flying away with the Evil Masked Figure was pretty awesome, Shaggy and Scooby playing with chemical potions was very funny, Seth Green is very funny as the museum curator. There are the pre-requisite fart jokes but they are funnier than what was in the first Scooby Doo movie, the theatre laughed hard at one scene involving Miner 49er during his unfortunate encounter with Shaggy and a nervously gassy Scooby. In fact, most everything about Scooby Doo 2 is better, funnier, cleaner and smarter than the first one. There were a few scenes that felt a little clumsy, Fred being masculine, Daphne being Buffy-ish and Scooby dancing makes three. For some reason the Black Knight Ghost was given a lot of dialogue, unfortunately you can't understand a single word except his last sentence, which happens to be a bad pun. The other ghosts are mostly, and appropriately, monosyllabic, as were their cartoon forerunners.\n\nThe special effects are seamless right from the beginning, the Pterodactyl-eye view of Vancouver, BC as Coolsville is stunning. The shimmer effects with the ghosts is very cool, the bright and vibrant colors lend to the completely fantastical vision of this fantastically fictional place inhabited by the most normal looking oddballs one could imagine. This time around, Matthew Lillard, (there is no better Shaggy), gets to play more with Scooby. Linda Cardellini still has the Velma vibe going and Neil Fanning is the Scooby voice master. Sadly, Freddie Prinze, Jr. and Sarah Michelle Gellar still do not understand who Fred and Daphne are or what they are about. It's distracting to see preppie Fred turned into a valley/skaterboy and I do not remember Daphne being so vapid and self-involved. Peter Boyle makes a perfect Old Man Wickles, cranky and completely bothered by the very existence of Mystery, Inc., Tim Blake Nelson in his brief appearances as Jacobo looks completely crazed. Alicia Silverstone was adept as a TV reporter who apparently has a bit of a grudge against Daphne. That leaves the stars of this movie, the monsters, most of which are CGI and voiced by experienced voice actors in the usual cartoon manner, but four of the ghosts are actually humans inside elaborate costumes. They did an excellent job of acting through the layers of prosthetic makeup, costuming and physical absence of their CGI screen mates. The added effects of glowing randomonium and varying degrees of transparency combined with complete obedience to their leader, the Evil Masked Figure, made the danger to the inhabitants of Coolsville apparent.\n\nThe sets, costumes, music, sound effects, visual effects, it all works to transfer the small-screen cartoon to the big screen in live action. For Game Boy Advance players, stay until after the very last name in the credits has rolled to see what Scooby Doo has just for you."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "splundy61",
        "review_rating": "10",
        "review_title": "Better Than It Needs To Be!",
        "review_detailed_main": "This movie is so much better than it needs to be. What we have is a 90 minute episode of Scooby-Doo. Unlike it's dismal predecessor, this movie does a great job of capturing the look and feel of the original cartoon, while simultaneously bringing it into the real world. Be a kid at heart, relax & enjoy some zonked-out monster madness!"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "adamjohns-42575",
        "review_rating": "8",
        "review_title": "Rooby, Rooby Roo!",
        "review_detailed_main": "Scooby Doo 2: Monsters Unleashed (2004)-\n\nThe fact that Daphne is now a full on \"Part Buffy\" fighting ace is one of the best bits for me, because I always liked her and because we all knew that she could be kick-ass if she was given the chance.\n\nWhat is also great is that this sequel didn't try too hard to beat its predecessor and ultimately ruin itself.\n\nIt's a shame that other people didn't feel that way, because the second sequel was shelved (Later turned in to a cartoon).\n\nI could quite easily have watched dozens of Scooby-Doo films with this dynamic and awesome cast and more of the fun scripts that they were gifted in the first two though. Box office numbers be damned I say!\n\nOnce again all of the lead actors give performances that are true to character and I love the interactions that they have with the supporting cast too.\n\nThis time they face a whole host of spooks and have to prove themselves to be the cool dudes that they are as their reputation is put on the line.\n\nIt's got the same silly humour and camaraderie as the first and it would probably score as high as that one if it wasn't repeating some of the jokes (They still work though) and didn't cheapen it by bringing in Big Brovaz, a band that disappeared as quickly as they came.\n\nI'm sure I'll get stick from the 22 year old uber-fan nephew, but I'm not saying that it's bad at all. I love it and will watch it again and again.\n\n795.71/1000."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "bigben5",
        "review_rating": "10",
        "review_title": "It sucked... (SPOILERS)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "pvinodm-88300",
        "review_rating": "10",
        "review_title": "Hello the gang-hi daphne wendy others",
        "review_detailed_main": "Sometimes love thrills,mysteries ect-this is a lovely serial for me-like courage the cowardly dog-the cartoon version lovely."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "Unknown__",
        "review_rating": "10",
        "review_title": "Scooby Doo 3",
        "review_detailed_main": "Scooby Doo 3\n\nEven if people say that they should stop making movies like Scooby Doo they're wrong and they should make a Scooby Doo 3. The reasons are that movies like Spiderman 3 aren't that exciting. Whats the plot anyway? Also the first Scooby Doo was a big hit it made more that 50 million dollars. And Scooby Doo is a classic funny cartoon from the 90's.\n\nFreddie Prinze Jr, Sarah Michelle Gellar, Linda Cardellini , Matthew Lillard are great actors. I think if they ever make a Scooby Doo 3 they should be included. Freddie Prinze Jr {as Fred} makes a great Fred, although he was too acty. [rating on Freddie as Fred is 8.5] Sarah Michelle Gellar {as Daphne} acted great, except she pretty much acted the same as Buffy. [rating on Sarah as Daphne is 9.5] Linda Cardellini{as Velma} acted great![rating on Linda as Velma is 10]Matthew Lillard{as Shaggy} acted well, but I am sure the director could of found somebody much better.[rating on Matthew as Shaggy is 7.5]\n\nThe movies {Scooby Doo 1 and 2} were awesome. But Scooby Doo the movie didn't relate to the cartoon series but it was better than the second one. I rate it a 10. Scooby doo 2 pretty much was like the series and I liked it.But I think the perfect title should be Scooby Doo 2: Monsters United. I rate it a 9.5. All of the Scooby Doo Movies were cool and I especially think THERE SHOULD BE A SCOOBY-DOO 3 !!!"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "GOWBTW",
        "review_rating": "9",
        "review_title": "This is more fun than the first! REALLY CORNY!!!",
        "review_detailed_main": "Although Shaggy(Matthew Lillard), and Scooby hogged all the attention, this movie haven't lost its touch. Fred and Daphne(Freddy Prinze, Jr. and Sarah Michelle Gellar) were closer than the first. Velma(Linda Cardellini) was still the brains behind the group, yet the most insecure of the group as well. She seems to work well with Shag and Scoob rather than Fred and Daph. Shaggy and Scooby are always the cowardly of the group, yet they never realize how well they're good at finding clues that the others don't.\n\nThis movie is also more musical than it was in the first one. It was sure a howl when Scooby had on that afro. He was really FUNNY! Unfortunately, he really gave out that term \"wigging out\". Velma didn't lose her glasses that much in this movie. I think she is hot, with and without her glasses, and when i saw her with those leather pants and heels. She made a real stiff out of herself. I mean she was completely awkward.\n\nBattling most of the creatures past made a big difference in this sequel. And seeing the past criminals was also interesting as well. And all this time, the gang were tailing the wrong man throughout the movie, and Heather(Alicia Silverstone) was a shady character as well, trying to smear the Mystery Inc. gang. Shame on you! Although she was fake.\n\nThe music number was flawless, Ruben Studdard of \"American Idol\" do the old Earth, Wind,& Fire's \"Shining Star\" which everyone really put on a show. And I think it what makes this movie better than the first. I think its time to start bashing the critics about the movie, it's one of my favorite cartoons, and I'll enjoy it from time to time. But I hope there's no chance for a third one. If there is one, make sure no one hogs the screen light like Lillard did! Rating 2.5 out of 5 stars!"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "alexjaidane",
        "review_rating": "10",
        "review_title": "A cinematographic master piece",
        "review_detailed_main": "Scooby Doo 2 is well written, directed, edited and acted, the movie is a lot of fun and James Gunn makes a great character piece of the gang, the soul of Hanna Barbera's Scooby Doo is here and it's exploited to a maximum level, it's a cinematographic expirience that plays with tropes you know and it is better in every single way than the original"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "joshuadrake-39480",
        "review_rating": "9",
        "review_title": "Better than the first!",
        "review_detailed_main": "Now, I move on to the sequel to the 2002 film, SCOOBY-DOO 2: MONSTERS UNLEASHED.\n\nI mentioned in my previous film review for the first Scooby-Doo film that the film was negatively received by critics, but was a hit with audiences and made a profit of $275 million dollars against it's $84 million dollar budget.\n\nSCOOBY-DOO 2: MONSTERS UNLEASHED is the sequel to the first film once again directed by Raja Gosnell and written by James Gunn.\n\nThe plot shows the Mystery Inc. investigating the plans of a masked villain who wants to control the city of Coolsville using a machine to create monsters.\n\nUnlike the first film, this film featured several of the monsters from the television series, including the Black Knight, the 10, 000 Volt Ghost, the Pterodactyl Ghost, the Miner 49er and Chickenstein.\n\nThe story is amazing and I think the writer once again successfully translated this script into a film that I enjoyed. James Gunn did a really good job with the script and Raja Gosnell directed this movie brilliantly.\n\nThe visual effects, costume and production designs are really great, especially the way they created the monsters and it was really amazing and the CGI on the monsters and Scooby-Doo is just freaking awesome.\n\nMy favorite scene is when Daphne fights the Black Knight. That was really cool, especially for Sarah Michelle Gellar, who was on Buffy the Vampire Slayer during the filming of this movie.\n\nThe acting is just incredible. The returning cast are really amazing this time around, I just wish they kept the deleted scenes in this movie and the film is just really amazing and fantastic. The music by David Newman is once again amazing. The newcomers are Seth Green, the late Peter Boyle, Tim Blake Nelson and Alicia Silverstone and they done really great performances.\n\nThe special features is really amazing in this film. You have the deleted scenes, again with and without commentary, two music videos, how the visual effects creators made Scooby-Doo dance, an insider's tool of the making of this movie and the movie-making process with Scooby-Doo, a True Ghoul Hollywood Story, two games on this film and trailers for the other movies released by Warner Bros. include THE POLAR EXPRESS and HARRY POTTER AND THE PRISONER OF AZKABAN and I will review those.\n\nOverall, I give SCOOBY-DOO 2 a 9 out of 10, while the DVD's special features gets a 9 out of 10 as well."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "mabtilley",
        "review_rating": "9",
        "review_title": "great for kids",
        "review_detailed_main": "my sons are huge scooby fans, we must own every scooby-doo movie. we took them to the first movie and they loved it and laughed, when it came out on video we had to buy. when they heard that scooby-doo 2 was out they just had to see it. once again they laughed their heads off and after the movie my middle son asked if we could buy it. i personal thought it wasn't quite as good as the first but i enjoyed it very much. shaggy and scooby make this movie, if they were the only two in the movie it would still be number one. but when you add the other characters to the movie it's a great combination. if you want to take your kids to any movie this year, make sure it's this one. one thing i find as a plus is that there is no foul language, which is great for kids. so if your kids loved scooby-doo 1 they will adore scooby-doo 2. now when does it come out on video so my kids can watch it over and over again, until i'm sick to death of it."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "celestial_eve2001",
        "review_rating": "10",
        "review_title": "Even Better Than The First One",
        "review_detailed_main": "If you enjoyed the first one, then you'll love the second one even better!\n\nSarah Michelle Gellar fighting scenes are spectacular! Daphne can kick some major monster butt! I just love her!\n\nFred was okay. I like his new hair cut. Velma is hilarious! I Love the scenes with her and Patrick.\n\nAs for Shaggy, well where to start? This guy was also freaking hilarious. Matthew Lillard brings Shaggy into real life! His the most believable Scooby Doo character in the movie. His so gosh darn cute, and I swear I love that Shaggy voice. Oh and the part where Scooby and Shaggy ate some dangerous chemicals! Well I won't spoil you, but it was funny as heck.\n\nOverall this movie was fantastic! If you have a kid it's a must see! If you don't it's still a must see movie!"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "tbenton",
        "review_rating": "9",
        "review_title": "Better than the first one!",
        "review_detailed_main": "Having grown up watching the cartoon, I was disappointed in the original. But this is more like the cartoon and alot better than the first one. I mean, what do you expect? It's a live action cartoon, keep that in mind. This isn't suppose to be social commentary or a \"change the world for the better\" movie. It's about a group of Ghost busters and their dog. If you have kids and find the cartoon entertaining, then this is a great movie to see. If your looking for something other that just good entertainment then go watch something else. I was very disappointed in reviews that blasted the movie. This will be one movie I look forward to seeing again on DVD."
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "StatNo",
        "review_rating": "10",
        "review_title": "Good Show! I recommend...",
        "review_detailed_main": "Wow, I really enjoyed this movie. From the first scooby doo, I thought this second release wasn't going to be as great, but I was wrong. This is one of those movies that keep the views on thier feet. It was a great movie to bring my nephew too, he really enjoyed it as a kid. But I found myself enjoying something a little different, fun and entertaining. I didn't remember seeing Alicia Silverstone in the first one, but that could just be me. I think the cast was great too, they are all the uprising stars you see in movies here and there. Good show, something different and very fun! I'd recommend taking all the little ones or even for something different. Two thumbs up, nice work!"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "daryl_s",
        "review_rating": "8",
        "review_title": "Elements of interest to many groups",
        "review_detailed_main": "Some people may turn their noses up at this one. Another sequel designed to squeeze out another couple of dollars for the franchise. To a degree that may be true (hey, nothing wrong with making a buck!).\n\nThat said, this film still contains some items of interest. For the kids, great show, very funny and enjoyable. For those who grew up with the animated series, you will love it. Very true to the original cartoon series with a lot of the same type features and plot devices. For those who are a fan of the \"animated actor\" (I think we can start to use that phrase now to differentiate a character from just a special effect, I mean, what would the LOTR films be without the input of Golum) there are some great scenes of interaction.\n\nAnother thing to note is that this film is not simply a remake of the first film (as a lot of sequels are), this very much stands on it's own feet. However, I do think that this really should be the last feature film we see of the Scooby characters, I honestly don't think a third one will sustain the momentum that well.\n\nOverall - **1/2 stars"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "kitkat9",
        "review_rating": "8",
        "review_title": "So much better than the first (sorry) attempt...",
        "review_detailed_main": "I am a \"Scooby Doo\" fanatic!! No one was more excited about the live action version back in 2002 than me (although I was looking forward to a Scarborough-esque retelling when Mike Myers was still attached to the project (complete with a Barenaked Ladies cover of the second greatest theme song in television history!!)). I, a 30+ year-old woman, much to the chagrin and delight of my friends/work colleagues, even had a \"Scooby Doo\" countdown. I bought my nieces and friends (forced to accompany me to what was sure to be the film event of a generation) Scooby-Doo merchandise. Nothing could ruin this moment for me, until I actually saw the film! Needless to say that my utter disappointment in their first attempt (Shaggy is a vegetarian...hello what about all of those salami sandwiches he and Scooby ate in the cartoons!!) didn't put me in a state of readiness for the second offering but my love of that wacky Great Dane and the promise of the superb Seth Green did make me want to see Number 2...a little bit. Well, this time I was not disappointed! They actually got it right this time!! A tribute rather than a joke at the expensive of long time (and yes over 30!) fans and only one fart joke (and not a bad one at that!)! It was great to see all the old monsters creatively redone in CGI! The cast was excellent (ok, it's not Shakespeare but they did a great job with the fantastic, pure camp that they had and it was good, old-fashioned fun camp this time too!). And yes, Seth Green was amazing as ever (psycho, cute, and lovable all wrapped up in one neat little package!) So, go and see SD2, especially if you didn't like the first one. If you're anything like me (and heaven help you if you are!) you'll like it...a lot!!!"
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "LoneAssassin",
        "review_rating": "",
        "review_title": "Complete rubbish.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "phanatic1160",
        "review_rating": "",
        "review_title": "rather disappointing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "Punk19",
        "review_rating": "",
        "review_title": "Scoobies back",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "Loops2112",
        "review_rating": "",
        "review_title": "Big Improvement",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "twistedkites8705",
        "review_rating": "",
        "review_title": "Of course its for kids but people of all ages can get a kick out of it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "Shadowslayer",
        "review_rating": "",
        "review_title": "Superior sequel is highly enjoyable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "dettus",
        "review_rating": "",
        "review_title": "scooby and shaggy still separated from the gang?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "crumpetgirl",
        "review_rating": "",
        "review_title": "Worst. Film. Ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "Darth_Homer",
        "review_rating": "",
        "review_title": "Could've been so much better",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "thekennelman",
        "review_rating": "",
        "review_title": "Rooby Roo!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "Miroku2k6-1",
        "review_rating": "",
        "review_title": "Monsters Unleashed is a Kid's Scooby Doo Dream",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "Punk4eva",
        "review_rating": "",
        "review_title": "Second serving is better",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "ghd2005",
        "review_rating": "",
        "review_title": "A Return to the Roots",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "thats_sooperdooper",
        "review_rating": "",
        "review_title": "Pretty Damn Cool",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "mrscountrypig",
        "review_rating": "",
        "review_title": "This movie is wonderful!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "MuskratPower14",
        "review_rating": "",
        "review_title": "Excellent Movie with a great message",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "paulgeaf",
        "review_rating": "",
        "review_title": "Unworthy of being anything to do with the original 'scooby' we all know and loved",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "o_leal30",
        "review_rating": "",
        "review_title": "Good Movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "laura-davis-1",
        "review_rating": "",
        "review_title": "Amen for the Old School!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "skad13",
        "review_rating": "",
        "review_title": "The Doo returns",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "Showtime31PB",
        "review_rating": "",
        "review_title": "Monsters Unleashed 7/10 better than the original...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "merlinxi",
        "review_rating": "",
        "review_title": "Good Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "ultramatt2000-1",
        "review_rating": "",
        "review_title": "Wacky sequel.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "Michael_Elliott",
        "review_rating": "",
        "review_title": "It's a Bit Better Than the First",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "presumin_ed",
        "review_rating": "",
        "review_title": "Just Doo it (mini spoilers)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0331632",
        "movie_name": "Scooby-Doo 2: Monsters Unleashed",
        "movie_rating": "5.3",
        "review_username": "DarthBill",
        "review_rating": "",
        "review_title": "\"Who's your mommy?\"",
        "review_detailed_main": ""
    }
]