[
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "felicialv",
        "review_rating": "6",
        "review_title": "Not bad",
        "review_detailed_main": "Melissa McCarthy is hilarious... This movie is better than its rating. Yes there are things that would never happen and people gripe about that but this isn't a freaking documentary it's a comedy. It's supposed to be a bit ridiculous. It's a good movie if you want a laugh. I'm looking forward to the next one written by her and Ben Falcone."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "SnoopyStyle",
        "review_rating": "5",
        "review_title": "some good, some bad",
        "review_detailed_main": "Michelle Darnell (Melissa McCarthy) was rejected by adoptive parents many times and learned to not rely on families. She becomes a hard-nosed successful businesswoman. Darnell gets 5 months for insider trader after being outed by bitter ex Renault (Peter Dinklage). Her long-suffering assistant Claire Rawlings (Kristen Bell) finally quits. When she gets out of prison, she has nobody and nowhere to stay. She guilts Claire's daughter Rachel for a place to crash. She goes to Rachel's Dandelion meeting and decides to start the competing Darnell's Darlings to sell Claire's brownies. She convinces Claire to date Mike Beals (Tyler Labine) and quit her job under bad boss Dana Dandridge (Cecily Strong).\n\nSome of the jokes work well and some others are awkwardly bad. There are plenty of stupid pratfalls that aren't smart enough. Melissa needs to trim back those bad jokes that aren't working. She and husband Ben Falcone need help to sharpen up their material. The basic premise has good bones. They have the lovely Kristen Bell. The little girls are cute and the girl fight is hilarious. Melissa and Ben have a tendency to inject bad low-grade comedy in all the wrong places. This is better than some of their other comedies and this could have worked much better than this."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "bkrauser-81-311064",
        "review_rating": "6",
        "review_title": "These Brownies are Burnt",
        "review_detailed_main": "I really hate it when bad movies happen to good people. Despite bursting onto the entertainment scene with a killer supporting role in Bridesmaids (2011) and a star turn in Mike & Molly (2010- present), Melissa McCarthy has struggled to find material truly worthy of her talent. She's a reliable box office draw and can be trusted to perform exceptionally well with an assortment of interesting characters so why is she constantly being saddled with wafer-thin plots, broad and boring scripts and paint-by-numbers directorial choices? Is it pride; risk aversion; nepotism?\n\nThe Boss is the story of Michelle Darnell (McCarthy) a larger-than- life business tycoon, who looses it all for insider trading and is forced to start from the bottom once more. Armed only with a mega- maniacal ego and aided by her former assistant turned partner Claire (Bell), Darnell desperately tries to claw her way up to the top of Chicago's industry professionals. Undermining her at every turn however, are a multitude of former colleagues and competition who will stop at nothing to keep her at bay. Her most nefarious foe is Renault (Dinklage) a former lover whose obsession with Darnell is rivaled only by his obsession with the ways of the Samurai.\n\nMcCarthy (predictably) does a stellar job channeling her inner Trump. The story begins with Darnell as a young girl being dropped off a number of times by would-be adoptive parents which, while being a lazy setup does give the audience a reference point in which to pin our aspirations. McCarthy takes that baton and runs with it; fleshing out the broadly drawn character into one you could imagine exists in real life. You're never made privy as to why everyone hates her and abandons her (other than Renault) though I suppose one could gleam such insights by her unofficial motto \"Family is for suckers.\" Also despite once again being a lazy setup, the emotional payoff by the end isn't exactly deserved, but thanks to McCarthy's sensitivity she at least saves it from being offensively ham-fisted.\n\nOne can't help but think there was a much better comedy left on the cutting room floor here. There are extended moments of improvisation that go no where, and could have been sacrificed for the sake of filling in plot-lines that are dropped or disappear into the ether. One particular plot-line surreptitiously involves Kathy Bates as Darnell's former sensei Ida Marquette who despises her but we never find out why. You'd think with two very talented actresses a moment of catharsis could have been captured on film but instead we get five minutes of McCarthy and Cedric Yarbrough taunting Claire for being the smartest gal in the room.\n\nSpeaking of Kristen Bell; the former Veronica Mars (2004-2007) star plays a variation of the nagging, humorless, smarter-than-thou wife we've seen in hundreds in sitcoms and comedic vehicles. Her character is so irredeemably oppressive and boring that when Claire and Darnell have the third act falling out we all know is coming, I was less worried about what would happen to her than I was about why no one was standing in front of Chicago's Cloud Gate sculpture during the film's wistful montage. Her character arc completes itself with a budding romance with Mike (Labine) that was neither interesting nor convincing.\n\nYet despite all it's faults, the movie achieves what it set out to achieve, that is to say it makes it's audience laugh and laugh often. This is largely accomplished on the strength of bawdy R-rated humor and McCarthy's shrewd comic timing. Peter Dinklage, who gives a particularly daffy performance, has a lot of fun riffing, joking and tumbling with McCarthy, thus saving the film's third act contrivance from completely ruining the movie. The Boss is certainly not worth the price of admission unless you're already a fan of Melissa McCarthy. Yet for those already annoyed by her shenanigans, The Boss is just further confirmation that she's simply playing to the Plebes."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "darkness_visible",
        "review_rating": "",
        "review_title": "Much better than the IMDb rating suggests",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "lovenewyork-21166",
        "review_rating": "1",
        "review_title": "Do you have to be immoral to be funny????.",
        "review_detailed_main": "Melissa McCarthy stars in a senseless adult comedy movie. \"The Boss\" failed to entertain me from the start till the end.The comedy is too cheap and the obscenity in language and behavior did not make me laugh at all. Honestly,I thought I am watching a silly porn-like comedy movie.\n\nMelissa McCarthy portrays the role of Michelle Darnell, a shameless and a selfish businesswoman who does everything bad for the sake of her own arrogant welfare. Her wicked and reckless behavior led to her imprisonment of course.\n\nI am totally disappointed with this boring movie because its senseless vulgarity and the lack of comedy made of this film a total waste of time and a bad movie of the year 2016."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "shawnwu",
        "review_rating": "7",
        "review_title": "The Boss was laugh out loud hilarious, but also heartfelt.",
        "review_detailed_main": "Melissa McCarthy strikes again – this time at a rival troupe of juvenile sweets peddlers known as the Dandelions. The Boss was laugh out loud hilarious, but also heartfelt. The bizarre cast of characters in this film provided for some absurd and funny moments, but the best scenes were between Darnell and her newest protégé – the young Rachel, who quickly became like family to the money hungry Darnell. McCarthy always excels at physical comedy, but it was her character's confidence and quick wit that carried the film. Overall, I simply loved this film."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "nra-05473",
        "review_rating": "1",
        "review_title": "Please ... Don't Waste Your Time or Money!",
        "review_detailed_main": "I was ready for a fun, entertaining comedy and it failed at every level. Melissa and her hubby should not ever collaborate on a venture again, the writing and execution was forced which did not flow. We love Melissa, however she should have taken her concept to a professional writer. Peter Dinklage did not deliver which was completely surprising considering his career performance with Game of Thrones. For the most part he looked like he was in pain in all his scenes. I'm sorry to say, it is not even worth a future video rental. This is the first review I have written, I want to save you the pain! I wish I would have read reviews before spending my time and money. Let's wish Melissa a better script for any future movies, as this was a pure dud."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "kimmishy5",
        "review_rating": "7",
        "review_title": "Very funny",
        "review_detailed_main": "This movie is very funny. Love Melissa Mccarthy. She can play almost any role and she can dance."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "adrian-m-miller",
        "review_rating": "1",
        "review_title": "An unfunny Melissa McCarthy film? Yes, Sadly, It Is",
        "review_detailed_main": "What can i say but wait for her next one. There isn't a redeeming scene in this entire film.\n\nShe would have been better off leaving this for someone else and put all her efforts into reprising her role as Sookie in the Gilmore Girls remake (luckily she will be a bit player at least).\n\nThe script should never have gotten green lit, its atrocious.\n\nI don't have adequate words to express show truly awful this is.\n\nFrom the moment you see that over the top televangelist haircut, you should be forewarned that this is going to be truly terrible\n\nAvoid"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "Hellmant",
        "review_rating": "7",
        "review_title": "McCarthy is a very talented comedic performer!",
        "review_detailed_main": "'THE BOSS': Three and a Half Stars (Out of Five)\n\nSlapstick comedy flick, re-teaming actress Melissa McCarthy with writer/director Ben Falcone (her husband); the two previously performed the same duties on the 2014 hit comedy flick 'TAMMY'. McCarthy stars in the movie, and she also co-wrote the script; with Falcone and (actor turned first time screenwriter) Steve Mallory (who also played a small part in 'TAMMY'). The film costars Kristen Bell, Ella Anderson, Peter Dinklage, Tyler Labine and Kathy Bates (who also costarred in 'TAMMY'). It tells the story of a very successful businesswoman, named Michelle Darnell, who's imprisoned for insider trading, that tries to make a comeback by selling delicious brownies. Michelle Darnell is based on a character McCarthy previously created for the comedy troupe 'Groundlings'. The movie performed well at the Box Office (like all of McCarthy's films), but it also did poorly with critics (like almost all of McCarthy's movies). I liked it (like most of McCarthy's films).\n\nMichelle Darnell (McCarthy) was an extremely rich and powerful businesswoman; and then she was busted for insider trading. When she gets out of prison, 5 months later, none of her old business associates want anything to do with her anymore. Only Michelle's former dedicated assistant, Claire (Bell), will help her out. Claire lets Michelle stay with her, and her daughter Rachel (Anderson). At first the ex-con is extremely annoying, but then she learns to bond with Claire and Rachel; and when she learns how good Claire's home cooked brownies are, she gets an obsessive new business idea.\n\nI think McCarthy is a very talented comedic performer, and writer, and this character is brilliant. So the movie is definitely funny. It's a little hit-and-miss, but it's more hit than miss (I think). It's not hilarious, or an exceptionally well made film; but if your'e looking for laughs, it should deliver. Unless you're just not a fan of Melissa McCarthy, or her style of comedy (everyone has their own tastes), than this film probably isn't for you.\n\nWatch our movie review show 'MOVIE TALK' at: https://youtu.be/- KJTB5KGois"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "mjk-08559",
        "review_rating": "1",
        "review_title": "If they paid me, I would not watch this again.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "berttom-64515",
        "review_rating": "9",
        "review_title": "Funny and light-hearted",
        "review_detailed_main": "A funny light hearted comedy, the casting was well done, all complimented each other. The story plot even though far fetched, but remember it's a comedy, is entertaining. Worth seeing on cable. Melissa McCarthy is entertaining and the out-takes at the end are very funny. Better than other comedies out there."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "Jez-Jez-Jez",
        "review_rating": "7",
        "review_title": "The only review that matters",
        "review_detailed_main": "Im reading the reviews here and what I gathered was that people who gave this movie 1 / 2 / 3 are somehow disturbed with the fact that it is done by a married couple, it is starred by a full figured woman who is married to the director and that it has majority of women. When men slap and kick each other in the movies nobody bats an eye. I believe that if the child gets in the movie business the parents are quite well aware of the pros and cons and they study the lines with their kids so its not Melissa's fault there. Shes a writer not a priest. There is a \"just for gags\" program on TV. Its stupid as hell but it makes people laugh. It's a comedy for goodness sake not a tfue story. As for the reviewer who told us to watch his review on YouTube... I wouldn't watch it even if you can pay me. Its not possible to sit for more than an hour in the movie and give it 1. Its not an ebay product. You only give it a 1 if you stayed for 5 minutes and felt it wasnt for you. This is a great comedy. Well done. Having said that... there were few mistakes like when Michelle told Claire that she had a cellmate for the last six months when really she was arrested for 5 months.\n\nWhat's with these critics who tell people not to watch certain movies? What the hell is that? Make your own conclusions yes... but dont tell people not to watch the movie just because you hated it. That's what shows that it goes deeper than the movie. I call that hating..."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "patsworld",
        "review_rating": "1",
        "review_title": "Where Have All The Good Writers Gone???",
        "review_detailed_main": "And what one earth is wrong with Melissa McCarthy? She is beautiful, talented, funny\u0085.and yet she keeps making these foul, way too much sex pieces of trash. It's hard to figure out why. Do people in Hollywood think there are no more decent people out here wanting to see good, funny movies? Nobody left without the mouth or mind of a waste container? If so, they are wrong. The thing is, with this movie in particular, it could have been very funny. Good cast, fair premise, but instead we ended up with a film that was nothing much more than garbage. When a movie ends and everyone is just looking at each other with, \"What the heck did we just waste money on?\" looks on their faces, it's not good. Even worse, waiting for this one to come on, we were treated to a couple of coming attractions with pictures as bad, or worse. Foul language, as if the writers have completely lost any ability to write witty, clever dialogue, or dialogue at all that isn't merely four letter words, over the top sex that, frankly, is not interesting, is tiresome, and is so over- done. Who decides to spend money putting out money for this stuff? Nobody with any intelligence, I'm thinking. Too bad. You're cheating movie audiences, big time."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "hp-anzinger",
        "review_rating": "1",
        "review_title": "Comedy in movies getting worse and this film proves it",
        "review_detailed_main": "TV shows: Almost every year you see a new clever comedy show like Scrubs, Simpsons, Big Bang Theory, Southpark, Malcolm in the Middle, ... You don't have to like it, but at least acknowledge that it is very clever and well written.\n\nWith movies on the other side it's a different story. Here the trend is that it is getting worse and worse. We are almost at a point where we were in the 80's.\n\nThe problem: The movies make money and as long as this is happening we will see movies like \"The Boss\" in the future. Or another theory - I'm getting to old for this kind of movies."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "dacksonflux",
        "review_rating": "7",
        "review_title": "Viciously Vulgar",
        "review_detailed_main": "I used to be a girl scout, and I'm now a business woman. This has become quite the guilty pleasure.\n\nThere being a minimum, I'll give some further details. This is not a comedy for everyone. Children probably wouldn't be watching this. There is VERY strong language & there are sexual themes through out the movie. It's not subtle. It is vulgar.\n\nI would describe this movie's humor similar to that of \"Sausage Party\", being that if one is easily offended they most likely would not enjoy this movie.\n\nPersonally however, I think it's delightfully absurd, cheeky, & playfully cantankerous with just the right kind of trashy."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "xinfatale",
        "review_rating": "1",
        "review_title": "Terrible Waste of Time and Money",
        "review_detailed_main": "I can't believe I let my friend drag me into watching this .... atrocious film.\n\nThis movie relies on ugly, immoral jokes that demean and pigeonhole people into old fashioned stereotypes. Making fun of lesbians? Seriously who does that anymore?! Also, if the jokes are ugly and cheap to begin with, forcing child actors to say them doesn't make the jokes any prettier. Slang terms and vulgar words do not automatically equal humor. Far from it.\n\nAbsolutely tasteless.\n\nThe Boss lacked subtlety, and I found myself comparing Melissa McCarthy's role to Donald Trump, and not in a good way, mind you. There was nothing funny about the film---the violent attempt at slapstick humor failed. It was badly timed and came off rather flat. No one was likable except Peter Dinklage's role. Even then, he is shoved into a stereotype about funny midgets. What are we? 8 year old children? That was the last time I ever laughed simply because someone was shorter than average.\n\nThere is a way to mix violence/vulgarity to create a comedy (See Deadpool, Hot Fuzz, etc.), but The Boss definitely never even took off. Just pure failure.\n\nHated the film. I don't recommend wasting your brain cells on this."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "GoneWithTheTwins_com",
        "review_rating": "",
        "review_title": "The comic timing is disastrously unpolished.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "nogodnomasters",
        "review_rating": "6",
        "review_title": "Guilty as charged",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "professorscott",
        "review_rating": "1",
        "review_title": "Not for children - then don't put them in the film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "namashi_1",
        "review_rating": "6",
        "review_title": "A Fun Comedy!",
        "review_detailed_main": "'The Boss' is A Fun Comedy, that's pretty watchable, especially if you're a Melissa McCarthy fan. Its definitely flawed, but some of the jokes are right on.\n\n'The Boss' Synopsis: A titan of industry is sent to prison after she's caught insider trading. When she emerges ready to rebrand herself as America's latest sweetheart, not everyone she screwed over is so quick to forgive and forget.\n\n'The Boss' isn't clever, but what it is, is a lighthearted comedy. Sure, its verbose & not all is fun here, but McCarthy's spirited performance makes a lot of it work. Ben Falcone, McCarthy & Steve Mallory's Screenplay succeeds in making you laugh at times, but a funnier approach wouldn't have hurt. Ben Falcone's Direction, on the other-hand, is just about okay. Cinematography & Editing, too, are ordinary.\n\nPerformance-Wise: McCarthy is the life of the show. She's first-rate! Kristen Bell is endearing. Ella Anderson is cute. Peter Dinklage is hilariously over-the-top. Kathy Bates is adequate.\n\nOn the whole, 'The Boss' isn't without its share of laughs."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "dave-mcclain",
        "review_rating": "1",
        "review_title": "Another McCarthy-Falcone misfire.",
        "review_detailed_main": "Sometimes a filmmaker is simply too emotionally invested in a movie to see when it needs to be better than it's turning out to be. Of course, every filmmaker needs to be passionate about his/her cinematic endeavor, but there is such a thing as letting emotions get in the way of sound artistic judgment. It often happens when the same person both writes and directs a movie (his/her \"passion project\"), especially when also acting in the movie. Then, there's an even greater danger of things going wrong when these kinds of overlaps involve a married couple. It happened when Dax Shepard wrote, co-directed and starred in the pointless action-comedy \"Hit and Run\" (2012) which co-starred his real-life wife Kristen Bell. In 2014, another couple, Melissa McCarthy and Ben Falcone, took the practice of overlapping jobs and complicating it with marriage to another level by co-writing and co-starring in \"Tammy\" while Falcone also directed. That movie made money, but was poorly received by most critics and many Movie Fans as well. 2016 has the pair taking the same chance with the comedy \"The Boss\" (R, 1:39), which, ironically, co-stars Kristen Bell (but her husband is nowhere in sight). So, is \"The Boss\"\u0085 boss? Read on.\n\nMcCarthy stars as Michelle Darnell, a high-powered businesswoman and motivational speaker whose childhood (back and forth between an orphanage and foster care) taught her that the only person she can depend on is herself. She's self-centered, arrogant and basically amoral. Michelle generally uses and abuses her personal assistant, Claire (Bell), and Michelle's bodyguard isn't much more than her personal hype man. When Michelle is arrested for insider trading and sent to jail for five months, everyone abandons her, former lover and long-time business rival Renault (Peter Dinklage) buys her companies and the authorities freeze all of her remaining assets. Looks like someone has to start all over again.\n\nWhen Michelle is released from jail, she doesn't have anyone to call or anywhere to go, so she takes a taxi to Claire's apartment. When Claire gets home from her new job (where she works for a crazy Darnell disciple played by SNL's Cecily Strong), Claire's pre-teen daughter, Rachel (Ella Anderson), convinces her mom that they have to do something to help Michelle. Claire allows her former boss to stay in the apartment until she gets back on her feet, but Michelle's feet remain reclined on Claire's couch until Claire forces Michelle to do something to earn her keep. Michelle takes Rachel to her Dandelions meeting (think Girl Scouts) where the troop leader (Kristen Schaal) is discussing their cookie sales.\n\nMichelle gets an idea that her \"way back\" is to form a group called Darnell's Darlings which will teach girls business skills as they sell the unusually delicious brownies that Claire makes from an old family recipe. Michelle gets Claire to make the brownies and help with the troop and gets Rachel to help her recruit various tough girls and other misfits to join up and sell brownies for a percent of the profits. Michelle also approaches her estranged former mentor (Kathy Bates) for financing to help expand the business, but as all this is going on, Renault and his equally evil assistant (Timothy Simons) are keeping tabs on Michelle and her new business, hoping to increase the payback that he feels her still owes her.\n\n\"The Boss\" is mostly unoriginal, uninspired, unrealistic and unfunny. The clichéd plot lazily recycles the often used story of a main character who has been hardened by a tough life and doesn't know how to give or receive love. Falcone's direction randomly makes use of McCarthy's talent for physical comedy, but rarely gets her or the other actors to show us anything interesting or even very likable about their characters. Both the script and the acting give us characters who often change their tones and their attitudes toward other characters abruptly and with no clear reason why. We also see characters meeting for the first time, but acting like they already know each other, again without explanation.\n\nThere is also a lack of realism in the way the script portrays the fallout from Michelle's crimes, and her business dealings as the head of Darnell's Darlings, but this comedy's biggest flaw is its lack of\u0085 comedy. There are a few laughs to be found here and there, but the movie's other problems just kill the mood. Besides that, the movie's attempts at humor are overly dependent on cartoonish violence involving children, cursing around, by and at children, and vulgar sexual references which come off as more crude than funny. McCarthy herself has been much funnier in previous films and hopefully she'll be funnier again in her future projects. Sadly, her character in this film is one boss who should be fired herself. \"D+\""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "cosmo_tiger",
        "review_rating": "8",
        "review_title": "One of the funniest comedies I have seen in a while. I laughed out loud many many times watching this, and I watched by myself.",
        "review_detailed_main": "\"I don't need anyone. I'm going straight to the top.\" Michelle Darnell (McCarthy) has had a hard life. Living in and out of orphanages growing up hardened her and made her the woman she is today; one of the richest and most powerful women in the world, and former prison inmate. When she is released she has nothing and no one to turn to, except her former assistant Claire (Bell). Willing to accept her in for a few days but after Michelle takes Claire's daughter to her Girl Scout meeting everything changes. After watching the last few McCarthy movies I have said that she only has a few movies left before her humor starts to get played out. After watching this one I realize that I am wrong. She is as hilarious as ever in this one and is one of her best movies she has ever made. She really lets loose in this movie and says and does things that are different then her usual unsure of herself characters, and it works. There is something about her that is just so likable that even when she plays a character like this you can't help but laugh with, and not at. Overall, one of the funniest and smartest comedies I have seen in a while. I laughed out loud many many times watching this, and I watched by myself. McCarthy is a comic genius and I can't wait till her next movie. Watch this today, unless you offend easy. I easily give this an A\u0085a very very hilarious A."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "kr98664",
        "review_rating": "6",
        "review_title": "A Turtlenecked Good Time",
        "review_detailed_main": "Ah, where to start? Perhaps to mention the whole theater was in stitches most of the time? That's always a good sign, even if I missed some lines due to the noise of the laughter.\n\nOne quick thing to get out of the way: The plot was basically a vehicle to move from one funny scene to the next. There was something about a rich woman who lost everything and tries to get it all back, but that wasn't really important. This movie could have been just as much fun if it involved game show hosts or ballerinas, but the plot as written was fully passable. Remember folks, this was not a drama, but an actual comedy.\n\nIf hovering undecided over the button on Netflix, the best thing to ask yourself is if you've enjoyed other movies with Melissa McCarthy. She was an absolute scene stealer throughout this movie. She was unabashedly foul-mouthed and as politically incorrect as could be. Kristen Bell got to play the uptight, straight man (or person, in PC-speak).\n\nAnother sign of a good movie is I never checked my watch once. There even a few good sight gags, something sadly missing in so many high-brow flicks. I'll never look at a sofa bed the same way... It's been a couple of days since we saw this, and my wife and I are still chuckling over this one. It was quite the pleasant surprise.\n\nPay attention to Melissa McCarthy's costumes. She wears a turtleneck in every scene, even as a child. Some were quite over the top, practically covering her chin. This was a running sight gag throughout the movie. It had me chuckling, anticipating each new scene just to see how outlandish the next costume would be."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "RustyShacklefordd",
        "review_rating": "1",
        "review_title": "This Was a Bad Movie",
        "review_detailed_main": "This was a bad movie. The movie was not funny. It was boring. I didn't laugh once. The acting is not good. It was very disappointing. The plot was dull. The directing was bad. The story was unoriginal. The main character was unlikable and annoying. The jokes were bad. I should have gone to see Demolition or Hardcore Henry. I almost fell asleep. It was a big letdown. There was no moral. The story felt very outdated. It was worse than Batman V. Superman Dawn of Justice. It was so bad I couldn't believe it was real. It doesn't even deserve a star. It deserves a Razzie because it was so bad. Even my friend didn't like it. It needed better writing. Please do not see this movie. I did not like the movie."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "steven-leibson",
        "review_rating": "1",
        "review_title": "The Queen of Crass and Crude goes to the Nth Degree",
        "review_detailed_main": "Melissa McCarthy has made a deserved name for her crassness and crudeness. I found her raw humor in Bridesmaids and The Heat to be extremely entertaining. But this movie, which presents her as a businesswoman in the mold of Martha Stewart, does her a disservice. What set McCarthy apart in the movies where she shines is that she's the one being crass and crude, surrounded by more normal people who make her stand out. In this movie, everyone seems to be trying to be just as crass and crude, if not more so, including the numerous girls playing Girl-Scout-like cookie sellers who get into a street brawl over cookie-selling territory. Poorly written movie. Not funny. Despite that, the movie is doing well in the box office. It's hard to imagine the audiences for this. Too crude to take kids. Not enough adult humor for adults."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "rachaelblakeegypt",
        "review_rating": "",
        "review_title": "vulgar R rated jokes",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "nilufer-09026",
        "review_rating": "7",
        "review_title": "One of the better comedies out there",
        "review_detailed_main": "This movie is really good fun. It is so fictional, its ridiculous, BUT, with all the connotations involved, I think it really captures what it takes to be successful. A delicate balance between being a boss, and being kind. The two have never mixed well in real life. If you're looking for light hearted fun, with some very good slapstick humour well choreographed, I'd recommend this. If you don't laugh out loud atleast twice, I'd be surprised"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "amandalorent",
        "review_rating": "1",
        "review_title": "Yawn. A WHOLE hour in.",
        "review_detailed_main": "So dry. No humor whatsoever. Boring as heck. Sat through a full hour waiting for the story to pick up. Weak story line and even weaker comedy by the actors. So lame. So so so so so so lame. . MM is much better than this. Baffled as to how production companies picked this crap up. She can do so much better. . I don't understand why director would pan out after a lame joke to a shot of the city, and zoom in, this happened like 10 times. Why are these 'filler scenes' necessary, might it be because oh, there's no HUMOR? I was sorely disappointed to say the very least; even Kristen Bell disappointed me with her weak lines."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "zachglad",
        "review_rating": "7",
        "review_title": "Pretty Damn Funny",
        "review_detailed_main": "I don't understand the hate for this movie? It was funny. Like very funny. Yeah, the humor was a little stupid sometimes, but it told a decent story. The opening is hilarious, the main character is hilarious. The third act is a little stupid, but yeah it was supposed to be a little stupid.\n\nThis movie was tastefully vulgar and tastefully offensive. The slapstick and physical humor is a bit hit and miss and I could have used a little more of Melissa's character as opposed to Veronica Mars, but...\n\nI still liked it! It was funny! It was cheesy, but the cheese made sense and was established well!\n\nHonestly, why is there so much hate? I loved it. And its feminist themes are very well written and acted upon."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "autisticreviewers",
        "review_rating": "1",
        "review_title": "Autistic Reviewers Opinion Of This Movie.",
        "review_detailed_main": "Ben Falcone keeps proving to me that he is a horrible writer and a horrible director. There is nothing about this film that works. Read on to find out why: We have a female boss by the name of Michelle Darnell was placed under arrest for Insider Trading. She has just been released and wants to become something huge, something big and ready to become \"America's sweetheart.\" All the people she messed over aren't quite willing to forgive her. Very simple plot.\n\nMelissa Mccarthy is just plain horrible. We all know that her character is unlikable, but this was beyond a joke. In the movie world if you decide to create a very obnoxious, nasty, mean, and repulsive character...it can work...but the actor/actress playing this character needs to be able to bring something great to the table and by acting greatly and making you appreciate this horrible/unlikable character. Melissa Mccarthy does none of this, and therefor makes it completely outrageous and leaving you in total discomfort for a full 90 mins. Kristen Bell was horribly casted and was just pointless. Peter Dinklage was the only decent thing about this film, and he managed to give us a few chuckles. That's the sign of a good actor. But he's used as the stereotypical midget and we are laughing at his advantage. Again, it just didn't work.\n\nWomen and slapstick comedy - a mixture that fails abysmally. And this movie does just that. Nothing worked. It was a horrible combination. I will never watch this again. I disliked Tammy, but this one was even worse! It was just horrible. 1/5 stars. 1/10. Autistic Jay"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "EntertainmentBuff",
        "review_rating": "7",
        "review_title": "Pretty Funny",
        "review_detailed_main": "I liked the trailer and generally enjoy Melissa's movies along with my fiancé. Prior to going I read all the negative reviews and low score on IMDb so I went in expecting the worst, but was surprised it was funny.\n\nReading the negative reviews I kept seeing them talk about vulgar jokes in the movie which I can see as a problem, but the trailer had some of those same jokes. So what were these people expecting from the movie? The trailer sums it up perfectly. I honestly think most people are upset simply because of the vulgar language/jokes while there are children in the movie. Including some of those vulgar remarks are made by the children. So if you look at that as being bad, don't watch the movie. If you are a grown up that knows majority of children cuss away from their parents then you will probably enjoy it.\n\nYou can wait for it to come out, not a theater must, but worth seeing at some point."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "bodinehist",
        "review_rating": "2",
        "review_title": "Don't waste your time or your money.",
        "review_detailed_main": "I love Melissa McCarthy and Kristen Bell, but this movie was terrible. The plot was unfocused, the characters underdeveloped, and most of the the \"jokes\" crude and poorly timed. I left wondering who the target audience was supposed to be because I cannot picture anyone enjoying this film. With so much talent, it was painful to watch its lukewarm opening disintegrate into vulgar attempts at cheap laughs that never came. The whole thing just made me feel sad...and not in a good way. I hope Melissa McCarthy will continue to work on her writing because she clearly has a great sense of humor, but this film reflects poorly on her talent."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "info-34731",
        "review_rating": "10",
        "review_title": "Why the bad reviews?",
        "review_detailed_main": "I don't get the really bad reviews of this movie. The reviews don't even match the movie. There are references to too much sex, and a flat story. Maybe I got a different movie, but there isn't any nudity or sex. At best there is cursing.\n\nIt was a fun movie with an interesting story line. McCarthy is a funny actress that is able to convey a warm heart in her comedy even when the story line is trying to make her look mean.\n\nWhen I am doing system upgrades from home I put movies on in the background that are memorable for being full of constant dialog and this one is now in my list of movies that provide laughs while doing that 4am system upgrade."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "Lordknows262",
        "review_rating": "7",
        "review_title": "I enjoyed it for what it is.",
        "review_detailed_main": "I can't believe I didn't want to go see this after being let down by Trainwrek, but I went and watched it and loved this unapologetic film for adults, it was made for adults to forget your problems and laugh.\n\nThis movie relies on physical comedy, adult jokes, that shines in the same standard of Caddy Shack. Making fun of lesbians? Seriously who has the balls to do that anymore?! Right off the back you know not to take this COMEDY serious, if you go to forget the worlds problems and not bring them with you, its a good time, for adults.\n\nAbsolutely fantastic time.\n\nI found myself comparing Melissa McCarthy's role to Donald Trump, how is that not funny, in anyway the slapstick humor is what I expected from McCarthy. Peter Dinklage's role was funny, because its a comedy. I got the feeling that he was playing a person who just happened to be a small person.\n\nThere is mix violence/vulgarity, I seen as an up to date Laverne & Shirley, great cast too, on line with Deadpool, Hot Fuzz, etc.), but The Boss definitely is a great ride if you are there to laugh.\n\nI loved the film. I recommend it for a good time with friends."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "tylervirtual",
        "review_rating": "2",
        "review_title": "Melissa Mccarthy cannot write a script.",
        "review_detailed_main": "This film is a terrible misfire. Melissa Mccarthy has proved with this 2nd movie written by her that she cannot write a screenplay. She proved with Tammy and with The Boss that her talent is restricted to physical humor with her acting. The Boss is a lazy attempt at a comedy with plenty of horrendous jokes, bad characters, and a weird ass ending that feels totally out of place because of a fight scene. This entire movie is a mess and the only redemption is that a couple of jokes hit and that Michelle's (Melissa Mccarthy) story arch is that she need's to learn that family is everything this intertwines well with the other main character's story arch which is to find her own self worth. They have good character contrast but besides that everything else is crap. I made a video movie review on my Youtube Channel if you want to check that out. Here's a link. https://www.youtube.com/watch?v=Rc6WbzHHit8"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "PWNYCNY",
        "review_rating": "1",
        "review_title": "Women and slapstick comedy - a mixture that fails abysmally.",
        "review_detailed_main": "What is wrong with this movie? Actually, the question should be: what is not wrong with this movie? First, except for the final scenes, this movie is not funny. It mocks women and even worse, young girls. That is not funny. Second, the movie is poorly acted. Third, the movie experiments with gender role switching with poor results. Fourth, the principal player, Melissa McCarthy just is not funny. She is loud and obnoxious. Actually, it all comes down to this: gals acting like nasty wise-guys just does not work, at least not for this writer. Lucille Ball was funny, Joan Davis was funny, Jean Stapleton was funny, Irene Ryan was funny, Rosalind Russell was funny, Gracie Allen was funny, Shelly Long is funny, Barbra Streisand is funny, Melissa McCarthy is not funny. Women punching each other in the face is not funny. Young girls brawling is not funny. What's worse, the movie early on establishes that McCarthy's character, the Boss, is a rotten person and shows it. She generates no empathy. She does stuff that is really hurtful and nasty. The one strong male character in this movie, played by a midget who actually is funny, despises the Boss and with good reason: she used him to get a promotion and then dumped him. Throughout the story she is the cause of all the interpersonal conflicts. In fact, she is intensely disliked, and with good reason: the character is repulsive. She is pushy, a hustler, loud, obnoxious, aggressive, and physically unattractive. That alone would not necessarily render her humorless. The problem is that she has no redeeming qualities to make her lovable. She's not warm, endearing, sensitive or even misunderstood by others. Her abrasive personality is as transparent as clear glass. She is not the victim; she is the perpetrator. And that is not funny. What's next: a female version of The Three Stooges (Mai, Lara and Coochie)? Or what about a movie featuring a female version of Harold Lloyd? Or what about a movie about a female Sad Sack (Sadie Sack?) Or what about an all-female version of Gomer Pyle, USMC? (Scene: affable but slow-witted Gina Pyle is berated by her hysterical sergeant, Violet Carter). Or what about an updated version of All in the Family with Archie transformed into Alma, Edith into Alma's clueless husband Eddie, Gloria into Alma's hysterical son Glen and Mike into Alma's obnoxious daughter-in-law Midge? The rip-off possibilities are endless. Anything for a laugh, right?"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "michelle_kummer",
        "review_rating": "",
        "review_title": "Rubbish again!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "stevendbeard",
        "review_rating": "6",
        "review_title": "Good Showcase For Melissa/Flimsy Story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "essential-23126",
        "review_rating": "2",
        "review_title": "Good first 5 minutes, downhill from there",
        "review_detailed_main": "I was looking forward to seeing Melissa McCarthy having never seen any of her movies and she is known for her comedic skill. Sadly I was very disappointed with the film but must agree that Ms McCarthy certainly has talent. Sadly this film did not enhance her talent in any way. Her skills were spoiled by the constant references to female anatomy and mostly shouting insults with bad language. I was saddened to see a script that to me downgrades women which is not at all funny. I must be honest and admit I did not stay to see the whole film so there may have been an improvement further on which I missed as I left the cinema. This experience has discouraged any further viewing of Ms McCarthy's work which is a pity. This film had all the makings of good entertainment and would be more successful if the language was cleaned up. However, perhaps I am old-fashioned!"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "rembert-schofield",
        "review_rating": "7",
        "review_title": "Awesome--funny movie",
        "review_detailed_main": "Look, this movie is not intended to be an Oscar contender. It is a funny movie. Go see the movie with the attitude to have fun. If you go to the movie after a very hard day and you have no idea how to relax and have fun, you will hate the movie. But then again, you will hate any movie.\n\nThe characters made us laugh, real hard. A few serious scenes (almost a tear drop). The actors did their job. Loved Peter-too funny. If you stay through the credits, you will see the bloopers--too funny.\n\nThe only negative with the movie was the length--it did seem to go by rather quick. But all in all, ignore the critics and if you want a movie where you don't need to \"think\" and you want a mindless funny movie--get a ticket and go have a good laugh."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "ferguson-6",
        "review_rating": "3",
        "review_title": "Market Crash",
        "review_detailed_main": "Greetings again from the darkness. Movie profanity and crude humor are best used selectively, and certainly not as a comedy crutch. Melissa McCarthy has not built her career on subtlety, but even for her standards, this latest comes across as a lazy effort with missed opportunities for both laughs and a message.\n\nMs. McCarthy re-teams with those responsible for Tammy (2014), including her husband writer/director Ben Falcone and co-writer Steve Mallory. Here she plays Michelle Darnell, an egotistical hyped-up business tycoon with no sense of integrity or humanity \u0085 constantly wearing an odd turtleneck. Somehow the filmmakers thought it a good idea to explain this lack of soul showing a young Michelle being continually \"returned\" to her orphanage (run by a nun played by Margo Martindale).\n\nWhen Michelle's business rival (and former business associate and former lover) Renault/Ron (Peter Dinklage) turns her into the SEC for insider trading, the correlations with Martha Stewart become impossible to ignore. There is even an acknowledgment of this by McCarthy's character. Once released from white collar prison, Michelle hits rock bottom and ends up sleeping on her former assistant's sofa. Kristen Bell is Claire, the assistant that Michelle once dumped on and now crashes with. Ms. Bell is mostly relegated to \"straight man\" to McCarthy's string of lame punchlines.\n\nIn the spirit of exaggeration in lieu of creativity, three scenes in particular stand out: the street fight between rival scout troops, a ridiculous breast grope-off with McCarthy and Bell, and a clumsily staged sword fight between McCarthy and Dinklage. The missed opportunity to have a point about girls in business, and stooping to schmaltz with the Michelle family story are every bit as disappointing as the mostly unfunny and constant use of profanity-laced insults. Saying \"suck his d***\"over and over in one scene does not make it funny \u0085 in fact, it's a bit sad.\n\nExacerbating the frustration is the misuse and underuse of such talents as Cecily Strong, Kristen Schaal, Tyler Labine, and Kathy Bates. Ella Anderson as Claire's daughter does come across as a real kid, and she's part of the best scenes in the movie. Somehow a movie that (finally) calls out the Girl Scouts on their unfair-to-girls business model, manages to disappoint on every other front."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "Eddie_weinbauer",
        "review_rating": "2",
        "review_title": "if you've seen the trailer,than you caught all the fun parts",
        "review_detailed_main": "you also have seen most of the scenes that are funny. How this got green lighted I have no idea,but it's far from a barrel of laughs. The biggest laugh I had,was when the two girl scout groups clash in the middle of the street,in a down right raw street brawl. But that was also the most funny scene .The rest were short and boring scenes that you slightly snickered over and that was it.\n\nBut if you have seen the trailer,you have also just witnessed all the funny moments in the film. Kristen bell's is mostly overshadowed by Melissa,to the point where you really start wondering what is her purpose in the film, aside from being the mother to one of the girl scout kids,she has very little to do in this movie"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "ona02015",
        "review_rating": "8",
        "review_title": "Another hilarious McCarthy offering!",
        "review_detailed_main": "The Boss is another vehicle to demonstrate Melissa McCarthy's comedic talent and flair which cemented her win as MTV Movie Award's first ever female winner for the Comedic Genius Award earlier this year, managing to bring some of the scripts duller moments to life while managing to make the genuinely hilarious moments even bigger and better than expected. Without her, I cannot help but think the film would collapse around her, but her involvement (matched with the character and supporting cast) make the film a success. I struggle to comprehend the negative reviews for this film, as it is nothing but enjoyable from start to finish. A success that should tide McCarthy over until Ghostbusters, in just a few weeks...\n\nSummary: Melissa McCarthy is absolutely The Boss, adding another notch to her belt of impressive comedy and hilarious characters, registering in the higher end of her filmography, despite what reviewers would make you believe.\n\nI truly do not understand the hate that this filming is attracting. It's pretty damn hilarious if you ask me.\n\nFULL REVIEW: http://goo.gl/03vrSb"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "maartenroegiers",
        "review_rating": "6",
        "review_title": "Funny",
        "review_detailed_main": "The story is very easy to digest. Melissa McCarthy plays a businesswoman (Michelle) that was put in jail for crimes. Michelle gets back up and is able to lead a group of children to sell brownies together with her former assistant. Dealing with some personal issues she decides to sell their products to a rival/lover Ronald. Eventually they start to duel for the company with 'katana's'."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "tavm",
        "review_rating": "4",
        "review_title": "The Boss was a partially okay time-waster and that's it",
        "review_detailed_main": "This is the second of Melissa McCarthy's movies I've seen that she also partly wrote and like Tammy, this seems to try to be both a comedy and somewhat of a drama with it not succeeding too much in either. There are some somewhat amusing scenes concerning certain body parts or even mentioning such parts. Ms. McCarthy plays a woman who was mostly raised in an orphanage who grows to be a very powerful woman until...well, if you're really curious, watch the movie. Otherwise, I wouldn't recommend it. She and Kristen Bell seem to have some good chemistry though not enough for me to highly recommend this. Peter Dinklage also was a little amusing. What I'm saying it, The Boss isn't great or even pretty good. It was just meh for me..."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "merril444",
        "review_rating": "2",
        "review_title": "Oh dear, so not good!",
        "review_detailed_main": "I wanted to like this movie, as I really like Melissa McCarthy but sadly this was a total waste of my time. I actually enjoyed the bloopers during the credits much more than the movie itself because they at least made me laugh a couple of times.\n\nThe plot is unbelievable, ridiculous and not very funny. Melissa co-wrote it, which is unfortunate as I expected better from her. Melissa plays an emotionally corrupt, mouthy, brash business woman with few morals. The rest of the supporting cast are simply over-the-top stereotypes. I'm surprised that Kathy Bates, Peter Dinklage and Kristen Bell accepted this movie, as surely they must have read the script first? This is not clever writing. Save your money for more worthy film."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "samgiannn",
        "review_rating": "",
        "review_title": "The Boss (2016)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "redmondgarmony",
        "review_rating": "7",
        "review_title": "Girl Power",
        "review_detailed_main": "Can't really remember any males in the film, there were some, but hey This is a real empowerment film.\n\nHilarious, so many site gags, a few low points like the street fight between the girl gangs, but it's all about symbolism.\n\nGlad I stumbled upon it. Laughed, crinkled my brow, really happy to have seen it.\n\nNot sure why I have to write 600 characters, but I am DB requires it. I'm pretty sure I encapsulated how positive the film is in the first 300 characters, but hey, I will go on. It's a good film. Watch it.\n\nApparently I'm still 84 characters short. Hopefully this does it? Sixteen more...."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "RforFilm",
        "review_rating": "3",
        "review_title": "The Boss is a mostly unfunny cliché of foul jokes and predictable scouting story lines. This box of cookies is not worth buying!",
        "review_detailed_main": "A story cliché that's often used for comedies, especially family comedies, are the ones where an adult is thrown in to the world of a child's, sometimes by choice or by accident, and try to benefit from that. There is a lot of comedic potential from this kind of fish-out-of-water scenario, considering if their character is out of their element or if the children know more about the subject that the main character is about to face. Movies like Bushwacked, Troop Beverly Hills and even Ernest Goes to Camp not only uses this story element, but also throws in the theme of camping or scouting.\n\nThis also has comedic potential (even if the previous examples aren't good ones), as the idea of scouting is often the first time children get the chance to become adults while retaining innocence, and yet the adult in question would be getting a dose of how much harder it can be to return to such a carefree time. One element that turns girls into women is when their tasked to selling cookies for their troop. Rather then tackle this idea as a family film, The Boss goes for a full, hard R rated comedy the tries to push how bad a person can be.\n\nMichelle Darnell (played by Melissa McCarthy) is a successful businesswoman (I don't think were told exactly what it is she made or did) who prides herself through expensive self-help seminars and daily richly living. She cares little for anyone, even her never sleeping assistant Clair Rawlins (played by Kristen Bell). One day, Michelle's business enemy, a Japanese culture loving Renault (played by Peter Dinklage), exposes her insider trading, which puts her in prison for five months, along with her property seized by the government and her bank accounts frozen, putting back at square one.\n\nWith no place to go and no one willing to work with her, she shows up at the front door of Claire, who lives with her young daughter Rachel, and has taken a new job. She lets Michelle stay with them, but forces her to help out, including taking Rachel to her scouting meeting. It's here where she discovers that the girl's troop sells a high amount of cookies. It's here where she's inspired to make a brand new scouting troop that sells brownies that are cooked by Claire and twenty percent of the profits go back to the girls.\n\nWhile I wouldn't call Melissa McCarthy a comedic genius, but you'd think a talent like her would have had a lot more to offer for The Boss. Directed by McCarthy's husband Ben Falcone (who also directed the really bad Tammy), much of The Boss rides on how foul she can be in front of children. This wouldn't be a bad thing, but like how Tammy attempted to put in some unneeded drama, this also tries to sneak in some schmaltzy material about the importance of family and such. That's not going to work as this is supposed to be an R rated story for adults and not for kids.\n\nMaking an R rated movie around something that's supposed to be child friendly is a extremely tough sell and this movie justifies why something like The Boss shouldn't be pursued without an intelligent script. As is, I laughed a few times, but mostly by how insane McCarthy can be with her character. Both Kristen Bell and Peter Dinklage try their best, but the material gives them little to work with, and their stuck telling predictable jokes with a predictable story.\n\nI'll give this three boxes of cookies out of ten. The Boss is a mostly forgettable comedy that we can toss into the bargain bin that will probably satisfy those that want cheap laughs. I hope McCarthy can show a lot more creative idea with her upcoming Ghostbusters movie. I know she's capable of a ton of laughs (no pun on her weight)."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "narathip_87",
        "review_rating": "6",
        "review_title": "Melissa McCarthy works overtime to keep an uneven comedy humming.",
        "review_detailed_main": "A film that is both funny and works to McCarthy's strengths. It is a little over the top at times (and a little more \"adult\" than you might expect) but it's definitely a film that will make you laugh out loud."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "burlesonjesse5",
        "review_rating": "3",
        "review_title": "VIEWS ON FILM review of The Boss",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "Majikat76",
        "review_rating": "6",
        "review_title": "Not the best!",
        "review_detailed_main": "There comes a point when Mellissa McCarthy is Mellissa McCarthy in films! I think we've had the best from he and the little bits of shock value in a film with so many kids, was slightly cringeworthy.\n\nIt's not without it's funny moments and it is watchable with a few giggles"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "awakethenorth",
        "review_rating": "4",
        "review_title": "Fun, Amusing, Overall A Bad Movie",
        "review_detailed_main": "\"The Boss\" starts with a bang, which just slowly seems to die out into an attempted feel-good movie.\n\nPeter Dinklage, playing Renauldo does a great job as the simple minded, ex-lover and obsessive character.\n\nMelissa McCarthy is at most a mediocre actress with very little talent, and seems to only get by with her swearing and bluntness in movies.\n\nKristen Bell alongside Peter Dinklage are the only redeeming qualities in this film.\n\nThe Boss had a good idea to it, just poor choice of casting for the main role, and poorly executed plot."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "weebitkrazy",
        "review_rating": "8",
        "review_title": "Really not that bad",
        "review_detailed_main": "If you like Melissa McCarthy, you will like this silly movie. Silly is the operative word here. Not meant to be realistic or dramatic. I enjoyed the performances of lighthearted comedy. Parts are a bit aggressive but not violent. Silly climax, silly plot, silly movie. I didn't love it but I liked it a lot!"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "monstermayhem32",
        "review_rating": "7",
        "review_title": "comedy gold",
        "review_detailed_main": "In this film, Melissa McCarthy plays Michelle Darnell who didn't really have a family and was bounced around from one foster home to another decides to depend on herself and make herself a business woman who becomes rich and helps others gain money. Things go downhill for Michelle when she is accused of insider trading and framed by an old lover of hers who wanted revenge against her over a promotion years earlier wanting payback. Broke and penniless, Michelle ends up staying with her former assistant Claire and her daughter Rachel. However Michelle decides to start anew and start a new business making brownies and helping out fellow girl scouts. I will say while it is not the best of Melissa Mccarthy's works but I do feel that she does entertain and make people laugh. Kristen Bell is quite hilarious as a comedian."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "Quietb-1",
        "review_rating": "3",
        "review_title": "Misses most of the time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "jtindahouse",
        "review_rating": "3",
        "review_title": "An absolute mess",
        "review_detailed_main": "Let me start by saying something very bluntly - Melissa McCarthy and her husband Ben Falcone need to stop writing movies. They are tarnishing McCarthy's career. Ever since her Oscar-nominated performance in 'Bridesmaids' McCarthy has been hot property in Hollywood. Yet nearly everything she has starred in since has been an abysmal movie (with the exception of 'Spy'). If things continue this way for much longer she will no longer be hot property and her career will likely fall by the wayside. So to be entrusting the writing of her scripts, at the peak of her career, to herself and her husband (who have never written before) is nothing short of insane. They first gave it a go in 2014 with 'Tammy' and the general consensus was that it was pretty bad, and yet here they are again two years later with 'The Boss', and I can confirm without a shadow of a doubt, it's really bad.\n\nThe first thing that comes to mind as being a major issue is the story. Selling cookies and battling a rival group? This wouldn't even pass for an episode of a sitcom. I know what you're thinking though, if the characters are strong enough the story shouldn't matter too much. Let me assure you this is far from the case. The characters are dreadful. Almost every one of them in the film is completely unrealistic and over the top, and yet at the same time incredibly boring. The jokes are amateurish and would struggle to make in immature five-year-old laugh most of the time. The film also uses the same jokes over and over, at one point even twice in a row within the space of a couple of minutes. If McCarthy really does have the comedic talent to carry Hollywood films (which I'm starting to doubt truth be told) she needs to find a very fine set of writers to write a script that plays to her strengths. And she needs to find them fast."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "RLTerry1",
        "review_rating": "",
        "review_title": "A truly diversified portfolio of comedic stock!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "astha10024",
        "review_rating": "7",
        "review_title": "Watchable. An okay movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "Screen_Blitz",
        "review_rating": "5",
        "review_title": "Melissa McCarthy steals the show by only a short shot",
        "review_detailed_main": "Melissa McCarthy has had plenty of ups and downs in her career. It seems in recent years she has gone back and forth from landing in hilarious roles to disappointing roles, her last major role being the action comedy 'Spy' from last year. She has often stolen the show in films directed by Paul Feig, 'Bridesmaids' and 'The Heat' to be more specific, but seems to slop in other roles. This film marks her second collaboration with her husband director Ben Falcone, the man behind the critically hammered 'Tammy' which starred McCarthy as the titular character. In this film, McCarthy plays Michelle Darnell, a chairwoman of a billion dollar company with her best friend Claire (played by Kristen Bell), a single mother of a pre-teen daughter Rachael (played by Ella Anderson), working by her side. In the process, she's made enemies with her former lover Renault (played by Peter Dinklage) after taking his position as manager, and he has vowed revenge against her ever since. After a botched interview with a television personality, Michelle is arrest for insider trading and sent to prison for six months. Upon release, Michelle stuck on the streets with her assets wiped clean, her home on foreclosure, and with nobody to turn to but Claire and her daughter who move her into their house in attempt to get her back on her feet.\n\nFor the past several years, McCarthey has proved her gift of comedic talent, and this movie does not fail to show it, but she certainly doesn't embrace her full potential in her smart-mouthed role here. What good does she bring to this movie exactly? Well, she doesn't fail bring on some occasional laughter enough to distract you from the thinly written script, and her comedic chemistry with Kristen Bell works, but the jokes don't always hit home. McCarthy tries desperately on bringing out laughter through her shamelessly vulgar dialogue, some of which in the presence of elementary school-aged Ella Anderson. In some scenes, the jokes work, and leave a fair number of people in my theater laughing. In other scenes, they tend to come off as bold and mean-spirited, or otherwise rather forced. A lot of it begins when her character volunteers for Kristen Bell's daughter's Girl Scout. As shown in the trailer, one scene features a violent street brawl between dozens of young-aged girls, a scene where we sit through little children engage in slow motion fist fights, throw each other against cars, karate kick each other in the face, etc. Apparently we are supposed to believe this is funny when it really just comes off as cruel and makes you feel guilty for laughing, if you happen to do so. As the most of the fun and hilarity take place during the first hour, the film completely drops the ball during the second hour and laughs come to a halt. That is when Peter Dinklage begins consuming some major screen time. This actor is shown to have comedic potential, but sadly it doesn't work. The jokes he shoots out never land and his comedic chemistry with McCarthy falls completely flat.\n\nThe biggest accolade The Boss manages to achieve is being slightly funnier and more fun to watch director Ben Falcone's previous film 'Tammy'. Overall, this definitely doesn't sit on the ladder of Melissa McCarthy's best works, not even close. She and Kristen Bell manage to steal the show here, but only by a short shot. This is comedy that will please mostly fans of Melissa McCarthy, but leave others with a cold shoulder."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "rgkarim",
        "review_rating": "6",
        "review_title": "Mediocre Melissa Film That Lacks Quality Writing",
        "review_detailed_main": "Another beautiful day another reason to head back into the theater. Hi I'm Robbie Karim and that despicable display of comedy is my attempt at a funny opening for my latest review. Today we look at the latest production starring Melissa McCarthy called the Boss, a film that looks promising for a quick laugh. However, does this movie shine in terms of quality or is it another mediocre media designed to net our money? Let's get this review started then and see if we can answer that question.\n\nTHE GOOD: \u0095 Very funny moments \u0095 Cute moral built into the movie \u0095 Fairly Fast pace \u0095 McCarthy's acting\n\nThe Boss is certainly a humorous film that uses a lot of McCarthy's old tricks that we've become accustomed to. McCarthy herself bears most of the comedic weight using her delivery as the main punch to get you laughing. She's loud, drawn out, and she has the sass that I can't help but chuckle at every now and then. Kristen Bell and Ella Anderson assisted with keeping the film fun in two ways. The first, and major contribution was being the medium for McCarthy to bounce her jokes off, where they acted as props to react and keep the rants going. And the second contribution was bringing the cute, life lessons that every comedy film seems to need. In the Boss' case, that moral is family and these three actresses do make a fun, interesting family to watch. This dynamic keeps the plot going and thanks to some decent editing helps avoid some longwinded and slow plots that Hollywood likes to waste our time with.\n\nTHE BAD: \u0095 A lot of scenes already shown in the trailers \u0095 Some comedic scene went on too long \u0095 Not the most unique or original film \u0095 Too much obsession with genitalia and sex\n\nNo surprise that the trailers give a lot of comedy away and the Boss is another victim of this trend. You will catch a lot of the more unique moments on the commercials, which depending on how much TV you watch, can dilute the comedic punch it was intended to bring. Fortunately there were still golden nuggets still buried in the movie, but even these weren't as funny as some of the other things that have come out of McCarthy's films. The problem was these jokes weren't that original, easily blending in with the sea of Melissa McCarthy jokes that we've seen. In addition, the scenes not shown in the commercials centered very heavily on sex, which seems to be the only medium they think audiences like. The Boss doesn't even try to put cleverness behind their dialogue, instead relying on the delivery and a low comedy threshold to carry their writing. If relentless vulgarity is your bread and butter, this is the movie for you, but for me well it got old after a while, especially when you see as many films as I do. I can't deny I laughed at a few dirty moments, but some scenes where they bantered on and on crossed over the stupid line.\n\nThe Final Verdict: The Boss is a fun film that takes its place in the mediocre works meant to kill time. However it certainly isn't the greatest of Melissa McCarthy's works and the lack of originality, wit, or even balance are the components that weaken this film. But it still feels like a Melissa McCarthy film and those who are extreme fans of this movie will laugh their heads off regardless of the stale tactics and lazier writing. Regardless I can't recommend this one for a trip to the theater, but then again I'm just a reviewer and can only share my opinions. Again this is a fun Melissa McCarthy movie and will most likely crack everyone up, I'm just not the biggest fan of sexual humor and I see more movies and trailers that really dilute humor for me.\n\nMy scores are:\n\nComedy: 6.5 Movie Overall: 6.0"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "adib-32829",
        "review_rating": "1",
        "review_title": "Disappointing",
        "review_detailed_main": "I put my hopes too high for this movie but this was totally disappointing for me.\n\nWouldn't recommend any one to watch, totally boring.\n\nI'm sure everyone expected this movie to be funny like we used to see in all Melissa McCarthy movies but that all came out wrong.\n\nIMDb expect us to write minimum 10 lines review but I really can't find words to say well the story is fine however the movie scenes were boring in most of it.\n\nNot to forget to add that I didn't see any famous actors in this movie, some actors can really add a nice flavor no matter how boring it is but that I didn't find here"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "tobimmeyer",
        "review_rating": "6",
        "review_title": "Not too bad, but I have seen better from these actresses and actors.",
        "review_detailed_main": "It's worth watching. It's stupid funny. I would probably watch it again."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "Brevin_Campbell",
        "review_rating": "3",
        "review_title": "A disappointment",
        "review_detailed_main": "This movie is known to have beat Batman v Superman on its third weekend just narrowly overtaking it. But we know that like BvS the Boss was also canned by critics as a god awful movie that doesn't deserve the light of day.The Boss is another film that was hated by critics as well and told to go away as Melissa McCarthy had fallen from grace once again in another poorly done comedy.\n\nThe film does have some shining moments though. The whole battle between the rival kids was awesome to see as they kept throwing down against each other along with the scene with them shooting at one another as well with paint ball guns too was also great, but a few great scenes can't make up for a terrible film.\n\nThe jokes just don't land at all. The whole movie is boring to watch. A Melissa McCarthy is kind of being a big douche bag through all of it and it just doesn't work.\n\nThis is a bad film that no one should see."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "jenrussell-108-412119",
        "review_rating": "8",
        "review_title": "Enjoyable film that doesn't go on for too long!",
        "review_detailed_main": "I've just finished watching this and really enjoyed it. I was looking for a film that wouldn't go on for too long and that would'nt need me to engage my brain and that's exactly what I got. It was funny, sweet, mostly predictable and much better than I was expecting. I thought Melissa McCarthy was great in it and that she and Kristen Bell had great chemistry.\n\nDefinitely worth a watch if you're just looking for a funny, lighthearted film!"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "dcarsonhagy",
        "review_rating": "6",
        "review_title": "The Boss",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "anaconda-40658",
        "review_rating": "4",
        "review_title": "This Film Needed a Boss.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "swilliky",
        "review_rating": "5",
        "review_title": "McCarthy carries the film to make it pretty funny",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "Gordon-11",
        "review_rating": "",
        "review_title": "Very forgettable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "tin-B",
        "review_rating": "6",
        "review_title": "Some good laughs",
        "review_detailed_main": "It's a funny movie, although it's not for everyone. If you are too sensitive to adult humor ... which most of the reviewers ARE, then don't watch it.\n\nIf you are too sensitive to laugh at a few lesbian jokes... then don't watch it. Personally, i myself think it's a huge lesbian joke that every TV show be it cable, satellite, netflix, syfy, such as The 100, Z Nation, etc., etc., etc, turns q previously hetero character into a lesbian just for a few hot lesbian scenes instead of introducing new characters who are already lesbian. I don't see anyone getting upset about that big joke.\n\nI happen to be pretty fat, and I laugh at fat jokes. I laugh at funny fat jokes, let me clarify. So if you are sensitive to just about anything, don't watch this.\n\nIt seems the only thing we are supposed to laugh at when it's insulted these days is white people.\n\nGood nuff movie to rent, don't buy it, it's not worth buying, but is a good Red Box rental especially for a double feature night.\n\nI don't expect all movies to be perfectly polished and politically correct blockbuster hits. Why do you?"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "Prabhat_KS",
        "review_rating": "4",
        "review_title": "An All feminine, Bland, Clichéd, Cheeky affair. A total Hit and Run.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "subxerogravity",
        "review_rating": "6",
        "review_title": "Could have been more Boss",
        "review_detailed_main": "Melissa McCarthy has entered that zone where I'll go see a movie if she's starring in it. Good for her and funny women everywhere, not so good for me.\n\nThe Boss was weak. It had a lot of good jokes and good punchlines but they did not hit me as hard as you would expect from someone as funny as McCarthy.\n\nI would not go as far as to say she was phoning in her performance. I think she brought her A game, but the movie itself is a C tops.\n\nKristen Bell for the most part was the straight man to McCarthy's comedy, but the chemistry between these two seemed lackluster. Tyler Labine seems to be going somewhere as Bell's love interest, but his screen time was really coming to little too late.\n\nThe concept of a Martha Stewart styled situation, bouncing back by selling girl scout cookies was Boss. The material with McCarthy interacting with the girls and teaching them big business is funny.\n\nBut the big laughs... Peter Dinklage (pun implied). He plays McCarthy's ex-lover turned business rival, and his whole persona of a wound tightly Mongol who keeps focus with his interest in Japanese Samurai culture was golden. I loved all of it.\n\nOverall, it's good for a few laughs, if you catch it on Netflix, but it's not the strongest comedy one of the Queens of comedy as every done."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "psykoz",
        "review_rating": "1",
        "review_title": "Sigh.... Cringe...",
        "review_detailed_main": "Melissa McCarthy isn't funny. She's just fat and annoying. Hollywood, please stop putting her in more movies.\n\nI can't stop cringing. Watching any of her movies or TV-shows literally gives me cancer.\n\nWho keeps thinking it would be a great idea to star Melissa in yet another movie?\n\nPeople hate her. And yet she keeps getting more work? How? Ugh, cringe.\n\nEven the new Ghostbusters is gonna get destroyed by her. It's unbelievable, really.\n\nHollywood needs to get their acts together. If this keeps up, Melissa will soon be in every single movie.\n\nLOL!\n\nUGH!"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "Robert_duder",
        "review_rating": "6",
        "review_title": "A fun simple dirty little comedy that McCarthy has become known for",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "butterbean-21201",
        "review_rating": "2",
        "review_title": "Really Dissapointing",
        "review_detailed_main": "I really like Melissa McCarthy and have seen most of her work and loved it. However this movie is not her best work, It is vulgar in places that isn't needing profanity. The throwback references of most of her movies are old and stale. She and her husband can surely do better."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "Caglatureray",
        "review_rating": "9",
        "review_title": "Smooth and funny",
        "review_detailed_main": "Rally smooth and easygoing and funny. Really liked this one !"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "bbewnylorac",
        "review_rating": "6",
        "review_title": "Had potential, but fell sort of its promise",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "capone666",
        "review_rating": "5",
        "review_title": "The Vidiot Reviews...",
        "review_detailed_main": "The Boss\n\nThe paradoxical thing about bosses is that they're the highest paid yet most hated person in the company.\n\nUnfortunately, the CEO in this comedy no longer receives the income portion.\n\nMichelle (Melissa McCarthy) is a hard-nosed businesswoman sent to prison for insider trading. With nowhere to live when she's release Melissa reaches out to her former assistant Claire (Kristen Bell), whom she mistreated and poorly paid.\n\nDetermined to regain her fortune and topple her adversary (Peter Dinklage), Michelle proposes that they sell Claire's homemade brownies through her daughter's scout troop. But all that camaraderie soon becomes too much for the titan of industry to handle.\n\nWhile McCarthy's verbally abusive character provides a few decent sight gags, for the most part this vanity project written and directed by her husband is an unfunny, foul-mouthed and overall formulaic family outing.\n\nIncidentally, in white-collar prisons the inmates don't get raped...their butler's do.\n\nRed Light\n\nvidiotreviews.blogspot.ca"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "jawneyfloros",
        "review_rating": "",
        "review_title": "terrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "lisafordeay",
        "review_rating": "6",
        "review_title": "Funny movie starring the ever so likeable Melissa McCarthy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "NestorTheGreat",
        "review_rating": "6",
        "review_title": "When work follows you home",
        "review_detailed_main": "McCarthy and Bell having a gromance (whatever word passes as a girl bromance); A pulling at heartstrings and shaking of funny bones ensues. While you're questioning the turtleneck decisions, the unfinished formation of what I presume are pay-off jokes flashes through the scenes. The tall girl guide, the brawl, the feisty mum and deadpan den leader seem punchlines for bigger laughs that never eventuate.\n\nThere's still loads of laughs to be had seeing McCarthy be directed by her husband to make out with Dinklage, all the while Ben's also in front of the camera acting as Steve...sounds creepy when said like this, though!\n\nThe plot, which matters so very little in this fun comedy, sees an orphan become a powerful, rich and successful industry leader, then a prisoner and straight to being an ex-con living on a sofa in her ex-assistant's home. A fish out of water tale with a dose of helping others, and heartmelting adult vs child moments.\n\nKristen Bells is kept at bay while McCarthy carries the weight of the jokes, written by Melissa herself! I wonder if the title referred to the writer, director or character?"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "alijsayab",
        "review_rating": "1",
        "review_title": "Not suitable for children",
        "review_detailed_main": "I was surprised by the shallow level of the bad language in this movie ! It's never makes it comedy ."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "ManjeetG",
        "review_rating": "6",
        "review_title": "Quite Funny!",
        "review_detailed_main": "This movie is at times strange and quirky, yet overall, quite funny.\n\nThough not a fan of crudeness, obscenities or violent behaviour, especially in kids, I looked beyond that and found the movie humorous, with some off-hand remarks hitting home.\n\nThe characters didn't have great depth, but we got the gist. Melissa McCarthy is always a joy to watch. Peter Dinklage's character was ironically comical.\n\nBelow the surface points to note regarding this movie - it's about connecting with people,family, being there for each other, trust, making things right, empowerment, reaching heights one doesn't feel capable of or when others have put you down, rising after a fall and finally, a movie about kicking ass and taking names!"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "mekid-33183",
        "review_rating": "1",
        "review_title": "So vulgar",
        "review_detailed_main": "It's a 15 and it's utterly vulgar. My kid was watching this, what a disgusting movie, what is the need? Are you unable to make a movie and write a script without so much vulgarity and profanity? Shame on whoever made that. No wonder kids are so confused nowadays, they watch so much trash on tv.\n\nThis movie should be an 18, definitely not a 15.\n\nIt's a 15 and it's utterly vulgar. My kid was watching this, what a disgusting movie, what is the need? Are you unable to make a movie and write a script without so much vulgarity and profanity? Shame on whoever made that. No wonder kids are so confused nowadays, they watch so much trash on tv.\n\nThis movie should be an 18, definitely not a 15."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "barrowinnovations",
        "review_rating": "8",
        "review_title": "what a bunch of PC reviews",
        "review_detailed_main": "I don't like to write long reviews analyzing a movie, either it works for me or it doesn't, basically. I busted out laughing several times during this movie, it worked for me. The boob scene was hysterical. Sure, some parts are silly and crude, but it's lighthearted and ends well like movies should. I only wrote a review because of the amount of 1 star reviews ripping it. Lighten up Francises."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "eddie_baggins",
        "review_rating": "1",
        "review_title": "McCarthy and modern comedy at its very worst",
        "review_detailed_main": "How long can one continue to do the same thing over and over before said one becomes bored? It's an intriguing question and one that now must be seriously asked of comedian Melissa McCarthy, who over the last 5 or so years has dominated the increasingly activate female comedy market thanks to hit turns in films like Bridesmaids and Spy but has also shown an unashamedly tired tendency to reiterate the same character over and over in often diabolically unfunny experiences.\n\nIdentity Thief, Tammy, The Heat, this film (filmed once more with her real life husband Ben Falcone) and to a lesser extent Ghostbusters have seen the somewhat self-confessed queen of comedy reliving the same variation of her loud mouthed, dumb or obnoxious persona that initially won her a legion of fans of but has since seen her become a tiresome bore and its actually nice to see such a forced film like The Boss get the reception it deserves.\n\nDevoid of legitimate laughs and unnatural in the all the wrong ways for a comedy, The Boss is the very worst of McCarthy and the worst example of many of modern day comedies worst attributes from trite story lines, a thinking that the more swearing and toilet humour the better and a collection of characters we neither care for or find funny and while every now and then McCarthy reminds us that she can lead a comedy to moments of gold (last year's Spy an example) her Michelle Darnell is an utterly irredeemable creation.\n\nWe're asked to care for Darnell as the high roller loses her fortune and finds solace and meaning in her relationship with Kristen Bell's kindly Claire and then in her battles with rival and ex-lover Renault played by Game of Thrones Peter Dinklage with more ham than a Christmas dinner but how Falcone and McCarthy thought we'd care about this barely there story with barely available laughs will always be one of life greatest unsolved mysteries.\n\nThere's nothing boss about The Boss and McCarthy's continued one mindedness to milk her past successes over and over with increasingly forced and tired features like this will quickly see the domineering actress fall out of favour with her once willing audience as the so-so box office and terrible reception to this film is attesting to already.\n\n½ a samurai sword out of 5"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "danielichbiah",
        "review_rating": "1",
        "review_title": "One of the worst movies of history",
        "review_detailed_main": "Disgusting, vulgar, stupid... I find no words to describe how much I hated this movie. Its vulgarity is beyond any limit. The terrible thing about this horrible film is that all along you hope that it will get better, that the ugly character depicted will learn some lesson from life and start having a more respectable viewpoint toward others. But no. Her huge vulgarity and insanity is assumed throughout. This is one of the 2 or 3 worst movies I have ever seen... By the way, may I advise all parents not to show such a vulgar movie to kids. The language is obscene and filthy. Like the character of this movie only worth of disdain. I wonder what can be in the mind of the lady who wrote this... I really pity her."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "xilirationisfun",
        "review_rating": "1",
        "review_title": "And I never write reviews....",
        "review_detailed_main": "Absolutely awful. Seems as if it were written by 6th graders. Instead of bothering to write any jokes, anything witty at all, they threw in a bunch of curse words and site-gags. Cursing can be funny if it amplifies a joke, but alas there were none. The premise is not awful, Troop Beverly Hills is very funny, but without any real jokes it feels like a melodrama marketed as a comedy. McCarthy did not bring any real depth or humor to the character, and poor Kristen Bell must not be getting any real offers (she is sadly cast as the wet blanket once again). There is so much wasted potential by writing that never seemed to go past the draft phase and actors that were given absolutely nothing to work with,and the cast has some great people. Bummer."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "DavidLindahl",
        "review_rating": "2",
        "review_title": "A weird mess that was bound to fail from the start",
        "review_detailed_main": "Melissa McCarthy is definitely hot in Hollywood right now. Her Oscar nomination for Bridesmaids in 2011, didn't just give her respect in the business, but also more opportunities to make films. So what did she chose to do with her time. In The Boss she is directed by her husband Ben Falcone, after a screenplay they have both written together. She plays Michelle Darnell, a business woman who built her own economical empire from scratch. After being sentenced to prison for insider trading, she is later released completely bankrupt and forced to stay on the couch with her ex assistant Claire, played by Kristen Bell. Here she puts Claire in trouble when she suddenly sees a business opportunity in her daughter's girls scout cookie sales.\n\nI have to be completely honest and say that it is difficult for me to find anything positive to say about this film. McCarthy plays Michelle as an unsympathetic devil, which appears to be meant to create humor in the contrast between what is morally right to do, and what she chooses to do. The problem is that the film completely lacks comical timing and jokes that actually works. Minutes long breast jokes are mixed with girls fighting each other bloody and other scenes loaded with boring stereo types that just doesn't work anymore. I think that in the middle of this mess, the filmmakers sort of forgot what kind of film this was meant to be. Is it supposed to be a fun family film with a cookie selling daughter, or more closely to black humor with jokes about death, illness and other normally tense subjects? I just don't know.\n\nThe Boss is badly edited, badly told from a dramaturgical point of view, and also incredibly predictable. Don't get me wrong, a lot of classic drama is predictable but if the rest of the film is below tolerable, you just don't care anymore and long for the film to end. Who even thinks that it is fun with an arrogant lady who tries to sell cookies to get rich? Very strange plot even to begin with. I find it very difficult to see where this film could have been saved. Very few things are even good to begin with, but the worst part as I mentioned before, is the extremely bad and terribly timed jokes. Watch the film and see for yourselves. But do it on your own risk. Because of the limited opportunities to makes this film even slightly better than it is (and it is not good to begin with), I can't grade it anything else than low.\n\nDavid Lindahl - www.filmografen.se"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "jrgibson-51931",
        "review_rating": "1",
        "review_title": "A 'comedy' without a single laugh.",
        "review_detailed_main": "What a turkey! I managed to make it through to the end and did not smile once. Anyone who found this garbage funny was either paid or would laugh at a brick wall. PC garbage about 'strong' women who use foul language to no comedic effect is obviously Hollywood's idea of what the public wants and sadly some individuals meet their stereotype but if every 'comedy' is abysmal then an audience will applaud one that is less atrocious than the others, although I think that The Boss is as bad a sit can get."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "j_ryberg",
        "review_rating": "10",
        "review_title": "Budget: $29,000,000 (estimated) Gross (US) $63 mil. HERE'S WHY",
        "review_detailed_main": "Filmed in Chicago, this movie has a PLOT. It's funny, well-written, produced and directed, with great characters and acting. Melissa McCarthy is excellent, and so's Kristen Bell, Taylor Labine, Kristen Schaal, Peter Dinklage, and Cecily Strong. There's pathos (I think I know what that means) and I laughed a lot, having stopped to write this with 20 minutes to go. The great script was written around a really good brownie recipe, and McCarthy's ruthless \"Michelle Darnell\" runs into legal problems, then has to deal with innocent \"Girl Scout\" types, and decent grownups. Dinklage's character (He did this on a hiatus during GOT) is a very bad man who fights Darnell for the business. I think most people, by far, will like this one. The numbers above were just up to 12 June 2016, and the overseas profit must have been HUGE. I can't wait to see how it ends, so here I go."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "alan.hughes",
        "review_rating": "1",
        "review_title": "Atrocious",
        "review_detailed_main": "This is an awful movie. It uses vulgarity in the place of comedy and, as a consequence, has no good jokes, simply uncouth dialogue. It is generally so distasteful that it leaves you feeling ashamed for watching it."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "mikemachuk",
        "review_rating": "2",
        "review_title": "Disturbingly bad!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "randar2129",
        "review_rating": "1",
        "review_title": "Made it through 10 minutes",
        "review_detailed_main": "Maybe if I had stuck it out and watched more of this film it would've grown on me, the way other of Melissa McCarthy's movies have. But, I just couldn't do that to myself. I couldn't sit through the painfully bad acting and poor writing. Just ten minutes in and it was already a stinking mess of awfulness. Unfortunately, I don't have much more to say about this movie, but I have a feeling it wasn't going to get any better. Why does Hollywood allow such crap to get made? I've seen bad movies, and this one has now taken the top spot. Maybe if it had been an 8 minute movie, I'd have given it more than 1 star."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "blanche-2",
        "review_rating": "5",
        "review_title": "disappointing",
        "review_detailed_main": "Melissa McCarthy stars in \"The Boss\" from 2016, also starring Kristen Bell and Peter Dinklage.\n\nMcCarthy plays a tycoon businesswoman Michelle Darnell, who loses everything when she's found guilty of insider trading and goes to prison. When she is released, she has nowhere to go, so she hits up her ex-assistant Claire (Bell) for a place to stay. Claire has a young daughter, Rachel, and Claire asks Michelle to take her to a Young Dandelions meeting - the Young Dandelions are similar to the girl scouts. There, she gets the idea to recruit some of the Dandelions and go into business selling Claire's fabulous brownies. It takes off, with Claire as 50% partner. But an ex-boyfriend and enemy (Dinklage) is anxious to ruin Michelle yet again.\n\nI have no problem with swearing, no problem with sex, but if there's one thing I have no tolerance for is vulgarity. And the humor here is vulgar and geared to the lowest common denominator. Why someone as talented as Melissa McCarthy does this type of film is beyond me. She's better than this - either she or Hollywood don't think so. Is it because she's overweight? If so it's even more insulting.\n\nI'm a huge fan of Kristen Bell's and wish this had been a better role for her.\n\nThere were some funny slapstick scenes and the premise was good, as was the cast, but the script was bad. And tasteless."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "Racingphan2",
        "review_rating": "5",
        "review_title": "I was with it until.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "mikasparky",
        "review_rating": "10",
        "review_title": "In the post-election era, this film is HILARIOUS",
        "review_detailed_main": "Think Female Donald Trump (if life were accurate and fair) meets Martha Stewart. I don't want to ruin the plot so I won't elaborate beyond that. I will say this about the film, though:\n\nMelissa McCarthy is one of the most brilliant comedians of the 21st Century--she's \"all in\" to her performance and completely believable (and hilarious).\n\nIf you need a laugh in these dark days of 2017 onward, I strongly recommend this film. It's not realistic, it has formulaic elements, but the production values are great, the actors commit to their roles and it's an enjoyable escape. And McCarthy is superb--as are the rest of the cast members."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "mailes22",
        "review_rating": "1",
        "review_title": "Truly awful",
        "review_detailed_main": "I used to like Melissa McCarthy. But she is just making movies with lousy scripts these days. Not funny. Not clever. I just don't understand how an actress with the comic talents of Melissa McCarthy keeps getting sucked into dross like this. The sad thing is that the premise of this script could have been quite funny, but it just keeps going for 'gross' in every scene."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "rabbitmoon",
        "review_rating": "1",
        "review_title": "It doesn't matter that its crass or vulgar - just that its really not funny at all",
        "review_detailed_main": "I don't mind crass and vulgar - Grimsby (The Brothers Grimsby in the US) was crass and vulgar but also witty, satirical, intelligent and frequently laugh out loud funny.\n\nThe problem with The Boss is that its just not funny at all - its the laziest effort at comedy I've seen in a while. In the first ten minutes, three key scenes (an opening orphanage scene, then her seminar, then the conversation between her, her assistant and bodyguard) are just lacking any punch at all - there's just nothing to even smile at. It just fails to be interesting on any level, like it was written by a grumpy teenager for an English assignment, when there was something better to do.\n\nHow it got made, I'll never know. I'm glad I walked out after ten minutes. If you're interested in seeing it, do yourself a favour and download it instead."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "eglg",
        "review_rating": "1",
        "review_title": "Worst movie in history",
        "review_detailed_main": "Waste of film Possibly the worst movie i have ever seen stupid approved violence language bad and made to be acceptable Melissa McCarthy is the epitome on NOT FUNNY paid for a movie she stars in so she could be as bad as possible NO sociably redeeming value don't watch this it is truly horrible accept for the young girl who befriends Melissa give her an award for tolerating the supposed comedian and her acting BAN McCarthy from cinema forever I am throwing up"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "sweeeetmikey",
        "review_rating": "1",
        "review_title": "I'd rather get a prostate exam from Captain Hook than watch another mediocre Melissa McCarthy movie",
        "review_detailed_main": "THE BOSS review by FAT Mike\n\nA titan of industry is sent to prison after she's caught insider trading. When she emerges ready to rebrand herself as America's latest sweetheart, not everyone she screwed over is so quick to forgive and forget.\n\nWith Gary Sanchez Productions (operated by Will Ferrell and Adam McKay) I had a glimpse of hope that this film wasn't going to be like other Melissa McCarthy movies like Tammy, The Heat, Identity Thief......I WAS WRONG, The Boss was just like the others.\n\nThere were some good, cheap laughs but most of them I didn't care about and the jokes mostly fell flat. The first 5 minutes was the best, the rest of the time I struggled not to turn off the movie.\n\nThe cast was better than main star Kristen Bell, Tyler Labine, Kristen Schaal but the one that made me laugh most of all was Peter Dinklage but not even he could save this movie.\n\nThe Boss tries too hard to be funny and is a forgettable movie (thank god). I hope one day we will get a good new Melissa McCarthy because I'd rather get a prostate exam from Captain Hook than watch another mediocre Melissa McCarthy movie. Cheers and remember I watch bad movies so you don't have too\n\n3 out of 10\n\nEdited by Samantha Locke\n\nfollow at @FatMikeTPK"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "FlashCallahan",
        "review_rating": "5",
        "review_title": "Nice array of turtle necks....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "moonbeamsnstars",
        "review_rating": "9",
        "review_title": "The ratings of this movie get a 1, movie gets an 8!!!",
        "review_detailed_main": "So, since y'all are trashing this movie, I thought I'd take a moment to \"school\" you close-minded folks... First of all, just because there are child actors in a movie does NOT (I repeat does NOT!!!) mean that children should watch this...It's called thinking like an adult and NOT allowing your spoiled brat kids to watch \"adult themed\" movies!!! Duh!!!\n\nWhat, you expect the film industry to parent for you?!? What, just because you have kiddos means that the rest of the population that doesn't have kids, should never watch a good movie because, you're butt hurt that you can't watch a grown up movie without kiddos running around...Get a freaking babysitter if you want to watch it so badly or, just set healthy boundaries and not allow your brat kiddos to watch grown up stuff with grown up language!!! It's really not that hard...🙄🤦‍♀️🤷‍♀️\n\nAs for this movie, it's freakin' HILARIOUS!!! Don't take this movie to be a non fiction when it's an absolute fiction!! Go in with an open mind...Much unlike the countless many who only sought to bash this movie simply because of the language (oh, the travesty of it all!!!) and their lack of being able to distinguish between what a child should n shouldn't watch (yes, CHILDREN should absolutely NOT watch this movie!!!) as a good parent would know. This movie was NEVER meant to be a G or PG rated movie for kids!!!! Get over it ffs!!!"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "thebenjaminnunn",
        "review_rating": "1",
        "review_title": "A mess of a film built around an unlikable lead",
        "review_detailed_main": "The Boss feels like someone wrote it on their phone from the toilet after eating some bad sushi. Either that or the director allowed for so much improvisation on the part of the cast that the plot fell apart.\n\nMelissa Mccarthy's character is an unrepentant, unfunny sociopath whose humour is entirely independent of context. Her jokes could easily be swapped around at random and it wouldn't affect the coherence of her scenes.\n\nThe plot is just a mess of poorly explored ideas that are thrown away as soon as they're introduced.\n\nPeter Dinklage and Kristen Bell are highlights of the movie but even they can't make the humour work."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "MLDinTN",
        "review_rating": "4",
        "review_title": "the problem with this movie is...",
        "review_detailed_main": "Melissa Mccarthy's, Michelle, is too obnoxious. You can't route for her to change because she's too rude to be humble. The film starts out with Michelle admitting to insider trading, but she doesn't get it's a big deal. So she goes to jail for a few months, gets out and is broke. She gets her old assistant, Claire, to take her in.\n\nShe gets an idea to start a brownie business since Claire's are so good. Next thing you know, she back stabs Claire by selling the business because she thinks Claire was going to but she wasn't. Then they have to try to steal back the contract.\n\nFINAL VERDICT: Really not to funny. Michelle is just mean and it's not a good character for Mccarthy. I'd say skip it."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "jacklmauro",
        "review_rating": "4",
        "review_title": "Terminated",
        "review_detailed_main": "This gets a 4 only because the first 45 minutes deliver, at least a little. Yes, there's lots of crudeness. Still, McCarthy is so, so watchable (she has perfected the sideways, barely heard moment). McCarthy is also able - remarkably - to still make explosions of profanity funny. Unfortunately, and before midpoint, this goes completely off the rails, and aside from the way too trite story element of emotional denial and epiphany. You keep wanting someone to give McCarthy something decent to work with. The earlier, admittedly very broad farce simply degenerates into stupid and unfunny cartoonishness, and it's just too bad. You can almost feel the actors' wondering of how and why any comic promise was allowed to be destroyed. Melissa and we deserve better."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "ouzman-1",
        "review_rating": "1",
        "review_title": "Seriously?",
        "review_detailed_main": "Her future is in the past if she continues playing such rubbish. Nothing endearing about this. If I said this was bad someone would say that it isn't even that good!"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "Boristhemoggy",
        "review_rating": "1",
        "review_title": "Absolute load of old rubbish. Don't waste even 5 minutes of your life on this.",
        "review_detailed_main": "I have the utmost respect for Kristen Bell, as a comedy actress (Forgetting Sarah Marshall) and as a serious actress (The Lifeguard) so I watched this film principally because of her. I've never seen her in a bad film, although this now is the first time and she is utterly wasted and despite she is the only good thing about this film, I wish she had never made it as it's taken away some of the respect I had for her and the confidence in knowing that her films are always good to watch I've never heard of Melissa McCarthy before, and I will never watch her again. She's awful to watch, unfunny and weird for whatever reason she has for wearing something that covers her neck at all times. Awful movie, awful people in it."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "msbond_007",
        "review_rating": "10",
        "review_title": "Loved it-- Black Ironic Humour no sugar-coating",
        "review_detailed_main": "Loved it-- Black Ironic Humour no sugar-coating!! ---Finally a comedy in years that made me laugh...and did so from beginning end! The story is actually cute and quirky, and even thou it is comedy there are also a few life lessons one can learn by watching this film. I have no idea why certain members have a negative view on this movie. I liked it because it is raw and is sarcastic--- if your only into just Rated G or foreign drama films this is not for you then stick to Walt Disney! I also think reviews from certain members first regarding the movie as being vulgar, but end up themselves writing vulgar reviews with inappropriate language...if want to set an example then do 100%\n\nI give the movie a big thumbs up!!!!"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "iquine",
        "review_rating": "2",
        "review_title": "Nothing Redeeming About This",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "nipunbeniwal",
        "review_rating": "4",
        "review_title": "one time watch",
        "review_detailed_main": "For the people: It is all about Melissa McCarthy, all the other characters seems to be just supporting her. Strong swearing, loved it. Good ways to dis haters. It would been better if there were more jokes. : By the people."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "ivobg",
        "review_rating": "2",
        "review_title": "Vulgar rubbish \"comedy\"",
        "review_detailed_main": "I have no idea why people are so hyped about MM and give 10/10 at all her movies. Let's be honest - she isn't anything good as an actress. She's mediocre and below.\n\nThis movie isn't any different of her library, offering nothing but fault vulgar language, annoying blabbering and unfunny jokes. I couldn't even laugh when she fell on the stairs.\n\nIt's by far one of the worst comedy I ever watched. The whole story offers nothing unseen before, nothing intriguing and moves slowly. Two hours are too much for this empty script, it shouldn't be longer than 90 minutes.\n\nVulgar rubbish \"comedy\", I can't give it higher than 2/10."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "jamiemarkland",
        "review_rating": "4",
        "review_title": "Mehhhhhhh",
        "review_detailed_main": "Melissa McCarthy has had plenty of ups and downs in her career. It seems in recent years she has gone back and forth from landing in hilarious roles to disappointing roles, her last major role being the action comedy 'Spy' from last year. She has often stolen the show in films directed by Paul Feig, 'Bridesmaids' and 'The Heat' to be more specific, but seems to slop in other roles. This film marks her second collaboration with her husband director Ben Falcone, the man behind the critically hammered 'Tammy' which starred McCarthy as the titular character. In this film, McCarthy plays Michelle Darnell, a chairwoman of a billion dollar company with her best friend Claire (played by Kristen Bell), a single mother of a pre-teen daughter Rachael (played by Ella Anderson), working by her side. In the process, she's made enemies with her former lover Renault (played by Peter Dinklage) after taking his position as manager, and he has vowed revenge against her ever since. After a botched interview with a television personality, Michelle is arrest for insider trading and sent to prison for six months. Upon release, Michelle stuck on the streets with her assets wiped clean, her home on foreclosure, and with nobody to turn to but Claire and her daughter who move her into their house in attempt to get her back on her feet.\n\nFor the past several years, McCarthey has proved her gift of comedic talent, and this movie does not fail to show it, but she certainly doesn't embrace her full potential in her smart-mouthed role here. What good does she bring to this movie exactly? Well, she doesn't fail bring on some occasional laughter enough to distract you from the thinly written script, and her comedic chemistry with Kristen Bell works, but the jokes don't always hit home. McCarthy tries desperately on bringing out laughter through her shamelessly vulgar dialogue, some of which in the presence of elementary school-aged Ella Anderson. In some scenes, the jokes work, and leave a fair number of people in my theater laughing. In other scenes, they tend to come off as bold and mean-spirited, or otherwise rather forced. A lot of it begins when her character volunteers for Kristen Bell's daughter's Girl Scout. As shown in the trailer, one scene features a violent street brawl between dozens of young-aged girls, a scene where we sit through little children engage in slow motion fist fights, throw each other against cars, karate kick each other in the face, etc. Apparently we are supposed to believe this is funny when it really just comes off as cruel and makes you feel guilty for laughing, if you happen to do so. As the most of the fun and hilarity take place during the first hour, the film completely drops the ball during the second hour and laughs come to a halt. That is when Peter Dinklage begins consuming some major screen time. This actor is shown to have comedic potential, but sadly it doesn't work. The jokes he shoots out never land and his comedic chemistry with McCarthy falls completely flat.\n\nThe biggest accolade The Boss manages to achieve is being slightly funnier and more fun to watch director Ben Falcone's previous film 'Tammy'. Overall, this definitely doesn't sit on the ladder of Melissa McCarthy's best works, not even close. She and Kristen Bell manage to steal the show here, but only by a short shot. This is comedy that will please mostly fans of Melissa McCarthy, but leave others with a cold shoulder."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "kiahrex",
        "review_rating": "3",
        "review_title": "Unfunny, stupid and what's with the neck warmer",
        "review_detailed_main": "Apart from the annoying and loud character, what stands out the most is the weird neck piece she wears in every scene. It's it hiding an injury or something? It makes her look like her head is floating in mid air."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "brian-2266",
        "review_rating": "9",
        "review_title": "Come on!! Flat Out Physical Comedy!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "CastleofGlass1987",
        "review_rating": "3",
        "review_title": "Awful",
        "review_detailed_main": "Not even kristen Bell can save this movie, couldnt even finish it, well i didnt wanna but i made myself to the end poor writing , poor jokes"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "kaptenvideo-89875",
        "review_rating": "2",
        "review_title": "Talky but lifeless and charmless \"comedy\"",
        "review_detailed_main": "Talky but lifeless and charmless \"comedy\" about self-made business mogul (Melissa McCarthy) who goes to jail for insider trading and then bounces back, creating a cookie empire with former employee (Kristen Bell).\n\nThe best that can be said about this misfire is that they try different things – buddy comedy, a colorful person story, inspirational girl power story with swearing, later even some rom-com and action.\n\nBut nothing, even potentially the funniest parts like girlfight or comparing titties, is developed far enough to have a real impact.\n\nYou may laugh a couple of times but the result really is a weak, talky series of sketches that never pay off, or should not continue for 100 minutes... but it sadly does.\n\nWhat's worse, the characters are super bland (even Peter Dinklage and Kathy Bates are wasted) and the central heroine is as soulless and kind of zombified as the whole experience feels.\n\nStill not convinced that Melissa McCarthy can carry a movie. There's no single point that she really makes this role her own, instead of weakly impersonating Danny McBride and Vince Vaughn in their most boring movies.\n\nThanks to the McCarthy's current star power and marketing it as a straight comedy, it managed to get 80 mil USD from cinemas. Way more than it deserves!\n\nConsidering that McCarthy is also one of the screenwriters, and her husband Ben Falcone director and also one of the writers, it's surprising how they can't play to leading lady's strengths.\n\nComparing to other recent big-name comedies, it's as useless as \"Zoolander 2\" and \"Anchorman 2\"."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "tinamarieneely",
        "review_rating": "4",
        "review_title": "Wanted to like it",
        "review_detailed_main": "I wanted to like this movie, but the jokes fell flat. Peter Dinklage's character was especially disappointing, considering he's such a great actor and has played in funny roles before. Melissa McCarthy did her best with what she was given, but they didn't utilize her full capabilities as an actor. Kristen Bell's character was genuinely boring. Tyler Labine played in an unfortunate role but, like McCarthy, he did his best.\n\nThe drug references in this move weren't funny. The samurai references weren't funny. The sexual more-than-references weren't funny. The couch-flip was funny in the previews but in the movie it was no longer a surprise. There needed to be more moments that surprised the audience like that. The constant references to the tall girl being tall... Yeah, not funny after a hundred times. Once. That's a one-time joke.\n\nI think that's partly what happened. Any actually funny material was replayed over and over so that the original joke didn't even get a chuckle toward the end. You can do it, writers. We believe in you.\n\nI don't think the actors did anything wrong here, but the writing was very odd (lazy) and the pacing poor. They lingered where they didn't need to linger and ignored opportunities that could have been very funny. I had high hopes for this movie, which definitely contributes to my disappointment."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "ginocox-206-336968",
        "review_rating": "1",
        "review_title": "Muddled and confused",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "coreyjdenford",
        "review_rating": "4",
        "review_title": "Can't be The Boss of everything.",
        "review_detailed_main": "My review of The Boss (spoiler free)\n\n** (2/5)\n\nCast: Melissa McCarthy, Kristen Bell, Peter Dinklage with Ella Anderson and Tyler Labine.\n\nPlot: A titan of industry is sent to prison after she's caught insider trading. When she emerges ready to re-brand herself as America's latest sweetheart, not everyone she screwed over is so quick to forgive and forget.\n\nMelissa McCarthy in my eyes is just a comedy goddess but not in this. In this movie she plays Michelle Darnell who is the 47th wealthiest woman in the world and just a titan of industry but other than that her character very flat and the material is just over used. Director Ben Falcone also known for Tammy (2014) another immature adult comedy just like this one.\n\nAfter being released from jail she seems lost and tries to seek the help of Claire (Bell) and her daughter Rachel (Anderson) to try an make herself a better person. She gives Rachel some business advice to run a successful cookie company and she gives Claire advice on dating. Peter Dinklage who plays Renault (not the car) is just as equally bad even he doesn't make the film any better.\n\nJust so you know this is an adult comedy but it just feels rushed and isn't the raw humor we're used to from McCarthy. There is no story and no character development it feels rushed, and made me feel guilty for watching it as if to say \"why am I watching this.\" It certainly isn't as funny and as enjoyable as last years Spy which was the funniest film of 2015 and just a balls out smash. There are two funny moments in this film and only two this should be left alone.\n\nHere are some points as to why this comedy should be avoided:\n\nCharacter: Michelle Darnell has a very Trump-esque feel to her and other than her just being the 47th richest in the world, again like in Tammy her character feels rushed. Michell starts life as an orphan being taken in and out of the orphanage where she lives even when she tries to change she is still a bad character, and still over done. Just as humorous as she was in Bridesmaids.\n\nStory: Other than the story of her being wealthy there is no other story better than that, it's not even well written by Falcone or Steve Mallory. To be frank this is just a plot-less and unfunny mess. I miss Spy. Renault's story is no better he is a business man who likes to take whatever everybody else has got because he feels he should have it. The story is just to real life it's just silly.\n\nThis a cheaply done comedy and I thought comedy meant funny but this is just unfunny and as I said before just a mess. Like Tammy this is one to be missed.\n\nVerdict: Stupid and immature. Melissa is not her funniest and not her silliest if you like Melissa McCarthy just avoid this. Comedy not worth watching.\n\n4/10 plain bad."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "dianne-81253",
        "review_rating": "8",
        "review_title": "Laughed my A$$ off",
        "review_detailed_main": "I don't know what movie these other reviewers were watching, but my husband and I laughed our backsides off watching this movie. Come on people - it's fun and entertainment! Ton's of 1-liners. Melissa McCarthy is her classic usual hilarious self. Kristen Bell is a wonderful addition to the movie and Peter Dinklage you can tell had a blast working with Melissa. I won't go on and on about the details of the film like some people do as I'd rather get those from watching the film myself! Just watch and remember it's for entertainment and enjoy. We recorded this movie and backed it up so many times to re-watch scenes because we were laughing so hard many times we couldn't hear it. Some classic lines and totally enjoyed this movie!!"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "garethbushby",
        "review_rating": "2",
        "review_title": "Waste of Time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "mdking-49244",
        "review_rating": "1",
        "review_title": "Awful, just truly awful!",
        "review_detailed_main": "This may very well be the worst film I have ever seen. Melissa McCarthy just isn't funny. Avoid at all costs!!!"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "cahill-64801",
        "review_rating": "3",
        "review_title": "So Bad",
        "review_detailed_main": "This movie is a perfect example of how enough marketing and big name actors will produce a film that grosses enough money to be somewhat profitable, but still terrible at the end of the day. The plot was shaky at best, the jokes toed an odd line between being childish and very crude, and the end result was a disappointment. The film felt awkward, forced, and cheap throughout its entirety. After watching, I was honestly confused as to why Kathy Bates and Peter Dinklage agreed to have any role in the film whatsoever. I felt as if Melissa McCarthy was simply yelling at me for the entire movie, and was hoping that I would laugh either out of confusion or because that was what I was supposed to do. It wasn't the worst movie I had ever seen, and I would be lying if I said I did not laugh a few times as I watched. The Boss has a few laughs in it that will make you not completely regret spending your time watching it, but as you watch it, you will probably think that the movie is a quickly and poorly made sham."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "plargreg",
        "review_rating": "1",
        "review_title": "WASTE OF HOLLYWOODS TIME AND MONEY",
        "review_detailed_main": "WASTE OF HOLLYWOODS TIME AND MONEY, get this garbage out of here, in stead of pushing vehicles to further yer friends personal careers, i believe this is one of melissas mcarthys husbands movies where he casts her in some general unfunny bs, try to make an actual funny movie instead"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "planktonrules",
        "review_rating": "3",
        "review_title": "McCarthy's character was too abrasive, too selfish and too nasty.",
        "review_detailed_main": "If you think that seeing someone playing a nasty, abrasive, selfish jerk who curses non-stop...then this film is for you. As for me, I think the film was missing something most comedies have...a reason to care about the leading character.\n\nMelissa McCarthy plays Michelle Darnell, a self-help guru who treats everyone around her like dirt. She's amassed a huge fortune by lecturing, selling books and more....much like a foul-mouthed version of Tony Robbins. However, when she's convicted of insider trading, she's sent to prison. While the sentence isn't very long, when she leaves she learns that pretty much everything she owned has been confiscated. So, she moves in with her old assistant, Claire (Kristen Bell), though there is no conceivable reason why Claire would have anything to do with her...as she's completely repellent and awful and has learned nothing from her ordeal. She's also a god-awful influence on Claire's daughter. What's next and, more importantly, who cares?!\n\nIf the notion of seeing McCarthy play a god-awful character who constantly curses and acts vulgar, then this film is for you. Some vulgarity can be funny (such as in \"Step Brothers\")...constant vulgarity and nastiness simply makes you wonder \"what were these people thinking???!!!\". I thought it was all way over the top and nothing like her sweet film \"Spy\". I liked \"Spy\" and liked McCarthy's character. But with \"Boss\", I found her and her character very easy to hate. The film is occasionally funny...but not enough to make it possible to overlook McCarthy as Michelle. In fact, after a while I tired of all this and just turned it off and found something better...it was nearly over but I just didn't care."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "tsholl-64283",
        "review_rating": "4",
        "review_title": "The movie is not as good as her earlier movies",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "CANpatbuck3664",
        "review_rating": "3",
        "review_title": "The Boss Lacks Funny Content Even With Melissa McCarthy Trying Her Best",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "selinakeles",
        "review_rating": "4",
        "review_title": "It was okay",
        "review_detailed_main": "It wasn't really funny or super interesting, but it wasn't awful. I wouldn't reccomend as your first choice of the day"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "skankhunt-28052",
        "review_rating": "4",
        "review_title": "Mids",
        "review_detailed_main": "The movie stars Melissa McCarthy and directed by her husband Ben falcone and it's not very good. Melissa McCarthy is the same character pretty much every movie and her act can be entertaining and if your a big fan of her you will probably like it. I am getting somewhat tired of it and it started after seeing Tammy but after seeing this one Tammy was actually not even that bad. This can be hard to watch and the plot isn't worth going into great detail but McCarthy stars a orphan turned millionaire who then loses her job again due to her ex boyfriend Renault who's real name is Ron. The movie has its moments mostly when McCarthy does things like gets thrown into a wall, or falling down a staircase or hitting a tennis ball at some guy. However the character she plays in this movie is unpleasant, she was an orphan who no-one liked and when she gets rich she treats everybody poorly and throughout the movie even when she is poor again she is crude nasty but not too funny. Another thing is that I can't tell who the target audience is there's a kid who's in the movie and makes it feel like a family comedy but then she does some horrible things that shouldn't be in a family movie. I got pretty stoned during this movie and even then it was hard to sit to but I am just not into McCarthy enough where I can enjoy a whole 90 minutes of her comedy . Like I said if you're into McCarthy you might like it but otherwise not really worth a watch"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "thesar-2",
        "review_rating": "4",
        "review_title": "What? No Springsteen Cameo?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "fialynnchar",
        "review_rating": "8",
        "review_title": "I wanna be a Darnell's Darling!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "leonblackwood",
        "review_rating": "4",
        "review_title": "Funny in parts! 4/10",
        "review_detailed_main": "Review: When this film started, I must admit I couldn't stop laughing but once it settles down, the jokes become more silly than funny. Melissa McCarthy plays Michelle Darnell, whose an extremely successful business woman with ruthless business methods. After growing up in a orphanage, and constantly sent back by her adopted parents, Ida Marquette (Kathy Bates), takes her under her wing, and shows her how to succeed in business, without caring about her peers, or anyone that surrounds her. Her right-hand girl, Claire (Kristen Bell), puts up with her selfish attitude so she can have money for her young daughter, Rachel (Ella Anderson), and pay to live in her small apartment. When one of Michelle's business deals goes wrong, due to her archenemy and ex-lover Renault (Peter Dinklage), Michelle turns to Claire for help, even though she has taken on a degrading office job to pay her bills. Whilst under her roof, Michelle finds it hard to ditch her bad habits but once she tastes Claire's delicious brownies, business alarm bells start to ring in her head. There are some touching moments in the movie and I did rewind the bed and rapping scenes a couple of times but the rest of the film seemed like a bunch of one-liners with Kristen Bell being the kill joy. Its a shame that Michelle's bodyguard, Tito (Cedric Yarbrough) exited the movie so early because I liked the banter between him and Michelle. Anyway, it's a watchable movie with a few funny scenes but the unrealistic plot became a bit silly after a while. Watchable!\n\nRound-Up: Melissa McCarthy, 46, is definitely becoming a certified, bankable star, who has hit the big time since her cameo role in Bridesmaids in 2011. With popular movies like Identity Thief, The Heat, the funny St. Vincent, Tammy, Spy and Ghostbusters in her portfolio, her quick rise to stardom, and dramatic weight lose, is definitely a huge achievement for the popular star. This movie was written and directed by Ben Falcone, 43, who has been married to Melissa McCarthy for some time, and also directed Tammy, which also starred McCarthy in the leading role. Although he has only directed 2 movies in his career, he has had small roles in his wife's movies and a few TV series. He didn't really push McCarthy to the limit in this movie, and we have all seen her play this type of role before but it wasn't bad for his second project. Personally, I was hoping for a bit more, after enjoying Spy so much, and after watching the movies outtakes, it would have been much better with Dave Bautista as her nemesis at school, but the director must have had his reasons to change at the last minute. Anyway, it's light-hearted fun with a decent plot but I doubt that McCarthy will be remembered for her performance.\n\nBudget: $29million Worldwide Gross: $79million\n\nI recommend this movie to people who are into their comedies, starring Melissa McCarthy, Kristen Bell, Peter Dinklage, Tyler Labine, Kathy Bates, Margo Martindale, Cecily Strong and Dax Shepard. 4/10"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "loueysmith",
        "review_rating": "5",
        "review_title": "Too inappropriate",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "phd_travel",
        "review_rating": "5",
        "review_title": "Like the cast but only partly funny",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "Figgy66-915-598470",
        "review_rating": "4",
        "review_title": "Not a good use of my time",
        "review_detailed_main": "19 June 2016 Film of Choice at The Plaza Dorchester Tonight - The Boss. When wealthy businesswoman Michelle (Melissa McCarthy) is sent to prison for insider trading she is left with nothing except her massive ego. Turning to her former assistant Claire for help, she ingratiated herself into the lives of her and her daughter with a grand plan to become successful once again. Sounds good on paper but this film, although mildly entertaining and fairly easy to watch, did not live up to its promise. As with many comedies, this film tried too hard. We were given all the funny bits in the trailers and what was left was insipid and dreary. There were a few funny moments throughout but mainly the humour was inappropriate to the plot and uncomfortable to watch. It's a shame because it had a strong cast, my favourite being the character of Mike, played by Tyler Labine, who added just the right amount of desperate craziness in his bid to woo and date Claire. Melissa McCarthy was wasted in this role. Glad to have seen it, will not rush to watch it again."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "AgustaBeata",
        "review_rating": "1",
        "review_title": "An unfunny \"comedy\" with unlikeable characters.",
        "review_detailed_main": "I hated this movie. I don't know if my expectations on a comedy is to high, but I expect to at least laugh a couple of times. It didn't happen in this, not even once. I actually almost fell asleep a couple of times. Why I even finished it is a question I will ask myself for a long time.\n\nThe only character that was okay was the daughter of Bells character and that was just barely. Otherwise they was bland, boring or totally horrible like Michelle.\n\nI have seen in other reviews that if you don't like this you are a women-hating man that's afraid of strong women. Well, I'm a woman and am not at all intimidted by strong women. More power to them! But it doesn't change the fact that I just hated this movie. Sometimes it's just that simple."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "practicalMagick",
        "review_rating": "9",
        "review_title": "I haven't laughed this hard in forever!",
        "review_detailed_main": "I honestly can't understand how this movie is getting such bad reviews. If you have watched any Melissa McCarthy movie, you should know what to expect. I laughed from beginning to end. I've found Melissa hilarious in every movie she's been in, even if the movie itself wasn't that funny. (Bridesmaids) Imo, if you enjoyed The Heat or Tammy especially, with their raunchier humor, you'll love The Boss. I saw it on $5 Tuesday, and would have gladly paid triple the price to see it. It seems like critics hate Melissa, and the public can't handle her adult humor being as we're in the year of the butt-hurt, part 2. My advice is to lighten up. Go into this movie with all your guards down and allow yourself to laugh at everything, whether it's p.c. or not. Laughter is the best medicine. People are getting too serious these days, as well as being too easily offended. This is a rated R comedy. That means rude and crude humor and anything over- the-top to get a laugh. If that's not your thing then by all means avoid this movie. If you find offensive humor funny and want to pee your pants laughing then do yourself a favor and let loose the laughter. Solid, hysterically funny film!"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "SpoilerAlertReviews",
        "review_rating": "5",
        "review_title": "Average film, not McCarthy's best.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "fluturoj",
        "review_rating": "4",
        "review_title": "Likable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "graham-harvey",
        "review_rating": "5",
        "review_title": "Good but not Great",
        "review_detailed_main": "Melissa McCarthy always handles even a bleak movie, and this one is pushing it. With the theme about business and an opportunity to show how someone could make good, the storyline was just too weak. There were some great scenes, but if created properly, this film could have been awesome. I would give it a C+"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "Reno-Rangan",
        "review_rating": "3",
        "review_title": "Use on opportunity, build an empire and be the boss!",
        "review_detailed_main": "I always liked Melissa McCarthy films when others said they were very bad, but this time it is totally different. I won't blame her, she always gives her one hundred per cent and so for this film. But it was the terrible script that let her down. Actually, it is a watchable film, because of her, but without her completely unimaginable. The trailer looked much better than the film. It is a comedy, but the laughs are too far, not even a little smile in your face easy to obtain.\n\nSo it seems there are plenty of negatives about it than the good. I watched it to prove the people are wrong about it, but in the end I was wrong. This is the second time the director and McCarthy together for a film who are the real life couple. But I liked 'Tammy' better, not this one and there will be one more film that I hope they would come up with much more interesting than these two.\n\nShe is not a solo type star, her films are always the multistarrer. So whenever I hear about her new films, I get curious about her new partner. Kristen Bell was not bad, even Peter Dinklage have given a nice performance. So The casting was good, but they all did not get the good script or the role. I did not enjoy it means not that I won't recommend it. It did not work for me, but it might to you, so I advise be carefully while choosing it.\n\n3/10"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "kosmasp",
        "review_rating": "5",
        "review_title": "The Intern",
        "review_detailed_main": "The movie has some really funny scenes and if you like McCarthy you may rate this higher. She and Bell are a good team, but you may feel that the sparks are not really visible. The movie flows along nicely and there is enough profanity and everything else one could ask for from a \"grown-up\" comedy movie.\n\nBut is it enough? The answer will probably be no. And that is not to say that you won't enjoy many of the things on display here. There is a love hate relationship at almost every corner and they all kind of make sense. One of the discoveries of the movie is the kid actor though. The casting department did a good job there. Not much more to enjoy though ..."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "putnamdavis",
        "review_rating": "8",
        "review_title": "People, lighten up!",
        "review_detailed_main": "This film is hilarious. It's not written to be Oscar-worthy, it's meant to be Slapstick funny. Not supposed to be serious so people should lighten up."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "Prismark10",
        "review_rating": "3",
        "review_title": "Girl Scout cookies",
        "review_detailed_main": "Co-written by McCarthy and her husband as well as directed by her husband I can only conclude that Ben Falcone does not know of his wife's comedy strength, then again neither does McCarthy.\n\nIn The Boss McCarthy plays Michelle Darnell, a go getting brash businesswoman who fell from the top and jailed for insider trading. Upon her release Darnell moves into the home of her put upon former Personal Assistant Claire (Kristen Bell) and her daughter Rachel (Ella Anderson) and end up masterminding a campaign to sell girl scout cookies. This puts them into conflict with a rival girl scout group and a former bitter rival comes back on the scene Renault (Peter Dinklage) who wishes to destroy her for once and for all.\n\nMcCarthy looks weird with a collection of turtlenecks that makes you think that there is something wrong with her neck. The film should had aimed for some kind of School of Rock vibe but McCarthy constantly curses around the kids, is mean spirited and shows little empathy even though at the beginning we see her as a child rejected by various foster parents. There are some bright moments with some decent knockabout comedy when McCarthy's girl scouts tussle with the rivals but the film is too unfocused and meanders all over the place."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "gamerboy-955-685002",
        "review_rating": "10",
        "review_title": "Pure comedy!",
        "review_detailed_main": "Michelle Darnell- An extremely wealthy and rich and successful businesswoman goes into jail for insider trading, and comes back and attempts to regain her reputation. The plot seems simple, but when you witness it it's pure comedy that made me laugh countless times. Unless you don't have a sense or humor or hate dirty jokes, than I don't think you might like this movie.\n\nMelissa McCarthy, Peter Drinkalge and Kristen Bell as the lead roles, I think they did a very wonderful job and served super acting, especially from Drinklage. Ignore the other user reviews, they honestly have no sense of humor not to enjoy a film like this.\n\nBig thumbs up for this movie and the actors! Hopefully we would get a sequel one day too."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "welovetodance",
        "review_rating": "8",
        "review_title": "Hilarious!",
        "review_detailed_main": "I don't know what the bloody hell is wrong with people. This film wasn't created to challenge morals or for children's entertainment.\n\nIt's an adult COMEDY movie. Of course it's going to be crude and silly, that's the point. To transport us our of our lives for an hour and a half. It's fun and has a totally new and random storyline.\n\nI'm sick of the same old romcoms which contain 0 comedy apart from a white middle aged ignorant a*shole wearing a funny cap and miss pronouncing words... the acting is good, the action is good and the writing is good.\n\nEnjoy!"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "annnonymous289",
        "review_rating": "10",
        "review_title": "Love this movie!",
        "review_detailed_main": "Melissa McCarthy and Kristen Bell are great in this flick. They make a really good comedy team. Of course, the cameo by Kathy Bates was awesome. She really is so versatile. The movie is funny, period. If you're not into raunchy comedies why would you even watch a Melissa McCarthy movie? I think the premise of the flick was pretty believable behind all the jokes. Takes real work to start a business, and it takes real work to work through trauma that makes you build up walls. I love that most Melissa McCarthy movies have some little life lesson in them. Even if they do get wrapped up in \"vulgar\" jokes. I have watches this flick multiple times, and will watch it again."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "Database_Man",
        "review_rating": "10",
        "review_title": "A nice comedy",
        "review_detailed_main": "Just a nice comedy for a good laugh.\n\nThe absurdity of known things shown certain scenes is remarkable. Brilliant sarcasm is entertaining."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "mikestarr-92388",
        "review_rating": "8",
        "review_title": "A hilariously good time",
        "review_detailed_main": "I don't understand all the hate surrounding this movie! The Boss is absolutely hilarious and a true gem in the world of comedy. Melissa McCarthy once again proves she's a comedic powerhouse, delivering a performance that had me laughing from start to finish. The way she embodies her character is simply brilliant, with impeccable timing and a flair for physical comedy that makes every scene a joy to watch.\n\nIf you enjoyed her performances in Spy and The Heat, you'll definitely love her in this giggle-fest. The chemistry between the cast is fantastic, and the witty, sharp script adds layers of humor that keep you engaged throughout. Each supporting character brings their own unique charm to the film, making it an ensemble worth watching.\n\nThe storyline, while lighthearted and fun, also carries a message about resilience and redemption, which adds a bit of depth to the laughter. The movie combines slapstick humor with clever dialogue, resulting in a film that is both entertaining and uplifting.\n\nDon't let the critics sway you-give The Boss a chance, and you'll find yourself in stitches. It's a feel-good movie that's perfect for lifting your spirits and providing a much-needed dose of laughter. Highly recommended for anyone looking for a fun and hilarious comedy!"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "jezzalinko_star",
        "review_rating": "9",
        "review_title": "Don't Listen To Other Reviews... Unless You're Looking For A Decent Plot",
        "review_detailed_main": "This film had me and my friends laughing several times throughout!!! Other reviewers comment on the fact that there was simply no humour, but some jokes just aren't funny to others which is of course understandable. McCarthy strikes back by doing what she does best, and that's making us laugh! This comedy will make you look like an absolute fool in front of others in the cinema - that is, because you will be laughing so hard! Funny characters, hilarious jokes and bizarre scenarios all combine to make a very enjoyable film. Don't expect a clever plot or engaging story because this is meant to be FUNNY and I can assure you that it exceeds that label! Highly recommended!"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "hjsblossom",
        "review_rating": "9",
        "review_title": "What is wrong with you people? It is funny!",
        "review_detailed_main": "OK, i have looked back at all the reviews and interestingly enough 70% of the negative reviews seems to be left by the male population. Just saying....\n\nAnyway. Yes, there are curse words, there are cartoon-sh fights, the unsettling \"children of the corn\" battle. But i think this all together makes a great comedy. I think Hollywood needs to toughen up a little in the sterile and boring world of political correctness. We are not watching \"House on a prairie\" here. I mean, there is nothing wrong with the \"House...\", but this is Melissa McCarthy comedy. Delivered as advertised.\n\nTo be honest, i loved the speech in the beginning. Very empowering. Is that what have scared the male population? And i am not feminist in case you are wondering."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "lee_eisenberg",
        "review_rating": "8",
        "review_title": "business is business, and business must progress",
        "review_detailed_main": "\"The Boss\" is one of those movies that you can only enjoy if you accept low, in-your-face humor. Melissa McCarthy is all about said humor, and her character here is no exception. Part of the movie's aim is to show the contrast between McCarthy's brash, crude-mannered former magnate, and Kristen Bell's uptight former employee, with McCarthy trying to launch a new business and hire Bell. There's no shortage of talk about sexual organs, and McCarthy's abrasive character even upsets a Girl Scouts-like organization. I suspect that they had fun filming it. Even if you think that it gets too over-the-top at times (such as the tanning scene or the plan of what to do with the guard), you gotta love McCarthy's character's outrageousness."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "noellecm",
        "review_rating": "10",
        "review_title": "Melissa McCarthy brings physical comedy to a new golden age in The Boss",
        "review_detailed_main": "Channeling a combination of Lucille Ball and Jerry Lewis, Melissa ushers physical comedy to a whole new level. The movie starts with a little history of Michelle Darnell's troubled childhood, being rejected from family after family. As she grows up, Michelle becomes overly self-reliant, deciding to make it in the world as independently as possible. That independence comes at a cost. Will Michelle grow a conscious or continue her corporate climb, stepping on as many heads needed to make it back to the top? You have to see The Boss to find out!\n\nIt is a hilarious movie watching Michelle Darnell transform from a despicable tyrant to a heart-warming character that you ultimately root for. Kristin Bell plays the Dean Martin straight man to Melissa McCarthy's Jerry Lewis. Peter Dinklage is pure icing on the cake with expertly delivered lines and evolving hairstyle.\n\nThe kids in the movie are the real winners here. Ella and Eva steal every scene they are in, and the West Side Story rumble on the block is half kid Braveheart and half sugar- cookie filled insanity.\n\nIs this a high-brow, erudite comedy? Newp! This is the heart-warming, trash-talking, hair scalping comedy that will keep you in a silly mood for days! If you need a pick-me-up after a long work week, this is the comedy that will have you seeking out brownies, itching for an old-fashioned street fight, and motivate you to finally ask for that raise. Now go see it!"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "jiffyxpop",
        "review_rating": "10",
        "review_title": "Pretty Funny",
        "review_detailed_main": "I don't know what's happened since 2005, but all the highly rated movies I see are always bad, and movies like this, which are actually extremely funny, are rated poorly. Loved the characters, Peter Dinklage's acting was terrific, and the whole scenario was hilarious. Don't understand the negative ratings AT ALL."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "freedomisfromtruth",
        "review_rating": "10",
        "review_title": "This is funny",
        "review_detailed_main": "Reviews that didn't find it funny, are not human, lot funnier towards the end where there was lot of laughter. Sure there some words in front of kids, but maybe that was dubbed in, more realistically, despite how you think your kids are sheltered, they use those words more then adults, so stop living in denial. There was some serious scenes that didn't pan out, but all the goofy scenes hit the spot. McCarthy still can be funny whatever role she plays. From Plainfield IL to Hollywood must not have been easy, but to still be able to pull it off, great. Made our day, my wife had to muffle her laughter with her coat so as to not disturb everyone, who also was laughing in the lady to lady adjustment scene."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "DarkVulcan29",
        "review_rating": "8",
        "review_title": "Entertaining Melissa McCarthy film",
        "review_detailed_main": "Michelle Darnell(Melissa McCarthy) a billionaire, who suddenly loses her fortune, and is sent to prison for insider trading. After five months she is released, ends up staying with her former employee(Kristen Bell) who is also a single parent. But finds a way to build things back up, with a brownie empire.\n\nMelissa McCarthy really jumps out the screen to you, even if the movie is bad, Melissa McCarthy always find a way to make it interesting. Her husband Ben Falcone directs it, and also co wrote it with McCarthy. Melissa McCarthy is really funny here, playing a hateful character you can not help but really like. She and Kristen Bell play off each other with such perfection. Peter Dinklage is also quite the scene stealer, when he is on camera, he goes for the moment each time. This is not for everybody, It's not all family oriented, but not overly raunchy either, I mean it comes but never hangs on for too long."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "bobannen-52748",
        "review_rating": "8",
        "review_title": "Surprised so many people don't like this movie",
        "review_detailed_main": "I was surprised to read so many negative reviews about this movie. I just got back from the movie theatre with a group of 6 people and while some of us found it funnier then others, we all enjoyed it. When the movie first started we all thought it looked like it was going to be cheesy but within the first 10 minutes all of us were giggling or outright laughing (and continued to laugh throughout the movie). Everyone else in the theatre seemed to me laughing too! The premise behind the story is unrealistic but that is part of what made the movie so funny for me and the group I was with. This was one of the only comedy movies that has made me laugh out loud in a while."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "ghatfield69",
        "review_rating": "8",
        "review_title": "Movie was Good!",
        "review_detailed_main": "Saw it last night and didn't expect too much from all the bad reviews. Found myself laughing a lot. This is one of her best movies. Glad it was R rated and raunchy! This is a comedy not an academy award winner! Ton of funny scenes! The fight scene between the two girl scout troops was great. Plot worked simple and made the movie a fun ride. Most comedies get panned by critics. little Peter D was great as usual! People are a little to hard on this movie, There's been a lot worse, a lot worse! Mellissa is a funny lady and I enjoy her timing and her physical comedy. Chicago was a great city for this movie to be based on."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "whitneyassoc",
        "review_rating": "8",
        "review_title": "Not for Kids but great Movie",
        "review_detailed_main": "Mellisa McCarthy is hilarious in this movie. It is raunchy humor but if your good with that it is the best. The whole theater was laughing and with a few gasps at some of her references. I and my wife found it very funny. I would highly recommend.\n\na lot of the comments I have seen are likely prudish types who really shouldn't have been in this type of movie in the first place. It follow the \"This is 40\" and the movie with Sandra Bullock. Probably better. I will be seeing it again when it comes out on DVD. Very funny as long as your not looking for too much of a story. Kristen Bell is excellent in it as well as the girl that plays her daughter. Well worth the price of admission."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "kiss_the_pussycats",
        "review_rating": "8",
        "review_title": "That biz partner we all dream of having",
        "review_detailed_main": "Seriously, vulgarity and bad jokes aside, not only do I enjoy Melissa's comedy style, but I love the storyline! Michelle is the motivational, business idea executioner we all wished we had in our lives. Cutting the crap and going straight to business, telling you what you need to do to move forward in life, AND giving you half the proceeds. I mean where do you find these people!! World is filled with too much talking and not enough doing like this story's main protagonist Michelle! I am jealous!! Someone take me out of my office cubicle please!\n\nThe girl power and biatch fights are fun to watch. Chemistry with the ladies \"family\" is touching. Overall very enjoyable!"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "arieldanielsad",
        "review_rating": "8",
        "review_title": "Is it how a Scorpio act?",
        "review_detailed_main": "Haha. Funny movie, love Melissa. Somethings as a Scorpio is on point but not all in this movie is. I like it though because of Melissa! Wanted to speak on the Scorpio description because people really believe what they hear and what others describe...in that case I wonder if my review matters 🤔🤷😄"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "wpirotte",
        "review_rating": "8",
        "review_title": "Redemption is not for everyone",
        "review_detailed_main": "When I saw this on Peacock, I was taken aback by the low tomato ratings. Then I see similar scores here, and even some pretty vicious trashing in the user reviews. So, mes amis, I am kind of puzzled. This movie checks every box in the female empowerment department, only one male is even significant to the story (predictably, not a stereotypical male). We have crassness, tenderness, brains, and the heroine is hardly a barbie doll. So, what gives? There is subtlety and slapstick, there is suffering and joy. TBH, I cannot figure it out. But here's my best: there is not enough despair and the protagonist redeems not only her own selfish life, but overcomes the societal vagaries of fate that justify her selfishness. Is Hope the new enemy?"
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "moviesfilmsreviewsinc",
        "review_rating": "10",
        "review_title": "McCarthy at her Best",
        "review_detailed_main": "The Boss, a comedy starring Melissa McCarthy and directed by her husband, Ben Falcone, is the worst kind of bad movie. It is passively bad, switching gears to no discernible purpose and having things happen that don't constitute \"events\" in any meaningful sense. Throughout its last hour, it keeps jumping into your lap and demanding love without doing anything to earn it. This is the worst kind of bad movie. Melissa McCarthy plays a disgraced businesswoman trying to re-invent herself in \"The Boss\". She is a brilliant physical comic, in a particular mode of id-monster, reptilian brain clowning. She is the kind of actor who can crash through a wall spouting gibberish and make you believe that it's something that a person might actually do. She shines when disrupting order, but here she's mostly begging for love. She's the kind of actor who can crash through a wall spouting gibberish and make you believe that it's something that a person might actually do. McCarthy's character in \"The Boss\" is a self-help guru and businesswoman who was raised in an orphanage. The movie drains her of any distinguishing characteristics save poor impulse control and pathological neediness. When the neediness overwhelms everything else, the effect is off-putting and depressing, and there are no compensatory virtues (brilliantly staged slapstick). McCarthy's other star vehicles have had a bit of this \"please love me\" thing, but in general, the less obvious her films go to that well, the more focused and entertaining they are. The Boss is a movie that constantly shifts in tone, with McCarthy's Darnell being a complete dolt in the Will Ferrell/Zach Galifianakis vein, but then snapping back to present her as a business genius and a warm auntie to Claire and Claire's daughter. It is not that The Boss wants to explore the psyche of a capitalist savant, but it is ready, willing and able to ditch all story momentum in pursuit of a cheap joke. The film is sloppily patched together with endless shots of Chicago streetscapes set to bland music. Director Ben Falcone is actually McCarthy's husband, and if they want to continue to collaborate on projects, they should limit themselves to putting on plays in their backyard for friends and family. Darnell is released from prison and ends up in Claire's walk-up apartment. The Boss is going for a Great McGinty-esque redemption story, but it takes 40 minutes for the first scene with any real laughs. Melissa McCarthy's character is obnoxious and bull-in-the-china shop, but she still manages to make her likable. The Boss is trying to create a Great McGinty-esque redemption story, but it takes 40 minutes for the first scene with any real laughs. McCarthy can sell the Bill Murray-esque obnoxious bull-in-the-china shop character and still make her likable, but to watch her flounder with such poor material is humiliating for all involved."
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "bcnkor",
        "review_rating": "10",
        "review_title": "The best Melissa McCarthy performance of her career",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2702724",
        "movie_name": "The Boss",
        "movie_rating": "5.4",
        "review_username": "mikemcmillan2002",
        "review_rating": "8",
        "review_title": "A DEPARTURE FROM HER USUAL STUFF, AND STILL FUNNY",
        "review_detailed_main": "A DEPARTURE FROM HER USUAL STUFF, AND STILL FUNNY."
    }
]