[
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "PhilmGuru",
        "review_rating": "6",
        "review_title": "So many people have missed the point",
        "review_detailed_main": "Anyone who has seen this movie and commented on it as a serious action film should be shot.\n\nFrom the very start it is fairly obvious it crosses the cheese line into a parody. From the totally pointless/unrelated cheesy opening scene of HF on a shooting range, the lake chase scene, the whole buddy buddy chemistry (or total deliberate lack thereof) to the non stop annoying phone ringing or maybe the complete lack of an interesting plot? Some of these should have given away to most people the real intentions of this film.\n\nThe 'love' scene with Harrison Ford should be the last clue to anyone blind enough, that this is really not to be taken seriously and can be considered made specially for Mystery Science Theatre.\n\nThe film is called 'Hollywood Homicide', I believe, so titled as to ruffle some Hollywood feathers with the notion that Hollywood has been killed by the never ending rain of terrible buddy cop movies. The real joke is that some suit somewhere probably OK'd this as a real action movie.\n\nIn fact, the funniest thing is that some people took it seriously and enjoyed it as a serious action movie.\n\nThe chases are deliberately over the top lame (I mean really, really bad), the dialogue is so silly and pointless it just makes you laugh, the character development is totally non-existant, the cliches flow non-stop, the whole side plot of internal affairs is placed there because it's in every buddy cop movie, etc, etc. How anyone took this movie as a serious action film is beyond me.\n\nI give it 6/10 because, it's hilarious in places (in a MST kind of way), I agree with their intentions (THE COP FILMS MUST END!!!). Just please, don't take it anything more than a parody."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "jpschapira",
        "review_rating": "6",
        "review_title": "More unusual than expected",
        "review_detailed_main": "Taking another chance on L.A, on the streets and more specifically on the police, as in \"Dark Blue\", Ron Shelton, a man of multiple themes, brings a new project to the table, which is called \"Hollywood Homicide\". The difference between this one and the latter one is that this is Hollywood, precisely. And when the beginning credits roll, and we're shown fifty \"Hollywood\" signs; it's obvious that they want us to realize that. Why would it be?\n\nThe story about Ron Shelton meeting Robert Souza in the set of \"Dark Blue\" and them both getting together to write the script of \"Hollywood Homicide\", because Souza had been a cop before\u0085Interesting. However, in the same vein, \"Dark Blue\" is the portrait of a cruel reality; \"Hollywood Homicide\" is the satire of a shallow but real reality in the end. It's Hollywood, and it was a good premise to put some fun in the crime scenes, probably to make it \"more dramatic than anything seen in Hollywood\".\n\nThe other elements the plot offers go from action to crime, or vice versa. They created the murderer of a rap band, so they could mess a little bit with the music business, too. There we see the producers, the groups, the \"showbiz\"\u0085It's even related with theater and movies, because one of the main characters wants to be an actor; and in a decent comedic way, he's thinking about acting each time he's doing something; and he probably isn't that good.\n\nI'm talking about K.C Calden; Josh Hartnett's character. He gives classes of movements to find the inner self. There, a lot of hot women assist and kiss him when they leave. In one scene, his partner tells him that he did for sex. \"At first it was for sex, now it has become something spiritual\", K.C answers, and at night, a hot woman is waiting for him in the \"Jacuzzi\". \"How long has it been since the last time you got laid\", K.C asks his partner. \"It's not your business\", the partner says. Then, he lets a man working as a prostitute into his car. When they discuss that, he says: \"It was nothing, it was a man, a cop; a cop man\".\n\nThis partner is Joe Gavilan, a pro in the police business played by a pro in the acting business. As he did with Kurt Russell in \"Dark Blue\", Shelton brings Harrison Ford back to the top of his game. With his character, based on writer Robert Souzas's own life, he has the best lines and he has a lot of fun. Antoine Sartain (Isaiah Washington) should be afraid of him; a man that has had sex, with Ruby (an over the top Lena Olin) and makes real estate business with producer Jerry Duran (the great Martin Landau) and Julius Armas (a correct Master P) while he's driving a car high speed. When he is told the composer of the rap group is still alive, he replies: \"Somebody actually writes that s***?\". He has had bad times, Bennie Macko (Bruce Greenwood) wants to get him, and in the best scene of the movie, he and K.C get interrogated. This scene is managed with camera changes between the two interrogating rooms, where in Joe's, his cell is always ringing; and in K.C's, he is \"centering\" himself spiritually. Joe's interrogator can't do anything, while K.C's interrogator (a woman) asks him to help her relax.\n\nThat scene stole the only laughs from me during the entire film. Keith David was also having fun in his Leo role, reprising some of the comic elements he gave to Lester Wallace in \"Barbershop\". More importantly, and if you were wondering, Shelton directs his actors perfectly, making a stupendous balance between the pro and the amateur, the old and the young; Harrison Ford and Josh Hartnett. Their chemistry is perfect, and one of the few reasons to watch the movie. In the end, their characters are nothing else but cops, in a film that leaves a lot of plot situations unresolved, is a bit long, not funny enough, but different from the gross humor that everyone finds easy to put on paper."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "lawprof",
        "review_rating": "6",
        "review_title": "Much Needed Good P.R. for the LAPD",
        "review_detailed_main": "No urban police department is free of episodic troubles but the LAPD has a case as chronic as smokers' cough. Good cops, bad cops and villains with SOCAL written all over their faces and inflected in every line.\n\nBut, hey, it's summer and Harrison Ford and Josh Hartnett deliver some good laughs and a pretty hot high speed smash 'em up chase through Hollywood in this cop/buddies film.\n\nThe genre is pretty familiar to all. Very formulaic. You get a wiser older cop with flaws and/or attitude and a young acolyte with flaws and/or attitude. The novelty here is that while many cops moonlight to pay their bills, Ford's a detective who doesn't let hot police work interfere with his on and off real estate brokerage business. With incessant calls for his private business on a cell phone that rings with \"My Girl,\" Ford delivers a good performance with wry humor and a surprising degree of athleticism (he's sixty but you'd never know it).\n\nJosh Hartnett, as the very junior homicide investigator, also has a sideline, actually two. He earnestly pursues an acting career while running a meditation mill for lissome young lovelies who, predictably, fall into his arms and bed. But he's a good cop.\n\nThe actual homicide story is instantly familiar and its development devoid of surprises. So what? It's summer! I can't see art films EVERY day.\n\n6/10. Can't give it more than that but it was entertaining for both me and my teenage son who especially appreciated the urban road rampage."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "DarthBill",
        "review_rating": "",
        "review_title": "Harrison Homicide",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "I_actually_am_sam",
        "review_rating": "1",
        "review_title": "Oh good lord",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "IMDbtop1000",
        "review_rating": "7",
        "review_title": "Better than expected.",
        "review_detailed_main": "I saw this movie as a sneak preview on Monday night. I went into the movie with very low expectations, I wouldn't have even gone if it wasn't for the free ticket. The show did surprisingly deliver many laughs and I will probably be forced into taking a friend or even, god forbid, the wife. Many areas were slow and predictable, but overall it was quite fun. Several sensual scenes involving Harrison Ford actually drew snickers from the crowd. I even overheard a teenage girl say, \"Gross, isn't he like 60!\". I guess the 'Indy' days are over for Ford. The doughnut in one of the more intimate scenes probably drew the biggest laugh of the entire movie and got peoples' minds off the fact the Ford was making out with a lady 14 years younger than him.\n\nAnywho, the rest of the cast was good. Keith David as Lieutenant Fuqua was entertaining. The always surprising and very compelling, Dwight Yoakam was great. Not Sling Blade great, but more like Panic Room great. Josh Hartnett's character was funny in a very whacked out yoga way, but was clearly in the film for folks like the aforementioned wife. Overall good movie, go see it. 7/10."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "senortuffy",
        "review_rating": "4",
        "review_title": "Dreadful buddy film.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "darbruing",
        "review_rating": "7",
        "review_title": "Really enjoyed watching Harrison & Josh",
        "review_detailed_main": "I really enjoyed watching Harrison & Josh acting together. It was a fun, action-packed film with two great hunks! They made it look like they enjoyed filming it too. I always enjoy watching Harrison Ford! The only time he freaked me out was in What Lies Beneath, at the end."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "Rooster99",
        "review_rating": "3",
        "review_title": "Boring, standard, totally unoriginal, not at all funny, falls flat",
        "review_detailed_main": "Lame movie. Completely uninteresting. No chemistry at all between Indiana Jones and the guy from Black Hawk Down. The car chase scene just goes on and on and on ad nauseum. They manage to switch vehicles a few times, but always end up right on the tail of the baddies. The scene where Hartnett grabs the family's car with the crying kids in the back was just as stupid as could be. He is telling them about Eastern philosophy and how it is all right to die, which I imagine the writers thought was funny or even witty. It just came off as moronic, totally unbelievable and even cruel.\n\nSome subplots weren't even explored, they were just used as filler. Why does Hartnett get sick seeing dead bodies yet keeps ordering burgers at crime scenes? Why, and on what grounds, is the bad IA guy suddenly arrested out of the blue by the chief? Why can IA pick up the buddy cops and then just let them answer their phones or pretend to be Indian mystics and then just let them waltz out of there without so much as a slap on the wrist? For some reason, even though Ford is uncovered as a cheat and a fraud when acting as a realtor, (he makes up the prices when he is trying to sell the producer's house to jack up his own commission), they keep coming back to him anyway! They knew he lied to both of them! Yet there they were, coming to terms that both said they would never go for. Stupid, just stupid. This is also one of those cop movies where they just fire wantonly on public streets with no care in the world for innocent bystanders. There they were, just standing on the sidewalk blasting away while people ducked for cover. Amazing that they didn't hit a single person after having fired about 60 rounds each....\n\nThe scriptwriting was terrible, the action sequences were boring, the plot just a sidestory to a very pathetic attempt to have us root for Ford and Hartnett. It fails miserably. And Ford's phone! Turn the damn thing off! How many times could it ring in a 2-hour movie? 50? 60? It was frustratingly aggravating by the midpoint in the movie! Every 30 seconds, that stupid tune would play! And if it wasn't Ford's, then Hartnett's was ringing! It was incredibly annoying!\n\nComplete waste of time, Ford's worst movie since 6 Days 7 Nights, which was without a doubt, the lowest point of his distinguished career."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "bsl05",
        "review_rating": "7",
        "review_title": "better than I thought it would be",
        "review_detailed_main": "A friend of mine rented this movie and I was a little suspect. I remember never thinking much of it, and the horrible memory of Harrison Ford doing that hip-thrusting move in the commercial - noooooo!\n\nBut I will say that I was pleasantly surprised with this movie. It has some genuinely funny parts, and it was also interesting to see who was going to make the next cameo (my favorite being Dre 3000 and his movie \"Nasty\"). My liking of this movie probably has a lot to do with perception - expected crap, but turned out to be OK. I'll give it 7/10."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "lesleyharris30",
        "review_rating": "5",
        "review_title": "Delivers some Laughs and Not Much Else,",
        "review_detailed_main": "Hollywood Homicide is a mediocre movie with an average storyline that I felt had the opportunity of being very different but simply didn't and a cast that could have delivered more.The set up of a buddy cop comedy in LA with Harrison Ford and Josh Hartnett easily could have worked but simply didn't,they completely lacked any necessary chemistry for their parts.I always love seeing Harrison Ford on screen,but was very disappointed by his performance in this,he simply couldn't do comedy,he delivered pretty much every line very poorly and I feel like he slowly lost more and more interest in his role throughout.There were certainly a handful of parts that made me laugh,but there wasn't enough and there was nothing aside from that,the action sequences are unimpressive,and we are never really given any reason to truly care for these characters.It has its moments,but Hollywood Homicide is mostly a poorly written and poorly acted comedy that I would not recommend.\n\nTwo detectives investigate the murder of a popular rap group.\n\nBest Performance: Josh Hartnett Worst Performance: Lena Olin"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "BrandtSponseller",
        "review_rating": "9",
        "review_title": "I finished a painting while writing this review",
        "review_detailed_main": "Joe Gavilan (Harrison Ford) is a seasoned detective. K.C. Calden (Josh Hartnett) is his still wet behind the ears partner. Hollywood Homicide has them trying to balance the investigation of murders involving members of LA's rap industry with unusual extracurricular activities and concerns.\n\nThe most obvious aspects that make the film work so well are the extracurriculars. Without them, this might be seen as just another buddy-cop action/crime/drama--a good one at that, but nothing spectacular. But Hollywood Homicide is a comedy at heart. Gavilan's first concern upon arriving at any crime scene is that he gets some food, just the way he likes it. He's also a real estate agent. While conducting investigations, calls from buyers and sellers of homes always take precedence. Calden is also an aspiring actor, and he's quite a ladies' man. He even makes extra income by running a yoga class--with only women students--at $20 a head. Most of the students want to sleep with him, as do most other women he meets. They get away with it because Gavilan, at least, is also a great detective.\n\nAll of this material is very funny, but never in an over-the-top way. In fact, a lot of viewers might have difficulty \"getting\" the humor in the film, as much of it arrives by way of the action/crime/drama material that is only slightly exaggerated. That's a genre that often borders on the absurd even when it's played seriously. So the tendency may be for people to take this film seriously at times, and miss the gist of the humor.\n\nThe real joke, of course, is that this is Hollywood--a fact made all too clear by director Ron Shelton's title montage of \"Hollywood\" on various signs. In Hollywood, as in LA in general, it seems that everyone has something else that they'd rather be doing than their actual job, so they're all really focusing on that instead, while the day job pays the bills. Everyone is trying to make connections, and they're willing to do all kinds of unusual things to make them. Everyone is constantly on their cell phones. Run-ins with people who have various connections to the entertainment industry are commonplace, and it's not unusual to casually compliment them on their talent or some facet of their career before you, say, run after their offspring with a gun. Criminal activity and other unpleasant facts of daily existence are mostly taken in stride because no one can let such things get in the way of achieving success in what they really want to do.\n\nThat Shelton was able to make a film about \"the real joke\", and still keep a capable \"serious\" action/crime/drama running in the background is the real secret to the film's success. Without looking the broader themes, one might wonder why Harrison Ford would pick a seemingly pedestrian script at this stage of his career. From a deeper perspective, this is a very funny film with a more serious, almost self-deprecating subtext (for Hollywood, or the entertainment industry in general), and with an even more generalized \"the grass is always greener on the other side of the fence\" theme. Hollywood Homicide is well worth a watch or reassessment with this in mind."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "kyle4350",
        "review_rating": "7",
        "review_title": "A Pretty Good Movie",
        "review_detailed_main": "I saw an advanced screening of this movie today, and I have to say it was very entertaining. If you're going to see this movie then don't be in for a lot of thinking, just be in for some fun. There is some good action scenes, and seeing Harrison Ford do somethings against type is worth the price of admission alone.\n\nAnyway, here's the basic plot, two cops played by Ford and Hartnett are assigned a rap murder case in Master P's club. They also have jobs on the side, Ford is a real-estate broker, and Hartnett is an actor/yoga instructor. These both play key roles in the movie, and add some of the comedic flavor. It was good to see Ford go back to having a personality, because it fits this movie. Overall I'd give the movie a 3.5 out of 5 scale, and definently recommend it, because its fun as hell!"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "wheatt",
        "review_rating": "1",
        "review_title": "dreadful",
        "review_detailed_main": "It not a serious crime drama/thriller so it must be a comedy? Hang on though, it's simply not funny or even mildly amusing. It is continually tedious throughout.\n\nWhat is worth mentioning is that the film maker seemed obsessed with the ring tones on the character's mobile phones, to a point where it was just irritating (if you are supposed to turn off your mobile phone during the course of a film, why did the film makers insist on pushing this annoying plot-device on us?).\n\nIt would've been much more interesting if Mr Ford and Mr Barnett were just playing themselves (real actors moonlighting as cops). No explanation needed, it just would have been more watchable.\n\nTiresome."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "gazebo",
        "review_rating": "",
        "review_title": "A very lighthearted action movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "arahman",
        "review_rating": "1",
        "review_title": "Feed Your Cat or Floss Your Teeth",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "Sergeant Hulka",
        "review_rating": "7",
        "review_title": "All I wanted was to have a good time, and I did.",
        "review_detailed_main": "This movie is a lot of fun. Everyone seems to be doggin' this movie, but most negative critiques I've read sound like the person expected \"Hollywood Homicide\" to be bad. The movie has failings to be sure, but I laughed out loud many times and smiled throughout the whole film. All I wanted was to have a good time, and I did."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "bellabutterflye",
        "review_rating": "1",
        "review_title": "Painful to watch",
        "review_detailed_main": "I've seen every movie Harrison Ford has done. I consider him to be in my top 5 of best male contemporary actors. I found this movie however to be so unwatchable, I literally couldn't finish watching it!!! The writing, the dialog, the acting!!!! How could this be? OK, all actors are entitled to a bad film once in a while.\n\nLike many have said the movie comes across as not being sure what genre it is or isn't. The worst part for me was watching Harrison Ford during chase scenes. It looked to me as though his arthritis was acting up. It was so distracting and I was embarrassed for him. I have seen plenty of aging actors take on physical roles that of course they're not as fast or as agile as their younger counterparts, but they didn't move with such rigidity and pain that it became a distraction in itself. YIKES! I understand that his character did real estate on the side. He looked more like an aging real estate agent who was forced into doing something physical that he's not accustomed to doing, like a cop chasing suspects.\n\nJosh Hartnett was also forgettable in this disaster and looked completely bored most of the time. I can't comment on the entire picture, just the part I watched, and that.......was enough."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "joeandjenny86",
        "review_rating": "7",
        "review_title": "Enjoyed the Movie",
        "review_detailed_main": "I went to see Hollywood Homicide in spite of the poor reviews because I wanted to see Harrison in a comedy. He did a great job, much better than Six Days Seven Nights (where he was trapped on the island with Anne Heche). Also, some have said the plot is impossible to follow. This is another of the reasons I decided to go, because often when people state this and give a movie a low rating, they are blaming the movie for their own lack of mental dexterity. The plot was not hard to follow, though it did zip right along. Josh Harnet and Harrison Ford played off of each other well, and their interaction was interesting and funny. I had never seen Josh before, and was impressed. No one will get an academy award, but as a light hearted summer action-comedy, it's a fine way to spend a rainy afternoon. (My 10 year old daughter also liked the movie.)"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "slerner-4",
        "review_rating": "1",
        "review_title": "Harrison Ford starring in a horrid movie? I was shocked too.",
        "review_detailed_main": "This was honestly one of the worst movies I have ever seen. Considering it is starring Harrison Ford, a usually bold and dynamic figure, this movie was truly a surprise--a terrible, terrible surprise. The dialogue hung together about as well as if it had been written the night before at 3am. Actually, if Ford and Hartnett had simply ad-libbed I would wager the result could not have been worse than the final script.\n\nThe sad aspect of this movie is that the fault does not lie fully on the script. The acting from Ford and Hartnett is very poor. Most notably, Ford is completely unbelievable in his attempted \"quirky\" role. This is far from the dynamic, engaging Ford of \"Indiana Jones\" or \"Witness.\"\n\nYou have been warned. Watch this at your own risk. Even if you are watching for laughs I would not recommend this movie. I think the only rational reason to watch this movie is if you wish to knock Ford from his pedestal of perfection down to the cold, hard floor that is Hollywood Homicide."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "drt10",
        "review_rating": "7",
        "review_title": "Formulaic and Daft but very funny",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "dbdumonteil",
        "review_rating": "5",
        "review_title": "a buddy movie...",
        "review_detailed_main": "...like apparently all the ones you could have watched before. This effort cranked out by Ron Shelton rests on basic bases. Two cops from Los Angeles are compelled to work together. There's Joe Gavilan (Harrison Ford), a seasoned policeman who has recourse to unconventional methods to do his job. He has to team up with young Calden (Josh Hartnett). Both of them are involved in an investigation revolving around a series of murders in the world of rap. But in parallel, the former also works as an estate agent to make ends meet while the latter teaches yoga and dreams of becoming an actor...\n\nAmerican cinema has already offered us products boasting two mismatched cops who are compelled to work together to solve a murder or to clarify a judicial affair like \"48 Hours\" (1982) or \"the Lethal Weapon\" saga. \"Hollywood Homicide\" finds itself deeply rooted in this tradition with the portraits of the two men I described earlier. But it is different from the other buddy movies because the viewer discovers another face of the American police. Some members are obliged to occupy a second job to provide for their needs. Thanks to this, Shelton renews a little the genre his flick belongs to with the contribution of Robert Souza who was a former cop.\n\nThe director turned to this perspective with a playful eye and thus his film has strong comedy accents. Is it enough to ensure the vision of the film? Well, Shelton's venture and his intentions are rather commendable but they amount to a lame movie. It oscillates nearly all the time between comedy of manners and detective film and has trouble to keep a unity and a stable pace. It is at times monotonous especially in the first half and it sometimes takes a boisterous turn. Shelton also obviously tried to bestow his work with an action-packed side in his story, notably with an endless chase in the second hour; first in car then on foot which throws the film off balance. The options chosen by Shelton to showcase the two heroes' private lives also get the film embroiled in shallow subplots. Then as the film boasts two stars, Shelton and Souza seemed to proportion correctly Ford and Hartnett's roles so that each of them could have equal parts on the screen. You can check this remark throughout the film by the numerous signs or clues related to the respective lives of our duo.\n\nIf this film had been more tightened and fluid, it could have been the perfect contender to completely transcend and renew the buddy movie."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "a_mcness",
        "review_rating": "9",
        "review_title": "A breezy, colourful and very underrated comedy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "bkoganbing",
        "review_rating": "6",
        "review_title": "Rap Homicide",
        "review_detailed_main": "It's Hollywood of the present day and a couple of guys come into a club with Uzis and start shooting it up. Several members of a rap group are slain. As this is a world that doesn't open up to law enforcement in general, solving this massacre is going to be tough.\n\nBut put on this Hollywood Homicide are a pair of detective partners of different generations both of whom have different other life careers. Harrison Ford has delved deeply into those get rich quick real estate schemes you see on infomercial television. He's got himself a $700,000.00 lemon on his hands right now and even LAPD's Internal Affairs is looking into him.\n\nAs for young Josh Hartnett, son of a cop killed in the line of duty, he'd really like to be an actor. He's also into new wave type religion that really drives Internal Affairs nuts when he's questioned.\n\nThe club owner Isaiah Washington who employs some LAPD cops as his security is not terribly cooperative, maybe preferring to deal with it in house in every sense of the word. It's not going to be easy for Ford and Hartnett who seem to be dealing with all of this in their spare time.\n\nIt's all the usual kind of stuff you expect in modern police comedies or dramas and this is a bit of both. I'd like to single out soul singer Gladys Knight who plays the mother of a survivor who does in fact put Hartnett and Ford on the right track. And his fans will be somewhat taken aback by Lou Diamond Phillips who has a cameo appearance as an undercover detective in full drag. Make up and wardrobe really did right by Lou.\n\nFans of the two lead actors should enjoy Hollywood Homicide."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "MarshMelody",
        "review_rating": "5",
        "review_title": "Fails as both a comedy and crime thriller. Not the worst thing, but it's just \"eh\".",
        "review_detailed_main": "I like crime thrillers. It's one of my favorite genres, though I haven't seen many good ones in the medium of film. Most of the time, I'm reading them, like some of Kellerman's or Grisham's. Most movie crime thrillers just seem to fizzle out, though there are some classics, if they tend to be critically panned. Yesterday, I watched Hollywood Homicide on Netflix and finished with mixed feelings.\n\nIt promises to be both a comedy and a crime thriller, and it fails at both. There's maybe one point where I genuinely laughed because something funny happened, and about ten times where I just shook my head at the failed attempts at humor. The crime thriller aspect is ruined because there is literally zero mystery after about 10 minutes of the film when they literally show you who's the bad guy. Wow, you literally took away the entire point of crime thrillers: figuring out who done it and why. And the execution of telling you this is poor at best.\n\nThe action is few and far between and isn't very well executed. The acting isn't all that great. It does have Harrison Ford as the leading character, but nor are there any other memorable names or does he do a great job himself. The characters are either bland or unlikeable. Harrison's is the best, and shows signs of potential. The dialogue is meh. There's some good stuff, iffy stuff, and deplorable stuff. There's even an uncomfortable and unnecessary sex scene (though it doesn't show anything, thankfully).\n\nSo I wanted to like it, but the only piece of comedy comes in the first ten minutes, and the failed crime aspect kind of ruin this film. However, it does entertain for the rest of the film and didn't make me cringe much outside of the few failed attempts of humor. So it's not the worst thing, but it's a failed attempt at best. Hollywood Homicide gets a 5/10. Had it succeeded in either aspect it promises, it could've been a great film, but it just isn't great. It isn't good. It isn't decent. And it isn't even mediocre."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "sallyfifth",
        "review_rating": "",
        "review_title": "Difficult for Narrow Minds",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "Mr_Sensitive",
        "review_rating": "1",
        "review_title": "Total Mess-Up Of Everything = Worst Movie Ever Made.",
        "review_detailed_main": "Couple of years ago I watch one of the worst movie ever made called The Sweetest Thing, it got big stars, and big production behind it. I though there can't be any thing worst than that, until I saw this movie, also with biggest stars and big picture = Shittiest movie ever.\n\nThere no words, or sentence how mess up the script is. The characters have no character at all, so the writer made him a part time yoga instructor and an actor wannabe, and as Harrison as the struggling real estate commission. And that suppose to be funny?\n\nThere are no story or plots or anything here, just a pile of sh*t. Everything about this movie is beyond bad or worst (especially the script), except maybe the used of the Josh Hartnett in the movie and the way they present the credits at the start.\n\nRecommendation: I'll give it 1/10, just for Josh.\n\nRating: 1/10 (Grade: F-)"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "slightlymad22",
        "review_rating": "6",
        "review_title": "Routine Buddy Cop Movie",
        "review_detailed_main": "It's not hard to see what attracted Harrison Ford to Hollywood Homicide, buddy cop movies if done well are usually successful, Josh Hartnett was on a role after 'Pearl Harbour', 'Black Hawk Down' and '40 days and 40 nights'. While Ford's last effort 'K-19 Widdowmaker' had flopped massively grossing only $65 million dollars World Wide off a $100 million dollar budget. You had to go back to the Robert Zemekis directed 'What Lies Beneath' with Michelle Pfeiffer in 2000 for his last hit. And in Hollywood 3 years can be a lifetime.\n\nThe plot, which was ridiculous to follow at times. Two LAPD detectives played by Harrison Ford and Josh Hartnett investigate the murder of an up and coming rap band. In his spare time Ford moonlights as an real estate agent, Hartnett as a yoga instructor, but he really wants to be an actor, an spends a lot of time reciting 'A Streetcar Named Desire'\n\nThere are scenes of action, car chases (more like Smokey & The Bandit than Bullit) chases on foot and shoot outs. In between there was loving making and some sentimental soul searching before the predictable finale\n\nLou Diamond Phillips pops up, as does Martin Landau, Eric Idle Smokey Robinson, Robert Wagner and Gladys Knight.\n\nFord remains watchable, as always, but these are not two of his better hours."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "FiendishDramaturgy",
        "review_rating": "2",
        "review_title": "Obvious, blatant info-mercial for Indiana Jones 4!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "wingedheartart",
        "review_rating": "7",
        "review_title": "Worth watching.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "AaronBrungardt",
        "review_rating": "2",
        "review_title": "I sure hope everyone got paid up front...",
        "review_detailed_main": "because this movie was terrible. First of all, musicians or pseudomusicians (rappers) should never be cast in movies (with the exception of Mos Def). Secondly, is this movie a comedy or an action movie? The action isn't suspenseful and the comedy is rarely funny (exceptions Hartnett driving the minivan & Ford's lude gesture in the interrogation scene). Thirdly, Isaiah Washington is not a good actor (time to find a new career buddy, sorry). Fourthly (if that's even a word), there is a point where the number of unusual characters gets annoying. In Hollywood Homicides case, about 20 minutes in. Fifthly, when in the history of detectives or cop movies is the Captain only referred to by first name both in the dialogue and the credits? Never; there must be a reason for this. Sixthly, not every character needs a love interest. This movie may have actually been better had Harrison Ford not had a \"ladyfriend\". Seventhly, in what universe can a cop fire his weapon at a vehicle in public without an investigation? Apparently in Sheltonland. Eigthly and finally, with a former detective as co-writer and advisor all previously said mistakes in realism should be nonexistant. Therefore, if you wish to see a buddy/cop movie that is both funny and action packed rent Lethal Weapon 1,3, or 4. These were and are how it's supposed to be done. Hollywood Homicide: 2 stars out of 10."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "mozli",
        "review_rating": "7",
        "review_title": "Atypical Harrison Ford outing that works for me",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "neardarkp",
        "review_rating": "1",
        "review_title": "Ford is slipping!",
        "review_detailed_main": "There are a few actors such as Hackman, Deniro, Pacino and Ford whom i would take a chance renting or seeing a film without prior knowledge, this is because i like these guys, they can carry a film well and apart from the odd glitch they also choose good projects to be associated with. So although i had not heard of \"Hollywood Homicide\" i decided to give it a try on the strength of Ford, thinking that at the very worst it would be watchable. I was wrong - very wrong! This movie has no sense of pace, we are left not really caring about the crime that has been committed or who did it, the action sequences are completely out of place and look like they were thrown in last minute to juice things up! In short Ford you just left the category of rent regardless and went to the approach with caution list :("
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "KEVIN9197",
        "review_rating": "10",
        "review_title": "ANOTHER EXCELLENT FORD MOVIE.",
        "review_detailed_main": "Once again this movie shows you can give an audience a good movie, but you can't make them watch. This is an excellent buddy cop movie, with lots of action and a good plot, it won't win Oscars for story telling but it's interesting. Ford and Hartnett give great performances and of course everyone is too wrapped up in that green CGI crap to even notice. Trust me, if there are any adults out there who are looking for an exciting and funny time at the movies, you should ignore the giant green chunk of CGI cheese and see this movie instead. It's the best movie you haven't seen."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "Robert_duder",
        "review_rating": "6",
        "review_title": "Disappointing mess of writing disaster!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "Qirexian",
        "review_rating": "2",
        "review_title": "Hollywood Suicide (containing a few spoilers...)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "Herag",
        "review_rating": "",
        "review_title": "Funny movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "RightOnDaddio",
        "review_rating": "3",
        "review_title": "2023. A Gen-X Review of a Decades Old Film That I've Never, Ever Seen Before",
        "review_detailed_main": "Man, is this movie bad. It really bores you to tears. It's tough to watch such talent get wasted on the screen and even behind the camera. Wow. It really is astounding.\n\nThis is a film that proves the actor or talent is only as good as what's on the printed page no matter how fantastic or legendary of a performer they are.\n\nThis movie doesn't know what it wants to be and it's confusing and not at all fun to watch.\n\nIs it a comedy?\n\nWell, it'd have to be funny to accomplish that feat.\n\nIs it an action film?\n\nIt'd have to excite the senses. It does not. It does the opposite. It dulls them.\n\nIt's hard to believe watching this that Harrison Ford had two more Indiana Jones movies even left in him.\n\nThis isn't noir, either.\n\nIt's not gritty or dark. It's quite bright actually.\n\nFord looks completely uncomfortable the entire movie. He and Hartnett have no chemistry.\n\nIt's best to leave this case unsolved."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "FlashCallahan",
        "review_rating": "6",
        "review_title": "Don't call me sir, I work for a living....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "refinedsugar",
        "review_rating": "5",
        "review_title": "Stuffed Like A Turkey At Thanksgiving",
        "review_detailed_main": "Wrap your head around why this film cost 75 mil to make and you get an idea about it's issues. It's bloated. Best thing about 'Hollywood Homicide' is the pairing of Ford & Harnett. They are a lot of fun and have good on-screen chemistry which is odd to say when you learn after the fact they heavily disliked working with each other.\n\nFour members of a popular rap group are brutally gunned down while performing in a nightclub. Sgt. Joe Gavilan (Harrison Ford) and his younger, less experienced partner K. C. Calden (Josh Harnett) are assigned the case. Joe moonlights as a real estate agent and K. C. is an aspiring actor and somewhat of a womanizer.\n\nThere's bits involving a physic, the slimy head of a record label, his dirtbag head of security amongst shootouts & chase scenes delivering the required action. The trope about new partners bonding and some tacked on backstory about a cop father who was gunned down in the line of duty. Plus an additional antagonist in a IA lieutenant. There's a ton of known faces filling out the cast. As is typical of director Ron Shelton, his actress wife Lolita Davidovich has a role.\n\n'Hollywood Homicide' commits the ultimate deadly sin of a comedy - it isn't consistently funny. The action is rather pedestrian too. I liked the buddy cop pairing found here, but a lot of the best parts made it's way into a good trailer with a better tone than the actual movie. This is fairly average all things said and done."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "whpratt1",
        "review_rating": "6",
        "review_title": "Harrison Ford can Even Do Comedy Roles",
        "review_detailed_main": "Enjoy Harrison Ford and I know it is not easy to do comedy roles and at the same time try to make his role as a detective serious and convincing. Ford played Joe Gavilan,\"Randowm Hearts\",99, a cop who also sold real estate and had a hard time trying to pay off three wives and plenty of debt. However, his partner was Josh Hartnett,(K.C. Calden), \"Sin City\",05, who was not certain if he wanted to be a cop like his dad or give Yoga lessons to a class of red hot great looking gals, who loved to meet him in hot tubs. Joe & K C made a good team and managed to step on each others toes, but they still managed to hold onto their jobs. It is not the greatest of films and lots of money was spent in producing it, but it clearly shows what great talents Harrison & Hartnett have to offer their fans."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "zabihah",
        "review_rating": "2",
        "review_title": "Steaming Heap of Dung.",
        "review_detailed_main": "Unlikable characters+unintelligible plot=unwatchable movie. Talk about waste, not just waste like something your dog digested and deposited on your back porch, but also such a waste of talent. Hartnett, Lena Olin, Ford, Sam Neill, Martin Landau, Andre 3000 from Outkast, even a brief cameo by Eric Idle! Many gratuitous yet very carefully filmed love scenes to not show nudity to get the PG-13 rating. They should have left it in so at least you would have something to watch!\n\nI gave it a two for effort because the director tried to do some sort of Robert Altman-style self-reflexive movie by Hollywood about Hollywood. But he bit off more than he could chew and the forced in-jokes fell flat.\n\nI was surprised Ford denounced this movie saying that he knew it was bad and just did it for the money. Now I understand why he said it."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "Panterken",
        "review_rating": "6",
        "review_title": "Featherlight action-comedy that has the feel of an early nineties buddy-cop movie.",
        "review_detailed_main": "I've always had a weakness for the Lethal Weapon movies and this reminded me a lot of them. The chemistry wasn't quite what it should be in a buddy-cop movie but Harrison Ford presence made up for that. As always, he was a delight to watch...Hartnett, however,was diminished to a talking prop...\n\nOf course it was no where near as good as the movies it pays homage to, but fans of the genre will enjoy it non the less. It's a fun movie and that's really all it needs to be. I'm not really a fan of the over-the-top humor that seems to rule the comedy films these days, so this kind of humor really surprised and delighted me...\n\nI can guarantee you a good time if you liked Bad Boys, Lethal Weapon, 48 hours etc.\n\n6.4/10"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "MovieKitty11",
        "review_rating": "5",
        "review_title": "Not particularly great, mediocre at best",
        "review_detailed_main": "Harrison Ford was just ok in the movie, and the younger Josh Hartnett was cute back then who played a yoga instructor part time and a player sleeping with many women aside from being a cop. I expected the movie to have better music especially the story is about rappers in a club being murdered and these cops try to catch murders. There are some good car chase scenes and light hearted comedy scenes, but they are not really funny enough and car chase scenes are not good enough like other movies. There are not eye catching cute guys aside from Josh Hartnett and I did not find Harrison Ford to be attractive in the movie nor suited for the role. Mediocre movie that took me several sittings to complete as the story is uninteresting and actors/actresses not that appealing. I would spend my time watching another better movie if I knew it would be this boring. Lame story line also. Not recommended."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "taurwen",
        "review_rating": "9",
        "review_title": "Sarcastically funny portrayal of CA life...",
        "review_detailed_main": "I guess I can understand why most reviews of this movie have been negative (it was a very unusual film for the action or comedy genre), but I personally enjoyed it a lot more than many recent \"better\" movies. The characters are such charicatures of people I feel I've brushed elbows with in daily life, the cheesiness of their goals and interactions with others. The way life in SoCal is portrayed is how I view it (from afar, I'd never live in L.A., as I'm a Northern Cal person), rushing for the wrong reasons, networking with people instead of making real human connections, always pedaling some sales pitch, etc. And all this was with a dry sense of humor - I didn't notice any silly one-liners in the whole film, yet I laughed throughout its entirety. I liked all the main actors in their roles. The plot was only secondary to the characters, so its lack of coherence in spots wasn't a big deal to me. My one gripe is that the interrogation scene is a bit too frantic feeling, but I can forgive that one spot of overplay. All-in-all, I think this was a great, mocking, dryly funny romp of a movie. Very entertaining."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "FunkMcLovin",
        "review_rating": "7",
        "review_title": "An Amazing Thing For A New Comedy...",
        "review_detailed_main": "OK, I just got back from the sneak preview and was pleasantly surprised by this movie. I had a feeling that it would be pretty good because I usually enjoy movies written and/or directed by Ron Shelton (although there are a couple of exceptions). The first half of the movie was OK... there were some funny parts but nothing spectacular, but then the weirdest thing happened... IT GOT FUNNIER. In these days when you almost expect the first half of a comedy to he hilarious and then just hope for the second half to be bearable, this movie gets funnier and funnier as the movie progresses. Plus, amazingly enough, the movie flows all the way through. I am not going to go as far as compare this to Lethal Weapon like one of the critics, but this movie is thoroughly enjoyable and well acted. 7/10."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "KrustyGeezer",
        "review_rating": "5",
        "review_title": "No surprises here...",
        "review_detailed_main": "This film, in Denmark at least, was marketed as a lightweight cop/buddy movie, part of the joke being the mismatch of Josh Harnett and Harrison Ford. Personally I thought it was OK; as a rental that is. I wouldn't be too happy if I'd paid good money to see it in a theatre. Sure, in a few places it made me laugh, thereby fulfilling my expectations. There were more than a few 'names' in the movie that were either under-utilized or just tossed away, but so what? Everyone needs to slum it now and again, something that I'm sure director Ron Shelton was more than happy to do after the hard-hitting and bleak 'Dark Blue'. And I'm also sure that everyone got paid a tidy sum at the end of the day. Harrison Ford is a good serious actor, truly believable when playing furrowed-browed, exasperated characters under pressure. What a lot of viewers forget is that the bulk of his high profile comes from playing lightweight comedic characters - fast quipping Han Solo, desperate but dry Indiana Jones anyone? - He doesn't disappoint here either. He's a seriously entertaining comedic actor, whilst Josh Harnett is a proficient and good looking foil to the dog eared Mr. Ford. That said, the film just doesn't add up. Just look at the names; besides the aforementioned leads, there's Martin Landau, Lena Olin, Lou Diamond Phillips, Lolita Davidovich, Bruce Greenwood and a host of notables in cameo roles. The whole mish-mash is directed by the reputable Ron Shelton. Admittedly, just because a film has some heavyweight names doesn't automatically mean that there's going to be a lot of substance in the content, but one is right to expect more. There certainly isn't here though. This is a soufflé of a film. The main plot is quickly forgotten.(...why I haven't mentioned it,)and there's the wasted talent, but I seen worse films that purported to be funny, and weren't. Films that even had sequels made!And therein lies my point. I had low expectations. I chuckled, therefore I was pleased. No more, no less.\n\nEpitaph: When the film ended, I couldn't help thinking that it could be translated into a highly entertaining TV cop show, but you'd have to keep Harrison Ford for it to work; and somehow I just don't see him doing that. Not just yet..."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "taminar",
        "review_rating": "",
        "review_title": "I laughed 'til I cried.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "spookyrat1",
        "review_rating": "4",
        "review_title": "You're Benched Ron!",
        "review_detailed_main": "The Lethal Weapon franchise succeeded in marrying action and comedy, as did the 48 hours movies and the first couple of Beverly Hills Cops episodes. Hollywood Homicide tries to do the same, but from the outset, everything just falls flat.\n\nThere's a nightclub shooting scene with plenty of automatic gunfire, where no-one appears to get shot, though when we return to the scene of the crime later, bodies are littered everywhere. This initial inconsistency is indicative of the whole film. Potentially entertaining scenarios present themselves only to be mishandled by either lazy acting, lazy writing, lazy directing, or a combination of all three.\n\nHarrison Ford and Josh Hartnett have zero chemistry together in the lead roles as kind of mismatched buddy cops, who each moonlight in other occupations and have way too many side issues going on in their personal lives, especially, annoyingly so, with Ford's Joe Gavilan. Like some of the other characters in the movie, I actually got thoroughly sick of hearing his various phones ringing throughout the film. Many would say the phones were only ringing, because he was phoning in his performance. I wouldn't disagree.\n\nThe script simply isn't funny. Ron Shelton who wrote among other films the comical, witty, scripts for Bull Durham and White Men Can't Jump, has struck out co-writing and directing this clunker. Ironically the funniest scene appears pre-end credits, where Hartnett's character KC Calden finally get his opportunity for a starring stage role in On The Waterfront with amusing results.\n\nThe action scenes are similarly vacuous, totally lacking in any sense of excitement or suspense. Shelton again has to take the blame for instance, for inserting one extremely long, boring car chase into the \"action\", immediately after another extremely long boring car chase had finished. He even ends the movie with Ford cracking the same unfunny lines he began with in one of his opening scenes.\n\nIt's clear Shelton's talents lie in the sports film genre, rather than crime comedy. I'd consign him to the penalty corner, until he chooses to see the error of his ways."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "HunterDK",
        "review_rating": "6",
        "review_title": "Ford entertains but Hartnett fails",
        "review_detailed_main": "Hollywood Homicide is a typical buddy cop comedy with Harrison Ford as the experienced cop and Josh Hartnett as the rookie.\n\nThey have to team up for an assignment, and their differences are some of the sketches in the movie. Sometimes these sketches work and sometimes they do not. I think that the scenes with Harrison Ford are the best, Josh Hartnett seems to have some difficulties with his role in some of the scenes. I would like to question his acting ability, I am not sure if he is a future star of Hollywood.\n\nThe movie has been criticised because it chooses two paths; the more serious path with murders and the less serious comedy path. I can agree with this to some point, but I would say that this third way works too. It is possible it would have worked better, if it just was a comedy without the more serious thrills.\n\nAnyway, I can assure you that there is no doubt that the idea was to create a comedy, and I would say that Ron Shelton succeeded, but it is definitely not one of the best comedies I have seen. You will get entertained when watching this movie, but not much more than that. - My vote: 6/10"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "bitbucketchip",
        "review_rating": "4",
        "review_title": "Why?",
        "review_detailed_main": "Harrison Ford carries this movie on his shoulders.\n\nIt's supposedly an action comedy. It isn't. The jokes fall flat. Comedy is about timing. This movie times with an hourglass.\n\nWithout humor we're left with the action. There's so little it isn't worth mentioning.\n\nWith small action and no comedy, at least there's a story. Right? Nope. The plot is so convoluted, with trivial and annoying side plots involving personal bankruptcy and real estate deals and IA investigations and marital infidelity and psychics and personal vendettas and aspiring actors and yoga instructors and I'm getting bored listing the side plots. It's absurd. I defy the viewer to explain what is going on with the murder investigation at any point in the film. It's the primary plot line and most of the time no one is even working on it. When they are, they're giving it five percent of their attention because of the aforementioned side plots.\n\nFive stars for Ford. Minus one for whoever wrote this travesty. Four stars."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "strid333",
        "review_rating": "7",
        "review_title": "I haven't laughed this hard in a movie since . . .",
        "review_detailed_main": "I haven't laughed this hard in a movie since \"My Big Fat Greek Wedding.\"\n\nI loved the way they poked fun at showbiz and the media swarming like flies to get a story. I loved the way that our two cops had lives outside of work (real estate and yoga/show biz).\n\nNot the greatest movie on earth, but it was good to laugh that hard."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "shadowycat",
        "review_rating": "1",
        "review_title": "Dragnet on Molasses",
        "review_detailed_main": "Worst part of this picture was the music - maybe they intended a retro feel, but it just reeked of second rate 70's cop show...\n\nThe new TV dragnet is so slick and fast-paced, it was agonizing to sit through this dark, dreary and lugubrious imitation. Harrison Ford phoned this one in, Al Bundy does such a better job in the role of aggressive older cop... even Gary Busey in Point Break did better - heck, as old cops go, Gary Busey in Point Break kicked much butt.\n\nI kept waiting for the humor. I kept pinching myself to stay awake saying wait a minute - this was billed as a comedy - WHERE IS THE HA HA?\n\nJosh Hartnett was even MORE boring as the young fly cop on the rise, and once again, Dragnet or Point Break (Keanu was great) (Hartnett was not)\n\nTwo thumbs way down... what a waste of time, we almost rewound the tape before the film was over!"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "edwagreen",
        "review_rating": "7",
        "review_title": "Homicide? More Like Hollywood Hilarity-Hollywood Homicide***",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "christiansmovies",
        "review_rating": "1",
        "review_title": "On my top 10 WORST MOVIE List!",
        "review_detailed_main": "Seriously\u0085 What happened in this Movie? I cannot believe that this kind of garbage gets produced, let alone somebody actually had to give the thumbs up and go ahead on a ridicules script like this.\n\nJust to elaborate a little bit. There is absolutely no story, and nothing makes sense. They didn't do their research, and continuity was completely not there. Such as the Saleen gets hit, and in the next scene it's all fixed again. Or what about the chase scene elevator \u0096 how did Joe (Harrison Ford) know what floor the suspect had picked when he ran into an earlier elevator.\n\nAnyways I am writing this review to save any serious movie buff from going through the aggravation I had to endure. This movie goes on my top 10 list of Worst Movie's ever made\u0085 alongside Mission to Mars and Dreamcatcher."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "melli-lissa",
        "review_rating": "10",
        "review_title": "Fantabulous",
        "review_detailed_main": "After seeing 40 Days and 40 Nights I was seriously beginning to doubt Hartnett's acting ability. This movie certainly proved me wrong. He and Ford worked supurbly together. The one liners and witty quips were abundant, yet done in such a way that I wasn't bombarded. All around a great film, where else can you see Ford riding a pink bicycle or Hartnett doing yoga?\n\nThis one is definately a must see. The car is pretty snazzy too!"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "hitchcockthelegend",
        "review_rating": "7",
        "review_title": "We've been partners for what, four months, and now you wanna be my shrink?",
        "review_detailed_main": "Ultimately you have to think that those who have wanted to see Hollywood Homicide would have done so by now, certainly fans of the generational divided lead actors (Josh Hartnett and Harrison Ford) would have long since tuned in to see what it's like. It's fair to say that its reputation is most divisive, with some critics proving to be most ferocious in their summations. Personally I find it to be an enjoyable spin on the buddy buddy cop formula, where director Ron Shelton isn't afraid to put emphasis on characters instead of just filling out the pic with high octane bangs and crashes. The wry portrayal of the police system in a bustling Los Angeles is nicely etched into the froth, with the sidebar of coppers having two jobs being a deft poke in the ribs.\n\nGood fun with well crafted action scenes, but the main strength is in the writing and to see once again that Ford has been very undervalued as a comedy actor of the years. 6.5/10"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "mjw2305",
        "review_rating": "5",
        "review_title": "Disappointing buddy cop action/comedy",
        "review_detailed_main": "Veteran detective, Joe Gavilan (Harrison Ford), is on the biggest case of his career and he's breaking in a new partner, K.C. Caldan (Josh Hartnett), who can't make up his mind if he wants to be a cop or a movie star.\n\nIt is pretty well made, it has a decent sprinkling of action and it is mildly amusing at times; but to be honest i expected a lot more from the likes of Ford and Hartnett, the chemistry between the cop duo is somehow left wanting, and they are not given much help by the weakness in the script and the screenplay as a whole.\n\nIt's not completely awful, but it certainly isn't anything special, and if it passes you by; you won't have missed much.\n\n5/10"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "george.schmidt",
        "review_rating": "",
        "review_title": "Not exactly Murtaugh & Riggs",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "elshikh4",
        "review_rating": "1",
        "review_title": "Sour Ice Cream !",
        "review_detailed_main": "(Josh Hartnett)'s dead eyes, the thick writing of it, and (Harrison Ford) being in a buddy-cop comedy. Here's 3 reasons to hate it, avoid it, and to utilize 116 minutes of your life better!\n\nThe buddy-cop movies are fun. However, their real golden age was back in the 1980s and the 1990s. Making one that tries to mix action and comedy through the police of Hollywood itself is sure a good idea, though the final result of that turned out to be not at least a spoof of the subgenre, but a reason to ask God to have mercy upon all the past movies of the same kind whereas the worst of them was by all means greater than (Hollywood Homicide)!\n\nWhat really did happen to this entertaining formula?! Since a whole decade the things hadn't been the same. You'd have a buddy-action stubborn flop after another. I'll delight you with some titles to catch on the disaster well: (I Spy - 2002), (National Security - 2003), (Taxi - 2004), (Starsky & Hutch - 2004), and the worst of them all yet (Miami Vice - 2006)!\n\nI believe one of the reasons is the natural case of saturation after many similar movies and TV shows during 2 decades already. Add to that, particularly here, the negligent dealing, and the dull humor. Actually the matter this time is totally unbearable. Yes, we have the characters of 2 loyal cops who have second jobs, and the background of sinful city, but what else was new?! It's not about cliché; it's about few renewals mixed with clichés where both have been badly made.\n\nThe acting, especially from (Hartnett)'s side, is terrible. This guy is anything but a comedian (or an actor!). So his character was wanting to revenge for his father's death? Revenge on yourself man, he probably died out of watching your acting! According to (Harrison Ford)'s performance, he wanted to have a good time, but at least we didn't! Even the small roles got people that have nothing to do with comedy, or that's what they seemed here anyhow!\n\nThe directing fails in presenting something that comic or that harsh, some parts managed to be highly dull. Look at the sequence of arresting the black guy through the lake; it's a rare time to be boring in what's supposed to be action / comedy! They didn't utilize Hollywood itself whether as an ironic place where there is ugly face behind the superficial charm, or even as a place which's full of shining or fallen stars; since there were no cameos that could've given it few interesting moments.\n\nIt's a very easy movie that relayed on being watchable by only its stars' glamour, and its form as a buddy-cop movie, to end up as one of the worst cases of 2 stars with non-chemistry on the screen (one of them has no chemistry with the screen itself!), and a buddy-cop destroyer more than a movie. God, don't make me, or my children, live enough to witness (Hollywood Homicide 2)!"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "claudio_carvalho",
        "review_rating": "6",
        "review_title": "Silly and Forgettable",
        "review_detailed_main": "In Hollywood, Joe Gavilan (Harrison Ford) is a competent detective of the homicide division and a real-estate broker in his spare time to pay his debts and mortgage. His partner K.C. Calden (Josh Hartnett) is also an aspirant of actor, looking for a chance in the cinema industry to quit his position in the police department. While Gavilan and Calden are investigating the death of four rappers, the dirty Lt. Bennie Macko (Bruce Greenwood) of the internal affairs and enemy of Gavilan is chasing them. 'Hollywood Homicide' is a silly and forgettable movie, although having a great cast and a very high budget. I agree with the title of the comment of another user: 'I'd rather just watch \"Lethal Weapon\" again...' Me too. My vote is six.\n\nTitle (Brazil): 'Divisão de Homicídios' ('Homicide Division')"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "bellino-angelo2014",
        "review_rating": "4",
        "review_title": "Dreadful buddy cop movie and quite grating too!",
        "review_detailed_main": "There was a period back few years ago when this movie was aired lots of times and once in 2019 I finally had the chance to watch this movie despite it was a bit painful experience.\n\nWhen the film begins there is a murder in a nightclub where four rappers are murdered. They are called on the case K. C. Calden (Josh Hartnett) and Sergeant Joe Gavilan (Harrison Ford) who, despite having a 36 year old age difference, work as buddies. And during the course of the movie there are some various stories such as Gavilan that works also as a real estate agent that tries to sell his flats. And Calden teaches yoga during his free time, has problems with women and is also an aspiring actor that is debuting as Stanley Kowalski in A STREETCAR NAMED DESIRE (and during a performance in the end he is interrupted by a service call).\n\nWhile many buddy cop movies worked in the past (such as the LETHAL WEAPON, BEVERLY HILLS COP and 48 HOURS) this didn't and it looks like a bad copy of all those good movies. While Ford gives a likeable performance as always, Hartnett probably gives one of his worst! He looked so whiny and awkward that it's no surprise he was such a loser through the all movie. The always reliable Keith David, Bruce Greenwood and even Martin Landau are very bland and looked like they wanted to be somewhere else. Some of the situations were quite cringeworthy too such as the car chase scene towards the end where Robert Wagner gets mud splattered by Calden's super fast car. About the only great thing about this movie was the soundtrack, but that alone can't save a movie.\n\nEven if you like some of the cast members, avoid this movie at all costs as it looks so painful that you feel actually sorry for the actors, and when this happens, it surely is a bad sign!"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "deltajuliet",
        "review_rating": "7",
        "review_title": "Really Underrated",
        "review_detailed_main": "Not many movies these days deliver acts worthy of laughing out loud; yes, there has been Wedding Crashers, The 40-Year-Old Virgin, and a few others I probably just can't remember right now, but they are still relatively uncommon. Luckily, Hollywood Homicide is one that does deliver these acts.\n\nIt may not be the funniest movie ever made (it's not purely a comedy, really), but it's certainly worthy of a viewing.\n\nHartnett and Ford play off of each other quite well. At one point a woman waves to Hartnett's character and says hello. Hartnett yells back something like,\"Hey, Kimberly!\" She yells back,\"It's Amy.\" Hartnett is a bit embarrassed and moves on with Ford, as he quietly comments,\"you dog,\" in a serious yet very funny way. That's not the best example of the movie's humor--there's many more examples and certainly more funny ones, but I certainly don't want them to be known to anyone who hasn't seen the film.\n\nAn interesting attribute of the film is its ability to make clichéd formulas funny and interesting. For instance there is the buddy-cop element--I think I've seen that in about 200 other movies, but Hollywood Homicide handles it well. Hartnett (often referred to as \"the kid\") and Ford really do go well together, as I mentioned earlier. There's also the standard internal affairs challenges. These culminate in an extremely funny scene where both Hartnett and Ford are being interrogated in two rooms adjacent to each other.\n\nI could give a much better in-depth explanation of why this movie is funny, but to do this I would be greatly challenged; it's hard to do without discussing some of the scenes.\n\nAs for the plot, the pair is investigating a (yes, you guessed it) homicide in L.A. I give very little of this review to the plot because the plot is really more of a side-plot, a device used to set up the rest of the movie so that actors like Ford and Hartnett can play off of each other...they do it well."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "Theo Robertson",
        "review_rating": "4",
        "review_title": "You'll Have Forgotten About It Tomorrow",
        "review_detailed_main": "There's something very old fashioned about this movie , so much so that it's difficult to believe it was released in 2003 . Even if it'd been released in 1993 it would still have felt rather stale . The plot is a comedy of contrasting cops , one a veteran with idiosyncratic quirks and the other one being a wide eyed new boy and as you'd expect one is played by a well known actor with a couple of decades experience of starring in big budget movies while the other is played by a pretty boy actor who's be touted as the next big thing . How old's this idea ? well Quinn Martin had a very successful TV show with this premise starring Karl Malden and Michael Douglas away back in 1972 and the 1970s haven't dated well\n\nWith hindsight the film doesn't do itself any favours with the casting . Harrison Ford star was rapidly failing in 2003 and Josh Hartnett probably had a career high with BLACK HAWK DOWN and didn't go on to a become a massive Hollywood name and it's important in this type of buddy movie that the on screen chemistry crackles . Unfortunately it doesn't but the two stars aren't helped by a painfully loose script where instead of a murder investigation time is taken up with characters complaining that their cheese burger has lettuce in it and that they musn't be called sir because \" I work for a living \" . Many times I forgot I was watching a film where a murder investigation is taking place . Try and imagine an episode of THE WIRE not featuring Marlo and his crew and where no one swears and you've got the idea . By this time tomorrow I'll probably forget that I saw the film in the worst place"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "gavin6942",
        "review_rating": "6",
        "review_title": "Sort of Misfired Somewhere",
        "review_detailed_main": "Two LAPD detectives who moonlight in other fields investigate the murder of an up-and-coming rap group.\n\nOne of the few major critics to give it a positive notice was Roger Ebert, who awarded the film 3 out of 4 stars. I am surprised by Ebert on this one. While I do not by any means think the movie is as bad as most people seem to, I would be hard pressed to say it was good. Something about it just seems off.\n\nI got the impression that this sort of movie would work well as a television program, especially in today's world with the bigger budgets TV shows. It would make a good running gag to have cops who moonlight as other things."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "SnoopyStyle",
        "review_rating": "4",
        "review_title": "duo not that funny",
        "review_detailed_main": "Hollywood police detective Joe Gavilan (Harrison Ford) and his young partner K.C. Calden (Josh Hartnett) are investigating the murder of a rap group at a nightclub. Joe is a self-confident grumpy veteran cop and selling real estate on the side. He's got a property that he can't get rid of. K.C. is a new-age youngster who can't shoot wanting to be an actor instead. Music producer Antoine Sartain (Isaiah Washington) had the group and others killed. Gavilan's rival Internal Affairs Bennie Macko (Bruce Greenwood) is out to get him. He's having an affair with psychic radio host Ruby (Lena Olin) who turns out to be Bennie's ex.\n\nThese characters are not particularly fun but the movie wants them to have fun chemistry. This movie needs one comedian in the duo. Without that, the two actors are trying to do things beyond their limits. Ford has a bit of comedic edge but he can't be the funniest one in the group. Hartnett is who he is. The comedy doesn't quite work and the police case isn't anything too compelling. It could try to be a serious crime drama but it's not that either."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "perlner",
        "review_rating": "8",
        "review_title": "who knew Harrison Ford was so funny?",
        "review_detailed_main": "This is not an art film. It does not have a message that you will come away with and discuss afterwards with your intellectual comrades. It does not have a story that makes sense and will fulfill you in the ending.\n\nBut...it is not cheap or dumb. Somehow it manages to be witty and in good taste, while giving us just enough action (and I don't just mean car chases...do understand, Harrison Ford is involved, and Josh Hartnett isn't exactly unattractive either ;) to keep us wildly entertained.\n\nThe one-liners are a riot, but there's an underlying parody here too, that is rampant throughout the movie. The movie makes fun of buddy comedies, of car chases, and of Hollywood in general, by showing you just how ridiculous it really is.\n\nAnd yet...somehow these two stars (especially Harrison Ford, but I am impressed with young what's-his-name too) are so likeable, and so genuine, that we can really believe their situation, and root for them.\n\nKudos to the makers of this film. It's not going to win any Oscars, but it will win your heart."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "arnuld-mizong",
        "review_rating": "7",
        "review_title": "Good Buddy-Cop Movie",
        "review_detailed_main": "Like I always say:\n\n1) First, I only write if the movie is extremely good 2) if people are unnecessarily bashing a good movie 3) if it has a low rating.\n\nI decided to write this review because of 3rd reason. It is good light-hearted buddy-copy action-comedy. Original dialogues, authentic acting, original story and nice humor. Of course, it is not gonna win any awards, no nominations either but if you got time and an action movie guy or action-comedy fan or like to pass some feel-good time or even if you like something \"original\", get some pop-corn and sit down and watch. It is an enjoyable movie."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "ColeSear",
        "review_rating": "3",
        "review_title": "Almost Escapes Being A Waste of Time (SPOILERS)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "Li-1",
        "review_rating": "",
        "review_title": "Not exactly what I expected, but an enjoyable action/comedy nonetheless.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "shiftyeyeddog",
        "review_rating": "3",
        "review_title": "Harry, you're on Notice",
        "review_detailed_main": "Remember Harrison Ford? Great actor, great films, great taste in characters? Well he's dead. At least to me. He's been replaced by some hack who has spent the better part of a decade churning out crap, surviving on the benefit of the doubt the public feels he's earned with his many great roles. Well your credit is all used up, Harry. You're through. Short of Indiana Jones 4, your name is no longer going to be enough to automatically get me into a film. Now you're on the movie-by-movie list. This movie? It was crap. It was stupid. It was boring. It was horribly scripted and Ford didn't fit the role at all. There were too many coincidences in having every single plot line weave together in the end, and did I mention Ford was completely wrong for the film? Plus, we don't wanna see him bare chested in his underwear, blindfolded and engaged in pre-coital activities... **shudder**"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "Spanner-2",
        "review_rating": "6",
        "review_title": "Formula smaltz",
        "review_detailed_main": "Formula buddy/cop action/comedy casts a worn down looking Harrison Ford as a detective and a sleepwalking Josh Hartnett as his junior partner... in this case they both have side jobs, Ford as a pathetic real estate agent and Hartnett as a struggling wannabe actor.. The film has them investigate the murder of a rap group and deal with a sleazy Internal Affairs investigator (Bruce Greenwood, in a typical role for him). The film does have some fun moments, sly injokes about Hollywood, and a entertaining final chase sequence to recomend it.. but nothing new or original here. GRADE: C+"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "tc1073",
        "review_rating": "1",
        "review_title": "A waste of time....",
        "review_detailed_main": "Harrison Ford must have lost all of his marbles when he made this movie. It has a ridiculously weak story line, the characters are pathetic, and the dialog is stupid. Plus, they were terrible cops if they were worthy of being called cops. The studio executives obviously thought that star power (Harrison Ford and Josh Hartnett) would suffice in place of a well written, well filmed, well edited, entertaining movie. If I could give it less than one star, be assured I would."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "imdb-21622",
        "review_rating": "6",
        "review_title": "Moderately amusing",
        "review_detailed_main": "I feel this movie is a bit in the vein of Get Shorty.\n\nIt's a comic take on Hollywood and cop movies.\n\nI feel it just falls short of being as great of a movie as Get Shorty.\n\nFor one thing, Harrison Ford's character is not that likable. His main schtick is trying to run real estate deals while solving a murder case. If we had some sympathy for him, this might work better.\n\nHis partner is slightly more interesting, but also falls a bit flat in his role as a yoga loving, womanizing wannabe actor.\n\nThat being said, the movie is good for some laughs. I found the interrogation scene pretty amusing. I found the final chase scene pretty amusing.\n\nFailing to find a better comedy on cable, this might be a possible choice for some mindless viewing.\n\nI should note that the plot is moderately complex, so you kind of have to pay attention at times IF you really want to understand the whole plot (I was surfing the internet while watching the movie, and missed some plot points.)"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "tipplerunkus",
        "review_rating": "4",
        "review_title": "I came, I saw, I bored.",
        "review_detailed_main": "Remember when Harrison Ford was the biggest star in Hollywood because he made great movies? Those days are feeling like a more and more distant memory.\n\nWhile \"Hollywood Homicide\" is by no means terrible, it is a routine and surprisingly boring buddy cop movie. It's a comedy that's not particularly funny, and an action movie that's not especially exciting. An overabundance of subplots cannot mask the weakest of the central storyline.\n\nFord at least appears to be enjoying himself more than is his last few projects, and he is able to carry the film most of the time. Hartnett is adequate, but he and Ford aren't exactly Newman and Redford as far as chemistry is concerned.\n\nAll in all, \"Hollywood Homicide\" is a reasonably amusing diversion, but just barely. Take out Ford, and it's not even that."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "rbverhoef",
        "review_rating": "6",
        "review_title": "Mindless fun",
        "review_detailed_main": "Here is one of those action comedies that is nothing more than fun to watch and knows that it is exactly that. It works on the levels it wants to work on, so why complain? We have Harrison Ford and Josh Hartnett as two homicide detectives working in Hollywood, investigating a case that involves some dead rappers in a night club. Joe Gavilan (Ford) is not only a cop, he does some real estate as well. K.C. Calden (Hartnett) is a teacher in yoga at night and wants to be an actor instead of a cop. There are quite some smiles here.\n\nI will not really go into the plot although I can add that Gavilan has some problems with Internal Affairs, especially a guy named Benny Macko (Bruce Greenwoord), and is seeing a psychic named Ruby (Lena Olin). Who the killer is and why does not really matter since the movie is not about that at all. (The final act proves this since the villain has no apparent evidence against him but to lead the story to its ending he simply starts shooting at the cops.) The movie is about the dialogue and the fun both Hartnett and Ford have with their characters.\n\nHartnett is the perfect sidekick here for Ford who is the kind of actor that seems to have fun being himself only with a different name and a different profession. His Gavilan shows us the same joy as his Han Solo or his Indiana Jones, something that makes this movie worth watching if no better movie should be available. I say this because there are a lot of better movies out there, but 'Hollywood Homicide' is definitely not a waste of your time."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "higfilm07",
        "review_rating": "4",
        "review_title": "Ford and Harnett make \"Tango & Cash\" look like gold",
        "review_detailed_main": "This film's shortcomings can be blamed mostly on the screenwriting and direction. Ford and Hartnett's buddy cop pairing just doesn't have the chemistry of Mel Gibson and Danny Glover in Lethal Weapon series. The climax chase scene seems to never end. This light fare of a movie, tries to be so much more than it should be as it piles more layers of internal investigations and corrupt cops on top of its rapper homicide story. Overall the film never decided if it wanted to be serious or not and the result is a unentertaining mess. Give me Stallone and Russell in \"Tango & Cash\" any day over this one!"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "RMR-2",
        "review_rating": "8",
        "review_title": "Surprisingly good movie",
        "review_detailed_main": "Hollywood Homicide was a victim of an unsteady marketing campaign that didn't know whether to advertise the film as a comedy or a cop-drama. It does involve cops and a murder investigation but it is the natural humour in the movie and the interplay between Harrison Ford and Josh Hartnett that is the best reason to see it. Harrison Ford is as likable and gruff and easily humourous in this movie as you will ever see him. Having seen Sabrina and 6 Days 7 Nights, I was prepared for the worst, but Ford was on-key here and it was a happy surprise to watch him. He is effortlessly good here.\n\nJosh Hartnett's character had been partnered with Ford's for four months so they are comfortable with one another. It's not played as old cop / young hotshot rookie but as seasoned cop / good but inexperienced kid and it works well. There is a scene where Hartnett wears himself out chasing a suspect on foot while Ford instead follows in the car. The suspect is caught when Ford parks the car, gets out and waits patiently for the suspect to emerge from an alley and then trips him, allow a breathless Hartnett to finally cuff him.\n\nThe murder plot is perhaps too dark for this movie and it is the discordant note in it. The movie might have done better to have painted the bad guys as just bad and not evil. But don't bother about the murder investigation or bad guys and watch the movie for Ford and Hartnett. Ford especially sparkles and it would be a shame not to see him when he's so good."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "soriasv",
        "review_rating": "7",
        "review_title": "A solid 7, enjoyable",
        "review_detailed_main": "Enjoyable. Better than anticipated. Performances were good. A lot of stars hidden in this film."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "michaelRokeefe",
        "review_rating": "5",
        "review_title": "Unlikely partners make a good combination.",
        "review_detailed_main": "Too convoluted. Two homicide detectives share thoughts of other vocations. Joe Gavilan(Harrison Ford)is the sometimes tougher than nails veteran on the job. Alimony has him working as a real estate agent. His younger partner K.C. Calden(Josh Hartnett) is a yoga instructor on the side, but really wants to become an actor. This unlikely duo is assigned the investigation of a multiple homicide at a dance club. Gavilan and Calden need to prove that music mogul Antione Sartain(Isaiah Washington)is killing off established rap stars that want to leave his management. Dwight Yoakam is a ruthless enforcer working for Sartain. While this investigation really gets muddled, Lt. Bennie Macko(Bruce Greenwood)is an Internal Affairs officer with a grudge and vendetta against Gavilan.\n\nThis movie is longer than it needs to be. Repetitive rap music is very annoying. Ford seems bored with his role. Hartnett seems miscast period. Bad ass Yoakam is a comical highlight. Lou Diamond Phillips is hilarious as an undercover hooker. Other faces you may recognize are: Martin Landau, Gladys Knight, Keith David, Smokey Robinson and Lolita Davidovich. Lena Olin plays Ruby, who is more than friendly with both Gavilan and Macko. The final chase scene is a redemption for this pot luck action flick. Violence, sexual situations and loads of profanity are a big help in holding this one together."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "StanleyStrangelove",
        "review_rating": "",
        "review_title": "Dead On Arrival",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "jehaccess6",
        "review_rating": "5",
        "review_title": "Comedy/Action Film Hybrid Held Together By Harrison Ford.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "bfrankjr",
        "review_rating": "7",
        "review_title": "Great Chemistry",
        "review_detailed_main": "When you think of Harrison Ford you tend to think of Special effects and something exploding behind him. In this film Harrison Ford teams up with a great rising star Josh Hartnett. Yes the Script may need some work and some characters need some development. But the on screen chemistry between the two worked well and should be further developed in a sequel to these two great characters. If you are wondering why I have not discussed the plot nor setting it is because this is not one of those films. This is a film that you watch when you want something different. Not a great Action film, Not a great Thriller, but a film that will delight you and keep you laughing and on your feet until the end of the film. IN an error where acting is seconded to effects this film ranks high on my scale. It is worth the viewing."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "Bob-45",
        "review_rating": "4",
        "review_title": "\"Wholly Weird Putrefied\"",
        "review_detailed_main": "Maybe it was me, but I found it nearly impossible to follow the opening massacre in this movie. The overall storyline is also so disjointed, I needed Gladys Knight to explain to me what was going on. I can't believe LAPD would allow Ford's character to carry on his real estate business while on duty. That would be a firing offense at virtually any job I know. Further, the antics Ford and Hartnett perform during their IAD interrogation would have got them thrown into the slammer. Certainly, what self respecting interrogator would allow Ford to keep his cell phone? This cop buddy movie is about as convincing as \"Tango and Cash\" or \"Showtime\". In other words, despite some fairly humorous scenes and dialogue, the best I can give \"Hollywood Homicide\" is a \"4\"."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "moviedude1",
        "review_rating": "7",
        "review_title": "This is definitely not one of your parents' \"whodunit...\"",
        "review_detailed_main": "The trailer tells you they're cops, but they are real estate agent & yoga instructor on the side: one for extra money, the other for extra attention from...well, you know...\n\nPartners in a murder investigation involving a rap group, Ford and Hartnett share the star status of fighting crime in LA. From the beginning, Ford's presence is commanding, letting you know that he is \"in charge.\" But of what, we're not quite sure. It seems the lives of our hero (and his partner) are going in tangents not quite equal to their current profession. Harrison is trying to make a little extra money on the side, but his real estate deal has him so caught up in itself that he can't focus on the job at hand. As far as Hartnett is concerned, all he CAN do is find his \"center to focus\" on. But as a member of the audience, I found myself extremely lost in this film. Not lost like losing track of time (in fact, I could not wait for the movie to be over), but lost because their is no direction on the entire film.\n\nMystery does turn to comedy in the end, however, as Ford fights the head of the Internal Affairs, whose got it in for him. Once it's the two of them (Ford & Hartnett) against the world, all hell breaks loose, and then we have a movie worth watching! Sit through the beginning... it's worth it in the end!"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "dtabizel",
        "review_rating": "1",
        "review_title": "Boring, tosh.I preferred visiting the dentist to watching this movie.",
        "review_detailed_main": "My goodness - perhaps the worst Harrison Ford movie ever? Not funny, not a thriller and cobbled together very badly indeed. I wouldn't even watch it on cable if I were you. Would anyone like to borrow my DVD to use as a beer mat? I preferred visiting the dentist to watching this movie."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "imseeg",
        "review_rating": "6",
        "review_title": "Lighthearted buddy cop movie. Nothing special. A bit silly. Barely worthy 6 stars.",
        "review_detailed_main": "For the Harrison Ford fans or the Josh Hartnett fans.\n\nThe bad: this buddy cop movie is basically going nowhere. Forget about any tough action or thrill, it is basically meant to be a comedy, but without many good jokes.\n\nIt'll do, but only barely. But sometimes I like to see a mediocre throwaway movie just to fill the time...\n\nNot any good? It's lighthearted nature is pleasant.\n\nThe story: 2 cops who really dont wanna be cops anymore, still have to solve a murder case. Lots of (supposedly) funny talking scenes about yoga, selling real estate etc."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "indymd",
        "review_rating": "1",
        "review_title": "Long time Harrison Ford fan laments: \"How could you have stooped so low!\"",
        "review_detailed_main": "I have enjoyed Harrison Ford's movies over the years, eagerly anticipating his next generally enjoyable and successful movie. I have rarely been disappointed in his work, from blockbusters like \"The Fugitive\", \"Air Force One\", and the Jack Ryan movies, to more subtle successes in \"Witness\", \"Regarding Henry\", and \"Sabrina\". And, of course, his masterpieces, the Indiana Jones series, are at the top of the list. So my disappointment in this movie was intensified by the expectation of excellence. Let me just say this, I have walked out of two movies in my life, for painful pointlessness, poor performances, and lame writing, and the other movie was \"Ferngully.\" Mr. Ford has dropped several notches in my esteem of him as an actor for even agreeing to participate in this disaster!"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "sadik35",
        "review_rating": "10",
        "review_title": "Man! does this movie rock!",
        "review_detailed_main": "Hollywood Homicide is about two LAPD police officer, one that takes his job seriously but wants to be an actor and the other hates paperwork. Now when a group of rappers are killed these two guys are brought in to investigate. Now that is a good plot for a movie like this(it is not what I wrote, i made a summary out of the plot). This movie is really funny and filled with gun,car and hand to hand violence. The actors are perfect for their roles and the movie has a goo script. Not to mention that the comedy was suitable for an action movie like this. I love the action. The action scene that was mixed with comedy was when Kasey was chasing the Afro-American guy and he jumped into the duck pond. Now that was funny."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "TimGatewood",
        "review_rating": "7",
        "review_title": "Harrison still has IT, age notwithstanding",
        "review_detailed_main": "Harrison Ford does NOT disappoint, even when the script is not the greatest. This one has a good plot and a great cast, although you really have to watch to find some of the names listed in the opening credits. There is some real humor here, too, albeit buried under about 5 or 6 cliches and standard storylines. What really makes this one worth watching is that it manages to poke fun at the rap scene and at Hollywood and at all the cliches, while still working every last one of them as elements of the flick. The rest of the cast turned in good performances, too, but we watched this for Harrison Ford and will watch it again for him. The man still has IT, and he shows it off in this movie."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "mrinalvikram",
        "review_rating": "2",
        "review_title": "Disaster of a movie",
        "review_detailed_main": "One of the worst Harrison Ford flicks I have ever seen. For a seasoned actor like him, its strange that he should choose to work in such a movie. The plot digresses all the time and there is not much action or comedy in the action-comedy flick. Josh Hartnett sucks. Although Ford's quippy humour and his smirk breathe some life into the movie, its definitely not much reason for anyone to go and watch it."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "coolguy5090",
        "review_rating": "",
        "review_title": "Interesting Characters make \"Hollywood Homicide\" worth while",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "RichMcLeod",
        "review_rating": "1",
        "review_title": "Worst movie I've ever seen",
        "review_detailed_main": "This movie was so bad it made me vote. I wish there was something less than a 1. I guess I have to vote now for some I like, as I trust IMDB. If this was a spoof, it failed miserably. If it was a real action movie, it failed miserably. If it was an attempt by a combination of never was and has been stars to prove that anything can get made, it succeeded. Geeez."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "Janchewie",
        "review_rating": "7",
        "review_title": "Enjoyable film! Hollywood Homocide..",
        "review_detailed_main": "I just viewed this film and I enjoyed it. I think some people get to deep/profound and technical etc, it's only a film!\n\nI was on a message board a while back with comments about a \"Knights Tale\". People were on about the costumes were not correct for the time in history and this and that.\n\nIT'S ONLY A FILM AND QUITE AN ENJOYABLE ROMP, GOOD!!!\n\nIf we were talking about something like \"Mutiny on the Bounty\" or \"Dances with wolves,\" we would expect correct costumes and details for that period, that's it!!!\n\nWhat more can I say,\n\nDave..\n\nI've got to say more because I need so many text words to get on the message boards;\n\nTo Market, To market, went my brother Jim,\n\nSomebody threw some tomatoes at him,\n\nTomatoes don't hurt, they've got soft skin\n\nBut these Bastards did, they come in a tin!!!"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "wes-connors",
        "review_rating": "5",
        "review_title": "Broken Hip Hop",
        "review_detailed_main": "Veteran (read: the old guy) Harrison Ford (as Joe Gavilan) really wants to make a big sale in his sideline real estate business. Rookie (read: the young dude) Josh Hartnett (as K.C. Calden) sidelines as a yoga teacher who really wants to be an actor. Mr. Ford likes to listen to Smokey Robinson, who appears as a cab driver. Mr. Hartnett yells \"Stella!\", and stages a version of \"A Streetcar Named Desire\", which you can see part of, in the last act. Ford beds lovely psychic Lena Olin (as Ruby), and eats Viagra. Hartnett beds various women, and eats bean sprouts. \"Police detectives are different in Hollywood,\" they say...\n\nRon Shelton's \"Hollywood Homicide\" involves Ford and Hartnett investigating rap murder. Ms. Olin and Bruce Greenwood (as Bennie Macko) are strong supporting players. Fair to middling appearances are offered by Gladys Knight (not singing), Lou Diamond Phillips (gunning for Eddie Murphy), Mr. Robinson (a Miracle), Frank Sinatra Jr. (the son of), and Robert Wagner (in wet cement). Despite the involvement of some real rappers, the hip-hop music angle doesn't ring authentically. And, the film never finds the comic groove it's so obviously seeking. Things pick up toward the end, if you want to cut to the chase.\n\n***** Hollywood Homicide (2003) Ron Shelton ~ Harrison Ford, Josh Hartnett, Lena Olin"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "tprosek",
        "review_rating": "7",
        "review_title": "I don't know why this gets bad reviews",
        "review_detailed_main": "It might not be for everybody, but I thoroughly enjoyed this movie. It's a guilty pleasure of mine that still has me cracking up when I watch it. Sure there will be people who overly critique this movie but for what it is, it's good. It wasn't made to be an academy award winning picture. If you like action comedies you'll like this one."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "imdbreview",
        "review_rating": "2",
        "review_title": "lousy movie",
        "review_detailed_main": "In reading others' comments/reviews, I noticed that those who \"kind of\" liked this movie were the ones who went to a free screening. Yeah, MY standards are lower @ a FREE screening also. However, I actually paid good money for this movie (well..my date did, actually), and I want the $7 and my 2 hours back!! So many things didnt make sense in this movie...tires were shot out at one point to stop a car...but later, a chase was required even though ample opportunity for the former presented itself. Lena Olin was a cliche. The plot was so simple I kept thinking \"it can be this simple\". And PLEASE dont FORCE me to listen to rap music!! My version of h***."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "dominic_sheldas",
        "review_rating": "6",
        "review_title": "Very very average",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "rosscinema",
        "review_rating": "3",
        "review_title": "Film becomes its own joke!",
        "review_detailed_main": "I suppose the idea of playing in a comedy must be intriguing to Harrison Ford probably because he doesn't get offered very many but its a shame he picked one so inane and pointless. Film is about an aging cop named Joe Gavilan (Ford) who moonlights as a real estate agent and no matter what crime was just committed he looks to try and sell a house. His young partner is K.C. Calden (Josh Hartnett) who is thinking very hard of being an actor and he reads lines from popular dramas and prepares for a role in a very small production of \"Streetcar\". One night a hip-hop club is shot up and the members of a popular group are killed so they decide to talk to Antoine Sartain (Isaiah Washington) who heads the label that signed the group. Meanwhile, Lt. Benne Macko (Bruce Greenwood) of Internal Affairs is looking to bust Gavilan because of their bad history together. Gavilan is dating a radio psychic named Ruby (Lena Olin) who also use to date Macko and she also helps Gavilan with clues with her psychic ability. The premise is interesting enough and there are many Hollywood cop jokes written into the film. My favorite is the cameo by Eric Idle who plays a celebrity caught trying to pick up a hooker! The film does a good job of showing how the cops of Hollywood are always thinking of doing something else since Los Angeles has so many opportunities for other employment. But the dialogue is so silly and inane that its hard to believe that someone like Ford would utter some of the things that he had to. Hartnett is especially drab and he doesn't show much flair for comedy but one thing I found surprising was that he doesn't show the charisma that he showed in \"Black Hawk Down\". He's stiff as a board which use to be Ford's manner. You know your stiff when Harrison Ford is more lively in a film! There is also to many cliches like Greenwood as the Internal Affairs Officer with a chip on his shoulder towards Ford. Haven't we seen that a hundred times? And I had to cringe when Ford is riding the girls bicycle and tooting the horn while riding through a mob of people. Film is ultimately too silly and pointless. Ron Shelton directed and he usually has a terrific knack for comedy but here the film comes across as very uninspired. Don't waste your time!"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "TiVoFan",
        "review_rating": "10",
        "review_title": "Fabulous",
        "review_detailed_main": "Hilarious - well written - well delivered.\n\nI ignored the 'main coincidence', as it was *almost* too much.\n\nThe donut and the sale-of-the-house subplot had me laughing out loud.\n\nAs a 'have fun and enjoy yourself' rating: 10/10"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "ray-280",
        "review_rating": "7",
        "review_title": "L.A. Existential",
        "review_detailed_main": "The movie has one redeeming quality: of all the films shot in LA, this one is really SHOT IN LA: you get to see Los Angeles from the perspective of a local, where not everyone is a movie star, and where people live regular lives, at least as regular as one can live out there.\n\nHarrison Ford and Josh Hartnett are paired as the \"buddy cops\" whose job is to solve a nightclub murder of a rap group. In the course of doing so, they travel all over LA (the scenic shots make the movie worth watching all by themselves), and make sure that the investigation doesn't interrupt their \"real\" lives, which for Hartnett's character is his acting carer, and for Ford's, his endless search of real estate commissions.\n\nThe rap industry was poorly portrayed here, the music was second-rate (as rap almost always is when not done by rappers or when rappers are directed by non-rappers), and the plot was horribly contrived, but the actors are good and do the best they can with woeful material.\n\nWithout question, the plot's greatest strength is the many swipes it takes at LA culture in general, and the buddy-cop movies in particular. The heroes are not portrayed as quasi-supermen, but rather as a wheeler-dealer and an A-list actor trapped in the prison of regular jobs. Isaiah Washington did play the villain exceptionally well, but you'd have difficulty knowing this from the paucity of screen time he got.\n\nThe movie works, the plot works, and the acting works, but only works enough for no one to get fired. You won't regret watching this movie, but just barely. There are far better movies out there, but alas, there are also far worse. A true middle-of-the-road flick likely to be on cable for the next twenty years."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "boettcher30259",
        "review_rating": "5",
        "review_title": "Someone Missed The Boat",
        "review_detailed_main": "This movie would have worked better as a serious cop drama with the comic relief but instead it was a comedy that drew more laughs from embarrassment then humor. Josh Hartnett does a good job as an Ashton Kutcher mimic. And Dwight Yoakam was a surprise, as was Lou Diamond Phillip as the hooker/decoy. I did have to look at the credits to identify Gladys Knight because I was thinking she was maybe someone else I couldn't quite put my finger on, but there was no mistaking Smokey Robbinson. This movie also has a lot of other cameo shots throughout, such as Eric Idle, Martin Landau, Robert Wagner, Frank Sinatra Jr., and for those that are into hip-hop and rap, (sorry, I'm not) many an artist from that gene had cameos. Harrison Ford gave a good performance and had the only true laugh in the movie when he was in the interrogation room and did the \"hip motion\" while up against the two way glass. My feeling is that this is a good dollar rental or a movie for Spike TV. This is not the type of movie I'd spend a lot of money on, (I got my copy at Big Lots for $3) but I wouldn't avoid it either."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "Vermithrax101",
        "review_rating": "",
        "review_title": "7 out of 10",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "Max_Colston",
        "review_rating": "1",
        "review_title": "Hey, why not just call the film `Hollywood Hookers, Murderers, Rap Artists, Repo Men, Wannabe Actors, Drug Dealers, Bad Cops, Good Cops, Psychics, and Car Chases.'",
        "review_detailed_main": "HOLLYWOOD HOMICIDE\n\nGRADE: D+\n\nFor the past couple of years we've had a numerous amount of buddy-cop movies that attempt to be a `Lethal Weapon' or a `48 Hours' but don't even come close. That's usually because the two `buddies' don't have chemistry and the plot reeks more than a thirty-year-old turd. Those are just a couple of the problems in `Hollywood Homicide.'\n\nFord plays Joe Gavilan, a homicide detective that's up to his butt in debt and in his spare time dabbles in real estate. Hartnett plays his younger partner K.C. Calden, who is reconsidering being a cop and wants to be an actor, and in his spare time he's a yoga instructor. Things start to go awry when their investigation in a murder of a rap band leads them to a music CEO named Sartain (Isaiah Washington) and an unknown murderer (Dwight Yoakam). And at the same time, Internal Affairs officer Bennie Macko is trying to arrest Joe, who is dating Macko's ex-girlfriend Ruby (Lena Olin). Take all this and add about thirty-two subplots you get `Hollywood Homicide.'\n\nThe biggest problem with `Hollywood Homicide' is that it contains a long list of useless subplots that take up about half the film, leave no room for character development, and take us completely away from the main storyline. They throw the `Homicide' out the window! They might as well have just named the film `Hollwood'! They sure as hell deal with everything with `Hollywood' besides `Homicide`: hookers, murderers, rap artists, repo men, wannabe actors, drug dealers, bad cops, good cops, psychics, and car chases. Hey, why not just call the film `Hollywood Hookers, Murderers, Rap Artists, Repo Men, Wannabe Actors, Drug Dealers, Bad Cops, Good Cops, Psychics, and Car Chases.' If they would of went with that title I wouldn't have went into the theater expecting a good crime-solving movie, that dealt only with crime-solving, not that other mumbo jumbo.\n\nWhat's up with Harrison Ford these days? Since 1998 all he's been doing is picking bad movies! With last year's `K-19: The Widowmaker' where he sported a really bad Russian accent, and 2000's `What Lies Beneath,' where he played a character that wasn't him at all. Here he plays a cop. He's played a cop in numerous film like `Witness' and `Clear and Present Danger.' But at least in those films he actually shed a little bit of charm and heroism. Here he just goes though the script like a zombie, showing not a glimpse of a real cop. And his supporting actors Josh Hartnett and Lena Olin don't help out at all. None of it feels real. It all seems like they have to be there, not that they want to be there.\n\nIt's not like Ron Shelton isn't a good filmmaker, he's made great films like `White Men Can't Jump' and `Cobb.' It's just that his lifeless script with Robert Souza packs no punches at all and takes no risks. When they were writing the script they were probably thinking seeing Ford ride a pink bicycle would be hilarious, but it's not.\n\nDeep in this soulless piece-of-crap filmmaking, there lies the final half hour, which is the only reason I'm not grading this film any less. It's probably one of the best choreographed chase scenes on film. Only if the whole film had been that good."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "ericzillazillo",
        "review_rating": "6",
        "review_title": "Movie 8, Comedy 4",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "ironhorse_iv",
        "review_rating": "4",
        "review_title": "Hollywood Homicide!? More like Hollywood Suicide! This movie kill itself! It's awful!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "tabuno",
        "review_rating": "7",
        "review_title": "A Commendable Effort for a Difficult Task",
        "review_detailed_main": "16 June 2003. It's not easy to make a semi-serious, comedy-cop thriller. Director, writer Ron Shelton (writer for Tin Cup and Bull Durham) took upon himself a very complex and difficult assignment trying to combine comedy with a rather serious, violent cop murder mystery. There were spots in the first half of the movie that seemed to lose action and momentum while the uneasy mix of crime drama and comedy required some brilliant skill and scriptwriting. The end result, \"Hollywood Homicide\" came out much better than the conflicting, confusing trailers of the movie (one a serious cop version and second trailer a comedy in the vain of Beverly Hills Cop).\n\nThe humor was above average, tinged with dry and cerebral humor not usually found in comedies these days. The interplay, the pushing the envelope in character development and character backgrounds were all good efforts at better, quality movie making. This movie was an entertaining and great first attempt by Ron Shelton who took risks with his material and found an fine balance between humor and story plotline that truly promises even better things to come.\n\nHarrison Ford did great with his expressions, his sense of humor, and his letting go and enjoying, playing his part while Josh Harnett went a long for an enjoyable romp with a different kind of cop movie. While this movie wasn't perfect nor Oscar performing, it rates kudos for its experimental success in bringing more to the screen and braving new quality attempts at good movie-making. Seven out of Ten Stars."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "CuriosityKilledShawn",
        "review_rating": "1",
        "review_title": "Flatliner",
        "review_detailed_main": "This film couldn't be flatter. Even if you stomped it into the ground, went over it with a steamroller and landed a plane on it. Even as a bog-standard 80's direct-to-video, el-cheapo cop-thriller this would be the crap-de-la-crap. Hollywood Homicide (rubbish title!) thankfully and fortunately flopped big time in the summer of 2003. Though the audience who said 'no' to this were probably the same people who contributed to Bad Boys 2 (and equally terrible film from the same writer) being a success.\n\nHarrison Ford and Josh Hartnett play cops who moonlight as a real estate broker and yoga instructor. But Hartnett has aspirations to be an actor too (the irony is somewhat lost on him) and ends up yelling lines from A Streetcar Named Desire whenever he can. Oh stop it! My sides are splitting!\n\nAfter a couple of rappers are gunned down in a nightclub they investigate. Ron Shelton manages to stretch out this incredibly NON-existent plot for very painful, very boring 115 minutes.\n\nIt tries to be funny, and thinks it is, but this arrogance only amplifies the tediousness of the rank-amateur script. I kid you not; I could have got a 12-year-old, hyper on Buzz Cola, to write something better and more professional.\n\nHollywood Homicide is Unbelievably bad. And, I never thought I'd say this, it actually makes Showtime look good in comparison.\n\nThe DVD is 2.35:1 anamorphic widescreen and Dolby 5.1 sound. There are extras but I couldn't care less coz this film is rotten."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "nathanmanson",
        "review_rating": "7",
        "review_title": "Hidden gem",
        "review_detailed_main": "I've debated this film for a while but because of the low review rating I've been put off. However It was the last day it'll be on Netflix so it's literally now or never.\n\nI can't lie after the first 20 minutes I thought this just isn't the one and I'd just seen a really bad film so really wasn't in the mood. But it just kept picking up. It kept getting funnier as the film went on. It had that perfect mix of comedy and action. Was the definition of a proper early 2000's comedy action movie. The scene where they was both in the interrogation rooms was hilarious. I never knew Harrison Ford could be so funny.\n\nI'll definitely be recommending this film to my friends. I'm just glad I actually got to watch it because if I didn't I'd have definitely never watched it."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "pradlee",
        "review_rating": "1",
        "review_title": "awful fullstop.",
        "review_detailed_main": "this movie was not just bad it was so dull that it was really really bad. You could watch the first ten minutes and the last ten and be done- there is no need, really, no need to watch any of the rest. Unless you want to watch harisson get it on while eating a doghnut? and poor car chase, rubbish script, bad editing, awful soundtrack (watch out for the build up to the bits your supposed to laugh at but just arent funny, on any continent in any country). There is NO STORY!, except one that could be shown on an episode of Diagnosis Murder - and that is alot better! As I write this I actually realise that it is so dull that its not in the slightest bit entertaining, looks like it was made in the eighties but not influenced by anything good. There are so many worse films that are entertaining- if that makes sense, but this aint even bad enough to be that. Rubbish, rubbish, rubbish! Just needed to get that off my chest. It really is!"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "kersus",
        "review_rating": "10",
        "review_title": "Next Generation Lethal Weapon.",
        "review_detailed_main": "One of the best movies I've ever seen. It has it all: action, suspense, drama, and comedy that could hurt your gut.\n\nThe characters are so well developed, you know them inside out early in the film, yet no time is wasted on it. The movie keeps a good pace throughout. The casting was great, and everyone had their part down pat.\n\nHarrison Ford is dynamite as Joe Gavilan. This is the new and improved Lethal Weapon. I've seen 14 year olds, 30 somethings, and 60 somethings all thoroughly enjoying this film. There are beautiful women to appease some but no gratuitous sex scenes. There is action, but no senseless violence. In all, I think this gives something to every type of movie watcher.\n\nThe humour is built into the movie and you don't have any Jar Jar Binks (or Joe Pesci as in Lethal Weapon) type characters that some require for humour. The characters actions and the results of those actions will leave you laughing harder than ever.\n\nThis is an immediate classic that would make a great series or even TV show if done with the same quality of this film."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "AirBourne_Bds",
        "review_rating": "7",
        "review_title": "Homicide, or Sideline?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "cine-11",
        "review_rating": "3",
        "review_title": "Wow, what a stupid movie!",
        "review_detailed_main": "This movie was such a formulaic, phone-it-in effort at making a typical Hollywood action film that it was almost a parody. There were about 20 mins of plot in this 2 hour movie (any Law and Order episode would blow it away). The rest was filler using sappy relationships, the usual police trouble with internal affairs (with a cop-out (heh, heh, get it) resolution) and the standard car chase seen at the end that went on so long, it began to get boring. Avoid this one."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "phanatic1160",
        "review_rating": "",
        "review_title": "underrated",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "DunnDeeDaGreat",
        "review_rating": "5",
        "review_title": "Still having mixed thoughts on this one",
        "review_detailed_main": "Hollywood Homicide isn't a good film when you get right it down to it, nor is it a really bad one. Hollywood Homicide is a film that was butchered in the editing, script department and really lacks what it needed to be a hit in the summer time which is more action. The trailer pretty much gives away the plot which at some points in the movie goes haywire it seems like the studio was forcing Ron Shelton to give everything into the movie so it could be a big summer tent pole release but alas for a movie of this nature to be a big summer tent pole release in my opinion I would have changed a few things. Number one- replace the non acting Master P with the more rounded Mos Def (who can make any bad movie pretty enjoyable hence his work in Showtime). Number two - make the film R rated you can't make a movie about Gangster rappers and not have profanity, I mean honestly how many ganster rappers do you know that release clean CD'S by choice also add some nudity. As much sex as Hartnett was getting the film could have showed some T&A ! Number three - Give the very underrated Isiah Washingtion more screen time as the villain ! I think that version of Hollywood Homicide would have been good to release in the summer. Although Ford and Hartnett have good chemsitry the film that is made here would have been better suited as a winter or fall release. So like I said I still have mixed thoughts on this one I liked the film for Hartnett and Ford and the many cameo's and pop culture refernces but the story line and lack of action upset me. I give the film ** stars."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "blanche-2",
        "review_rating": "7",
        "review_title": "okay, so it's not Citizen Kane",
        "review_detailed_main": "I actually thought this film was pretty funny. I love Harrison Ford, and here he stars in \"Hollywood Homicide\" as a cop/real estate broker. The film also features Josh Hartnett as his partner/fledgling actor, Lena Olin, Bruce Greenwood, Isaiah Washington, Keith David, Dwight Yoakam, Lolita Davidovich, Martin Landau, Master P, Lou Diamond Phillips, Gladys Knight, Smokey Robinson, Kurupt, Dre, with a cameo by Eric Idle, and also Robert Wagner.\n\nDetective Joe Gavilan (Ford) and his young partner Kasey Calden (Hartnett) are assigned to a club slaying of a group of rappers. This brings them into the underside of the recording industry. Meanwhile, Gavilan is desperate to sell a house to get out of debt; later he tries to get the listing on the home of a producer (Martin Landau) in order to sell it.\n\nHis partner Kasey, whose father was a cop, isn't sure police work is for him. In fact, he's mounting a production of Streetcar in which he plays Stanley, and goes around practicing \"STELLAAA\".\n\nThe character of Gavilan is based on Robert Souza, a LAPD detective who also worked as a real estate broker ten years before retirement. The scene cuffed crook steals the gun from a patrol officer's belt and starts shooting it off in the parking lot actually happened during Souza's tenure.\n\nI thought the chase scene, with Gavilan commandeering cabs, stealing bikes and whatever, was very funny, and the production of Streetcar was a good touch. Practically speaking, I know in New York City police officers can draw their guns in the city proper but are not allowed to use them because of pedestrians. I can't believe they don't have the same law in Los Angeles, yet every time I see a crime movie set there, people are standing on the street shooting off guns. This one was no different.\n\nThis is just a light comedy. Take it as such, and you'll enjoy it."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "brodie6",
        "review_rating": "4",
        "review_title": "Horrible film, simply bad bad bad",
        "review_detailed_main": "This movie was the worst Harrison Ford film I have ever seen. I fast forwarded past many parts to get to the conclusion, which was equally stupid. The only cool thing about it was that you get to see Dwight Yoakum without his cowboy hat on. Dwight listen up my man, LEAVE THE HAT ON!!!!!! He looks like that weird looking brother of Ronnie Howard. You know the guy Ronnie throws into his films for three minutes to throw him some work. Seriously though, don't waste your time on this bomb. It's a bad as they come."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "muvphreek",
        "review_rating": "7",
        "review_title": "Why is it people have to be so critical...",
        "review_detailed_main": "Why do people have to be so critical? Sure, this movie is no academy award candidate and may instead be a prime razzie award choice. But why is that cause for anyone to cut into it just because maybe \"they\" didn't get the point? It isn't!\n\nThe older, big name actors really show their age... Harrison Ford in particular. It really shows when we see him running. And Frank Sinatra Jr.! I hardly recognized him! But they weren't supposed to be their original selves... even big name stars age. I thought the fact of their againg was handled well.\n\nThis movie is poignant in places, it has some brief dramatic moments, has some passable action sets and is moderately funny throughout. It will need to toned down language-wise before it can be released for broadcast TV and a few of the steamier scenes will probably be cut, but it should draw a TV-14 rating.\n\nThe overall plot is reminiscent of those aimed at younger audiences where there is an obviously malevolent bad guy and unlikely heroes must save the day. The bad guys don't gloat and make threats of world domination, but they do hire killers and carry guns themselves. I did think the interaction between the Internal Affairs guy and his \"minions\" was a bit hokey though.\n\nBottom line here is that if you didn't like the movie that much, just write it off. Don't jump all over it like it was some virus or something. Okay? Personally, I would recommend it for anyone who enjoys comedic banter, overdone chase scenes, neat stunts and a fairly simple plot, by today's standards."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "matthat",
        "review_rating": "1",
        "review_title": "medals should be awarded for watching the whole film..............",
        "review_detailed_main": "This is a desperate film with no redeeming features whatsoever. Once again Harrison Ford's lack of comedic ability shines(!) through and reminds me of his rather inept performance in Working Girl. I rate Ford a fine actor but this role appeared badly chosen and maybe he is a bit limited now he is probably too old for fully fledged action roles. Regardless of whether the film is intended to be a self parody as some reviewers have maintained, surely the most important requirement is that it should entertain. Some of the humour is so forced and woeful that it borders on embarrassing, and the plot line jumps incoherently from one unlikely scenario to another. Little use is made of some potentially very useful cameo performers, and I, like most others found Josh Hartnett's performance quite baffling. His best acting seemed to be in Streetcar, and I'm sure it should have been his worst !! Again I like Hartnett, and perhaps blame should lay somewhere other than with the actors - as the saying goes \"you can't make a silk purse out of a sow's ear\" Makes you wonder whether the script offered by that bloke from Outkast could have led to a better movie."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "eds2103",
        "review_rating": "7",
        "review_title": "contains several moments of absolute hilarity, generally good fun",
        "review_detailed_main": "This movie is not wonderful or anything, but it contains several moments of absolute hilarity, and is generally good fun. Ford and Hartnett are brilliantly funny together in some bits. I recommend you check this out for some great laughs. Apparently IMDb is not a fan of brevity as they consider any review incomplete if it is less than \"10 lines.\" But there's really nothing else I want to say about this movie. So what can I put here? How 'bout some cool quotes. Here are some great quotes from Joseph Conrad's novel \"Heart Of Darkness\":\n\n1. \"And this also,\" said Marlow suddenly, \"has been one of the dark places of the earth.\" (p. 5)\n\nMarlow delivers this comment about England just before he begins his tale about his adventures in the Congo.\n\n2. # \"I raised my head. The offing was barred by a black bank of clouds, and the tranquil waterway leading to the uttermost ends of the earth flowed somber under an overcast sky--seemed to lead into the heart of an immense darkness.\" --Marlow narrating\n\n3.\"I tried to break the spell--the heavy, mute spell of the wilderness--that seemed to draw him to its pitiless breast by the awakening of forgotten and brutal instincts, by the memory of gratified and monstrous passions. This alone, I was convinced, had driven him out to the edge of the forest, to the bush, towards the gleam of fires, the throb of drums, the drone of weird incantations; this alone had beguiled his unlawful soul beyond the bounds of permitted aspirations.\" --marlow\n\nGee, this book is pretty racist ultimately... but well written i guess."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "fullaware",
        "review_rating": "2",
        "review_title": "There's a movie in there somewhere",
        "review_detailed_main": "It's not a comedy exactly, it's not a drama exactly, maybe it's an action-adventure movie? No, not exactly. A sexy-leading-men-toy movie? No, not that either - it's all of these, yet none of them completely enough to be satisfyingly any one of them.\n\nTwo cops more interested in their side businesses than taking care of business. A ridiculous car chase / fight scene. A bumbling comedy that takes off on tangents not even related to the storyline.\n\nAnd poor ol' Dwight Yoakam: he sure is ugly isn't he? I know he can't help it, but it's like he works at it! What was it Sharon Stone said after dating him - \"She'd rather eat a dirt sandwich\". That personality comes out in every picture he's ever done. Look at Panic Room, The Newton Boys, Sling Blade, etc. 'We need a really ugly, balding *sshole. I know, Dwight Yoakham!'.\n\nIf it's on TV, and there's nothing else on, okay then suffer thru it. But do not pay money to see this garbage."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "Curmudgeon78",
        "review_rating": "10",
        "review_title": "Hilarious",
        "review_detailed_main": "I saw a sneak preview for Hollywood Homicide this last Saturday the 7th at my local theater.\n\nFor the record, I am a huge Harrison Ford fan (note my name). I'm a little biased in my opinion of this movie, but only a little. It doesn't affect my judgement of a good or bad movie. I think Harrison Ford's character was his most fun to watch since Indiana Jones. I've always wanted to see Ford in a shoot-em-up cop movie and he delivers. But it's more than that, he plays it with a colorfulness and with a different humor than anyone had expected him to.\n\nVery funny. Good buddy/cop movie. Good Ron Shelton movie. Good Harrison Ford movie. Good movie period."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "lavaside-60237",
        "review_rating": "7",
        "review_title": "Good for a Watch",
        "review_detailed_main": "Hartnett and Ford are both charming as hell, and make a good 'old guy and young guy' duo.\n\nThat's the entertaining part of the movie.\n\nWhat cheapens it is the case that the story centers around.\n\nBy 2003, 'gangsta rap' was played out.\n\nMaster P is horrible, along with all of the cliche villains.\n\nIt would have been better just keeping the movie about their personal lives, without any case - over what they chose to go with.\n\nIt is still a fun watch.\n\n5.3 is such a low grade for this movie, that it makes me wonder if I need to watch all of the other 5s on IMDb because they might be decent, as well.\n\nPeople are way too hard on this film."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "ozwillb",
        "review_rating": "3",
        "review_title": "Oh dear",
        "review_detailed_main": "Just watched this on netfix, never heard of it, and now I know why! Action or comedy, quite frankly it's neither. Still quite shocked as why someone like Harrison Ford agree to do this pile of hooey. Nevermind!!"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "glitterbugz590",
        "review_rating": "",
        "review_title": "AWESOME MOVIE!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "neil-476",
        "review_rating": "5",
        "review_title": "Not 100% successful. Or 50%, come to that.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "CKCSWHFFAN",
        "review_rating": "6",
        "review_title": "So disappointed with this",
        "review_detailed_main": "I knew there was trouble with this picture when I first saw the previews & clips. I have been a Harrison fan & collector since 1980. With Ron Shelton the man behind Bull Durham I thought this would be a much better film. Josh needs to go back to school to learn to act. The script was bad. What the actors were asked to do with this film was embarrassing. HAD to be Rap the music in the film. Great, lets listen to that through the film. Right, news cameras would NOT in Hollywood know who would be getting a star on the Walk of Fame that day! Totally lame is the best way to describe this film. This all I wanted to say on the film"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "howco",
        "review_rating": "1",
        "review_title": "Appropriate title",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "etrufio",
        "review_rating": "7",
        "review_title": "Eh, it was alright... I guess.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "lisa-104",
        "review_rating": "1",
        "review_title": "Save your money for another movie!!!",
        "review_detailed_main": "Who in the world told Harrison Ford that this was a good role for him???\n\nAnd Josh Hartnett...how does a 19 year old who can't fire a gun become a cop? Over used cliches plus zero character development and about 15 pointless music industry cameos equal a surprisingly bad film!!!"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "tastyhotdogs",
        "review_rating": "6",
        "review_title": "Somewhere in between Police Academy + Copland?",
        "review_detailed_main": "Slim pickings in the weekly videos this week at our video shop, so went with this. It had Harrison Ford, it was about cops, couldn't be all bad.\n\n\"Hollywood Homicide\" retells the story of Joe (Ford) a policeman who dabbles in real estate on the side. This storyline keeps the movie watchable. Joe's partner is the 2000's poor mans Keanu Reeves, Josh Harnett. The partners are working on the murders of a group of up and coming rappers. This is their focus, but they both have plenty happening outside of work. Joe needs to really sell a house or his finances are screwed and KC is about to star in a play which he hopes will see him get discovered. This means the story kind of gets torn in several areas, and no great detail or screen time goes into any of them. For this reason there's no great depth to the characters. The movie was still OK though, thanks to the real estate sideline and a few great cameos, including Eric Idle, Master p, Andre 3000 and more."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "anaconda-40658",
        "review_rating": "2",
        "review_title": "Hollywood Road Kill.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "altan317",
        "review_rating": "10",
        "review_title": "It was great",
        "review_detailed_main": "It was one of the greatest films I had seen before. If you didn't watch it before , I think you should see. In fact the names Harrison Ford and Josh Hartnett make you know where you need to go. Enjoy!"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "ericendres",
        "review_rating": "6",
        "review_title": "\"Happens to be\" a bad movie.",
        "review_detailed_main": "I looked forward to seeing this movie, based on some very positive reviews I'd read, touting it's unique sense of humor in the context of the buddy-cop movie genre. Well, I was enjoying it for a little while, and there were some humorous moments early on, but it quickly became stale and formulaic and far too incredulous, suffering from way too many \"happens to be\" elements.\n\nWhat I mean by that is...\n\nHarrison Ford's girlfriend happens to be the former girlfriend of the nasty cop who's out to get Harrison Ford, who happens to be involved in an old situation with Dwight Yoakum's character, who happens to be the cop who killed Josh Hartnett's father (with Josh Hartnett happening to be Harrison Ford's partner). Harrison Ford happens to be an aficionado of Motown, and the crime witness happens to be the son of an obscure Motown singer, giving Ford the clue to find his whereabouts. Ford's girlfriend (was her name Ruby? I just didn't care to remember what the names were after seeing it) happens to be psychic and this convenient ability happens to be the only solution for them to come across the criminals to lead to the conclusion. I mean, I don't mind a deus ex machina if used cleverly, but this was ridiculous.\n\nThe more I think about it, the more preposterous this whole movie really was, and largely devoid of any real substance or creativity. As I said, early on there were hints that this could be a fairly unique character-based cop movie, but it just never paid off at all in that sense, and the cliches and \"happens to be\" plot proved to make this a big waste of time. A great cast, including a decent smaller part for Martin Landau and a cameo by Eric Idle, but I really have to wonder why someone like Harrison Ford would have wanted involvement in this junk.\n\n4 out of 10 (and that was generous)"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "hobartjimson",
        "review_rating": "1",
        "review_title": "Don't waste your time.",
        "review_detailed_main": "The purpose of a movie is to entertain, nothing else. This one fails badly. The dialogue is terrible. The movie is slow. The one good scene has a character never in the movie again. I could give you examples of why this film never achieves it goal, which isn't what you might think from the opening, but that would waste your time as much as this movie. Spend two hours watching clouds instead."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "tedg",
        "review_rating": "",
        "review_title": "Nasty",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "mwilkes",
        "review_rating": "3",
        "review_title": "What a waste!",
        "review_detailed_main": "What a waste of talent. Why can't someone with Harrison Ford's experience refuse to participate in such lame dialogue as he did in this movie? It is reminiscent of the chimney speech from Gremlins. Now I understand Ford's lack of enthusiasm for the project when he was pitching it on Letterman last week."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "iirolamppu",
        "review_rating": "6",
        "review_title": "Lazy, traditional action movie",
        "review_detailed_main": "Harrison Ford is a good actor, but I think that he isn't good in action movies and he's acting was quite bad. Whereas Josh Hartnett was brilliant and I hope he would make more action roles in his career.\n\nStory of this film is very poor and that's why this movie has been unrated in all of movie posters. This movie isn't anything new and when you watch it you can guess what will happen next. There is some humour in this movie, but it didn't work at all.\n\nAfter all movie was well directed and I give it 3 of 5."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "JennyP",
        "review_rating": "3",
        "review_title": "Cute movie, until the last 1/2 hour",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "epdowd-2",
        "review_rating": "7",
        "review_title": "Harrison Ford shouldn't try anymore comedy.",
        "review_detailed_main": "\"Hollywood Homicide\" is not much different than almost every other \"mismatched buddy-cop\" picture that have been made over the years. It tries to be \"Lethal Weapon\" meets \"Rush Hour,\" which sounds like a great combination. But it just doesn't hit the mark. While Harrison Ford is usually a very believeable and dependable actor, he must take some of the blame for this lackluster flick. He has absolutely no comedic instincts. He is probably trying to break out of his leading man roles. He is, afterall, getting a little too old for those. Comedy seems like a good idea. DeNiro's been doing it, but Ford just can't pull it off. Josh Hartnett is better, but his character is so one dimentional that he's borderline boring. I was really disappointed with this movie overall because it had so much potential. It's funny how the trailers at the theatre were edited to make this movie look like a comedy, but the TV spots have action written all over them. It's not that any movie has to be one or the other, it's just that this one is all over the place looking for a home. Ford is good at the physical comedy, but when it comes to dialogue, he falls flat. Don't bother to go to the theatre, wait to rent this one on DVD."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "Murdoch82",
        "review_rating": "1",
        "review_title": "Don't watch this Hollywood bull***t.",
        "review_detailed_main": "This is like the worst movie ever, I feel sick. TERRIBLE acting and story. I never commented any movie in here before but I just had to warn everybody about this movie. Those of you who voted 5 and up: I feel sorry for you guys, honestly."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "jlancaster-28718",
        "review_rating": "7",
        "review_title": "What happened to Josh's face?",
        "review_detailed_main": "It got fat. He was soooo cute. I love me some vintage Josh. Pearl Harbor was the perfect Hartnett face. He's still real cute here. The movie is only so-so but Josh is still in his cute prime. I'm not a hundred percent he was ever a brilliant actor, he's ok. I actually thought he was going to be a major movie star after Pearl Harbor but it didn't happen. I'm not sure if that's because of his acting or his choice of projects? Idk. In this movie, I thought he could have exercised a little more comedic chops here. He wasn't terrible but not seasoned. But he has enough charm to get by, at least enough for me. I actually was more surprised by Ford being funny. Wasn't expecting that. But always love me some of that dreamy Josh face:)"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "bernythefly",
        "review_rating": "1",
        "review_title": "it sucks",
        "review_detailed_main": "it sucks and that says it all awfull story, awful acting everything is just pathetic i rented the movie for a night with my friends. after an hour of watching we throw it away...we didn't even wanted to see how it ends...we didn't care. i saw a lot of bad movies that i beared to watch till end but this one was too much my recomandation....don't go on cinema, don't rent it and god hope don't buy it.harrison ford better stick with playing indiana jones or a fugitive or anything then a cop or a salesman. the other guy better become a bus-boy or anything else than an actor(i didn't even learn his name ...didn't worth it). I give this film a great 1(ONE) and say that AWFUL IS NOT ENOUGH!"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "iLoveMovies919",
        "review_rating": "10",
        "review_title": "I loved this movie!",
        "review_detailed_main": "This may be one of the best Josh Hartnett movies ever. But not such a great one for Harrison Ford, it was to out of character for him and not in a good way. But then again Hartnett was out of character to. But in a very good way. I would really recommend it! I totally loved it!!!"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "bpostma",
        "review_rating": "4",
        "review_title": "I guess we've seen that before",
        "review_detailed_main": "Being listed as a comedy I would say there is remarkable little to laugh about in this movie. Both lead stars provide us with a totally uninspired performance and the story has nothing to offer either. Actually, I'm still wondering whether the side-story of Joe Gavilan (Harrison Ford) trying to sell some real-estate was supposed to be funny. This is your regular buddy-cop movie but it doesn't come close to the best in class, \"Lethal Weapon\". The action scenes also bring nothing new, we've all seen that 1000 times before. I watched this movie in two parts and I had to force myself to put the DVD back in the player and watch the second part. All in all I give it 4/10. Only watch it when you've got nothing else to do and are really really bored."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "obiwan2005",
        "review_rating": "",
        "review_title": "Ford is back in the saddle!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "thewoo82",
        "review_rating": "4",
        "review_title": "Indiana Jones... to this? What happened?",
        "review_detailed_main": "Harrison Ford's career is officially down the tubes. I knew this from the opening scene where we scene a wannabe thug with all gold teeth talking to a once well respected actor. Wow, all I can say is that 2 Fast 2 Furious was far more enjoyable then this stinker.\n\nI gave the movie a 4 just because the final 10 minutes kept me from falling asleep... if you decide to spend your money to go see this, heaven forbid, just show up for the last 10-15 minutes, its the only entertaining scene in the entire movie."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "Howlin Wolf",
        "review_rating": "4",
        "review_title": "Hollywood 'murders' ideas every day...",
        "review_detailed_main": "... Only with this one, I don't think there was truthfully that much to debase, in the beginning...\n\nA 'Keystone Cops' setup with someone as grizzled as Harrison Ford just doesn't work. Can you imagine the man himself pedalling real-estate? I wouldn't have thought so; he's far too 'gruff' and straight-down-the-line for that. As an actor he's a victim of the iconic roles he made famous; I'm sure he has a greater 'range' than some people will allow, but \"Hollywood Homicide\" is far too limp a vehicle for him to properly demonstrate it. Given a better script he could well play capably against type, but handing a non-comedian material too lame for Adam Sandler and expecting 'magic' to result is beyond even his talents. Each of you reading this review; think of the performer who generates the most chuckles within you... Got them? Right; well, I don't care who they are, even THEY couldn't have made \"Hollywood Homicide\" - as it stands - funny. Also, for something billed as an action-comedy, your pulse will likely be as constant as the expression of consternation that clouds your face...\n\nIt's Hollywood, alright; because you have trouble believing some of the actors here fit their roles. On that same note, why does Lou Diamond-Phillips have to consistently resort to playing transvestites in order to get work, these days????!! Midway through the running time, it gets to the point where there are so many extracurricular activities, we lose interest in what little actual 'plot' there is; so if the point is meant to be that these people aren't fully committed to the job they're doing, it's a case of life imitating art. The characters and actors appear sometimes disinterested, and ultimately that's how I felt, too."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "vampyrecowboy",
        "review_rating": "2",
        "review_title": "I paid a dollar for it and I overpaid.",
        "review_detailed_main": "What a waste of time and money.\n\nI wasn't expecting much and I got exactly what I was expecting and nothing more.\n\nIf you have time to waste in your life, than this is perfect.\n\nIf you have important stuff to do like - shine your shoes, cut the grass, count grains of salt or maybe wash your hair...then by all means - take care of those important issues before watching this movie.\n\nI thought of counting seconds in order to make sure that each one follows the next...but instead I decided to put this in the VCR and press play...I made a mistake."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "spinbunny",
        "review_rating": "5",
        "review_title": "Could have been a lot worse, could have been a lot better",
        "review_detailed_main": "I came out of this movie baffled --- I think I spent most of the time baffled. The entire internal police investigation thing I still do not understand (sharing of funds?) and Madame Cleo's and Psychic Ruby's characters (Lolita Davidovich and Lena Olin) looked so much alike the group of us spent the entire movie thinking they were the same character posing as one as part of the police sting and Joe's character didn't realize it. (we didn't even realize it until the credits rolled!) The bad cop and the donut scene was hilarious ... Josh Harnett needs to learn to stop acting without squinting and Bruce Greenwood was wasted (what a fine actor!) The best part of the movie were the cameo roles ... you will be laughing to yourself \"was that who I think that was???\" (and yes it was!) Not a bad was to spend a hot afternoon at the multiplex that has air conditioning ... just make sure you have lots of junkfood!"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "exa56",
        "review_rating": "10",
        "review_title": "Great movie!!!Negative critics!??",
        "review_detailed_main": "Hollywood Homicide is definitely a movie everyone should see !!!! I adored it !!Josh Hartnett and Harrison Ford make a superb team and they're really funny. What I don't understand is how critics from popular newspapers or magazines can be so severe in their judgment. I mean I saw awful comments on Hollywood Homicide . Some very insulting like : an humiliating comedown for Ford or Harrison and Josh Hartnett have about as much chemistry as a pair of wet socks!!! I know that everyone have their opinion but frankly I can't understand why they published articles full of insults about this movie. So everyone! Don't believe all you read about Hollywood Homicide and go see the movie. After that you'll be able to have your OWN opinion ...... personally I give it 9.5/10 !!!"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "NHNeil",
        "review_rating": "4",
        "review_title": "Homicide is right, this movie is dead",
        "review_detailed_main": "This time you should believe the terrible things that the critics are saying about this bomb. Why Harrison Ford would act in this movie is beyond me; certainly not to raise money to feed Calista Flockhart. The movie was a like a game of Jeopardy played by stupid people, no answers for many questions. Once again, I want my money back.....this movie sucked."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "bob the moo",
        "review_rating": "",
        "review_title": "Surprisingly unfunny and uninvolving film - deserves it's poor box office and reviews",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "crawl-1",
        "review_rating": "4",
        "review_title": "Waste of time",
        "review_detailed_main": "I spent an hour waiting to find anything I liked. This movie is another example of an emerging trend in Hollywood: find a name star(s) to save a dismal project.\n\nI guess I've seen too many cop pictures, but the whole thing here is old. I can think of at least 6 flicks with a similar plot line...throw in a couple kinks and bingo! you have a great movie.\n\nWrong!\n\nThe formula needs rethinking."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "mashcity",
        "review_rating": "1",
        "review_title": "Both actors didn't act, Josh looked embarrased to be in this",
        "review_detailed_main": "Harrison Ford is a great actor, however he should stick with \"Jack Ryan\" & \"Indiana Jones\", something is missing when his character is supposed to come across as funny- Josh Harnett can do better, & should have done better in this film.\n\nHowever together you wish their characters would have been killed off after the first five minutes (which were the best 5 minutes of the whole movie)! It was embarrassing to see these two fine actors turn in such weak performances."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "LeeAnn92",
        "review_rating": "3",
        "review_title": "What was Harrison thinking?",
        "review_detailed_main": "I can't believe I paid $7.00 to see this flick!\n\nThe movie has great gaping holes in it that are never explained fully such as: why does the fourth member of the rap group suddenly becomes a suspect and is arrested? How do they tie in the record label executive into the murders? All the detectives have for evidence is \"hearsay\". The implausability of the movie truly distracted from the performances and I never could buy into it.\n\nThe only reason to rent this film would be to see the chase sequence. It's truly fascinating and it's hysterical to watch Harrison wheel and deal on the phone (a la Hollywood) all the while cars are being wrecked around him.\n\nWait for rental."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "einezcrespo",
        "review_rating": "1",
        "review_title": "Over Hyped.",
        "review_detailed_main": "What was Harrison ford thinking when he signed to this? Despite all the hype I felt myself short changed in the end.Though it is admittedly light hearted fun the movie went no where fast. The movie fell flat. I had high hopes while looking at the previews. I guess like books don't judge a preview on star power. There was no chemistry between Ford and Lena Olin. No chemistry either with Josh Hartnet as Ford's partner in the police force. The cameos of Smokey Robinson and Robert Wagner was a waste of time. It was an embarrassing mess that should not have been done in the first place. The plot was silly and the acting average. All in all it was a pretty lame movie."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "Movie Nuttball",
        "review_rating": "10",
        "review_title": "Hollywood Homicide!",
        "review_detailed_main": "This is a pretty good movie. It stars Harrison Ford, Josh Hartnett, Lena Olin, Bruce Greenwood, Isaiah Washington, Lolita Davidovich, Keith David, Master P, Dwight Yoakam, Martin Landau, Lou Diamond Phillips, Kurupt, Frank Sinatra Jr., Choppa, Krazy, Magic, T-Bo, and Robert Wagner. I was so surprised about Phillips. His character is so convincing! This is a serious thrilling comedy actioner with lots of things happening all the time! There are many moments where Harrison Ford is just hilarious and a lot of other things in the film are as well! The action is really great and I loved the chase near end! If you like Harrison Ford and/or any of the actors mentioned above then I strongly recommend Hollywood Homicide!"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "Sergiodave",
        "review_rating": "3",
        "review_title": "That was not good",
        "review_detailed_main": "Those were the worst opening credits I've seen in a movie for ages, who would have guessed things wouldn't get any better. The basic plot could have worked well if they had a good script writer and two lead actors that gelled; unfortunately both gave terrible performances. Avoid this piece of rubbish."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "Special-K88",
        "review_rating": "",
        "review_title": "watchable but ineffective",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "jpintar",
        "review_rating": "5",
        "review_title": "So so",
        "review_detailed_main": "This movie is sort of a dramady that doesn't quite work either way. Harrison Ford is good as always as the veteran cop. Josh Hartnett,though, is miscast and needs acting lessons just like his character. Hartnett inability as an actor is more evident here when paired up with the far superior Ford. Of the other characters, only Lena Olin stands out as the psychic. The story is all over the place not knowing whether or not to be serious or funny. Either way, it does not justify a 132 minute running time. When the audience is way ahead of the characters who the killers are and it takes them so long to catch up, you know you are in trouble. The movie is also full of unnecessary subplots that inexplicably are supposed to join with the main plot at the end. Overall, a watchable mixed bag, 5/10."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "goth_marilyn",
        "review_rating": "3",
        "review_title": "No offense to anyone but this was awful!",
        "review_detailed_main": "The acting was just horrible, so was the story line! Even I was getting annoyed with the constant cellphone thing! it wasn't that funny either, but I guess you have to give the people credit for trying so hard. I feel sorry for the actors when this movie was looked down on by critics.\n\nActing: 1/5 Storyline: 2/10\n\nOver all: 3/10\n\nI didn't really even want to rent it..."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "eah51",
        "review_rating": "3",
        "review_title": "OK, not great",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "oragex",
        "review_rating": "1",
        "review_title": "Someone ruined this movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "buzznzipp1995",
        "review_rating": "10",
        "review_title": "Fun, fast and Ford with Hartnett are double barreled",
        "review_detailed_main": "This Harrison and the 'kid' movie I was roundly ignoring for a couple years. I had no idea that it was as fun and terrifically acted and directed as it was. I made an assumption about Josh and I was wrong. I saw the billboards in Los Angeles when I lived there and somehow I was interested in it for a moment then convinced myself that I didn't want to see it. After I bought it on DVD, I was driven by the story. Harrison Ford was a good cop with some trouble and a great real estate man on the side. Josh being an exercise instructor with a tunnel vision for perfecting his craft in Hollywood, and on the side a cop. Joe (Ford) is helping his young partner out in a pinch, along the way, (subplot), the kid learns some eye-opening stuff. This had some new and old school players that made it all mix right together. I have seen this several times and amongst the action there is a scene in a Mustang that kind of just sticks with me, in the aftermath they handle things as though they are just on the top of their best game!\n\nThis was a sleeper hit for me and unexpected action drama with a good slice of comedy.\n\nRecommended Highly for Hartnett and Ford fans."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "mburatti76",
        "review_rating": "1",
        "review_title": "Ugh",
        "review_detailed_main": "I'm not going to take too much time blasting this movie because it doesn't really deserve the effort. The only thing I can really say is I sat through this movie for 45 minutes then got up and walked out. That's how dreadful this thing was. There was nothing funny or exciting about any portion of this movie. When I looked at my watch I would have sworn I had been in there close to two hours, not the case. So if you haven't seen this movie, I suggest not wasting your time on this thing."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "Chris Knipp",
        "review_rating": "",
        "review_title": "Casual laughs and a mad chase",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "team_venture",
        "review_rating": "2",
        "review_title": "What Harrison Ford movies are almost never",
        "review_detailed_main": "This movie is terrible. There is no other word to describe it. The movie is riddled with plot holes, and only because the filmmakers wanted to keep it under 90 minutes. This is the type of movie where a 7 or 8 year old might like it because there is shooting and gunbattles, though they are poorly executed, but anyone who actually pays attention to films will be disgusted by the film's many mistakes. In short, don't go seeing this film expecting to see a well-written, well executed film, and certainly don't bother renting it either, and just watch it on HBO, like I did. In conclusion, a terrible film not worth your time unless the only other option is drilling holes in your head, which actually might be more enjoyable."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "dbborroughs",
        "review_rating": "3",
        "review_title": "Dull in a way that makes you wonder if they were trying to be this bland intentionally.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "zoe36",
        "review_rating": "4",
        "review_title": "Boring mostly, not even a good comedy!",
        "review_detailed_main": "Harrison Ford was not up to par in this movie, maybe he's just getting old and grabbing at any type of movie to appear in. I've seen some movies of his that were comic but to me, this was a bomb. All that running around doing real estate seemed to me silly."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "ArizWldcat",
        "review_rating": "2",
        "review_title": "Okay effort",
        "review_detailed_main": "but rather disappointing. During the first half of the movie, I squirmed in my seat, checked my cell phone messages (the sound was off...trust me), checked my watch...this was BORING. The action picked up a little in the second half and there were a few laughs, but in general, this was not the movie I hoped it would be. One good thing I can say is that at least Harrison Ford was not cast with a nauseatingly young girl as his love interest this time! Lena Olin, on the other hand, was not give much to do...there were lots of cameos (eric idle did make us laugh just by appearing on the screen...not many actors can do that) but in general, this was a lackluster movie...worth seeing at a matinee or maybe as a rental...on the other hand, it's summer, and there generally aren't that many good movies out in summer anyway <sigh>...."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "yeah_baby_5",
        "review_rating": "10",
        "review_title": "Good action",
        "review_detailed_main": "This movie in my opinion is the best movie of 2003. It has just about just about everything in it, action, drama, suspense and plenty of laughs. I was having a bad day when I saw this movie but after I walked out of the theatre, I felt better. Harrison Ford plays a little bit of a different role in this movie. His role as Joe Gavilan is a no nonsense cop who acts really tough in the movie. I strongly recommend this movie though, with it's great action and car chases, it is worth it. I give it 10 out of 10."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "amy6788",
        "review_rating": "2",
        "review_title": "Not a bad movie",
        "review_detailed_main": "If i wasn't such a complete Josh Hartnett fan, i wouldn't be saying this but i pretty much enjoyed this movie. It had its funny moments, but some of the time it was just horribly unfunny. When Harrison says \"F u very much\" i have to admit it was funny. I'm sorry to say this but...Harrison Ford is getting too old for buddy cop movies like this... I would've rather stared at Josh Hartnett for the length of the film than see Ford have a sex scene with some woman.\n\nI give it 6/10 stars."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "tara_retro",
        "review_rating": "",
        "review_title": "Hilarious and lighthearted fun!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "CitizenCaine",
        "review_rating": "5",
        "review_title": "Hollywood Foolishness",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "dollface007",
        "review_rating": "1",
        "review_title": "It was a felony!",
        "review_detailed_main": "I expected a lot more out of this movie. I thought the teaming of Harrison Ford and Josh Hartnett would be very interesting and the movie had been lauded as such a great one. I was absolutely disappointed and disgusted that I wasted my time and money to go see it. There was way too much swearing (right from the get-go) and it seemed as if it couldn't decide whether it was a cop flick, a buddy flick, a music flick, or just a throw-as-many-cameos-in-as-you-can flick. There were *some* funny lines and the movie did get good (finally) in the last 15 minutes, but basically, it was a complete waste of time and money. I didn't care for the writing (including the one dimensional characters, the lack of substance, the loose ends, and lame premise -- all of this happened in a few days? What's up with that?). The directing was okay (although not first rate). And I sincerely wanted to give Josh a haircut the entire length of the movie (what was the purpose of that 70's style anyway?). Bottom line: If you are interested in a real good story or even good scenery, don't waste your efforts to go see this movie. Both thumbs way, way down for this disappointing venture."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "blumis",
        "review_rating": "1",
        "review_title": "A TOTAL DISASTER",
        "review_detailed_main": "Yerok 7890 is right on! This movie is a mess! What amazes me is the good reviews from other IMDB reviewers. Anyone who wrote a good review for this movie must live in a cave and never seen a quality movie before. I gave it a one only because I was in a good mood that night. A TOTAL DISASTER."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "econnall",
        "review_rating": "3",
        "review_title": "negative",
        "review_detailed_main": "this movie was dissapointing and I went expecting very little in return. I think I barely cracked a smile at the half-hearted jokes and stale \"crusty-old cop vs. idealistic young, scrappy cop\" routine.\n\nthe funniest bit is at the end, however, so you got that going for ya."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "chamelion",
        "review_rating": "8",
        "review_title": "Entirely worthwhile",
        "review_detailed_main": "Kinda predictable, but worth a few laughs, especially with the dirty jibes to Hollywood. Ford displays his anger well and Hartnett gave a worthy performance at the last arrest. Light hearted fun overall. 7.5\n\nSome nice chicks in the yoga class."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "jeffreyrobillard",
        "review_rating": "",
        "review_title": "A lot of fun!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "gregeichelberger",
        "review_rating": "3",
        "review_title": "Don't kill yourself to see 'Hollywood Homicide'",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "stolen309",
        "review_rating": "4",
        "review_title": "Too much",
        "review_detailed_main": "This movie could have been good but the story has far too many sub-plots and the main theme gets lost. Is it Buddy-cop movie, is it a you killed my dad movie, is is a murder movie...it goes on and on. Not horrible but not worth the time."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "Quinoa1984",
        "review_rating": "5",
        "review_title": "Tries to poke fun at the genre, but can't help being apart of it",
        "review_detailed_main": "Ron Shelton seemed to have the notion that he could make a cop movie, obviously different from Dark Blue (which is the better movie), by using a strategy seen similarly in last year's Showtime with De Niro and Murphy. That one had laughs since each actor had their own personalities to add to the lengths the humor could take them. In 'Homicide', Harrison Ford and Josh Hartnett can only be as funny as the script allows them to be, and sometimes laughs come unintentionally instead of by true skill.\n\nShelton does try to give the genre a bit of a gear change- Ford and Hartnett play cops who also have part-time jobs on the side, Ford a real estate broker who's been lagging in sales, Hartnett a yoga instructor and wannabe actor who seems to have less skill in the later, though more ambition for that than his cop job. They're assigned a case involving a murdered rap group, which includes a record company and the main producer (Isaiah Washington), who may or may not be working different angles.\n\nIf any working comedy comes in the movie it's in small, ridiculous doses that may be funnier to a viewer depending on sense of humor, for instance their is a running gag involving cell phones, which may be funny if someone else in the theater doesn't have a cell phone that goes off during the scene (it unfortunately happenned to me at the screening I went to). Or in the climax in which the thrills are done with a quasi Lethal Weapon feel, where one can see Ford's frustration and relentlessness as a good thing or a bad thing. When the credits rolled up for Hollywood Homicide I concluded to myself that I had seen an unfortunately average cop-buddy piece, one that took itself too seriously to be a comedy, and took too many pot shots at the exagerations that could be placed in such a movie. Perhaps Ford can be good in comedy if he gets the right direction (he helped ease some of the tension in 6 Days, 7 Nights) and script. C+"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "proffate",
        "review_rating": "4",
        "review_title": "Terrific action finale, but...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "jotix100",
        "review_rating": "8",
        "review_title": "Bad title, but excellent Ford",
        "review_detailed_main": "The title of this film is misleading. Ron Shelton's satirical version of the L.A.P.D. Hollywood division is right on target. Most viewers go to see this film, probably, with the wrong idea in mind. This is a tongue-in-cheek account of these two so very different detectives that are real life partners on the streets of Los Angeles.\n\nFirst of all, the idea of Det. Joe Gavilan selling real estate on the side to make ends meet is hilarious. At the most intense moments of the film he is interrupted by phone calls from prospective home buyers, or sellers; it is not to be believed! Also, the idea that K.C. Calden, played by Josh Harnett, can't shoot the target and his partner has to do it for him, goes over people's minds. That part of the audience misses the point of the satire on the genre cleverly executed by director Ron Shelton.\n\nThis is a role Harrison Ford might have been waiting for. He is in top form here. He looks the part. His Joe Gavilan is a man who has seen better days already and is ready for retirement. Harrison Ford will always be identified, perhaps, with action films. He proves here that he can play comedy as well as anyone else without making the character looks stupid, or out of place.\n\nJosh Harnett on the other hand was a surprise in this film. He holds his own against Mr. Ford. They make a goofy pair wherever they go. The idea he is an aspiring actor in a town full of wannabes is hysterical. That he can teach yoga to a class full of female students is not one's idea of what macho police detectives should be like.\n\nThe casting of Lena Olin as Harrison Ford's love interest was very clever. She's a good actress whose career has been somehow limited by the choices she has made, probably, but she is radiant in this film. Bruce Greenwood, Lolita Davidovich and Keith David round up the cast, but obviously it's the Ford show all the way. They seem to have had a great time while filming it."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "bentasm1",
        "review_rating": "4",
        "review_title": "Eeeeeh, huh?",
        "review_detailed_main": "The movie was \"OK\". Not bad, not good, just OK. If there was anything else in the theater this would be skipped by far. Sadly, Fast and Furious 2 also stunk, but I'd rather see this than FF2. :) If you have a fetish for harrison ford or that other young punk, this will be a \"cute\" movie for you. Personally, I'd wait for HBO or Blockbuster."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "bonelessmonkey",
        "review_rating": "",
        "review_title": "I'm still confused",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "pc95",
        "review_rating": "3",
        "review_title": "Harrison Ford's Worst",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "dracwlya",
        "review_rating": "5",
        "review_title": "Wait for the video",
        "review_detailed_main": "I went to this movie not knowing what to expect, so I wasn't disappointed. The character interaction is great, and there are some great performances. However, I suspect that some of the story was left on the cutting room floor because - even though both we the audience and the protagonists know what is going on - the characters never get enough information to build a good case. Or maybe I just missed something.\n\nHowever, even if it was great movie, it wouldn't have been worth the $7.25 I paid to see it - it is not a big screen movie (not that there is anything wrong with that).\n\nSo, wait for the video."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "LOTR_Diva08",
        "review_rating": "5",
        "review_title": "Better than I expected",
        "review_detailed_main": "Hollywood Homicide wasn't exactly what you would call fantastic cinema, but it had some worthwhile moments. Harrison Ford and Josh Hartnett actually worked very well as a team. Hollywood Homicide had a few twists to it that made it different than the usual cop movies. Among K. C.'s 'Streetcar Named Desire' storyline, there were other parts that made the film reasonably amusing. I would suggest seeing this movie if you are in the mood for just a fun sort of film."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "elu5iv3",
        "review_rating": "5",
        "review_title": "Mostly a bore",
        "review_detailed_main": "Hollywood Homicide: 4.5/10\n\n\nI went to see 28 Days Later, but the next screening wasn't for two hours, so decided to watch Hollywood Homicide instead. This was the old cop/new cop storyline, with Ford as the veteran and Josh Hartnett as the young cop who also wants to be an actor. Like with \"Just Married\" from earlier this year, most of the funny moments were shown in the trailer, leaving a lot of dead time. Thankfully, Ford's acting made those parts watchable, but this was a poor role for Ford, who continues to slumber in Hollywood, taking mediocre roles like this instead of shining with better scripts. Hartnett is almost as green as an actor than his cop character was in the movie, somewhat charismatic, but not very good. Most supporting actors were weak, and the main strength of this movie was a really good chase scene through Hollywood at the end. I only laughed a few times, so this didn't really work for me."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "Guillaume_Fayot",
        "review_rating": "8",
        "review_title": "Not your average buddy cop flick.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "Floated2",
        "review_rating": "3",
        "review_title": "Odd cop film pairing doesn't work",
        "review_detailed_main": "Hollywood Homicide starring Harrison Ford and Josh Hartnett in an odd pairing and unrealistic cop crime comedy drama. This film didn't work as it film tried too hard to pair an older character with a younger one. The film did include some decent action sequences. Instead of making a memorable movie that could have stood out because of the wisdom, integrity or heart of the two men, in the end, all we get is a typical cop movie.\n\nThe film is labeled a comedy and does have comedic elements, but a lot of it is very forced. Examples would be of an awkward interrogation scene, and another scene where Harnett is chasing a suspected criminal where the criminal is shown going into a lake to try and dodge Hartnett. They weren't funny, and came off as awkward and time wasting. Hollywood Homicide did flop when it was released in theaters and one can see why. Several of the trailers were misleading, and the PG-13 rating to the film hurt it's chances, also of being a better film."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "casey_choas66",
        "review_rating": "",
        "review_title": "****1/2 out of 5",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "shawnthomas00",
        "review_rating": "2",
        "review_title": "I could have maybe gone for 2.5, but it's not worth rounding up to a 3",
        "review_detailed_main": "There's nothing to spoil so don't worry about that.\n\nThis thing was hanging onto about a 4 until the last 40 minutes; everything after that point drops it to a 2. Part of me is debating whether I should be more generous, but the gap doesn't seem big enough. It kind of just ran into a wall and fell down hard.\n\nIt's pretty bad but not the worst ever. Really there's no reason to waste my time or your time on it and I just felt compelled to contribute to the score. Unfortunately I am not doing both in reaching for this ten line minimum.\n\nBe assured that reading this was less boring than the film it reviewed."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "csjintn",
        "review_rating": "5",
        "review_title": "Hollywood Homicide --BIG disappointment",
        "review_detailed_main": "Hollywood HOMICIDE is an utter disaster, considering what Ron Shelton is capable of doing. This film is supposed to be a buddy comedy but it's mystery is a clichéd mess and it's not funny. Ford and Hartnett are both great actors but fail to generate much chemistry and the script is incoherent tripe. If you want to see a much better film by Shelton watch DARK BLUE with Kurt Russell in one his finest performances. Hollywood HOMICIDE is bland, stale, and uninteresting despite valiant efforts by Ford and Hartnett. There are a few fresh moments but ultimitely this film is a waste of time. Hollywood HOMICIDE-** out of 4."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "mdrebeck22",
        "review_rating": "1",
        "review_title": "Two cops working on solving a homicide of some really bad guys and got them into all kinds of trouble (I think)",
        "review_detailed_main": "This movie is hard for me to summarize because it was so confusing. Two cops were working together on a homicide, one older (Ford) and a younger partner. Frankly I had difficulty following the plot. All this business of selling his house and the romance (?) with Ruby got in the way. I didn't even get it. Maybe it's just me but I thought this was one of the worst movies I have ever seen and I couldn't believe an actor of Harrison Ford's caliber would even consider being in this movie. Normally I love Harrison Ford and was looking forward to watching it on late night TV However, it was awful. When it was over (and I wish I hadn't stayed until the end) I felt like someone was kidding me. This wasn't really Harrison Ford, was it? So sad! I'll grant you he doesn't look his age but he also wasn't acting his age. Come on - 60 is 60. Let's have a little dignity."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "hannahmeg",
        "review_rating": "2",
        "review_title": "oh dear...this film really didn't work!",
        "review_detailed_main": "Both Harrison Ford and Josh Hartnett are truly great actors...but watch Hollywood Homicide and you'll question whether Indiana Jones, Patriot Games or Pearl Harbor (which I think is a great film) ever really happened! Neither actor is convincing in either tough detective mode or amusing blunder time.\n\nThe precedence of rappers in the film too obviously markets it towards the MTV audience and yet still fails to deliver. Complete lack of substance, way too long, a parody of itself, this film is one of the worst films I've ever seen...although the scene where Harrison Ford steals a kids bike and battles with downtown traffic was so hilarious it almost made me forgive the rest of the film for being so bad...but only almost.\n\nAn embarrassing film on the resumes of a Hollywood great and an upcoming successor. Why oh why did they agree to do this film?"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "theonlymtm",
        "review_rating": "9",
        "review_title": "good movie",
        "review_detailed_main": "this is a good movie. it had action and comedy, the two ingredients that i love in a movie thats not scary, but they dont even make those anymore, usually they too are funny. This movie has a good spin to it, i didnt expect much really, but i got way more than i paid for, especially saying that it was a sneek preview.:)"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "ferguson-6",
        "review_rating": "4",
        "review_title": "The Bruce Greenwood jinx continues",
        "review_detailed_main": "Greetings again from the darkness. My screening was not billed as a \"Sneak Preview\", but I hope it was. Now director Ron Shelton can go back and edit this mess into a real movie. This is a waste of time and money. A very intriguing cast wasted in a joke of a buddy picture. This has to be the simplest genre to film. All you need is a bit of chemistry between your leads and then copy \"Lethal Weapon\" or \"Bad Boys\" or any number of decent films in the past. Not sure what was happening here other than Harrison Ford trying to latch onto the soaring career of teen heartthrob Josh Hartnett. Both look uncomfortable and talentless in this ridiculous flop. Lena Olin tries to add a touch of class and Dwight Yoakum, Martin Landau, Sinatra's son, and Isiah Washington all have their moments. Lolita Davidovich survives the best. Now on to Bruce Greenwood, who has no talent and has continued his streak of bad films despite being cast along some major film talent. ATTENTION HOLLYWOOD: STOP CASTING THIS GUY. IT IS SUICIDE TO YOUR FILM."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "sp27343",
        "review_rating": "",
        "review_title": "A good, but not great movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "disdressed12",
        "review_rating": "3",
        "review_title": "no comedic chemistry between Ford and Hartnett",
        "review_detailed_main": "i was so disappointed with this movie.a buddy cop film with Josh Hartnett and Harrison Ford should have had potential,shouldn't it?Ford and Hartnett play two cops who are partners and who also have second hobs to make ends meet or to have financial independence.they are called in to investigate the murder of a rap group.hilarity should ensue,right?if by hilarity,you mean endless yawning,then yeah,hilarity ensues.this one really hurt my brain.it was agonizingly boring to the nth degree.i think i saw this at a cheap theatre,but what ever i paid was exactly that amount more than i should have paid.i think they should have payed me to see this thing.i think the real problem with this movie,is their is no chemistry(the comedic kind) between Ford and Hartnett and that pretty much sinks the whole movie.for me,\"Hollywood Homicide\" is a 3/10"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "windtar",
        "review_rating": "3",
        "review_title": "Stink-A-Roo = Harrisons worst - Harnett awful = TERRIBLE MOVIE",
        "review_detailed_main": "Stnk - A - Roooooo Hollywood Homicide is pure garbage. The only reason i watched the whole thing is because im paralyzed, and i couldn't switch the channel myself in bed, lol.\n\nThis movie shows you that you can create a junky movie with a bunch of big name stars and it will still make money.\n\nI paid $1 at a flea market for it, and i want my money back! ha ha ha Everything about this movie was pure trash. It was too long, filled with boring stuff i didn't even care about.\n\nThe acting is awful... everyone was bad except the black cop, i liked his tiny roll.\n\nEvery situation was so fake, it was like the writer was in 12th grade.\n\nHarrison Ford reminded me of a old guy trying to act cool. His part was supposed to have comedy, but it was so fake that it just made him look dumb.\n\nJosh Harnette was absolutely awful. He should never trust the guy who wrote his part again. His character was not even likable. I personally would have seen his character killed off in first 5 minutes.\n\nThis movie was a waste of time. skip it, watch anything else that looks exciting to you on TV.\n\nI'd give it a 3, just because they spent millions to make it."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "priss666",
        "review_rating": "1",
        "review_title": "Trash",
        "review_detailed_main": "Please do not waste your time and money cuz if you have a brain in your head you do not want to see this. I like fluff movies at times if there is at least some redeeming value to them ie laughs, action, visuals. This has none of the above. I used to love harrison ford but i'm starting to doubt the movies he picks cuz the last few i've seen have been pretty bad. Josh hartnett is no doubt a babe and i thought he was the only redeeming factor. Some people think he can't act but i think he's a pretty good actor and will be a big star. I look forward to see what he'll do in the future. Anyway, i've already seen beverly hills cop and this totally reminded me of that. The plotline was contrived, the big chase scene unoriginal, nothing you haven't seen 100 times before. Please spend your money on another good movie that's out so hollywood gets the message and stops putting out drivel like this. I'm going to see 28 days later tomorrow and i have high hopes for that cuz shallow grave & trainspotting rocked and so does christopher eccleston. I can already say i'm sure i'll enjoy it much more than hollywood homicide. PS. Please do not spend your money on charlie's angels either cuz i hope they don't make another one. I know that's selfish of me but oh well."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "=G=",
        "review_rating": "5",
        "review_title": "Hollywood suicide",
        "review_detailed_main": "\"Hollywood Homicide\" sticks Ford and Hartnett as a pair LAPD homicide detectives in the middle of a mess of a movie involving some murders, an internal affairs investigation which connects with an external affair, moonlighting in real estate, yoga, and acting , and some love interest...yadayadayada. This lame comedy seems to get off on mixing the mundane moonlighting thing with cop stuff as though the \"cops are people too\" thing can be cranked into an eternal fountain of comedic creativity which, of course, it can't which, of course, is why this flick never really gets off the ground. Unfunny, undramatic, and ordinary in every way, \"Hollywood Homicide\" shoulda committed suicide and saved us all a some time and money. (C)"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "davidemartin",
        "review_rating": "9",
        "review_title": "Both a good cop detective flick and a good action comedy",
        "review_detailed_main": "I had no idea this was going to be as funny as it was. Dad and I went in expecting a serious detective flick about the seamy underbelly of the music biz. What we got was a good detective story about the aforementioned seamy underbelly and a helluva screwball comedy about two mismatched detectives and the troubles in their lives. Okay, the film is serious and violent at times so you might get a bit of whiplash as it switches from serious to comedy to serious again. But it's good whiplash.\n\nComing out of the flick, my eyes stung from all the laughing I did. And I was still giddy from the frequent andrenalin rushes. If movies are supposed to get you physically involved, this one succeeded.\n\nFord is quite enjoyable as the aging cop struggling to solve cases and make a fortune in legal second jobs. The problem is, other cops are not quite so picky where their second incomes come from. Hartnett is the young cop who is seems to be possessed by Shirley MacLaine. Lena Olin is quite fun as Rose, the radio psychic and Ford's girlfriend. Martin Landau is fun to watch as the aging film producer wanting to sell his mansion and maybe become a big name again.\n\nThe cast is full of people doing wonderful little cameo bits. Eric Idle starts of the parade as a writer protesting \"I did not hire prostitutes! That was research! Oh, hi, Candy!\" Lou Diamond Philips is gorgeous in drag as an undercover vice cop working a decoy stakeout. Singers Gladys Knight, Smokey Robinson, Dwight Yoakam and Frank Sinatra Junior all appear fleetingly (it was fun listening to the ladies behind me recognize her). And Robert Wagner is there basically to get a metaphorical creme pie in the face, but what the heck, you learn why Graumann's has that handprints in cement tradition! I have no idea why he's credited as \"Silk Brown\" though, as he is playing himself.\n\nWhile I can't stand cell phones myself, they are used to great comic effect in two scenes. And after watching all the ultra-grim Internal Affairs scenes on NYPD BLUE, it was a real hoot watching the simultaneous interrogations of Ford's and Hartnett's characters go completely awry.\n\nMy rating-- this is worth full price."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "robobox",
        "review_rating": "3",
        "review_title": "Less than the sum of it's parts.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "wellthatswhatithinkanyway",
        "review_rating": "",
        "review_title": "When are we gonna see some gratuitous sex,violence and language on our screens again?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "moneybagzz",
        "review_rating": "5",
        "review_title": "Great Concept, Sketchy Execution",
        "review_detailed_main": "Following on their successful collaboration in this summer's blockbuster \"Hollywood Homicide\" Harrison Ford and Josh Hartnett are going to release a 'crossover' album of the rap/hip-hop/house music genre.\n\nIt will feature brand new songs such as \"Horribly MisKast\" \"Kissing my Chances for an Oscar Goodbye,\" \"That Damn Ben Affleck gets all the Media Attention and J-Lo too\" and the classic \"Who is the Bigger Fool (My Agent or Me for Accepting This Role)?\"\n\nYou will also be dancing with your sweetheart beneath the mirror ball to the slow tune \"Donuts and Vitamin V...A tribute to over the hill action star.\"\n\nAlso, Smokey Robinson and Gladys Knight will be performing back up vocals, with Ludcris, Snoop Doggie, R Kelly and P Diddy on Violin, Cello, oboe and soup can, respectively.\n\nSpecial appearances by Grouch Marx, Karl Marx, Bruce Greenwood, Mark Hamill, Hillary Clinton and Scott Peterson have been rumored but are unconfirmed at this time."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "marcslope",
        "review_rating": "3",
        "review_title": "Da Don't Ron Ron",
        "review_detailed_main": "Ron Shelton is a clever and literate filmmaker who, at the top of his game, can transcend the trappings of genre (\"Tin Cup,\" \"Bull Durham,\" \"Blaze\"). That said, this cop-buddy-action-comedy is as generic as they come, and real junk. It paces feebly through every cliché, from the \"cute\" avocations of the partners (the older one sells real estate on the side, the younger one wants to be Brando) to the \"funny\" running gags (the young one's effortless studliness, the old one's cell phone with a \"cute\" ring) to the needless backstory (the younger one's dad was killed by one of the bad guys) to the pointless cameo guest stars (Gladys Knight, Smokey Robinson -- who are still welcome presences). And the women's roles! Sheer sex objects with no dimension; can this be the same Ron Shelton who wrote Susan Sarandon's great part in \"Bull Durham\"? The stunt doubles work overtime, the third-act car chase grinds on relentlessly, the bad guys have no edge or personality, the outcome isn't in doubt for a moment. Shelton's buddy banter is still a degree or two above the norm for this tired formula, and Ford paces with movie-star professionalism through the predictable trappings. As for Hartnett, why he's a movie star is never made clear."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "Tubby-11",
        "review_rating": "2",
        "review_title": "How did this thing get made?",
        "review_detailed_main": "Yes, this is a Harrison Ford movie. No, this is not a good movie.\n\nI went into this with low expectations. Not low enough. I thought Josh Hartnett was ok in Black Hawk Down. He is not ok in this, mind you, he and Ford have very little to work with.\n\nRead this and believe it: do not see this movie, do not rent it, do not watch it late at night if it's the only thing on TV, DO NOT."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "rainbowbrite0884",
        "review_rating": "9",
        "review_title": "Surprisingly Great",
        "review_detailed_main": "This movie was very funny, and exceded my expectations with all of the special effects, and cutesy scenes. It is a must see! It is amazing how funny Josh Hartnett and Harrison Ford can be when they are in the same movie. I give this movie a 9 out of 10."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "alfiefamily",
        "review_rating": "3",
        "review_title": "This is an amazingly bad movie...",
        "review_detailed_main": "for all involved. Script cannot make up it's mind if it is a \"buddy\" movie, a comedy, police action film, so it turns out to be nothing but a mess.\n\nThere is absolutely no chemistry between Ford and Hartnett(who continues to give one wooden performance after another). I realize that Ford is supposed to be the older, grissled veteran, but to me, he played it too old to make it believable. His big chase scene is laughable, especially when he gets on the girls bike.\n\nEverything about this movie is bad. Even the make-up. Did anyone else notice that Lena Olin's make-up was so heavy on her forehead and around her eyes, it made her look as if it had been applied by a cosmetoligist at a funeral home.\n\n2 stars out of 10"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "MovieAddict2016",
        "review_rating": "",
        "review_title": "I'd rather just watch \"Lethal Weapon\" again...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "mdefalla",
        "review_rating": "1",
        "review_title": "Hackneyed and cliched waste of time",
        "review_detailed_main": "This movie is neither 1.)original, 2.)funny, 3.)suspenseful, or 4.)interesting. It lacks in everything it tries vainly to deliver. In fact, this movie leads me to believe that there is a script salvage yard in Hollywood, where bits and pieces from other dismal buddy/cop/drama films can be sewn together to thus create a tangible blob of moving pictures that everyone has seen before. Ultimately this is where the tragedy lies: We didn't like those other movies the first time around."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "Alina-7",
        "review_rating": "9",
        "review_title": "Very Funny Movie!",
        "review_detailed_main": "Just saw this movie and it was just what I needed. A very funny Harrison Ford, plays it for laughs. He is very good at comedy...surprisingly as he's usually very stoic and non-expressive in his movies. Josh Hartnett is also very good. A great movie with lots of unexpected cameos."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "Scottfeinberg",
        "review_rating": "8",
        "review_title": "Deserves More Credit Than It Is Receiving",
        "review_detailed_main": "There were reports that the studio considered scrapping \"Hollywood Homicide\" because early returns on it were not favorable, but it was a very pleasant surprise. Harrison Ford hasn't done a lot of work lately, and most of it has not lived up to his high standards- it was good to see he's still got it. Josh Hartnett has not been a favorite, preferring to take on fluffy roles like the one he had in \"Pearl Harbor,\" among other things. But he, as much if not more than Ford, is responsible for this movie's enjoyable storyline, which represents a revival of the \"buddy\" film with a new take on it- it's a fast-paced, masked comedy, and one that should not be raking in 1/100th of what \"The Hulk\" is taking in this week."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "jmm509",
        "review_rating": "8",
        "review_title": "Quick-witted",
        "review_detailed_main": "This movie is based on a highly trained cop whos partner is with a rookie. They both portray other occupations such as Harrisons character is a laugh out loud real estate broker who gives every minute trying to sell a house while Harnett's character plays a yoga instrcutor and also somewhat of a playboy. The movie made me laugh and gave me something more to enjoy than other action comedies such as Rush Hour.I recommend this movie."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "jmm509",
        "review_rating": "8",
        "review_title": "I sat and I laughed!",
        "review_detailed_main": "The film has something that holds you in your seat for the entire. Maybe because this movie is somewhat more of a success in laughter than Rush Hour, most likely not at the box office. Harrison Fords character plays a cop who is greatly in debt and also holds a job as a real estate desperatley trying to sell a house and turn a quick profit. His rookie partner who plays a yoga teacher and somewhat also a ladies man who wants to get out of the business and become a actor mainly because he just cant take the job anymore. They investigate a crime that they are trying to figure out who murdered four sensation rap singers. I would agreed with the comment of Mr. Ebert and Mr. Roeper completley on what they said about this film. This movie I found that liked it right in the beginning. This movie is just a great way to start your summer off with some decent action-comedy to have you buzzing about all summer. Finally a pair of partners that I could finally get use to."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "jmm509",
        "review_rating": "8",
        "review_title": "Suprising!",
        "review_detailed_main": "I was stunned by the outcome of this film.A highly trained is partners with a rookie. Fords character plays a detective and a real estate agent. He spends the duration of the film trying to sell a house for a quick little profit. Harnett's character is a playboy which he also is a detective and a yoga instrcutor. Where they try to find the mastermind behind a number hits on rappers. I spent the entire of the film laughing and cutting to this little quick-witted film. This film was a more promising movie such other than action-comedies such as Rush Hour. I could defaulty sum this entire movie really into one SEE!"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "anuity",
        "review_rating": "8",
        "review_title": "Funny and enjoyable...",
        "review_detailed_main": "I saw a sneak preview of this movie was very pleased. I'm a big fan of Harrison Ford and it was great just to see him in another movie, but him and Josh Hartnett seemed to work really well together. The whole audience was laughing for the majority of the entire movie. All in all, this was definately worth seeing.\n\nI must say though that the pace seems to slow down somewhere in the first quarter of the movie, and I was afraid things wouldn't pick up, but luckily they did and the rest of the movie totally made up for this. Also, there did seem to be somewhat a lack of resolution at the end but nowhere to the degree where I felt jipped or anything. I still felt a nice resolution at the end.\n\nBut as I said, these complaints are definately outweighed by the rest of the movie which is thoroughly enjoyable. 8 out of 10 stars here."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "Okonh0wp",
        "review_rating": "8",
        "review_title": "don't take it too seriously, and you'll like it",
        "review_detailed_main": "*** out of 4 Homicide starts out slow but once you catch on, you'll see it's not an ordinary buddy cop movie. In contrast to the movies and TV shows we see way too often with mismatched cops who take their jobs way too seriously to provide good entertainment (Training Day, Showtime, Narc, Recruit, Third Watch, NYPD Blue, etc), this film is about two cops who are good at what they do but couldn't care less. Set in a city where everyone aspires to be something other than what they are, Josh Hartnett's K.C. Calden wants to be an actor while Harrison Ford's Joe Gavilan would rather be in real estate. Tied into the title, this premise cleverly pokes fun at its subjects' lives and subtly provides some genuine humor. Ford plays his role with far less intensity than you'd expect. Some might think he's sleepwalking through the script, and you can't deny that he doesn't put much effort to act like anyone other than himself, but the bottom line, is that a lazy Harrison Ford is fun to watch irreguardless."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "nicnik6",
        "review_rating": "10",
        "review_title": "Underrated",
        "review_detailed_main": "Hollywood Homicide is well worth seeing. One could start with analyzing the title and end up with criticizing the driving, but are these really what make the audience like or dislike a movie? They are not, in my humble opinion. Remember that if your horizon of expectations is not met, this is reason enough to chew on what you have just watched. To me, this movie was unexpected. While others may want to call it a bad detective movie, I like to call it a lovely comedy, a parody of both Hollywood industry and the police world. While Josh Hartnett can be unexpected in many of his roles, Harrison Ford really outdid himself playing such a part. So people, if you want to unwind after a bad or tiresome day, do watch this one. It's underrated!"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "votepedro492",
        "review_rating": "10",
        "review_title": "josh is amazing!",
        "review_detailed_main": "i totally have to say that josh hartnett does an amazing job on this movie! not to say that he is a total hunk! and i was on the movie set and got to hang out with him and hes really nice which makes him a even better actor because he doesn't have a big ego. This movie is a great comedy but yet there's suspense!Its a good movie to watch with friends, under 13 parents make have to skip a few scenes for violence and sex related matters . Other than that they did a great job with the movie! This movie is a great family film (for older kids that is) and is a lot of fun. Plus it takes place in Hollywood which makes it very interesting. They even have a guest start Robert Wagner! so its good for older ages too! The car chase at the end was done so great!They add humor to serious parts. K.C. (Josh Hartnett)is a yoga teacher and when he is taken to questioning he doesn't talk, instead his does yoga mean while Joe(Harrison Ford) is constantly talking on his cell phone during the questioning. That scene for sure brings out a good laugh from the whole crowd!"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "rudicantfail",
        "review_rating": "8",
        "review_title": "Not bad",
        "review_detailed_main": "This movie \"Hollywood Homicide\" is one of those movies that don't make it big. Harrison Ford stars in this, and he is a solid actor, but perhaps he should have avoided this one. I do not mean that this film is bad, just Harrison Ford has done better films. This actual movie is OK, it has a sort of decent storyline, and the script works well. There is some comedy injected into the script, plus there is a fair amount of action. It is pointless giving the script, because it has been explained in other reviews, but I will say that this is actually not too bad, it is entertaining and funny in parts. It is a decent movie to watch, but will never be a \"cult Movie\" status."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "thebrenman",
        "review_rating": "8",
        "review_title": "Great, Average Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "Yoids",
        "review_rating": "9",
        "review_title": "One of the best characters ever created",
        "review_detailed_main": "A great movie, not because of a complicated plot. It's just a real situation of two real characters. Gavilan (Harrison Ford) is one of the best characters I've ever seen in a movie, as you'll end up identifying with him and understanding every situation he has to deal with. It wont get any Oscars, but the movie WILL make you have a good time."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "jdhlover",
        "review_rating": "10",
        "review_title": "IT WAS A GREAT BEYOND GREAT MOVIE AND THEY SHOULD DEFINATELY MAKE A SEQUEL!",
        "review_detailed_main": "I loved the movie! It was funny and adventurous all at the same time! Josh looked and acted absolutely wonderful! Harrison Ford sort of tied the movie together adding the extra dose to make it better! They make a perfect team!I hope to see a sequel"
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "sevenof9fl",
        "review_rating": "8",
        "review_title": "Glad I gave this movie a chance",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "Montaya_111",
        "review_rating": "9",
        "review_title": "Harrison Ford and Josh Hartnett are quite a Pair",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "lynnellismiller-43836",
        "review_rating": "9",
        "review_title": "If you've ever moonlighted as a realtor you will love this movie!",
        "review_detailed_main": "I love this movie. When I was selling software ( a job that gives you much freedom), I too sold high end real estate, not as high as Joe, but I, too, found myself taking phone calls during dinners, parties, house guests, etc. I have seen realtors who got themselves into horrible real estate investments that were similar to those of this movies heroes. And the reactions are all the same as portrayed in this film. While it seems a little far fetched I assure you it is not. Harrison Ford plays the cop who gets himself into all kinds of trouble from imminent foreclosure, repossession of his auto and complications in his love life. Watch it to laugh at this close to life example when one occupation collides with another."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "Frogfisher",
        "review_rating": "8",
        "review_title": "This is actually good... well done",
        "review_detailed_main": "I regret I didn't see the whole film missed some of the start, but wauw I really thought it fun and good.\n\nI somewhat like the modest story a crime movie, that just runs amok in silly incidents, fun subplots and a good cast. I think the film works rather well and even though there are rather a lot of subplots the whole thing stick together pretty well. At no time did I feel confused or felt that the film lacked anything. It didn't try to be to much. A thing I loved was that the film was sort of a series of quit realistic scenarios and incidents that you can see happening out there in the real world. And it still manage to be hilarious. My favourite scene is the interrogation scene... I laughed and laughed and woke my roommate... and kept laughing.\n\nThis is a new favourite... gotta see all of it a some point."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "spurofda_moment",
        "review_rating": "8",
        "review_title": "Ringtones",
        "review_detailed_main": "I think the whole movie deserved an 8 just for the ringtones i mean what a quality idea, but on a low i think that Harrisons feet where a bit how you say minging. And i think the whole concept of Harrison being a cop while also working as an estate agent is just nothing short of amazing. I am just writing crap now to take up the lines, so i also think that Harrisons shades are really cool and if anybody knows where the prop is of these glasses i would much appreciate it, i also know I spelt that word wrong so please could someone also correct me on it as i don't want to sound like a div in the future! I like the part in the film where the gangster rapper is running from the cops it was quite entertaining, also when he wets himself that did get a snigger out of me."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "filmbuff20",
        "review_rating": "",
        "review_title": "A fun disappointment, but a disappointment nonetheless",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "bnl771",
        "review_rating": "",
        "review_title": "Only murder here is careers",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "tasha12042002",
        "review_rating": "10",
        "review_title": "Josh lovers will love \"Hollywood Homicide\"",
        "review_detailed_main": "Hollywood Homicide was made for the hartnett loving, car chases are cool too, don't-care-much-about-the-plot-just-as-long-as-it's-josh teenage girls.\n\nWhich is why it is my favorite summer movie so far. It is a pretty good movie about different age groups clashing and being drawn together over common intrests (like women). Most of the movie is headshots of Josh, but it's not like I'm complaining..."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "mickturbo",
        "review_rating": "8",
        "review_title": "Ford Funny, Movie Muddled",
        "review_detailed_main": "While watching Hollywood Homicide I couldn't help but feel like Harrison Ford and Josh Hartnett probably had a good deal of fun making the movie, and certainly a good deal of this fun is shared by the audience. Ford here reminds me of his appearances on Late Night with Conan O'Brian, a times reserved yet sprinkled with burst of manic silliness. He is downright funny in this role and I was surprised at how much I liked the on-screen coupling of Ford and Hartnett. The rest of the movie, however, seemed like it had been written much too hastily. The concept is a good one - cops in L.A. often have second jobs to supplement their income - and it is fairly well executed, yet the quadruple homicide plot seems to be secondary to the shenanigans of the characters. The movie seems to want to be Lethal Weapon, but can't find a comfortable rhythm. At times it felt like entire scenes were missing, as if there'd been some mistake in the projection booth, that's how badly the movie flowed. Overall, however, the performances make the movie an enjoyable one and worth a look."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "moviesfilmsreviewsinc",
        "review_rating": "8",
        "review_title": "Harrison Ford at his prime",
        "review_detailed_main": "\"Hollywood Homicide\" is a movie starring Harrison Ford and Josh Hartnett as detectives Joe Gavilan and K. C. Calden, assigned to Hollywood. Galivan, preoccupied with his real estate business, attempts to sell a house to a club owner who has just been killed. Calden, who wants to be an actor, has Galivan run lines from \"A Streetcar Named Desire.\" The movie was directed by Ron Shelton, who co-wrote with Robert Souza and specializes in funny dialogue for guy characters. The movie is more interested in the goofy cops than the murder plot, with their dialogue redeeming otherwise standard scenes. The movie features a double act between a man who has seen everything and a man who has seen too much. K. C., who moonlights as a yoga instructor, agrees that they are all going to die someday, but his philosophical observations are cut short by a crash. The movie \"Hollywood Homicide\" begins with a hit on a rap group in a music club, resulting in four deaths. Joe and K. C. investigate, but are under investigation by Benne Macko, the Internal Affairs guy who hates Joe. Joe is suspected of \"mingling funds,\" confusing his personal debts with his real estate business debts. He has been seen with Ferre Salesclerk, a known hooker, and Ruby the psychic (Lena Olin), another member of the Los Angeles women who believe it is fun to make love on a blanket in an empty house. Hartnett makes an able partner for Ford, trading deadpan dialogue and telling everyone he's an actor. He has one of Shelton's nicest little scenes when he goes to the morgue and looks at the dead bodies of the murder victims. There is a chase and a half at the end of the movie, filled with cameos and walk-bys, including Frank Sinatra Jr. As a show-biz lawyer, Martin Landau as a fading producer, Lou Diamond Phillips as Wanda the cop in drag, Gladys Knight, Dwight Yoakam, Isaiah Washington, Master P, Kurupt, Eric Idle, Dr. Dre, and just plain Dre. Much of the closing excitement depends on the Fallacy of the Climbing Killer, a dependable chase cliche where the killer climbs to a high place from which he cannot escape unless he can fly. This film may be the most exciting film ever made about real estate, with the dialogue being the reason to see the movie. The movie is filled with cameos and walk-bys, and the dialogue is the reason to see the movie."
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "bwilcox",
        "review_rating": "",
        "review_title": "Uncomfortable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "poeticstickman",
        "review_rating": "",
        "review_title": "another bad buddy movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "dcobbimdb",
        "review_rating": "",
        "review_title": "Hollywood screw up",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "ddsterrell",
        "review_rating": "",
        "review_title": "Very Annoying",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "mario-rad",
        "review_rating": "",
        "review_title": "this can't even be called a movie, but only junk",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "brad-kruse",
        "review_rating": "",
        "review_title": "Enjoyable, but not 'Lethal Weapon x'",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "fernandorocha-3",
        "review_rating": "",
        "review_title": "Harrison doesn't deserve this",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "lhseaglerunner",
        "review_rating": "",
        "review_title": "I'd Like to Report a \"Homicide\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "mt7176",
        "review_rating": "",
        "review_title": "Funny but not Thrilling.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "mrchaos33",
        "review_rating": "",
        "review_title": "Neither Fish Nor Fowl",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "rarematters",
        "review_rating": "",
        "review_title": "What section will Blockbuster place this after it's no longer a \"new\" release?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "punkie22100",
        "review_rating": "",
        "review_title": "For the Love of Film...WHY?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "Jawsphobia",
        "review_rating": "",
        "review_title": "All it needs is a moral center",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "Yeroc7890",
        "review_rating": "",
        "review_title": "Words Cannot Describe How Terrible This Movie Is",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "CDC0805",
        "review_rating": "",
        "review_title": "I link Harrison Ford; I like Josh Hartnett; I dislike this movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "mrbiggmike",
        "review_rating": "",
        "review_title": "major lackluster",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "MLDinTN",
        "review_rating": "",
        "review_title": "Silly idea",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "dubbleglok",
        "review_rating": "",
        "review_title": "Finally someone shows how lousy hollywood junk can be.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "mjrother",
        "review_rating": "",
        "review_title": "A new definition of Bad has been achieved",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "mcfly-31",
        "review_rating": "",
        "review_title": "this script is murder...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "shoalin",
        "review_rating": "",
        "review_title": "The movie was also a victim",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "Buddy-51",
        "review_rating": "",
        "review_title": "Laid Back to the Point of Inertia",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "Goon-2",
        "review_rating": "",
        "review_title": "Pretty dumb",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "claudiacasswell",
        "review_rating": "",
        "review_title": "Truly Lame",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "Sheryl-10K",
        "review_rating": "",
        "review_title": "Is this money well spent?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329717",
        "movie_name": "Hollywood Homicide",
        "movie_rating": "5.3",
        "review_username": "vampiresan",
        "review_rating": "",
        "review_title": "A Television pilot put on the big screen",
        "review_detailed_main": ""
    }
]