[
    {
        "movie_id": "tt1535467",
        "movie_name": "Patiala House",
        "movie_rating": "5.6",
        "review_username": "niteshruparel",
        "review_rating": "6",
        "review_title": "A good entertainer with a nice message",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1535467",
        "movie_name": "Patiala House",
        "movie_rating": "5.6",
        "review_username": "ian959",
        "review_rating": "6",
        "review_title": "Worth while watch",
        "review_detailed_main": "Okay, first up I suppose I best say that this is the best film Akshay Kumar has done for a long time. Whilst he will never be a great actor, at least here he does an excellent job with a character that could have been a disaster. No over the top performance, this is a measured effort that conveys the character's inner turmoils very well.\n\nThe rest of the cast also do a fine job. Rishi Kapoor is always excellent and does a very creditable job as the head of the house. Dimple Kapadia plays his wife with sensitivity and purpose, although she is under utilised and perhaps underwritten and subservient in the screenplay. Anushka Sharma also does an excellent job in a role that could quite easily have devolved into a mess. I quite fancy that, on the evidence of her first four films, we may potentially be seeing the emergence of a new Queen of Bollywood.\n\nThe film itself is a very interesting look at the family in an Indian household in Southall, London, where traditional values are being undermined somewhat by the younger generation being more influenced by the cosmopolitan opportunities of a more accepting London than that which their parents faced.\n\nThe only real complaint I have with the film is that too many characters were brought to the fore and it results in a bit of confusion as to who is who. However, that aside, the screenplay is good, the film has a sense of purpose and moves forward at a nice pace. There is no unnecessary sentimentality brought into play and the end result is a film that does not scale great heights of classic cinema but is an eminently watchable film that deals with its subject matter very well."
    },
    {
        "movie_id": "tt1535467",
        "movie_name": "Patiala House",
        "movie_rating": "5.6",
        "review_username": "ssvikas",
        "review_rating": "5",
        "review_title": "Family drama served in a 'Patiala Peg'!",
        "review_detailed_main": "A Punjabi family in London, father scarred by racial discrimination, child not allowed to play a sport. Haven't we seen it in 2002 in 'Bend it Like Beckham'? But the drama in this flick is more akin to the 2005 golf drama starring Shia LaBeouf, 'The Greatest Game Ever Played'. Just watch them both as the game ends; you'll notice!\n\nRishi Kapoor plays Gurtej Singh Kahlon, a patriarch who runs his large joint family with an iron-fist and holds a sway over the Indian dominated suburb of Southall where racists are kept at bay and Indian cricket victories are celebrated with fanfare.\n\nAkshay Kumar plays his son, Gattu who has sacrificed his dream of playing cricket for England in the fire of his father's stubbornness. The rest of his family follows suit. Enter a silver lining in the form of a spirited Simran (Anushka Sharma) and her brother, the Patiala House now dares to think of a way out.\n\nSo, what does this movie offer? There's plentiful drama, family values that conflict with young dreams. You also get to see Hard Kaur singing Bhajans and a 34-year old getting to debut for the national T20 team simply based on a selector who's seen his backyard bowling. Laughable premises in a quintessential Bollywood drama! But, to its credit, you don't see a father yelling 'Chak-de-Phatte' to his son in the stadium.\n\nBut the film is however not about cricket. Coherent with the theme, it focuses on the father-son conflict arising from a generation gap and change in circumstances. But, the filmmakers exercise just enough caution not to show an England vs. India match, thus avoiding a possible double-whammy, and central theme losing focus.\n\nIn fact, after a bucket-load of lame comedies, it is good to see Akshay Kumar in a serious role after a long time. He deserves applause for aptly playing man who lives as a shadow of himself but with the fire still burning bright within. Anushka Sharma has surely developed since her 'Rab-ne' days especially after 'Band Baaja Baaraat'.\n\nShould you watch this movie? Not if you are paying through your nose for an evening show in an up-market multiplex. But for Akshay Kumar's performance and Anushka's undeniable screen presence, you can give it a shot when it hits the small screen."
    },
    {
        "movie_id": "tt1535467",
        "movie_name": "Patiala House",
        "movie_rating": "5.6",
        "review_username": "aafreen-karim",
        "review_rating": "",
        "review_title": "Tradition Vs Dreams",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1535467",
        "movie_name": "Patiala House",
        "movie_rating": "5.6",
        "review_username": "adverd",
        "review_rating": "3",
        "review_title": "grown up from CHOPRA era...!",
        "review_detailed_main": "film is bit copy or inspire from here & their. director trying to satisfied everyone from HERO to Punjabi community lives in UK. producer & so on. I don't revile the story. we already seen so many films about cricket, Indian people lives abroad & racism. this film also have all this ingredients. screenplay is not well enough written. so few question i like to ask to writer & director of the film (NIKHIL ADVANI) (1)- why RISHI KAPOOR settle in UK, if he patriot about India. (2)- why RISHI KAPOOR was rude with his children. (3)- what ANUSHKA was doing in film. how she survive. she have only motivation to hang around AKSHAY KUMAR. (4)- if RISHI KAPOOR don't allow to A.KUMAR to watch cricket than how he allow him to do net-practice for cricket. (5)- if A.KUMAR has decided that he follow his father's wishes then why he was doing cricket practice at night & hiding from the family. (6)- it's impossible that A.KUMAR playing cricket in UK team & RISHI KAPOOR don't know. RISHI KAPOOR was on a top for his performance. he was mind blowing. his face expression & particularly body language. I suppose he should get award for best supporting actor.\n\nFilm was completely predictable. you know that what going to happen in next seen & might be you don't care that what going to happen in next seen."
    },
    {
        "movie_id": "tt1535467",
        "movie_name": "Patiala House",
        "movie_rating": "5.6",
        "review_username": "kunalkhandwala",
        "review_rating": "6",
        "review_title": "Dull, slow ball...",
        "review_detailed_main": "In the aftermath of 'Kal Ho Na Ho', director Nikhil Advani has had to wonder about his films lasting in theaters till the day after their release. Evidently, his challenges have been in script, story, music, performances as well as the hype they generate. Two years after his 'Chandhi Chowk to China' debacle, warning signals were set off with the previews of Patiala House....and rightly so. The issues still persist but what comes as a shocker now, is the lack of originality in story. Patiala House, only decent in some parts, is a dampener of sorts with melodrama etched all over its tired plot.\n\nFar too often have we seen an obdurate father curtailing the aspirations of his talented son who eventually, has to break out. When that talent revolves around cricket, comparisons with 'Iqbal' are inevitable and there, the film falls like wickets on a yorker delivery. Gurtej Kahlon (Rishi Kapoor) confronts the unjust discrimination inflicted upon his family by a group of Englishmen with non-violent protests that called for rights and change. Years later, after making lives better for his community in Southall, Kahlon's obdurate attitude towards the English prevents his son Gattu, from realizing his dreams of playing cricket for England's national team. Forced indirectly into a lifestyle as a shopkeeper, Gattu lives on to adhere to every command of his father's by sacrificing his dreams. As a result of his passive nature, he is not a favorite among his family of dreamers and it all looks hopeless till Simran (Anushka Sharma) enters his life, dominating his decisions and pushing him towards the try-outs for the English team selection.\n\nAnushka Sharma is perhaps the saving grace of the film. Her outspoken, bubbly attitude serve well to contrast the passive, soft spoken Gattu. She looks beautiful and seems to play such a role naturally, like she did in 'Band baaja baraat'. Rishi Kapoor's character is difficult to like even though, he is the most charming actor out there. Akshay Kumar's passive Gattu lacks intensity or a likable attribute to it. Even his bowling style doesn't have a secret weapon that we can look forward to in every game nor does the game last long enough for us to feel excited. Helplessly, we look back at the brilliance depicted in Nagesh Kukunoor's 'Iqbal' that had all these elements right, with some great performances but alas; Patiala House fails to deliver the excitement, fun, intensity or the emotional connection that can engage you.\n\nKyon main jagoon by Shafaqat Amanat Ali is repeated several times and is the only noteworthy track in the album. Even Hard Kaur fails to create magic in Role pe Gaya while the rest of the tracks are just forgettable.\n\nNikhil Advani has an ensemble cast of cricketers at his disposal with names such as Nasser Hussain, Symonds, Brendon McCullum, Pollard among others. It makes it interesting only in the beginning. Then, when you realize that these cricketers are not really adding any value to the debilitating script through the games, they seem like the rest of the cast. Another big issue with the film is the melodrama that Advani incessantly bowls at us. We are used to cinematic liberty taken by directors but here, we see dramatic liberty to its extreme. Kaali's final over against Australia lasts long enough for his family to make up their minds to go to the stadium, drive through London, buy tickets and then witness the dramatic last ball. Nikhil Advani is really making fun of his audience.....\n\nAnother disappointment for Akshay Kumar and his fans, another flop in Advani's list and a wake up call to other big names who rely on their past credentials to bring the moolah in. It's not going to work."
    },
    {
        "movie_id": "tt1535467",
        "movie_name": "Patiala House",
        "movie_rating": "5.6",
        "review_username": "varuna12",
        "review_rating": "3",
        "review_title": "East is East + Bend It like Beckham = Patiala House",
        "review_detailed_main": "It is a bad, bad, BAD film!!! Terrible script, screenplay, story! Music sucks! Not even a single song is memorable!!!\n\nAkshay's performance is brilliant but wasted in a wasted film! Rishi Kapoor ji is brilliant but wasted! Dimple Kapadia ji were brilliant but wasted!\n\nWhy was Anoushka overacting? Was it all required! The family has been raised in UK but none of the younger generation had accents! The film cannot be categorised in any genre because it was a khichadi or risotto of sorts! Rather silly!\n\nI couldn't believe our filmmakers can still make such bad films! What has happened to Mr.Advani, only god or CIA can tell! Seriously disappointed!!!"
    },
    {
        "movie_id": "tt1535467",
        "movie_name": "Patiala House",
        "movie_rating": "5.6",
        "review_username": "AnonymousbutDilpreet002",
        "review_rating": "4",
        "review_title": "Has the potential but falls short",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1535467",
        "movie_name": "Patiala House",
        "movie_rating": "5.6",
        "review_username": "silvan-desouza",
        "review_rating": "3",
        "review_title": "Akshay's unique film but fails",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1535467",
        "movie_name": "Patiala House",
        "movie_rating": "5.6",
        "review_username": "bk_connection",
        "review_rating": "9",
        "review_title": "Is this Movie worth a Watch ???",
        "review_detailed_main": "I haven't written movie comments for years, but I feel like this movie deserves a review.\n\nI am one of those guys who has been cursing Akshay Kumar the last 2 years for making stupid movies, and getting a lot of popularity for cheap scale movies which has done big on the Box Office screen....I never really understood why people are so fund of watching the same comedy movies over and over Until the comedy aspect dies in the movie and it gets painful to watch the movie example: Action Replay, Tees Mar Khan etc.\n\nBUT PATIALA HOUSE made me think different regarding Akshay Kumar and his acting....this movie Akki played very well, and showed his acting skills and he deserves to get credit for that. The show stealer in this movie is Rishi Kapoor, he was perfect as Akki's father and made a powerful impact. Rest of the cast was good and acted very matured and it was good to see Dimple Kapadia again...Anushka Sharma is a delight to watch, every entry she makes the crowd smile, and I can see her one day becoming a top actress in Bollywood.\n\nso Is this movie worth a One time Watch: YES and Is this movie worth a Two time Watch: YES\n\nGo for this movie, its worth every single cent."
    },
    {
        "movie_id": "tt1535467",
        "movie_name": "Patiala House",
        "movie_rating": "5.6",
        "review_username": "rhik",
        "review_rating": "2",
        "review_title": "A remake of Chak de India!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1535467",
        "movie_name": "Patiala House",
        "movie_rating": "5.6",
        "review_username": "jmathur_swayamprabha",
        "review_rating": "",
        "review_title": "Have the times really changed in England ?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1535467",
        "movie_name": "Patiala House",
        "movie_rating": "5.6",
        "review_username": "mukesh-chandra87",
        "review_rating": "5",
        "review_title": "Patiala house a complete broken rhythm",
        "review_detailed_main": "Patiala House a movie deals with Asian minority issue in England during seventies to eighties.Akshay Kumar (Parghat Singh Kahlon) who is son of Rishi Kapoor(Gurtej Kahlon) a leader of Patiala House community wants to a bowler in England cricket team.But he couldn't play because of his father hates \"Gora people\".Then he Sacrifice his dreams for his father.A girl Anushka (Simran)change him when he enters in age of 34.Pragat Singh Kahlon has to choose one way weather he has to follow his father's honor or he has to play for his cousins who also have dreams but due to Gurtej Kahlon they also have sacrificed their dreams.In the first half movie bounds audience with emotional touch because of Pragat Singh Kahlon is criticizes by his own cousins.After interval movie becomes flow-less because a lot of movies have been made in cricket plot.Here movie looses it's rhythm.After continuous flop show of Akshay Kumar he choose a serious role but unfortunately Patiala House couldn't proof him.Rishi Kapoor has done a good work.Also Anushka did well.Nikhil Advani is still searching for success after \"Kal Ho Na Ho\".Music of movie is good including hit track \"Loung Da Laskara\" by Hard Kaur.Script could have been better."
    },
    {
        "movie_id": "tt1535467",
        "movie_name": "Patiala House",
        "movie_rating": "5.6",
        "review_username": "racinrush",
        "review_rating": "5",
        "review_title": "Should one watch this movie?",
        "review_detailed_main": "So I have been hating Hindi movies for a while now...cuz the plots are usually so stupid and have ever cheap visual effects. Especially some of the movie that have been done by Akshay Kumar recently, because i don't know are they supposed to be funny? They really are not...\n\nWell this movie was a little different where the acting that Akshay Kumar has done was kind of good. It is a good believable plot where the old man of the house lives in an older thinking. But they songs are good, the cast of the movie is not bad and only make it better. Although the story is a little over stretched but hey which Hindi movie isn't!\n\nBut I give this movie a 5, cuz it still an OK movie. Its not the greatest level of acting but it is still a good watch. I would watch it at least once."
    },
    {
        "movie_id": "tt1535467",
        "movie_name": "Patiala House",
        "movie_rating": "5.6",
        "review_username": "bobbysing",
        "review_rating": "5",
        "review_title": "Its more a Rishi Kapoor film than a Akshay Kumar venture with a not so convincing second half.",
        "review_detailed_main": "Writing about PATIALA HOUSE, firstly I would like to thrash all controversies and objections raised by some SIKH Individuals or Organisations regarding the clean shaven look of Akshay as the son of a Sikh character played by Rishi Kapoor. The very first 15 minutes of the film clarify everything about the look and I must say that the director Nikhil Advani does that very convincingly.\n\nTruly speaking PATIALA HOUSE may be a better movie as compared to Askhay's all recent releases but at the same time it's also not anything too good or exceptional when we talk about entertainment. The film remains a half baked product with a good first half and a very unconvincing second with everything predictable till the climax. Though the script keeps introducing new twists in the story post intermission, but still the overall impact on the viewer just remains an average one.\n\nAmong the merits of the movie, one can undoubtedly rate the performances of Rishi Kapoor, Akshay Kumar and Anushka on the top of all in that particular sequence. And those complaining that Akshay has been repeating himself lately, surely get to see a new Akshay in the film, who is calm, sober and cool playing an underdog. But frankly, after watching PH you just feel OK and don't have anything great to say about the movie experience on the whole.\n\nAnd there are many factors responsible for this average kind of impact which are given below: 1. The story of PATIALA HOUSE at once reminds you of BEND IT LIKE BECKHAM.In addition to this it also reminds you of GOAL which talked about a similar racialism issue with a different background. So the inspirational angle again is right there visible vaguely.\n\n2. The film is based on a very uneven script where everything seems to be happening very easily even at the national sports level. Where the first half is pretty fine and impressive, the second one brings in some heavily unbelievable and weird kind of sequences which are not all convincing. The whole act of hiding the developments in the team selection and then stopping Rishi Kapoor from watching the entire tournament till its FINAL, looks like written by a childish brain.\n\n3. Post interval the film disappoints in many departments ranging from its music to all the cricket tournament scenes showing Akshay taking the limelight. Interestingly Hindi Cinema has a history of films based on cricket not doing well at the box office with an only exception of LAGAAN.\n\nAnd the main factor responsible for this fact is that for some strange reasons, cricket being filmed for the silver screen has never come out to be highly entertaining or watchable in all those films, except LAGAAN & IQBAL (which was not a box office success).\n\nNikhil Advani's PATIALA HOUSE also suffers with the same disorder. The cricketing scenes in the film are not at all impressive with some erratic cuts and un-intelligent direction. At many places on-screen depiction of players holding a catch, doing a misfield, appealing for an out, running for saving a run-out or talking with their captain (or opponent) on the ground are nothing close to as we see it normally in a LIVE Telecast. So the film which is largely based on the game of Cricket, does not justify the Big Sport on-screen, which sadly once again proves the historical fact related to the films based on cricket.\n\n4. Further PATIALA HOUSE plays the romance plot between Akshay and Anushka very loosely with a very questionable kind of explanation given for Anushka and her kid. The romance is never in the air and the viewers never feel like thinking about them as a pair.\n\n5. The director also tries to incorporate the \"Follow Your Passions in Life\" philosophy made famous by 3 IDIOTS in his film, which unfortunately falls flat and is not able to make any kind of impact on the young viewers.\n\n6. Musically the film is a weak venture too with only one song \"Laung Da Lishkara\" having some melodious notes. But what was the motive behind putting this song after the movie was literally over remains out of my understanding.\n\nPerformance wise, the film is lead by Rishi Kapoor strongly followed by Akshay Kumar playing the underdog impressively. Akshay comes up with a mature act after a long time and he has also worked hard on his bowling scenes particularly. He never goes over the top anywhere in the film contrary to his own style and delivers a fine controlled performance. But Rishi Kapoor excels himself as the SIKH father of Akshay. His getup, dialect, body language and style is highly authentic as well as entertaining. After the recent DO DOONI CHAAR, Rishi once again re- invents himself and delivers a highly polished act of an Indian Sikh living in England. To be straight, PATIALA HOUSE is more watchable for Rishi Kapoor than Akshay Kumar.\n\nIn the supporting cast, Anushka plays it real well as a half Punjabi independent girl. The girl continues to surprise me post BAND BAAJA BARAAT. But Dimple Kapadia neither looks good nor gets enough meaty scenes in the film to prove her famous skills. She gets a rough treatment since the story is mainly based upon the father-son relationship. The rest of the cast is fine with a great visual find Usman Qureshi, who exactly looks like the young Akshay Kumar in the flashback scenes.\n\nSo in all, PATIALA HOUSE can only be watched for its key performances by Rishi Kapoor and Akshay Kumar. But on a concluding note I would also like to warn that do not miss its initial 20 minutes for any reason, since those remain the most engaging moments of the movie according to me."
    },
    {
        "movie_id": "tt1535467",
        "movie_name": "Patiala House",
        "movie_rating": "5.6",
        "review_username": "nisham99",
        "review_rating": "10",
        "review_title": "Great flick !",
        "review_detailed_main": "The movie Patiala House has been much anticipated. Akki shouldn't be disheartened about earlier movies. i still stand by the fact that Chandi chowk was a good movie that went wrong because it was badly edited. Since \"waqt\"it has been a long time since we saw akki in a serious role. I can't help talking about him because he is my favourite. Fresh pairing of Akshay and Anushka adds a freshness and appeal to the film. Again additions of new actors was a good idea because it encourages people to appreciate new talent. Also a treat for lovers of Rishi Kapoor- Dimple Kapadia fans. People should appreciate this film as a movie on its own and not compare it to other cricket movies. The movie is not concentrating on cricket but on a person's dreams and aspirations. If you love akshay just like me,then you should watch it!"
    },
    {
        "movie_id": "tt1535467",
        "movie_name": "Patiala House",
        "movie_rating": "5.6",
        "review_username": "tahirdevil123",
        "review_rating": "10",
        "review_title": "awesome film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1535467",
        "movie_name": "Patiala House",
        "movie_rating": "5.6",
        "review_username": "rakeshshetty",
        "review_rating": "10",
        "review_title": "good movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1535467",
        "movie_name": "Patiala House",
        "movie_rating": "5.6",
        "review_username": "meet-dhir",
        "review_rating": "9",
        "review_title": "I feel this is a good emotional film.",
        "review_detailed_main": "The script isn't flawless but it definitely has moments that will make you flow in the movie.The cast have done a great job.Rihsi Kapoor was Fantastic in his Mountain Solid role. Akshay does a fantastic work and Sharma plays a great role as a lover. The supporting star cast have also done a great job and if you go with family you'll definitely enjoy the film. It also has a few good comic punches , great song , nice drama and overall definitely a great movie to watch. Who knows you may start believing in Second Chances after you watch this movie.So , go ahead with friends and family and watch this awesome film. Positive points: 1.Great job by the entire cast. 2.Decent Script. 3.Heart Soothing Music and songs. 4.Very good family Drama."
    },
    {
        "movie_id": "tt1535467",
        "movie_name": "Patiala House",
        "movie_rating": "5.6",
        "review_username": "andydgr8",
        "review_rating": "8",
        "review_title": "A good inspirational",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1535467",
        "movie_name": "Patiala House",
        "movie_rating": "5.6",
        "review_username": "MovieInspector",
        "review_rating": "8",
        "review_title": "One of Akshay Kumar's best films since 'Dosti: friends forever' (2005).",
        "review_detailed_main": "First of all, I'd like to praise the entire production team, but especially the director, Nikhil Advani, for doing such a great job with this. It doesn't actually feel like a film because the characters are so believable and their livelihoods are very normal. The film's story is relatively simple, but it conveys a very important and nice message. Hats off to Akshay Kumar, Rishi Kapoor and Anushka Sharma - they all have given really good performances here. Dimple Kapadia and the supporting cast also do their parts really well. The music is also good. The best tracks are 'Adat hai woh' and 'Laungda Lashkara'. The screenplay is fabulous and the editing has been done very well.\n\nVerdict: this film deserves to be a success at the box office - go for it!. I give it 8.5/10."
    },
    {
        "movie_id": "tt1535467",
        "movie_name": "Patiala House",
        "movie_rating": "5.6",
        "review_username": "Arjun93",
        "review_rating": "10",
        "review_title": "There should never be an unfulfilled dream.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1535467",
        "movie_name": "Patiala House",
        "movie_rating": "5.6",
        "review_username": "simplymegha",
        "review_rating": "9",
        "review_title": "Worth a watch!!",
        "review_detailed_main": "I've put off watching this movie for over three months now simply because I have been very disappointed by the last few films of Akshay Kumar. But this movie was a pleasant surprise. The story line is very predictable but the movie doesn't really disappoint in terms of story, acting or plots. The execution of the plot is excellent. Akshay Kumar looks great and so does Anushka Sharma, although her performance is forgettable and so is Dimpla Kapadia. Waste of her acting prowess - she only has one dialog in the movie. Rishi Kapoor looks great as a Sardar and I was hoping Akshay Kumar would don his sardar \"avatar\" too but he still looks great. I wasn't bored at any point in the movie and I would say the movie is definitely worth a watch"
    },
    {
        "movie_id": "tt1535467",
        "movie_name": "Patiala House",
        "movie_rating": "5.6",
        "review_username": "wolfhuntsvalue",
        "review_rating": "9",
        "review_title": "Advani lives up to expectations - Again.",
        "review_detailed_main": "Saw the movie last night. Well, definitely worth and more. Like some other poster, I refrain from posting reviews, esp. when you feel that IMDb board, when it comes to Indian Cinema, seems manipulated. Movies like Guzzarrish getting high marks is a perfect example...\n\nPatiala house worked for me at several levels. Story was smooth.. Script was tight. Dialogues were crisp. Protag dealing with the demons is well articulated. Anuska's character could have been better developed. Rishi and Dimple play their roles extremely well.\n\nStory has momentum. Script and characters have multi-dimension. Father-Son relationship is easier to relate. Generational gaps are well explored. I am a bit surprised to see below 6 ranking bu imdbers.\n\nNikhil does a wonderful job on keeping story fluid and engaging. One of the very few movies that I sat through w/o second guessing. Good job!"
    },
    {
        "movie_id": "tt1535467",
        "movie_name": "Patiala House",
        "movie_rating": "5.6",
        "review_username": "sayamasjad",
        "review_rating": "10",
        "review_title": "Akshay and Anushka",
        "review_detailed_main": "Patiala House could have become a great movie because it's a movie which contains its heart in the right place. The emotional drama which is the essence of the movie has been presented very well on the screen and it not only moves the audience but also inspires the youths not to lose heart and pursue whatever they are passionate about."
    },
    {
        "movie_id": "tt1535467",
        "movie_name": "Patiala House",
        "movie_rating": "5.6",
        "review_username": "Chrysanthepop",
        "review_rating": "",
        "review_title": "Kaali In Cricket",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1535467",
        "movie_name": "Patiala House",
        "movie_rating": "5.6",
        "review_username": "micky_arya",
        "review_rating": "9",
        "review_title": "9 out of 10",
        "review_detailed_main": "I don't understand how come this movie is bearing a rating of roughly 6. I've rated it 9 and I stick with it. This is one of the best movies I've seen recently. The acting was just splendid by all the actors, especially by Akshay Kumar who has excelled par excellence in portraying such a serene role with such an ease which actually is quite contrary to his style of acting as he specializes in action & comic roles. I was just amazed to see him emote with merely his expressions throughout the movie and still succeeding so well. No doubt, this is the best movie when it comes to bringing in International cricket stars and the best cricket based Hindi movie. The best thing about the movie was that it never showed anything extraordinary and something that couldn't be digested when it came to cricket. All in all, the movie was engrossing and is a must watch for anyone having a good taste in clean & sensible cinema."
    },
    {
        "movie_id": "tt1535467",
        "movie_name": "Patiala House",
        "movie_rating": "5.6",
        "review_username": "DICK STEEL",
        "review_rating": "8",
        "review_title": "A Nutshell Review: Patiala House",
        "review_detailed_main": "While I deem Akshay Kumar as one of the most hardworking of the Bollywood stars in recent years, he didn't have much luck with most of his feature releases from last year, with heavy expectations in Action Replayy and Tees Maar Khan, the latter which I enjoyed, that didn't fare too well at the box office. While he's adept at playing comical roles or as the action hero, he throws all that away in Patiala House, playing a meek character who's under the thumb of an overbearing dad, the patriarch of an Indian family living in the Southall district in London, England.\n\nThe film deals with the issue of racism, or being prejudiced against, and I suppose the Indian community would likely feel the effects of this, as racism has always reared its ugly head around the world, the most recent I can recall against the community was in Australia. In this film we go back in time to establish the circumstances of how Akshay Kumar's Parghat Singh Kahlon aka Gattu became the man he is, whose father Gurtej Kahlon (Rishi Kapoor) and his generation had suffered from racism in their community, and take it upon themselves to strike back in all manners. Gurtej becomes a successful activist in championing their rights, and in doing so grew in stature and influence, but unfortunately as society progressed, he got stuck in the same old mindset, and failed to keep up.\n\nWorse, he imposes his iron will on his children, dictating the types of jobs they could do, and the people they can interact with. For Gattu, it seemed that he got the shortest end of the stick, where his world class cricket skills got clipped just because his father is dead set against his joining the English national team, and thus condemning his son from exploiting his full potential. Gattu becomes the ordinary provision shopkeeper, rather than the luminous sportsperson he was destined to be.\n\nOn one hand the film tackles how battles are fought against inequality, and on the other take it into a micro environment with the dealing and living with an overbearing father, the patriarch of his extended family where no one dare cross him, though it doesn't mean that rebellious streaks fail to exist as undertones in the family members, especially Gattu's generation. Akshay Kumar ditches his comedic roles, and opts for a very serious, dramatic persona in his portrayal of Gattu, who now has the chance to realize his past dream when he an unexpected door of opportunity opens.\n\nThis of course also opens the film up a little to deal with the many comedic moments from the respective family members, pinning their hopes on Gattu to become that beacon of rebellion and to serve his country, crossing the line that their father has set. Thus is the weight on Gattu's shoulders, that he has to prove his worth to the rest of the world, and perhaps so their father will finally listen and realize that his children have more to contribute rather than being held back through prejudiced thoughts and views. Their cooking up of various, sometimes stretched, methods to prevent their father from learning of Gattu's joining the national cricket team brings forth plenty of laughs, as we know how difficult it is to control information in this connected age, and more so when you have hundreds of family, relatives and friends all on the cusp of revealing their sense of pride.\n\nThere's also Anuska Sharma in her first role outside her three picture deal with Yash Raj, and while her scenes are limited to being the mastermind and requisite girlfriend who inspires the hero, she inevitably brings about some sunshine in what I thought was her first comedic role. Check out her opening scene if you have doubts about that proclamation, but I suppose in a film with plenty of female co-stars as opposed to being THE item girl in a Hindi film, she does enough and not go overboard with her character's antics.\n\nFor cricket fans, there are ample scenes here that will appeal to you, though for the cricket idiot like myself, I can only take each bat, throw, catch at face value, try as I may in comprehending the rules of the game. But this is not just a cricket film, but has a powerful drama I'm sure many caught up in similar situations of having parents who don't quite comprehend the whats and the whys of your personal quests, could come to identify. It's been a relative slow start on the Hindi movie front this year, so I'm hoping the momentum builds up from this offering."
    },
    {
        "movie_id": "tt1535467",
        "movie_name": "Patiala House",
        "movie_rating": "5.6",
        "review_username": "www-quietriot",
        "review_rating": "",
        "review_title": "shameful !!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1535467",
        "movie_name": "Patiala House",
        "movie_rating": "5.6",
        "review_username": "r96sk",
        "review_rating": "8",
        "review_title": "Connects all the differing parts together well",
        "review_detailed_main": "Good stuff.\n\nI had an enjoyable time watching 'Patiala House'. It mixes sports, drama and comedy to create a strong film. The acting talent do their jobs nicely, while the score and camera work is also done to a noteworthy level.\n\nRishi Kapoor is excellent as Gurtej, bringing all the necessary attributes that's needed to play the stern and bossy character. Akshay Kumar is terrific in the lead role, giving a performance that makes you really care for Parghat. Dimple Kapadia (Mrs. Kahlon) and Anushka Sharma (Simran) are decent, also.\n\nAs noted at the top, the film connects all the differing parts together well. Sure there are some moments where the humour feels forced, or the drama is overdone, but by and large it's very good.\n\nThe film also could've been shorter, though that doesn't stop this from leaving positive impressions."
    },
    {
        "movie_id": "tt1535467",
        "movie_name": "Patiala House",
        "movie_rating": "5.6",
        "review_username": "harshbhagat-26001",
        "review_rating": "10",
        "review_title": "House that !",
        "review_detailed_main": "Over the years, Bollywood has'nt made some great family drama but if made in the late 60's and 70's or so then I or my generation of People, might have missed some great films of that time. But what has just happened to this genre in Bollywood, see in the last decade or two bollywood has been really at its best in gangster genre with some great stuff like company (especially), once upon a time in Mumbai and several other films. It has been terreffic with romantic genre with the likes of Kuch Kuch Hota hai, Dilwale Dulhaniya Le Jayenge and other films of those kind atleast they have not been terrible. Bollywood has been at its best try with comedies, political dramas and horror ( the least ) as well. But it has been somehow poor with family dramas inspite of making family drama movies more than any other genre, i mean Baghban was a good film a great example but there have not been other good movies. Although there have been some manipulative films to weep us but they are not effective lets say it for Kabhie Khushi Kabhie gham ( totally ineffective) might be someones favourite though ! That is the case with me being attached to let me say this wonderful movie Patiala House. Lets talk about it, Patiala house begins with a great note with that backstory of Sikhs getting outrageously disgraced by the british there in South Hall, its racism loosely inspired by some incidents in the late 70's in UK. Now to begin with its decorated well and its effective, here we get to introduced with Bauji Of Patiala House ( Rishi Kapoor ) at one point described as the Sarpanch of Southhall. He is a man of power ( although a bit arrogant ) He soon after the Killing of a Sikh Advocate ( Big Name In Community ) Gurtej A.k.a Bauji turns as hot-headed against British and Soon after riot-end he becomes the messiah of Sikhs living in Southall and there after with Support of Community Builds an Empire there soon South Hall becomes as if its not a part of UK anymore but a Town In Punjab with many Gurudwaras, Schools And Hospitals build by the community over there. And we are Narrated this by Soft-spoken living ( Walking ) his Life Gattu a.k.a a boy next door or a everyman whatever you call him. This Poor Guy Parghat Singh Kahlon was a exceptional Talent in his teens, but his father Gurtej's anger and hatred towards the nation ( he lives in) doesnt allow this talented boy to persue his career what was his dream every breathe. Soon after his Tyrant's Father declares that ' Jis Khoon ko mene pala kya usko ye gorey patla kar denge nahi ye kabhi nahi ho sakta, mera beta England Ke liye Cricket Nahi Khelega ' my god! The poor fellow ( a special mention to Qureshi who played teenage Gattu with great expressions ) But Gattu is a shop keeper a day to night worker who at night just satisfies himself by practising on nets. He is a obeying son, a person who other family members hate because they cant choose what they want to they too obey the Tyrant Bauji and if they dont they are being given his example. Gattu is really a great character infact my favourite in this times. The doors are banged on him, he is merely insulted and barely gets his due at one Point one sibling describes him as a shadow of a man. And then we have a funny Anushka Sharma lurking around, a desperate kid who wants to glorify gattu and A selector looking closely to look out for guys who can play for england because the worldcup is near and the current team has to be replaced ( with England You can belive that :). There are some silly sequences involving that a father doesnt know his son is playing for the nation ? Or how can a 34 year old not known cricketer who hasnt played cricket since last 17 years make straight to the English Squad by just one - over trial ? This are logical questions well i can answer those. Its based (loosely) on cricketer Monty Panesar's life the first ever Non-Indian Sikh who played international cricket and there are many other examples in cricket of comebacks and wierd selections ! Thats for all but at the core of it has a magnificent mother son and above that a father son story which is missing in movies. The emotions are contentful and real, the humor strictly is basic, the songs are terreffic specially Kyu main Jagun and acting is rock solid at some level by Rishi Kapoor And Akshay Kumar is all brilliant Playing Gattu bringing the right amount of Clarity to Gattu and audience his Gattu is A character of that kind that we forget him on screen that its Akshay Kumar (it happens very rare with big actors). Lastly if You Can put logic behind And Enjoy ( i am talking about any one of us ) Apes Talking, Cars Crossing Buildings in Hollywood and giving some scientific justification is those engaging but no logical hollywood classics ( although captivating ) then yeah i have a thing called heart which patiala house wins ! Its one of those rare films which is perfect film atleast for me as far as being entertained and engaged is concerned, i didnt weeped but i was affected. Its a experience will stay with me atlast its cricket and family the two things india loves the most just like me. And They are merged together very well. Its my rating that is 10 on 10 which many people wont agree but yes sometimes we are meant to disagree thats what the message!!!"
    },
    {
        "movie_id": "tt1535467",
        "movie_name": "Patiala House",
        "movie_rating": "5.6",
        "review_username": "syedhaideralishah",
        "review_rating": "10",
        "review_title": "Follow the passion and it will lead you towards success.",
        "review_detailed_main": "This is the story which represents the mind set problem of the most families of sub-continent but the way of representing is not so common, which i will explain how. This is the story belongs to most of the young people of sub-continent, where they have interest in one field but their family don't allowed them to follow and learn about that field and force them to follow the field they (family) want. And as shown in the movie due to respect and emotional attachment with the family they agree with the family's decision and become 'No One' in the society. But this movie give hope to all such a people that it's never late if they will start following their passion without giving up in difficulties one day will come that their family will be proud of them and they will live life with more satisfaction. One thing which could be replaced more better is that instead of showing that \"Gatu\" was stopped due to British-Indian problem from following his passion which is not so common cause and more common cause could be added. But even after that this movie will be not forgettable at least for me. The acting of Akshay Kumar and Rishi Kapoor and character of Anushka Sharma makes this story even more interesting."
    },
    {
        "movie_id": "tt1535467",
        "movie_name": "Patiala House",
        "movie_rating": "5.6",
        "review_username": "jaybhakta-80095",
        "review_rating": "10",
        "review_title": "It has a story and actors told it well.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1535467",
        "movie_name": "Patiala House",
        "movie_rating": "5.6",
        "review_username": "rishabhmishra-54271",
        "review_rating": "10",
        "review_title": "Worth your time!",
        "review_detailed_main": "Wanna watch struggle in making your dreams true (when you're up against your Dad). Then, I insist just give it a shot."
    },
    {
        "movie_id": "tt1535467",
        "movie_name": "Patiala House",
        "movie_rating": "5.6",
        "review_username": "aroramitash",
        "review_rating": "10",
        "review_title": "Underrated",
        "review_detailed_main": "Wonderful movie, should be appreciated more. Akshay delivers a stellar performance, Anushka also showed her prowess. The veterans Rishi sir and dimple ma'am were upto the mark as always."
    },
    {
        "movie_id": "tt1535467",
        "movie_name": "Patiala House",
        "movie_rating": "5.6",
        "review_username": "mkumardash",
        "review_rating": "8",
        "review_title": "Akshay Serious & Emotional Like Never Before",
        "review_detailed_main": "You will see A diffrent Akshay Kumar in the movie. So perfectly serious and emotional, which Akshay is rarely known for. Acting level unmatchable. This movie teachers you something."
    }
]