[
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "justj-3",
        "review_rating": "2",
        "review_title": "1.4 Rating for this movie is being very generous",
        "review_detailed_main": "I saw this movie with my wife, 12 year old daughter & 13 year old son, it was on a Monday and there were 8 people total in the theater! (Should have been my first clue). The toilet humor was over done, while at times it fit the storyline, pissing in the shower was a little overboard and unnecessary. I loved Larry and gang on the Blue Comedy Tours, but this was raw sewage.\n\nAll the funny lines were in the T.V. commercial!\n\nI did notice a major blooper. During one fresh scene (next day) and the few that followed it, the shirt of Tom Wilson had a large, wet stain on the pocket of his shirt - how did it get there and did we miss a cutting room floor funny?"
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "rimnod",
        "review_rating": "4",
        "review_title": "An Ernest P. Worrell for the 21st Century ?",
        "review_detailed_main": "I played on a Baptist College baseball team over twenty years ago with Dan \"Larry the Cable Guy\" Whitney. Even back then he was only a part- time pitcher but a full time clown. I wish he had shifted his focus and concentrated more on his curve ball. If he had then perhaps we would have been spared his first feature length film---\"Larry the Cable Guy Health Inspector\".\n\nAs a \"starter\" project this movie echoes the transitions made by other comedians-- most notably Jim Carrey (Ace Ventura -Pet Detective) and less notably Rob Schneider (Deuce Bigelow-Male Gigolo). However Dan's talent is probably better compared to the late Jim Varney and his alter ego-- \"Ernest P. Worrell\". Still, I can much more appreciate Varney's eccentric talents than Dan's stubborn assault on our sensibilities by offering repeated renditions of a stock version of a crude redneck character(or has he broadened this into being somehow representative of \"blue collar crude\" in an effort to pull some of the population living north of the Ohio River into this movie's prospective demographic?)\n\nIn \"Health Inspector\" Dan manages to exhaust most of the material found in his stand up routine. He also comes up with some new bits- most of which are only incidental variations on his old bits. It's true that he does break some new ground also. We get to see Larry in love through an indirect appeal to pathos. But the sum total of this film, in the end, is that it serves as little more than a woeful compilation of \"Larry's the Cable Guy's\" rather sloppy rise into the national consciousness.\n\nThe touchstone for deciding whether or not you should give \"Health Inspector\" a chance can be found in Dan's signature stage utterance---\"Git r Done\". If the humor buried in that expression appeals to you ---then by all means check out the movie. But if the phrase leaves you lost, cold and empty---you had best give the film a pass. For my part, I have never been able to translate \"Git r Done\" into anything that quite registers as \"funny\" on my tired brain. But I still went and saw the show anyway. After all, like I said --I used to play ball with this guy in school."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "rogerdob",
        "review_rating": "2",
        "review_title": "Deceiving Trailer",
        "review_detailed_main": "Boy, was this film awful. I knew nothing about Larry, the Cable Guy until I clicked onto a preview on the web. The preview was hilarious! It was my type of low-brow humor and I thought this is going to be a funny film. However, after I go to the theater and the picture started to play, I felt I was really duped by the trailer. Whereas the trailer was tightly edited to give great timing to the jokes, the film was edited with no regards to proper timing of set-up and punch lines. There were even added scenes in the trailer that didn't exist in the film. This was one of those films that I had to leave early from. I could not take anymore after 40 minutes."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "justforfun873",
        "review_rating": "1",
        "review_title": "I had such high hopes for this movie...",
        "review_detailed_main": "As a fan of Larry the Cable Guy and the Blue Collar Comedy Tour, my husband and I really wanted to see this movie. As a matter of fact, when we heard the release date, we ensured to plan an evening around going to the theater to see this movie. I've enjoyed watching Larry the Cable Guy over the years and I knew that this movie would not be Oscar worthy, or one of the best comedies I have ever seen, but I thought it would at least be entertaining - but to our surprise, it wasn't. We were turned off within the first 10 minutes of the movie and forced ourselves to sit through the remaining 80 minutes. Usually, just hearing Larry talk is enough to make some laugh, but by the end of the movie, we even tired of that. Unfortunately, I think we will be a little gun shy in seeing any future Larry the Cable Guy movies, unless of course, , he is teamed up with the rest of the Blue Collar cast and he is doing his stand-up act. This movie isn't even worthy of watching on DVD, unless you want to hear fart gags for an hour and a half."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "Haifis",
        "review_rating": "1",
        "review_title": "My honest opinion",
        "review_detailed_main": "I walked into the theater hoping I would get some good laughs. I went with my friend who worships Larry's humor. I left the theater disappointed. This movie is filled with the same joke over and over again. Basically overdone toilet humor. I have nothing against the humor, it's just the same jokes repeated over and over again. Nothing new or inventive here. Larry's humor was not creative. Just diarrhea jokes over and over throughout the whole entire movie! And that was the whole running gimmick! It became rather boring. This is a simple film which had the potential to be funny but destroyed it with horrible acting and boring humor."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "jack-817",
        "review_rating": "1",
        "review_title": "nothing to see here.",
        "review_detailed_main": "Tune into CMT or Comedy Central. Get the same jokes for free.\n\nI'm a big fan of redneck humor. Jerry Clower is GOD.\n\nBut Jerry's real,born and bred.\n\nThis cable guy from West Palm Beach by way of Nebraska insults his fans.\n\nI despise Jeff Gordon, whenever he pretends to be a good old boy.\n\nNow picture Jeff Gordon in a flannel shirt, with cut off sleeves. Add about fifty pounds or so.\n\nAnd get your authentic southern accent by watching the Simpsons cartoon character Cletus.\n\nThat's Larry. So long. I hope you enjoy playing Branson."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "duffyboy666",
        "review_rating": "1",
        "review_title": "Words fail me",
        "review_detailed_main": "Normally when a new bad movie comes out, it usually sky rockets up the bottom 100 list. This is mainly just a trendy thing. You Got Served, Bloodrayne and From Justin to Kelly were among these unlucky ones. Oh sure they were bad movies alright, terrible movies to be blunter. But when you looked at the movies like Red Zone Cuba, Gigli and of course Manos, you couldn't really rate them as that bad.\n\nNOT THIS TIME\n\nThink of the most horrible, hateful put down you could ever attach to anyone and anything and it still wouldn't do Larry The Cable Guy justice. That's right folks. 40 years on and finally, Manos is now the world number two on the chart. This movie is the biggest piece of s**t to ever stink up the theatre. It is so jaw droppingly, blood-boilingly bad that you wouldn't even serve it to your most hated emnemy.\n\nNot only is Larry The Cable Guy the single worst most horrible movie of all time, but it is the spawn of the single worst most horrible idea of all time. The plot involves a series of food poisonings at the city's best restaurants, with the All City Top Chef contest just days away. It's up to Larry and Butlin to figure out who's sabotaging the competition, even if it means taking on the breast-obsessed mayor.\n\nGot that folks? It's another toilet humor film which sucks! And it's another film directed by a first timer (Trent Cooper)! See Deuce Bigalow for reference! In the first five minutes of the redneck comedian's film debut, we see Larry urinating on himself in the shower, flashing his butt crack, having a flatulence attack in front of his boss, and referencing the smell of \"strawberry douche.\" At this point I turn unto God and ask \"Why?\" Why does Hollywood keep doing this with impunity!\n\nTrent Cooper is only there to keep the movie in focus (he even fails that at times) and to make certain there are enough fart jokes to keep the overlong running time rumbling. Seriously, you could make DVD chapters out of the number of times Larry -- or anybody, really -- makes with the southern thunder. That is how awful this movie is. It can't even save itself with fart jokes.\n\nLarry The Cable Guy is truly the worst movie of all time. It should be driven to a quiet spot, forced to kneel down and be shot through the head. That'll learn it!\n\nNEVER WATCH THIS MOVIE."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "mrblueshoes81",
        "review_rating": "1",
        "review_title": "Total Waste",
        "review_detailed_main": "Of all the Blue Collar Comedy actors, Larry The Cable Guy was never one of my favorites, but hey...I figured i'd give this movie a chance since I need a good laugh every now and then. Lets just say that this movie did not enhance my view of him. I wasn't expecting this to be an intellectual film or anything like that. While it did have a few funny parts, I spent most of the time in the theater teetering between pure boredom and annoyance. Unless you enjoy root canals, spinal taps, or anal probes I would avoid this one at all costs. If you need a good laugh I would implore you to rent something like Bringing Down The House or 40 Year Old Virgin. At least it doesn't cost as much and you will actually enjoy what you pay for."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "jarrodmon-1",
        "review_rating": "7",
        "review_title": "Pretty Good Bad Movie",
        "review_detailed_main": "Some of these folks need to lighten up. This movie was intended to be good old mindless fun. Is it rude and crude? Sure. Is it vulgar? You bet. Then again, I don't think anyone involved was anticipating \"For Your Consideration\" ads placed in Variety come Oscar season.\n\nMaybe we don't always have to relax for two hours after working a 55 hour week at a blue collar job by watching Amistad or Boys Don't Cry. Maybe it's okay to pull a long neck Natural Light out of the fridge and watch Pauly Shore or Rob Schneider. Perhaps even Larry the Cable Guy commenting on \"a brown snake playing peek-a-boo with my butt crack.\" And for those impressing us with their tolerance and raging over Larry implying a fruity waiter is gay, or calling a woman in a business suit a \"boy,\" I have to wonder, as I often do, why white guys are the only beings on the planet who can take some ribbing without crying about bigotry.\n\nEvery single commercial that ever airs on television depicts women and minorities and especially wives as super intelligent, almost God like figures. White men are slobbering half wits who can barely speak in complete sentences. And why are their no mass protests? Because we can take it. Period. Yet Larry makes a crack about his boss being mad supposedly because he's receiving anti-gay hate mail, and all of the \"tolerence\" activists pull out the daggers.\n\nBut I digress. This is a fairly entertaining mindless 90 minute diversion. If you can't take a joke, go watch First Wives Club. If you can check your brain at the door, Health Inspector will give you a few laughs, while solving a \"premedicated\" crime."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "anonymouslybeelzebub",
        "review_rating": "1",
        "review_title": "Do Not See This Film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "LiAnnV71",
        "review_rating": "8",
        "review_title": "Classic Larry",
        "review_detailed_main": "This movie is classic Larry the Cable Guy! So for those who watched it and were offended or appalled, tough! Larry makes fun of and says everything most of us wish we could say! This movie is funny and crude and plain hilarious. IF you thought anything other than that, I have no clue what you all thought you were going to see? So if you need something to make you laugh, or snicker or just forget your problems for a few hours, watch this movie, it just might add a little spark to your personality and make you a little more human! Life's too short to be serious all the time, laugh! With all the rising taxes and gas prices... who couldn't use a good laugh?"
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "extremecraigfan",
        "review_rating": "",
        "review_title": "What did you all expect from Larry the Cable Guy???",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "bergette5",
        "review_rating": "7",
        "review_title": "What do you expect?",
        "review_detailed_main": "Okay, I understand this movie is not going to win any Acadamy awards, but hey, if you are going to see it, you should understand that it is a movie starring Larry the Cable Guy. Do you expect quality material? No, you expect a simple-minded good time with a bunch of laughs. And that is exactly what this movie provided. I also give it extra points because at no point in the movie did Larry rely on his catch phrase \"Git r Done!\". He went the whole movie without saying it and only said it in the end. Now, yes, there is a lot of toilet humor and bad taste laughs, but if you watch his stand up, you should know that already. All in all, go see this movie if you want a simple good time and a lot of cheap laughs."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "dbuffalo",
        "review_rating": "4",
        "review_title": "For Larry The Cable Guy Fans, you should see this before they take the Browns to the Super Bowl",
        "review_detailed_main": "Unlike the very first reviewer, I confess that I never played college baseball with Larry the Cable Guy at Boston College or anywhere else. I did have a pretty tough week this week, and in celebration of the fact that I work some long and crazy hours I did my every other week Friday Matinée movie expecting some really crude, baseless, and thoroughly stupid humor.\n\nI was not disappointed.\n\nLarry the Cable Guy: Health Inspector is a reasonably competent movie vehicle for Dan \"Larry the Cable Guy\" Whitney, allowing for the fact that it is rife with all the flatulent, politically incorrect, crude, redneck, and every other kind of socially unredeeming humor we have come to know him for within his solo stand-up and \"Blue Collar Comedy Tour\" career.\n\nThe whole crux of this film revolves around Larry's job as a restaurant health department inspector who happens to be offending virtually every one in his path and screwing up at his job. To correct his ways or end his career, he is allied with a new partner, the virtually hermaphrodic Amy Butlin (played by suitably hermaphrodic nerd-turned-comedienne Iris Bahr). What ensues is a caper in which Larry finds a love interest, belittles his partner, laughs at his retarded neighbor, abuses a phony paraplegic, wrestles a uni-browed daughter of a crooked restaurateur, degrades all manner of human life, all while trying to solve the case of serial food poisoning. We are also treated to what Jerry Mathers looks like at the end of his career and to what became of Thomas F. Wilson (remember Biff Tannen?) as if he actually had a career as a quasi-straight (don't you think that's funny, I called Biff straight?) guy for Larry's gaffs.\n\nSound interesting? Of course not, but every crude one-liner in Larry's repertoire (new and old) is balanced against a sometimes funny sometimes lame plot. There is enough of \"Cable Guy\" humor and off-beat timing to laugh at, even some things the P.C. police would send you straight to Hell for. Ample fresh material exists to keep the not-so-funny lines from keeping the average Cable Guy fan from disliking this movie.\n\nAnyone expecting any more or less of Health Inspector is probably not a Larry the Cable Guy fan, and certainly should not see this film. If you are, however, and you just want to see about 90 minutes of absolutely insolent yet funny bathroom-style garbage disguised as humor, then by all means \"Git 'er DUN\" and see this film. It could be worse, of course, but comeonn\u0085.it's Larry The Cable Guy, NOT Shakespeare.\n\n4 out of 10 for a comedy like this means it is B-style humor worth seeing if you understand the brand of humor being presented. I did take a shower afterward though."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "fabfunk3",
        "review_rating": "1",
        "review_title": "The worst and most harmful movie ever made",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "lovekh",
        "review_rating": "1",
        "review_title": "Please Stop!",
        "review_detailed_main": "At some point the American movie going audience should stand up and tell film studios we will not stand for this garbage anymore. I saw this movie on the tail end of a double feature at a drive-in theater. The first movie was Scary Movie 4 so as many rational people will tell you maybe I was a little jaded before the second feature started. I pondered this question and realized no, this movie is just terrible. It pretty much consisted of a drunk hillbilly running around with out the slightest hint of hometraining. By the way I saw this movie outside of Cincinnati, OH. That night it began to storm pretty bad during the movie. Why do I say this? Because I came so close to wishing it would turn into a tornado and tear the screen away. It was just that bad. I am just sad for Megyn Price. I really enjoyed her in \"Grounded for Life,\" but this mess might have ruined her career. This is the kind of movie that I call a career killer, once an actor does one of these you will never seem them in a respectable film again. See: Chris Rock and \"Pootie Tang,\" or any cast member of \"Soul Plane.\" If you want to see non talent on a screen turn to public access on TV. I strongly advise you save your hard earned money."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "samsatitagain",
        "review_rating": "1",
        "review_title": "wtf",
        "review_detailed_main": "seriously this was just so awful i can't even say whats bad I would just sit here for an hour saying how this is the worst movie of all time no exceptions this is worse than the nick canon Nikelodeon show they used to play it was awful dirt so bad I UH and how can all these people comment with 5 stars like some comedians i think are stupid fake and just not funny and i understand how some people like lowbrow but this THIS this is like the statement of where America is if you gave this movie 10 stars then you really just good lord stupid comedy sure whatever you have to be like a 7 year old who likes poop and fart jokes to like this I JUST DON'T SEE HOW YOU CAN BE THAT bad i mean they didn't even put an effort into this they practically filmed this in their garage"
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "dbborroughs",
        "review_rating": "4",
        "review_title": "Beyond low brow comedy runs out of steam after 15 minutes and is only sporadically worth seeing after that",
        "review_detailed_main": "Hamlet its not.\n\nFunny it is, in the lowest of the low sort of way. Its fart jokes (and worse) galore and if you hate them stay away.\n\nThe plot has Larry getting a new partner and being assigned the ritzy restaurant beat by the mayor. Of course its a set up and of course in the end Larry comes riding to the rescue.\n\nThe problem is that after about 15 or 20 minutes the laughs stop as the plot really kicks in. There are jokes after 15 minutes just not that many good ones, even of the fart related variety. Actually by the half hour mark the movie becomes rather dull in a been there done that, why aren't there more jokes sort of way. While I don't think that the movie is the worst ever made, it is a disappointment simply because it runs out of steam so early on.\n\nNot worth paying for at any time, it is worth seeing when it finally makes it to cable where you can see the funny bits endlessly with out having to waste your money.\n\n3 out of 10"
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "mockay",
        "review_rating": "1",
        "review_title": "Overrated (not kidding)",
        "review_detailed_main": "Its not as explicitly racist as some people say but its still one of the worst movies in the world and without a shred of doubt, the worst I've ever had the bad luck of suffering in my life. Let my suffering prevent yours. Do not see this movie. Now consider how many people have voted this movie a 10, in the hundreds, making that the second highest number of votes, besides the 1/10s. Whatever the truth it, under no circumstance can this movie be awarded a perfect rating (10/10) and put in the league of the Godfather, Shawshank Redemption, Aliens etc Without considering those fake 10/10 ratings, this movie gets nothing but 1/10 rating, which is highly deserving. So this movie is actually IMDb bottom no.1 in rank, if people had really voted realistically instead of blindly giving it 10/10. And just because its the worst movie in the world, does'nt mean that you should check it out due to curiosity. This movie isn't just bad but also harmful."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "kf4mgz",
        "review_rating": "6",
        "review_title": "It's what you would expect.",
        "review_detailed_main": "I've seen Larry's stand up routine in person, and it was about the same as his Blue Collar Comedy tour show on the Comedy Channel. I've always thought he was funny.\n\nAs for the quality of this film, Hey! It's Larry the Cable Guy! What do you expect! I went to see it because I pretty much knew what I was going to see, and it beat my expectations. I don't think anyone needs to worry about Larry getting any awards for his acting ability, but I thought the movie was what it was intended to be: A mindless laugh fest.\n\nFor those of you that paid to see the movie and are upset about it, all I can say is what did you expect? Dan Whitney as the greatest film genius of all time? Give me a break. If you don't know who LTCG was, you would never have gone to see this film in the first place. This film delivers what it promises, Larry being an idiot, and the toilet humor is just part of the act. Those of you who act shocked and outraged, guess what? The laugh is on you!"
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "sweepthelegjohnny-1",
        "review_rating": "4",
        "review_title": "The Mind-Body Problem Solved",
        "review_detailed_main": "Plato contends that the soul is distinct from the body and is capable of maintaining a separate existence from it. Aristotle, in contrast, feels that body and soul are two aspects of the same underlying substance; form and matter.\n\nThe dualist position has reigned supreme. However, by espousing a distinct type of substance for the mind, dualists invite the question: What is it that makes it possible for two contraries to interact? I've always had a soft spot for dualism, but after seeing the first 5 minutes of Larry the Cable Guy's \"Health Inspector\" I've fully adopted an identity theorist's approach to the existence, or lack thereof, of the human soul.\n\nIt seems highly improbably, if not impossible, that an immortal mind could promote, as an artistic expression of itself, the sordid tale of this so-called \"Health Inspector.\" It's nothing more than a farce: man as some sort of pure, critically thinking substance existing in a platonic heaven where a universal Cable Guy sits, perpetually gitting-r-done!"
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "frogstompx-585-234486",
        "review_rating": "8",
        "review_title": "What were you expecting?",
        "review_detailed_main": "I'm not sure why this movie gets such bad reviews. Maybe it's a guilty pleasure of mine, but I love this movie. What were you expecting when you saw it? You either like Larry's style of comedy, or you don't. If you set your expectations too high, then I suppose this movie falls flat. But if you go expecting some cheap laughs and fart jokes, it's a home run. All I'm saying is give it a chance. Again, if you don't like Larry the Cable Guy or potty humor, skip it. But then again, if you're like me and do like those things, I'm sure you'll get a kick out of it. Don't take life so seriously. Relax, unwind, make some popcorn and watch. It's just a funny movie, I don't care who you are, so enjoy it!"
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "debums",
        "review_rating": "6",
        "review_title": "Sure it was rude and offensive, but it was VERY FUNNY!!!",
        "review_detailed_main": "OK, I know we should have abandoned bathroom humor in 9th grade, but crude and offensive comments about bodily functions still get a good laugh! Especially when those comments are made with Larry's colorful and creative phrasing. If you want a break from adulthood, go with pals you can laugh with and not feel you have to maintain a certain image. The audience was laughing loudly and holding their stomachs at the crude comments. I've even been sharing some quotes with other friends and family who appreciate tacky sayings! There is at least one of them that I couldn't share because I kept laughing while trying to repeat it and they couldn't understand me.\n\nGo and have a ball! If you take kids or your more uptight friends/family, you'll hate it, so plan carefully. :o)"
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "moonspinner55",
        "review_rating": "1",
        "review_title": "Flatulence in the finest restaurants...",
        "review_detailed_main": "Comedian Larry the Cable Guy's acting debut, playing a redneck health inspector who, alongside his female partner (who dresses down like a librarian out of a 1950s comedy), ferrets out a conspiracy to destroy fine-dining establishments. Slovenly humor goes back decades, and of course is often very successful, but there may be something deviate about Larry the Cable Guy's sense of humor; it's irrelevant to his core audience--who just want to have a mindless good time with the toilet jokes--but the film's rampant ugliness belies a hatred of people that coats the whole sub-modest enterprise like pond scum. Anyone with a semblance of grace or a modicum of style or good breeding is considered a candidate for the local gay bar (the movie is very fond of putting down \"the queers\"), while Larry's unattractive co-hort is never allowed to blossom (she's all business, which to Larry means she must be kept in her place, as that of a stereotypical spinster). There's a half-hearted, played-for-jokes romance somewhere in the middle of this wretched picture, but to bring that up is really about as useful as criticizing the witlessness of the entire conception. Audiences high on this kind of low-ball humor don't want profundities or helpful criticism; they only want to see the flies in the food. This movie gives them what they want. NO STARS from ****"
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "Bry-2",
        "review_rating": "1",
        "review_title": "PU Stinky poopies",
        "review_detailed_main": "This is probably the worst movie ever made, worse than Manos: Hands of Fate, worse that Plan 9 From Outer Space, worse than Pearl Harbor, worse even than Son of the Mask. And because my comment is not long enough, here are some more movies this one is worse than: The Greatest Show in Earth, Earth Girls Are Easy, and the 1976 King Kong.\n\nWonder if it's long enough now. Back to what I really wanted to say:\n\nBut if you like Larry the Cable Guy, you probably think the internet has something to do with tennis or maybe basketball, since those sports are on at the same time as WWE and NASCAR, and won't read this, and if you did, you'd STILL go see the movie.\n\nAll I can say is, \"Get her done.\""
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "Santenza",
        "review_rating": "1",
        "review_title": "Not Funny",
        "review_detailed_main": "There is nothing wrong with stupid humor, but there is big problem with just plain stupid.\n\nI am a big Larry the Cable Guy fan. His comedy, either solo or with the other Blue Collar guys, is very entertaining, original, and pretty darn smart.\n\nI also have nothing against him getting a Hollywood payday, but it looks like he and everyone else just mailed it in for this movie.\n\nHere are a few tips for the filmmakers if anyone is dumb enough to give them a second chance:\n\n1. If you're going to make fun of disabled people, you better be damn funny (consult the Farrelly Bros. on this) or else you will come off like a sick mean SOB\n\n2. Fart jokes are funny only if used in moderation\n\n3. Give the audience some credit: they know Larry the Cable Guy or else they wouldn't be watching the movie, so starting the movie with a butt crack shot is not really necessary (or funny)\n\nTo give credit where due, there are a couple of funny moments in this snoozefest. One is when the trailer trash mother of Larry's girlfriend-to-be mimics our hero. The other is at the end of the movie, when they drop hints about making a sequel. Now that's hilarious!"
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "sherismedia",
        "review_rating": "2",
        "review_title": "Not the worse movie ever, but pretty close",
        "review_detailed_main": "I hate it when someone on here starts comparing a movie by stating its the \"worse ever\" when the reality is they have seen much worse movies and they don't possess the intellect to simply tell others the movie wasn't worth watching without admitting they at least found a part of the movie entertaining or funny. In fact, they will deny they found ANY part of the movie funny just to rant and rave about how bad it was. I choose to compare fairly. Seriously, Larry the Cable Guy needs to stick to stand-up comedy and stay out of the movie business. I can't believe the fan following he has though. I honestly think that along WITH the other redneck comedians, he's entertaining and funny, but by himself, he's truly not that funny. I saw him live at the Houston Rodeo a few years back and Houston is FULL of rednecks and Larry lovers - ESPECIALLY at the rodeo. People loved Larry anyhow, but not too many people laughed to my recollection at anything he said. Him dragging that into another movie pretty much sets the stage for a good nap. However, I couldn't give this movie a 1 because I remember laughing if only a minute chuckle at a few scenes and somehow I did manage to stay awake through the entire movie (mostly out of curiosity). However, since I've seen Going Overboard with Adam Sandler mostly because I'm an Adam Sandler fan, I've realized that Going Overboard was even a bigger disappointment with not ONE funny scene or joke in the entire movie, thus it deserved a 1 and this movie wasn't THAT bad comparatively. If you've ever seen Rubberface which was one of Jim Carrey's first movies ever, it was also a 1 rated movie in my opinion as it was not funny at all. The difference is, Adam Sandler and Jim Carey were early in their career and went on to do some of the funniest stuff EVER and these movies were poor examples of their earlier trials that did not work. The difference is Larry the Cable Guy has already \"made it\" as a comedian being one of the highest paid comedians over the past few years, and THEN he tries to make a movie and it of course bombed. I don't see Larry the Cable Guy ever becoming in the future in the movies anything towards the talent of Adam Sandler or Jim Carrey, no matter how many times he farts in a film."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "poison1227",
        "review_rating": "1",
        "review_title": "Movie stinks, and I'm being nice",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "DKosty123",
        "review_rating": "5",
        "review_title": "Raunchy Is The Word Here",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "Asutian",
        "review_rating": "6",
        "review_title": "Absurdly Funny",
        "review_detailed_main": "This is not the type of movie I would typically make an effort to see, but I had little choice in the matter. (It was this or Stay Alive and I could not stand the prospect of another retarded horror movie.) After watching it I am going to tentatively recommend it to others. This movie is not the kind of movie you laugh with, but rather laugh at, and I think the producers new that. The idea of Larry the Cable Guy as a health inspector is just so fantastically ridiculous that you can't help but see how this is all going to pan out. While there is a good amount of racist and gay jokes they are used as a vehicle to mock the incredible ignorance of the white trash that makes them. Altogether I wouldn't say this movie was a classic or masterpiece, but it's entertaining in its own way and worth seeing, alternatively I would recommend it to anyone who's a fan of Larry the Cable Guy as it is a good showcase for his style of comedy."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "wbproperties",
        "review_rating": "2",
        "review_title": "Don't bother to go - wait to watch at home",
        "review_detailed_main": "This movie reminded me of Jim Carrey's Movie The Cable guy which was horrible at theater to the point where you were mad at the money you wasted but was OK 2 years later when you watched it on HBO at home.\n\nThe plot line is very thin and drags on for way too long. There are some very funny scenes but they are far fetched and very unlikely for a movie. Basically its a over the top flick that tries too hard. If you were willing to pay to see the Naked gun movies at a theater than go you will probably be entertained.\n\nI must also add for the record I am a big fan of Larry's, I really like his stand up comedy and even own a CD or two,but in a movie theater it sucked.\n\nAgain it is somewhat funny so do watch it at home or on pay per view for $3 but it is not worth $7 per person plus popcorn at the local theater."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "onofus",
        "review_rating": "10",
        "review_title": "I laughed my ****off",
        "review_detailed_main": "This was exactly what i needed. After a long period of seriousness i really waked up to life by this movie. To judge a movie by counting errors and repetitions and to compare it to other by making this one better and the other one worse don't really ells anyone much about the movie itself.\n\nOK. The movie made me laugh maybe 50 times and that might have been so loud so that the neighbours waked up and realised they had a neighbour. But of course the movie has some drama too. For example there is a retard (Larrys neighbour) who keeps on getting a ball in his head and falls over but still fight the vain with braveness and put his tumb up while he says I'm OK. And there also is some good spirit happiness in this movie to show the thankfulness over the things that really matters in life, for example when Larry gets his car back after it been stolen and nobody made a scratch to it.\n\nIf you need a laugh. See this movie.. If you need to complaint see gone with the wind"
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "cdelacroix1",
        "review_rating": "7",
        "review_title": "Git R Done",
        "review_detailed_main": "I just saw this movie tonite ... after it opened here yesterday. And I have to say I laughed and laughed just about from one end to the other of the movie.\n\nI've only seen Larry the Cable Guy a few times before ... on Blue Collar TV. And if you don't happen to like this particular brand of Blue Collar humor you probably won't like this movie. Because of course it's really constructed around the (to me hilarious) comic persona of Larry. And for that purpose ... a vehicle for Larry situational comedy ... it was just plain excellent.\n\nThe acting and characterizations of others in the flick were good; cinematography fine; composition adequate; plot adequate for the purpose. Meaning it really had no plot, but who cares, in a movie like this? The point of this kind of flick is really to set up situations for Larry to do his comedic thing, and the movie did and Larry did, so what else is there to say, except ... thanks, Larry, for Gittin' R Done.\n\nOh and thanks to Kid Rock and to Larry's Pick Up Truck from Hell for their special cameo appearances."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "pmcguane",
        "review_rating": "",
        "review_title": "this was a great movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "MorganMan1",
        "review_rating": "2",
        "review_title": "Well what did you expect, a funny movie??",
        "review_detailed_main": "\"Larry the cable guy Health Inspector\" was what I expected. This movie came across to me as a low budget, exploitation of the comedians' fans. Most of the one-liners were just repackaged lines he does in his stand up routine. Most of the characters were \"fitted in\" just to insert some type of story line. Now I will be the first to admit that the first time you see Larry The Cable Guy do his stand up routine he comes across as funny to many people. The second, third or fourth time, you soon realize he is just rehashing his same old stuff and loose interest quickly. This movie falls into that category. If you think farts are funny you will love this one! If you can be entertained with the same sight gags, one-liners and slapstick repeated several times in one movie, you might like this one. I rented it on DVD just to see if it was as bad as I expected, it was. My recommendation, if you want to see this one just watch a rerun on TV of his stand up routine, the jokes are the same and you won't waste as much time. I give it a 2/10 because a couple of the support actors did a good job."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "xoxcaitlin_kissxox",
        "review_rating": "3",
        "review_title": "Sorry Larry, The Big Screen's Not For You.",
        "review_detailed_main": "I'm a huge fan of Larry's stand up comedy. There, the vulgarity of his humor is balanced by his effortless wit and satire. In Health Inspector, this balance was completely non existent.\n\nI could rant for days on how terrible this movie was. Here's the basic problem. The humor was so vulgar and repetitive that it eventually came through as over the top, tasteless and in a word, unfunny.The other actors and actresses were completely useless as well, making a bad movie down right awful.\n\nPlease don't waste your time with this movie. It will permanently sour your opinion of Larry. Please enjoy him via stand up, especially Blue Collar Comedy Tour."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "drunk_kitten_1",
        "review_rating": "",
        "review_title": "Only funny part",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "Revolutionary_Nate",
        "review_rating": "1",
        "review_title": "what the...",
        "review_detailed_main": "Makes When a Stranger Calls and Big Mommas House look like The God Father and Lord of the Rings the Return of the King This movie is so freaking bad, Oh My God it's so awful, i would rather watch Glitter and CrossRoads for 40000 years straight, this is not funny at all it's so crap...the acting is like what the hell is this about\n\nGrazzies here we come....\n\n0.1/10\n\nActually watching paint dry in comparison is like watching The Godfather So bad...\n\nactually it was 0/10"
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "Robert_Hearth",
        "review_rating": "2",
        "review_title": "\"You're Not Gonna Believe This, But There's A Snow Cone Vendor Out There Not Wearing A Bra.\" --- Larry (Larry The Cable Guy)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "MustacheUmbrella",
        "review_rating": "4",
        "review_title": "The anticipated entourage prevented me from hanging myself",
        "review_detailed_main": "I was saved thanks to the movie trailer and perhaps Larry's none experience in acting, so I knew what I was getting into, which is why it sparked an interest in seeing this flick. It's kinda like when a mudslide is about to hit a million dollar mansion. And he's your boss too, and he treats you real bad, there's just absolutely no way you're going to turn your back or ignore that mansion falling to pieces. You want to be a part of that chaos!\n\nLarry the Cable Guy by no means is an actor or claims to be one unlike Ben Affleck or David Arquette, so there I give him credit. We are introduced in the beginning of all his horrific imperfections, Larry the Cable Guy: Heath inspector is not a movie about him trying to hold two jobs as many of you think. No, instead he is only a health inspector and checks to make sure no restaurants are violating any hygiene codes. This movie is your basic lowbrow humor filled with none stop situational visual comedy but in it's the lowest form, along with poking fun at the mentally impaired. It doesn't get any better when in about 15-20 minutes it turns into this \"dynamic duo\" which we have all seen millions of times before. \"Rush Hour\" \"Bringing down the House\" \"Taxi\" the list goes on...So now the premises is the character \"Amy\" uptight and perfectionist meets up with..you get the idea. Included in this film are isolated gags of fart jokes, vomit, butt crack and bad bathroom humor, which is cool, but once is enough! For a second, I thought this was headed in a semi-right direction when perhaps....Amy teaches Larry how to be more productive and visa versa? No. Instead just a one dimensional plot, but hey at least there's a plot, right? No? It's that hopeless huh? Well, it was a plot even though it was tiny. If you are thinking about taking children to see this, don't. Don't expose your child to filth please, but go ahead and enjoy it on your own. Too much Larry for me, Cable Guy is alright in moderation, but man this was near lethal overdose. And of course he only wanted to distribute his stand up act all throughout the movie. But at least he showers. Anyway, it could have been worse..Like chasing a Kangaroo for 2 hours cause he has your money. Why did I see this?, God only knows.\n\n3.6/10"
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "invincible_irvine",
        "review_rating": "5",
        "review_title": "What happened to the originality of Larry's stand up humor?",
        "review_detailed_main": "I've never really been a big fan of \"Blue Collar TV,\" actually, I've never watched a complete episode from start to end in one sitting. But I do remember the funny antics of Larry the Cable Guy. When the first previews of this movie appeared on TV last month, I found a couple recordings of his stand up routine, and was thoroughly amused with his unique brand of humor and style of delivery.\n\nAt the bookstore, I found out that he'd written a book, \"Get-R-Done,\" containing some of his more memorable stand-up favorites. I bought it after reading just the jacket synopsis and a couple pages I flipped through at the bookstore. At home, I couldn't stop reading and laughing, as the jokes and writing just kept coming at me at a blazingly funny rate.\n\nSo when I went to watch \"Larry the Cable Guy: Health Inspector\" yesterday, I went with high expectations of seeing Larry's most successful stand up routines shown on the big screen without the hold-backs of network television.\n\nWhat I saw was nowhere near the funny material from \"Blue Collar TV\" or his stand up and book; rather, \"Health Inspector\" is simply the same type of attempt to generate revenue from as wide an audience as possible. Though I'm not completely familiar with his routines and style, I quickly learned to appreciate his style of delivery of punchlines and humor, but very little of it is in the movie. The passing of gas is always a great fall-back to generate stifling laughs, but when the movie sets aside entire scenes on flatulating shows the film's desperate attempts to get enough laughs to convince movie goers to convince their friends and neighbors to watch the movie. After seeing the movie's performance over it's first weekend, it's apparent that that strategy didn't work.\n\nI may not be the most familiar with Larry the Cable Guy, but after knowing his style from listening to his stand up routine, I know that Larry the Cable Guy had little or nothing to do with the writing or producing of \"Health Inpsector.\"\n\nMy advice: wait until the movie is released on DVD before you watch it; there's no need to shell out $10 like I did to watch a movie that tries so hard to be funny, it almost isn't at times."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "kizzlex3",
        "review_rating": "7",
        "review_title": "hilarious",
        "review_detailed_main": "I went to see \"Larry The Cable Guy:Health Inspector\" on Friday and I wasn't planning on it being so good and funny.Larry the cable guy wasn't a great actor but since he was pretty hilarious you didn't even realize it. My theater was almost full and it was pretty rowdy and everyone was laughing almost during the whole movie. Also the story line wasn't great and it was sort of hard to follow. I don't think it was made to have a good story plot to make you laugh since he's already a stand-up comidian. Some parts are a little bit raunchy but mostly funny.Well all in all i gave it a 7/10 for the not so good plot. Oh and it's one of them movies you only want to see once or twice. Because of the bad story line."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "bensonmum2",
        "review_rating": "2",
        "review_title": "\"You're not gonna believe this, but there's a snow cone vendor out there not wearing a bra.\"",
        "review_detailed_main": "As the title implies, Larry the Cable Guy has a new job as a health inspector. Larry finds himself saddled with a partner he didn't ask for, farting, the prospect of a new relationship, more farting, a boss who wants him fired, even more farting, and a series of mysterious food poisonings at some of the city's best restaurants. Larry's a busy guy.\n\nI've seen a lot of dumb movies in my day, but Larry the Cable Guy: Health Inspector might just take the prize as the absolute dumbest. I think my IQ dropped a few points while I watched. The movie isn't much more than a continuous 80-something minute fart joke. The fart jokes go on and on and on. I didn't find the first one funny, so by the 50th, I was about ready to slit my wrists. Oh my God is this thing horrible! In between fart jokes, the movie finds time to offend just about every group imaginable. I'm not one that normally gets offended when watching a movie, but here, it slaps you in the face. Race, sexual orientation, handicaps, you name it - Larry treats them all with the same level of disdain and ridicule. It's bottom-of-the-barrel comedy. Still, I haven't rated the movie a 1/10 because, despite itself and my knowing better, there were a couple of moments that worked - most involving Larry's partner, Butlin.\n\nI'm shocked the makers of Larry the Cable Guy: Health Inspector were able to convince some of these actors to take the job. Iris Bahr (playing the previously mentioned Butlin), Megyn Price, Joe Pantoliano, and Joanna Cassidy must have all really needed the work. I'm shocked any would lower themselves to appear in this dreck. I know they were paid, but I still feel sorry for them."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "stoogedude",
        "review_rating": "10",
        "review_title": "A hilariously fun movie....if you're a LTCG fan....",
        "review_detailed_main": "I am an avid poster on these boards, and as everyone knows, I am a Larry fan. I support him and try to defend him as best I can.\n\nI went to see this movie Saturday the 25th with a couple of friends. The theater was sold out not long after my friends and I sat down. Now I'm guessing there were about 200-300 people there during that showing, and every single person laughed. I laughed a lot. I mean...A LOT.\n\nNow, as much as I have been defending it, I will say that I was skeptical before seeing it. I thought the acting would be bad, and it would be a lame movie as far as the plot is concerned. The movie didn't have the greatest writing, and the plot was a little off, and I got confused as to where the plot was going and who was involved in what throughout. But I laughed myself silly. This was what I expected, maybe a little better. The acting wasn't Oscar-caliber. But it was Larry the Cable Guy at his funniest. I give the movie a 7 out of 10. The plot and the acting put it at a 7, and it would have been lower if it hadn't been so ridiculously funny.\n\nI was outraged to see this movie at the #1 spot on the Bottom 100. It isn't THAT bad.\n\nI would like to see Larry in another movie, perhaps a buddy comedy co-starring the other Blue Collar comedians. Now THAT would be worth seeing!\n\nIn other words, if you are fan of Larry the Cable Guy, or you just like low-brow humor, including fart jokes, poop jokes, and other far out humor, then by all means, see this. If you are not a fan of Larry the Cable Guy, then I trust that you will avoid this. You won't like it. AND FOR THE LOVE OF GOD, DON'T VOTE ON IT IF YOU HAVEN'T SEEN IT!! If you thrive for political correctness, then you will be infuriated. If you have an open mind, and enjoy comedy, you will be hurting with laughter."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "Bill-16",
        "review_rating": "7",
        "review_title": "Not too bad at all",
        "review_detailed_main": "I was genuinely surprised that this movie was a good as it was. I gave it a 7/10 even though it was probably a 6/10, just because it surprised me.\n\nFrom the other reviews I figured that even I'd get disgusted at non stop toilet humor.\n\nThere was actually a plot and a love story.\n\nOne thing they left out was more physical humor.\n\nIn movies like this I expect people to slam their hands in car doors and get their hair ripped out by the roots every couple minutes. Like you'd see on an Adam Sandler movie.\n\nIt did make the usual dumb redneck jokes that the Blue Collar Boys are known for, but Larry was the only redneck in the film.\n\nI expected the neighbors to be a stereotypical hillbilly clan with an open toilet on the back deck and family members of obvious inbreeding.\n\nMany reviewers don't seem to understand that redneck humor IS making fun of the redneck lifestyle. The city folks seem to think everyone outside of their clean and highly educated cities is a dufus. It would be like country people thinking every city person is a Woody Allen neurotic.\n\nI'm lucky enough to live in between both cultures and I'll take the Good Ole Boys any day over a bunch of elitist snobs that think Wal Mart is the biggest danger to the USA.\n\nI see it had a $4 million budget. It made almost 7 Mil on opening weekend. That's called a profit, \"city slicker\"."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "bkrauser-81-311064",
        "review_rating": "1",
        "review_title": "America: We Have Created a Monster",
        "review_detailed_main": "Larry the Cable Guy reminds me of the idiot on the high school debate team who seemed to win his competitions winging-it. You know the guy; he's the one who can't spell Amazonian but manages to win the audience by saying the phrase \"save the rainforest because\u0085trees and s***.\" So it goes Daniel \"Larry the Cable Guy\" Whitney has been catapulted to super-stardom being a singularly obnoxious character comedian. His routine is infused with false goofball bravado and a bloated sense of self; callously \"standing up\" for red blooded Americans who drive a beat-up pickup truck and eat Hot Pockets for lunch out of a tin pale.\n\nI get it Middle America; Hollywood and the media are overwhelmingly liberal so out of the assortment of comedians you have to latch on to your mascot. But why would you plague us with this gleefully ignorant, aggressively offensive, boar? This film (which made a hefty profit), along with his comedy albums, standup tours and voice work for Pixar has elevated this guy's credibility. You've created a monster!\n\nIf you need proof of dear Larry's now unstoppable stupidity, look no further than his 2006 film Larry the Cable Guy: Health Inspector. He plays a city official who isn't particularly good at his job and doesn't really take his job seriously. So why do we care about this guy? Good question. Because of his unorthodox methods Larry is partnered with a by-the-books partner (Iris Bahr) who he constantly dubs a man due to her choice in wears and lack of voluptuousness. Funny. He then goes to a variety of ethnic restaurants with his new partner making imbecilic comments about restaurant owners and workers though because they're familiar with his banter the heed no mind. Funny. He also annoys his coworker Jack (Tony Hale) who is a paraplegic. Funny. He bungles into a mystery involving poisoned food before a local cuisine competition involving people in their Sunday best barfing and farting. Funny. Oh and there's the love story which starts with Larry staring at shop worker Jane (Megyn Price) as she removes the bras off of mannequins. Again, so funny!\n\nActually no\u0085no\u0085not funny at all! The cardinal rule of a comedy is be funny which this film is resoundingly not. Larry's character cannot provide any cleverness, insight, intuition or even irony. The man tows the line between amiable redneck and ugly American managing to isolate all but his most die hard fans. He slings his brand of gross-out humor with a soupçon of racism and sexism but any time it gets blatantly offensive he falls back into \"I'm-just-doing-me\" mode as the supporting characters catch him by being straw-men or shoulder shrugging bystanders.\n\nComedians like Groucho Marx did the thick shtick with a clever pomposity that irked the victims of his command of the English language. Jerry Lewis wasn't as sharp or presumptuous but he brought physicality to the fool role which was copied to great success by the likes of Jim Carrey. Larry the Cable Guy brings nothing to the table. His interpretation of the ignorant fool is one of a sad, second-hand Don Quixote. He looks to exemplify an ideal that never existed nor should; an Amrican who lacks all beneficial qualities but gumption and adulates his own numb-nut-ness while chomping down Moon Pies and day old pizza crust.\n\nThe saddest part about Larry the Cable Guy: Health Inspector is that despite naughty language, reference to bodily functions, sex and Kid Rock, the film got a PG-13 rating guaranteeing young people have and will see this asinine movie. In my youth when I lacked good taste I thought films like Ace Ventura: Pet Detective (1994) and Happy Gilmore (1996) were the best I've ever seen. Even today I will defend their quality while acknowledging serious filmgoers will dismiss them and deride me for them. It saddens me to think out there somewhere there are youngsters willing to defend Heath Inspector. Worse still is the notion that as they get older Health Inspector will crystallize in their minds with other \"cherished\" childhood memories.\n\nhttp://www.theyservepopcorninhell.blogspot.com"
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "lastliberal",
        "review_rating": "1",
        "review_title": "Dickweed. Dickweed. Dickweed!",
        "review_detailed_main": "There was absolutely no way that I was going to approach this film as a comedy. Anyone who dresses like Larry the Cable Guy cannot possibly be funny. Pathetic? yes, I'll give you that, but not funny.\n\nI saw that it was filmed in Orlando and it was about a Florida Health Inspector. So, I looked upon it as a documentary about checking out all those folks that sell boiled peanuts on the side of the road. Have you seen those things? People actually put them in their mouth! 89 minutes of farting, bathroom jokes, and a whole bunch of derogatory remarks about women, those with developmental disabilities, gays and lesbians, you get it. This is the same thing that you find in the small minds of people who watch NASCAR. I am sure they are the biggest fans of this movie. Not one laugh in 89 minutes.\n\nTies with Beerfest as one of the lamest excuses for use of film stock that I have ever experienced."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "JosephPezzuto",
        "review_rating": "3",
        "review_title": "Reel Look: Larry the Cable Guy: Health Inspector",
        "review_detailed_main": "That'll go down faster than a bottle of Vicodin at Courtney Love's house.\" American stand-up comedian, actor and former radio personality Daniel Lawrence Whitney, better known as Larry the Cable Guy, starred in his first movie back in 2006 as a slovenly cable repairman-turned municipal high-class restaurant-investigating health inspector. He was one of the members of the Blue Collar Comedy tour on Blue Collar TV, a comedy troupe which included Bill Engvall, Ron White and Jeff Foxworthy. To date Larry has starred in three Blue Collar Comedy Tour-related films: Health Inspector, Delta Farce (2007) and Witless Protection (2008), both of which I will get to reviewing later on in the near future. With his stereotypical redneck rube appearance, thick Southern accent and joke-telling of questionable taste, how does he fare from his stand-up act to the big screen? Aside from being best know as voicing Mater in the popular Cars franchise, of which came out the same year as this movie, how did this one manage to slip pass the Board of Health? Let's take a look.\n\nLarry, here playing much like himself but now as a health inspector, is an uncouth, middle-aged Moon Pie-munching bachelor living in a pig- sty of an apartment and drives an over-sized, bumper sticker-clad, exhaust-spewing pickup truck. His exasperated, no- nonsense boss Bart Tatlock (Thomas F. Wilson, of whom is best remembered as Biff from Back to the Future) is tired of Larry's ways in order of getting his duties accomplished. To have him fired, he assigns Larry with a new partner named Amy Butlin (Iris Bahr), a strict, by-the-book professional of whom takes her work quite seriously as opposed to Larry's questionable practices to his job, despite the fact that he always refers to her as a \"he\" or a \"him\" due to thinking she is a man. Iris did in fact appear in the unaired pilot for The Big Bang Theory as one of Leonard and Sheldon's university colleauges named Gilda the same year Health Inspector was released. Her character turned out to be the prototype for the later developed character Leslie Winkle (Sara Gilbert), as Gilda was thusly scrapped. No wonder she acts like a female Dr. Cooper in this movie. She tries to learn the ropes, but Larry's personality in less than tolerable. However his knowledge of vermin and disarmingly disconcerted way of interviewing witnesses and suspects slowly gets him where he needs to go. After learning of a serial criminal of whom is going around intoxicating local five-star restaurants, the duo drive off to save the town from a fatal food poisoning. It is only near the film's end where the culprit is exposed at a televised taping of Top Chef. Hilarious hijinks do not ensue.\n\nPanned by critics with a five percent on Rotten Tomatoes, the website ranked Larry the Cable Guy: Health Inspector #85 on its \"The 100 Worst Reviewed Films Of All Time: 2000-2009\" list. And after watching this, I can definitely see why. Some portions of Health Inspector are made up of Larry rattling off double-entrendes to get a point across we the audience got the first time (\"I could do this all day\") and enlongated fart jokes that disgust rather than get even a smirk. Even seeing Larry go undercover as a copacabana dancer near the end of the movie is unpleasant to look at, especially with his protruding girth. The supporting cast is halfway decent at least, including Joe Pantoliano (The Matrix, Memento) as Mayor Maurice T. Gunn, Tony Hale (Veep, Arrested Development) as Jack Dabbs, of whom poses as a wheelchair-bound cripple in cahoots with the bad guys (I seriously think he wanted to escape from the set near the end of the movie), Donnie (David Koechner, The Office, Anchorman), Larry's kind but dimwitted, bald but pony-tailed next- door neighbor, Joanna Cassidy as a restaurant owner, a horrifying unibrowed girl side character and Larry's blonde romantic interest Jane Whitley, a sweet, shy waitress. I was satisfied that they had the dignity not to make her a stereotypical airhead and actually quite smart. She does, unfortunately, give in to flatulence in one scene with Larry, somewhat losing her dignity as a better character. Even Kid Rock makes a cameo when Larry has a fantasy: either go fishing with him or make love to Jane. Jane comments to Larry, \"Nice rod\" as he holds his pole in a questionable area of his antatomy as we know what his thoughts are. But the jokes are no doubt aimed at those of whom attend Larry's stand-up act and are indeed low-class to say for the most part regarding his schtick. I didn't expect anything less upon pressing the play button, knowing I was doing it only for the criticism.\n\nWith a budget of $17 million, Health Inspector only garnered back a sickly $15 million plus of its earnings back at the box office. The website consensus on Rotten Tomatoes states: \"An aggressively lowbrow vehicle for its titular star, this gross-out comedy fails to \"git-r-done.\" At least Larry was nominated the Worst Actor at the 27th Golden Raspberry Awards. Look, if you enjoy Larry and his comedy, then good for you. As for myself, the toilet humor and innuendos are needless filler just to get a cheap laugh. I think it true and wise in keeping your health by staying far away from this film of which fails on all accounts to pass inspection."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "elshikh4",
        "review_rating": "1",
        "review_title": "It's Not a Toilet Humor.. It's Only a Toilet !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "StevePulaski",
        "review_rating": "5",
        "review_title": "Someone call the cable guy, I need a channel change",
        "review_detailed_main": "I'm not a die hard fan of \"redneck humor\". I am a fan of Larry the Cable Guy's stand up, but this film wasn't near the best of LTGC. He's a funny and amusing comedian who is probably, next to Foxworthy, the best on The Blue Comedy Comedy team. His humor in this movie is every fart joke he ever wrote in his life times ten. Toilet humor only goes so far. This movie proves that one full movie can focus on farting, pooping, peeing, and anything you giggled at, and maybe still do now, in grade school. Health Inspector deserves an award for that.\n\nHealth Inspector could be compared to the film Chairman of the Board with Carrot Top. Both were the acting debut of two actors, and it will likely be the last thing they do (or git-r-done) ever again. Witless Protection may be a Larry the Cable Guy film, but it's not an improvement or much better than this. Much like Chairman, this is okay, but nothing memorable or anything that will go very far. Chairman came out in 1998, and that's long forgotten. Health Inspector came out in 2006, and that one is long forgotten too. I can understand twelve years late, but only four years late, and there's no word on it any more? The plot is Larry (Larry the Cable Guy) is a the disgusting (pun intended) local health inspector which raises question, it never says how he got to become a health inspector? How would they let a man like this judge food when I'm sure he hasn't ate anywhere besides McDonalds until he became a health inspector? Just a random observation. Larry works with Amy Butlin (Bahr) who is probably Larry's worst choice for a partner. Unlike him. she's very uptight and serious, but opposites do attract. They wind up trying to find out who is responsible for all the food poisonings at four star restaurants, an it's all down hill from there.\n\nLarry works best when he does his stand-up comedy. My favorite of his stand-up routines is probably Morning Constitutions out of all three of his works. I did see both Blue Collar Comedy Tour films and did saw episodes of Blue Collar TV. Larry was the highlight of both, but so much redneck and country humor baffles me and leaves me speechless more often than not.\n\nHealth Inspector I give credit to being a film with loads of toilet humor that will make fellow southerners laugh, but the market for these types of films are very limited, if they even exist. It's not a bad film by any means, but isn't the kind of film I can recommend for a regular movie goer. I did laugh a few times, but forgot what I laughed at or why about five minutes later. By the last half an hour I contemplated changing the channel. But followed through with my plan to watch it. Do I regret it? Well Super Size Me was on so a little.\n\nStarring: Larry the Cable Guy, Iris Bahr, Bruce Bruce, Joanna Cassidy, Brooke Dillman, Tony Hale, David Koechner, Lisa Lampanelli, and Megyn Price. Directed by: Trent Cooper."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "SteakSalad_101",
        "review_rating": "1",
        "review_title": "Beyond horrible",
        "review_detailed_main": "I cannot believe I wasted 90 minutes of my life on this crap. I almost NEVER find movies bad. It's happened very few times in my life, but oh my, I cannot seem to find words to describe how bad this movie was. First of all, it was EXTREMELY disgusting. If your idea of a comedy is watching fat men take watery-sounding craps on small toilets, seeing close up shots of peeing in showers, people vomiting violently on restaurant parking lots, and hairy man cracks, then yes, I agree, this is the funniest movie ever made. Yes, I know what you're asking yourself, and the answer is yes: it's worse than BORAT. Yes, BORAT. If you thought nothing could more disgusting than Borat, you haven't seen anything yet. Second, a comedy is supposed to make me laugh because it's laughably funny, not because it's laughably BAD. The storyline is terrible and the acting is a joke. It's just not funny, and it's that simple. Watching my own toenails grow is more fun that watching this movie.\n\nAvoid this one like the plague."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "jalapenoman",
        "review_rating": "6",
        "review_title": "Yes, it is awful and full of holes, but it is hilarious and will make you pee yourself",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "dpm12",
        "review_rating": "1",
        "review_title": "One of the worst films I have ever seen, maybe THE worst",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "KEMnJAM",
        "review_rating": "10",
        "review_title": "I liked it.",
        "review_detailed_main": "I know Larry the Cable Guy may not be from the \"south\". But if he isn't he sure does play a good part of being southern. I am from Louisiana, i live in the very very bottom of the boot. ANd i think he is hilarious and so was this movie.\n\nI saw it in theaters with my older cousin and her 9 year old son, and we laughed our heads off, along with the rest of the very full theater. Then me and my boyfriend bought the movie and watch it all the time and laugh... We cannot seem to get enough of the movie.\n\nI guess u just have to have an open mind about humor.\n\nFor the downfall of it. It was kind of sick, I'm not real big on farting and using the restroom and announcing it to people and doing it in front of people. But all in all i liked the movie. i thought it was good."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "Cameron_Bales",
        "review_rating": "7",
        "review_title": "I've definitely seen 37 worse movies than this.",
        "review_detailed_main": "When I checked this movie was #37 on the worst movies in the IMDb. I've definitely seen 37 worse movies than this. Hey, it's not Oscar Material, but on the other hand it stars \"Larry the cable guy\" so you are probably walking in with your eyes open. I thought this was a fine piece of bubblegum. Some fun one-liners, and better acting and dialog than lots of movies. Don't let the super low-reviews chase you away if you are interested. The characters are cutouts, but that's what you are looking for. The air conditioner, and vise-grips in his truck are brilliant and true. The story actually makes sense, and you are hoping he will get the girl."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "zippyzipzip",
        "review_rating": "",
        "review_title": "Somebody Stop Larry the Cable Doofus!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "DonFishies",
        "review_rating": "5",
        "review_title": "Has plenty of funny moments making it much better than imagined (but not by a whole lot)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "RiffRaffMcKinley",
        "review_rating": "1",
        "review_title": "Terrible: A Nonstop Barrage of Fart Jokes and General Gross-Out Moments",
        "review_detailed_main": "Larry the Cable Guy has never been one of my favorite comedians anyway, but I can't even stand to see *him* doing anything so gut-wrenchingly repulsive as to star in a movie where the most memorable quote is, \"Y' ever fart s' hard yer back cracks?\"\n\nThis miserable abomination of a movie is something I never wanted to see, but it was playing in the room and I wanted to spend time with my family. Call me crazy. That was the film equivalent of falling on a grenade! I don't know how I overlooked this movie for my 25 Worst List in My Movies, but it's going straight in there when I'm done writing this.\n\nIf you're a fan of Blue Collar Comedy Tour, I guess you're supposed to love this. However, BCCT notwithstanding, this movie is terrible. How on Earth does a movie like this ever get made? No-- don't tell me-- profit."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "CagedinSanity",
        "review_rating": "4",
        "review_title": "Brainless, but fun.",
        "review_detailed_main": "I have two separate ratings for this movie.\n\nOn the actual *movie* comedy side, it's worthless and barely worth more than 3$ off of ebay. The actual skill and effort put into this was poor. 2/10 on that front.\n\nNow, as the entertainment value goes, It was worth seeing. I had two hours to burn at a friends house and we watched it On Demand, which coincidentally was 4$. Good measure of movie worth.\n\nI am glad he didn't have to resort to his catchphrase \"Git r done\" until the very end. But I wasn't glad that he just threw it out pointlessly. To me, \"Git r done\" Represents a victory cry or an exclamation when something cool happens. But to throw it out like a moron... Ugh.\n\nIt was worth the IQ-melting 2 hours just to tell people \"Yeah, I saw it. I laughed. I couldn't help it.\" And you have the right to say \"Yeah. It still sucked.\""
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "Obi5",
        "review_rating": "1",
        "review_title": "Unwatchable",
        "review_detailed_main": "As an avid fan of all genres of movies and an employee of a local movie store, I treat every new release with the same regard before previewing them. I like to give every movie the benefit of the doubt because I know every customer has a different taste on movies. When I am asked to recommend movies to customers, I will ask them their likes and dislikes and try to match their likes to a movie that would suit them, even if it was a movie I found lacking.\n\nThat being said, I would not recommend \"Larry the Cable Guy: Health Inspector\" to ANYONE. Even those customers who enjoy low brow humor would find this \"movie's\" antics unfunny and disgusting. High brow comedy lovers would find it intolerable. Low brow comedy lovers would find it too over the top trying to be funny. \"Rednecks\" should be offended by it. Of all the different types of customers I have encountered during my time at the movie store, I cannot think of one who would enjoy this type of \"movie.\" I watched the first 10-15 minutes of the \"movie\" and had to shut it off. It is the first time I have ever turned off a movie simply because it was that bad of a movie. I made it through other such notable movies: \"Jackass: The Movie,\" \"Gigli,\" \"Date Movie,\" and the \"Scary Movie\" series without turning off the television in disgust. I tried turning it back on and watching it and it only got worse. At no point does it redeem itself!\n\nTake my advice. Save your money on this movie. See if the video store has \"White Coats\" or \"The Matador\" for some good off beat humor. Don't lower yourself to such a level. Maybe if people don't rent or buy it, \"movies\" like this will stop being made!"
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "NotMoreMovies",
        "review_rating": "3",
        "review_title": "Get 'er DUMB ;-)",
        "review_detailed_main": "I'll start by saying this...\n\nI've seen worse...much worse...\n\nBut notwithstanding, this movie was horrible. But more \"Freddy Got Fingered\" horrible, not \"From Justin to Kelly\" horrible.\n\nThe good: The plot is there, and is easy to follow. It's not one of those movies where you keep asking yourself \"why did that happen?\" The jokes are funny in a low-brow way (VERY low-brow). Heck the first 5 minutes sets the pace for the whole movie, from Larry's butt crack to the \"yellow river\" in the shower (kids, say NO to \"crack\"). :) The comedy is so horrifically stupid it's entertaining (hence my reference to Freddy Got Fingered).\n\nThe bad: Everything else! Just about every race, gender, handicap, body size, and anything else commonly discriminated against is humorously referenced in this film! Nothing is sacred. If you're easily offended by....heck anything...don't watch!\n\nBottom line: If you switch your brain off...way off...you should be mind-numbingly entertained for 90 minutes. Just don't take anything too seriously.\n\nFinal verdict 3/10 (or one star out of four)."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "young-judith",
        "review_rating": "3",
        "review_title": "Larry The Cable Guy Movie Not That Good",
        "review_detailed_main": "The movie was a total bust for me. I was really disappointed in the story line, plot. I purchased the DVD and had I bothered to see it first I would not have done so. When I heard Larry's name and the tittle I was expecting to see some stand up routines of his. Not some silly off the wall movie line, plot, characters. Of course that is what happens when a person buys according to \"brand names\" rather than merchandise content. I do not think this will do very much to boost his career. I will say the vehicle he drove in this movie would be what a person would expect of the good ole boy character his choice of costume portrays. A good ole boy down on the farm type of vehicle. There was some laughs there and I was able to chuckle at some of the lines in the movie. Iris Bahr his straight man side kick partner done her part to make the movie with her acting ability. The next time they put Larry in a movie it needs to be tittled Git-R-Done with stand up tid-bits of getting some dumb things done and leave him to the snip it comments of his usual style. Now all I have to say is Get It Done."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "mgentalen",
        "review_rating": "7",
        "review_title": "I can't believe this, but worthy a watch",
        "review_detailed_main": "First of all, I honestly can't stand Larry the Cable Guy. But holdup, this movie sure is \" Rednecky humor\", and Larry is top billed, but, \"Health Inspector\" is silly fun.\n\nThe story may not be great, the writing is sub par and the acting is nothing new, but...had me smiling even though the material was obviously quite stupid."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "Star141b-1",
        "review_rating": "1",
        "review_title": "Larry did not GIT ER DONE!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "indyblueeyes1982",
        "review_rating": "10",
        "review_title": "funny from start to finish",
        "review_detailed_main": "this movie is nothing less than a comedic masterpiece. being a skeptic when i went in to see this movie, i must say my original judgements were wrong. the humor, while raunchy, was very efficient in making not only me but the entire audience laugh on end until the end of the movie. one of the best comedies i have seen in the theatre, this is a must see for anyone of raunchy, comedic tastes. don't let larry being a redneck detur you from this movie. that quality is what makes this movie so watchable. in the movie larry even gets put down numerous times for being a redneck. and the other people that are made fun of during the movie also are easy to laugh at. this movie is something that is sure to be a cult classic as soon as it gets out on DVD."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "fluffchop",
        "review_rating": "7",
        "review_title": "Good movie",
        "review_detailed_main": "This was funny. I laughed. What a character. The story was well written. It was a smart and dumb movie all at once. I loved his truck. You should watch this and laugh at the larger than life redneck humor. For this sort of movie it's very well done."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "EvLauster",
        "review_rating": "4",
        "review_title": "Doesn't quite \"GIT-R-DONE\"",
        "review_detailed_main": "** Larry the Cable Guy, Iris Bahr, David Koechner. Directed by Trent Cooper. Although I am not a hick I tend to like the \"Blue Collar\" team of Ron White and Foxworthy but Larry in a full movie doesn't seem to work well. A health inspector (Larry) is assigned a partner (Bahr, another blah performance) and the two have to track down the person behind the recent food poisoning in fancy restaurants. Larry has his usual stupid jokes about red necks and other idiotic misplaced jokes that seem to deliver soggy punchline (at best) and without a full antic dote. Director Cooper obviously just said \"go out there\" since there is no true comedy in it. Another deceiving trailer if I ever saw one, \"Health Inspector\" doesn't quite \"GIT-R-DONE\""
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "dbarr123",
        "review_rating": "3",
        "review_title": "Oh please 🙄",
        "review_detailed_main": "Change the rating to \"G\". The plot was so unbelievable and stupid that only children could enjoy it. It's amazing that this made it to the big screen. It's disappointing to me that Whitney stained his career with this."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "pmtelefon",
        "review_rating": "4",
        "review_title": "Sets the record for fart jokes",
        "review_detailed_main": "\"Larry the Cable Guy: Health Inspector\" fails to understand some simple rules of comedy. A peeing-in-the-shower joke can be funny but showing a close-up of the pee in the shower is not. A fart joke can also be funny. Having fifteen or twenty minutes of farts jokes isn't funny. Larry himself is a very likeable guy. He knows how to tell a joke. Unfortunately, he's given not the greatest material in \"Health Inspector\". His supporting cast is fine. Megyn Price is charming but then they make her fart too. \"Larry the Cable Guy: Health Inspector\" has its fair share of laughs but it also manages to wear out its welcome after a while."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "imdb-15118",
        "review_rating": "1",
        "review_title": "Movie isn't worth the paper the poster is printed on!",
        "review_detailed_main": "8 pages of reviews but I still had to comment! This is the first time I have ever posted a review in all the years I have been coming to IMDb for my movie information. I was compelled to vent on how miserable this movie was.\n\nI saw the movie Primer (good movie) and listened to the cast and crew tracks where they are talking about borrowing and renting equipment and having all their friends and family make food for them while they were shooting and how they had to make props by themselves and had to borrow money to market it, then I see Larry the cable guy, Health Inspector, and I see so much money totally wasted on such a worthless endeavor! Where do I start? The acting was terrible.\n\nThe story predictable, anyone who couldn't figure out within 10 minutes of the title sequence that the wheelchair guy was involved is probably the kind of person that gave this movie more than 1 star.\n\nYeah, right, a total loser like Larry gets a girl with all her teeth and less than 300lbs...Only in Hollywood, only in Hollywood.\n\nLarry needs to stay on the Blue Collar Comedy tour where he can hide behind the other talented comedians and throw out an amusing one liner once in a while....that way no one has to fund another escapade like this again! Don't see this, don't rent this, and I am with the guy that says if you find any evidence of this movie in public, take it out and burn it! Git' er' done!"
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "jimbo700",
        "review_rating": "1",
        "review_title": "A Redneck's \"Soul Plane\"",
        "review_detailed_main": "The only other time I have given a movie a rating of 1 star out of 10 was \"Soul Plane\", with Kevin Hart, Tom Arnold and Snoop Dog. \"Soul Plane\" was the last movie I truly regretted watching, until today. I am actually a big fan of Larry The Cable Guy, so it's not that I don't appreciate this kind of humor, but a fart joke is only funny so many times. Low-brow humor is OK with me, but this movie is just low-brow.. there isn't any humor. If you're the curious type, and want to see if this film is really as bad as people are saying... go ahead and cough up $2.50 for an overnight DVD rental. But trust me, my friends... you won't want to see it again so save the $19.95 (the purchase-price of the DVD on 8-11-06) and don't actually buy this on DVD. It should be in the $7.99 bargain bin within a month or two, but even $7.99 would be a waste of your money. I understand why Larry The Cable Guy agreed to star in this film, and it isn't exactly loaded with Academy-Award winners, but I really wonder what Thomas F. Wilson (better known as Biff in \"Back To The Future\") was thinking when he signed on. It must be the manure thing....."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "SpeedyFromTheBerks",
        "review_rating": "1",
        "review_title": "a snore fest!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "crazy_chick0000",
        "review_rating": "6",
        "review_title": "Cable Guy",
        "review_detailed_main": "This movie was interesting. I laughed a lot in the movie. It keeps a smile on your face because you never know what retarded thing will come out his mouth next. I just don't understand why it's called Larry the Cable Guy! Anyway, regardless of the title, the movie is a great comedy. It keeps you laughing and wanting more. I urge you to see this movie. Or in the words of Larry \"get her don\". Ha! Its hiliarous. Nice comedy and like I said keeps a smile on your face. If you want to go to a movie for a laugh, this is the movie to see without a doubt. You will enjoy it as I did and you may even wanna quote a few lines to your buddy next door."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "michaelRokeefe",
        "review_rating": "1",
        "review_title": "It just ain't getting' it done!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "voicesonthebluff",
        "review_rating": "10",
        "review_title": "Funny Movie",
        "review_detailed_main": "Really funny movie, just about everyone I know that has seen this movie thought it was good. I am sure that Larry is not everyones cup of tea, or can of snuff, but a lot of folks are fans who buy their CDs and DVDs. I don't think it will be packing em in at any art houses or winning ribbons at Cannes, but I don't generally look to see who does well there anyway. Many of us have an uncle or cousin that reminds us of Larry, we see him at family reunions and holidays, and he always brings a laugh and a smile.... So if you enjoy the \"blue collar\" brand of humor git-r-done and go see this film. It is what it is...don't expect something else."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "brad-kruse",
        "review_rating": "6",
        "review_title": "Red neck humor, done well.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "schreiner-07199",
        "review_rating": "2",
        "review_title": "Watched it as a ethnographic study of the mid 2000s",
        "review_detailed_main": "It's like they has a list of marginalized groups and made sure they made fun of each one. They had to be self aware of how bad the jokes were when they were filming it. But it was a simpler time. Definitely one for the archives to pass down to the next generation when people start claim how good things where during the Bush Administration. And think people actually want to go back to the days before the PC culture. We'll this is what you will gets. I laughed at the fact jokes, but I'm a sucker for them. Otherwise no much here to enjoy except for if you want to study past American culture through film or something like that."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "oscar_executiveboard",
        "review_rating": "1",
        "review_title": "Horrible!",
        "review_detailed_main": "I rented it and returned it the same day. Seriously, it was not worth the money, gas, and time spent. After viewing the trailer I was interested in it a little but decided to wait for it to come out on DVD so I can rent it.\n\nI really expected more from this after viewing the trailer. I think it's better to just watch the trailer for free as it is funnier than the actual movie.\n\nI've never seen Larry the cable guy before and I don't think I'll want to see him in anymore movies.\n\nI do not recommend this movie at all, see another movie instead, you'll be glad.\n\nMy grade for this is not even an F it's a Z-"
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "djfpiano",
        "review_rating": "1",
        "review_title": "A truly bad movie.",
        "review_detailed_main": "Any movie by Larry the Cable Guy is going to fall into the \"so-stupid-it's-funny\" genre, but this movie failed to meet even these requirements because it was extremely stupid, but by no means funny. I have nothing against Larry the Cable Guy and I've found his performances on the Blue Collar Comedy Tours hilarious, but this movie was by nowhere near hilarious. It will have you thinking twice before ever eating in a restaurant for the rest of your natural life (you may not want to eat snacks while watching this movie, or depending on your stomach, before this movie). The movie focuses on Larry the Cable Guy who is no longer \"the Cable Guy\" but now a quasi-rogue health inspector. According to different plot summaries of the movie, Larry has to try to solve a mystery involving a chain of food poisonings, but what they fail to mention is that these food poisonings do not, as I suspected, cause death but instead cause diarrhea and horrible gas. Larry does deliver a few funny one-liners, but toilet humor is everywhere and distracts from anything that might come off as funny anywhere else. The movie's jokes may be considered offensive to many different types of people including, but not limited to the crippled, Indians, the mentally challenged, homosexuals, and even anyone that has only one eyebrow (some may even claim that it is insulting to African Americans and Caucasians depending on how you take a few jokes). This movie is not funny, but is so rude and disgusting that it is beyond description and can be only compared to \"The Fly\". The problem with this movie is not that it is ignorant (different characters make comments on how rude and disgusting Larry is), but that it was produced/directed/created by an individual with a very twisted sense of humor. The movie's plot makes sense (although I wish it didn't) and if you find gross-out humor funny, you could find this movie being a 2/10. If you don't vaguely like the gross and disgusting side of humor, avoid this movie like the plague because dead flies, rats, cockroaches, trash-filled trucks, and cases of horrible gas are shown frequently in the movie. If you want to see it, wait until it comes to television."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "IonicBreezeMachine",
        "review_rating": "3",
        "review_title": "Juvenile, Crass, and idiotic all of which would be fine were it funny, which it's not.",
        "review_detailed_main": "Larry (Larry the Cable Guy) is a big city health inspector with questionable practices and his own way of doing things. Larry's boss, Bart Tatlock (Tom Wilson), irritated with complaints against Larry and the department, assigns Larry a new partner, Amy Butlin (Iris Bahr), a by-the-book professional who takes the job seriously. She tries to learn the ropes of health inspection while putting up with Larry and his personality while investigating a rash of poisonings at high end restaurants.\n\nReleased in 2006 to negative reviews and poor box office, Larry the Cable Guy: Health Inspector was an experiment in capitalizing on the success of the Blue Collar Comedy Tour which from 2000 to 2006 had seen massive success in direct to video productions, concerts, and other merchandise. Initially destined for a direct-to-video release Paramount opted for a theatrical release before transferring the rights to Lionsgate. The movie didn't wow with critics or the box office and rightly so because it is not good.\n\nWhen the film opens with a full shot of Larry the Cable Guy's plumber's crack and takes us through his morning routine of stepping on discarded pizza, saving used q-tips, and pissing in the shower, it's clear the movie isn't aiming very high. The schtick on display doesn't get much better once he steps outside his hovel with embarrassing gags like David Koechner playing a man with special needs or Larry repeatedly thinking Amy Butlin is a man and spouting a bunch of tired gay panic jokes with no real build up, set up or pay off and just limply hang there. There's really nothing else to say about this film, it's a movie, it's in color, the sound mixing is well done so you and hear and see everything clearly. Even if you like Larry the Cable Guy's stand-up you're probably not going to like this movie. Most of the time it's just a series of gross out jokes that are tired and played out and no real substance or reason to exist."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "runcap",
        "review_rating": "2",
        "review_title": "Is Larry supposed to be funny?...is he ever funny?",
        "review_detailed_main": "Maybe five minutes tops but at ten minutes he's agenizing repetitive and misfiring.\n\nI've watched a few of his standup routines and could never make it past the six minute mark.\n\nIt's really not the joke writers fault but the Larry persona brand...he's just not funny, the in your face yokelism is cringy and it shows in the mean spiritedness of \"Larry the Cable Guy: Health Inspector\" Hitting a dry well with his only trade mark character he looks disparate trying to be funny dredging in the muck ,the longer he hams the camera the more his one dimensional yokel shtick misfires.\n\nI mean how many times can you guffaw hearing \"Git-r-Done\" What am I five years old?\n\nWhere's a John Candy/James Varney redneck mix ,that would be entertaining but Larry just comes across as unlovable, annoying and overbearing, being slovenly is not funny just by itself ... \"know what I mean Vern\"\n\nInserting a hapless romantic side story into this awful movie just seemed so abusive to the poor girl and me watching.\n\nAlso Larry's boyish health inspector sidekick was constantly pummeled by this troglodyte...I felt repulsed and was hoping Larry would get fired for being a bullying slovenly unfunny halfwit, Jim Carrey had a dumb & dumber charm while Larry just comes across like a oinkng pig in a china shop.\n\nStory +1 ,cute romantic interest +1, Larry persona -10."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "guyfromjerzee",
        "review_rating": "7",
        "review_title": "Great fun for Larry the Cable Guy fans!",
        "review_detailed_main": "I was slightly hesitant to check out this movie, since I read a boatload of terrible reviews on this site. I expect bad reviews from critics, I expect bad reviews from those who despise Larry the Cable Guy--but I don't expect bad reviews from fans of Larry. Even most of the people who enjoy his comedy didn't like the film. But I finally picked up the DVD and lo and behold, I was laughing...a lot. The plot is no gem, but that didn't bother me. This wasn't meant to be an intelligent, plot-driven comedy. It was meant to be a comedy vehicle for Larry, and as that, it succeeds. Sure, the humor is low-brow and there are plenty of toilet gags. What the hell do you expect? Have you ever seen Larry's stand-up? I can't deny that I wasn't laughing out loud when Larry was on the John, couldn't find any toilet paper, and uses a towel to wipe himself. And as I hoped, the movie contains plenty of the comedians hilarious one-liners. So if you're not a fan, stay away! Nobody's forced you to watch the damn movie! If you, like me, are a fan--then enjoy the show. The movie is not pretentious. It doesn't try to be anything more than a brainless comedy flick. I was feeling in a terrible mood when I watched the movie, and it definitely cheered me up. I'm sorry, but if I'm in a bad mood, I'd much rather watch \"Larry the Cable Guy: Health Inspector\" than \"Gone with the Wind.\" The actors all seem to be having fun, even veteran character Joe Pantoliano (who bares a striking resemblance to Clint Howard in the film). The lead actress is cute, there are several cool songs in the soundtrack (including \"I Want to Know What Love Is\" by Foreigner). I have very few complaints. Whether they admit it or not, every person at least sporadically craves to just check their brains at the door, kick back with a couple beers, and watch a low-brow comedy of this nature. I appreciate great films like \"Crash\" or \"American Beauty\" or \"Goodfellas.\" Just because I can enjoy a movie of this sort doesn't make me a Neanderthal."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "healingchef",
        "review_rating": "8",
        "review_title": "It was so funny I was crying....",
        "review_detailed_main": "I did like this movie. I was not expecting it to be so funny! Come on people your telling me you did not laugh at all at this movie? yea right it at least made you giggle. I have to admit I didn't think it was going to be sooo good but it was. It WAS silly , but everyone in the theater was laughing and there were a lot of people almost a full house so it wasn't just me. It made me laugh. It is just a fun silly movie to go see. Not very much cussing at all and no bad scenes so just cause there were no sex or violence its a bad movie? It had gross scenes I guess but they were even funny. ANd I am a girly type of movie watcher. ANyways if you want to laugh till you cry watch this movie."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "usmcdiorio",
        "review_rating": "6",
        "review_title": "Actually kind of entertaining",
        "review_detailed_main": "After reading the reviews on this site I was sure that this movie was going to be absolutely horrible. I thought the movie was crude but funny. Obviously if you've ever listed to Larry the Cable Guy's comedy, he makes plenty of fart jokes and isn't afraid of the tasteless. The movie is pretty much more of the same. It had decent characters and even though the plot wasn't Academy Award winning, it was more than what I expected.\n\nBottom line, if you didn't like Larry the Cable Guy before this movie, you probably won't like him after watching it. If you think redneck jokes are funny, you'll enjoy it. If you're one of those people who are easily offended or overly political correct, you might as well not bother."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "Electricbassguy",
        "review_rating": "6",
        "review_title": "It's a Scary Movie for Buddy Comedies with a lot of farting.",
        "review_detailed_main": "Larry the Cable Guy: Health Inspector is not a bad movie. It's actually pretty funny. Even though many complain that all the characters are cardboard cutouts of cop movies, I think this is intentional. I believe that this movie is meant more of a parody of buddy cop comedies than anything else.\n\nLarry is pretty funny, though I think he works better at stand-up comedy because he doesn't have any limitations of plot. The rest of the cast was pretty good, especially Butlin (the boy.) The movie had a bit of odd social commentary. It seemed as though Larry had some anti-racist beliefs. He would let health inspections slide more for those who had not been in the U.S. as long, and Big Shug (a black man with great fried chicken... I guess that's stereotype) was somewhat of the hero.\n\nThe movie actually had a few tense scenes. It doesn't deserve to be in the Bottom 100."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "cacheit",
        "review_rating": "9",
        "review_title": "A Laugh a Minute!",
        "review_detailed_main": "Very funny! From start to about the last ten minutes, last ten minutes kinda drags by, but then the credits outtakes do it justice. In order to watch this movie be very perceptive and look past the actors as well for other gimmicks included in the movie. Lots of one-liners to keep everybody laughing. All of the actors do a great job I believe in this show, and even those not so \"new\" to the scene. Larry in Bible College? When does Larry the Cable Guy \"Pastor\" come out? That would be a hoot. Sit back have fun and prepare to laugh, especially at Larry's soon to be mother-in-law. I couldn't stop laughing through out the entire show, have fun."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "pdiddypeters",
        "review_rating": "6",
        "review_title": "I've seen worse.",
        "review_detailed_main": "I don't think this movie was half bad. Some of Larry's comedy was enough to give me several chuckles, and it was basically fun to see Larry be himself in the whole movie. I've seen worse comedy movies, like I-SPY with Eddie Murphy. I fell asleep the first time I watched that, and I have a sensitive funny bone! Sure, the storyline was kind of weak, and some of the supporting cast was bad too, it was still a nice fun romp of a movie. Larry's jokes were also fun to listen to, and I absolutely enjoyed his Larrymobile(truck). As Larry would say about this movie, \"It's funny, I don't care who you all are, that movie's funny right there!\""
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "jordan2240",
        "review_rating": "6",
        "review_title": "Take it for what it is.",
        "review_detailed_main": "I read a sampling of the other reviews, and find I'm in agreement with the few that thought this movie was entertaining. But, as others have noted, you HAVE to be a fan of Larry to get it. If you've never seen/heard him perform, then a lot of the one liners might seem very offensive. As in his act, he plays a naive \"redneck\" who is unintentionally insulting, and I, for one, find it to be rather funny. Yes, there is a good bit of bathroom humor, but, unlike some of the opinions, I don't think it was overly done, and I also thought the acting was rather good. I imagine the crew had a lot of fun making this movie, and that comes through the performances. I'm a middle-aged family man of normal intelligence, have pretty eclectic tastes regarding art, and don't follow NASCAR, and this movie made me laugh. I've seen some movies that have garnered some pretty good ratings on this site that I thought didn't deserve them, and I've seen others with terrible ratings that didn't deserve those either. This movie should rate no lower than a five. I don't know what people were expecting when they saw it, but take it for what it is, and you'll find yourself entertained."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "zoning",
        "review_rating": "8",
        "review_title": "Not for the PC crowd.",
        "review_detailed_main": "Greetings, I work for a Legal Department in a city and often have to help the Health Inspector close a restaurant or fill in for the inspector when needed.\n\nI thought it was very FUNNY.\n\nLarry does go over the top, that what he does! This is not Shakespeare and if you read and paid attention to the rating, \"Rated PG-13 for crude and sexual content, and for language.\", you would have known not to bring the kids.\n\nLarry is not for the PC crowd and that's a good thing. Now that's funny right there, I don't care who you are.\n\nI think the people that did not like this movie because of Larry, did not like him to start with.\n\nBest regards, Ferd"
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "yevonwm",
        "review_rating": "6",
        "review_title": "Not a stand up act but a good movie",
        "review_detailed_main": "This one gets a six from me, I was initially expecting a stand up act but I quickly realised (mid-movie) that I wasn't getting one. Its a good chance for Larry to elaborate on his redneck character with a movie budget but the quantity of fart jokes is not for everyone. I can see reviews from people disappointed that this isn't a stand up act and I must stress that this is more of a rush-hour style movie with chemistry developing between the characters and larry as the protagonist. Once you understand this its a nice family movie. You can tell everyone making the movie is having a hilarious time and it pushes through the screen."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "leonardwatson212",
        "review_rating": "6",
        "review_title": "Academy Award Winner - No, Funny -Yes!",
        "review_detailed_main": "OK, so this is not going to win any awards for being a great movie or a great screenplay, or pretty much a great anything. However, if you like Larry the Cable Guy and redneck humor you're going to love this film. It is Larry at his best. It is predictable and filled with some of Larry's classics, fart jokes, his sister, being a redneck, playing dumb. But hey that is what Larry is all about. If you do not like Larry's stand up routines or Blue Collar Comedy routines you will not enjoy this film. In the genre of dumb comedy, this is one of the best. All-in-all, if you want a great laugh this will do it if you want to see a great film rent Doctor Zhivago."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "Captain_Sturdy-1",
        "review_rating": "10",
        "review_title": "Like Shakespeare",
        "review_detailed_main": "There are those that recoil in terror at the seemingly repetitive themes in Larry the Cable Guy's major works, I respectfully digress that all great movies are about life and death, fear and triumph, love and loss. We must ask ourselves, is our life such as a catfish scented Igloo cooler? I say that it is. After all, is it not the basis of life, to worry about such troubling issues as to hang out with Kid Rock, or slobber over Pamela Anderson Lee whatever her last name is this year? Layer upon layer of intricate meaning, tackling other bothersome societal ills such as inbreeding, juvenile delinquent behavior well into adulthood, and even the perennial question \"Who farted?\". Indeed. Well thought out, Larry the Cable guy. You truly are a deep observer of humanity."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "bababear",
        "review_rating": "6",
        "review_title": "...but I Laughed Anyway",
        "review_detailed_main": "This probably has the worst screenplay of any movie ever made. Worse than THE PIANO, even worse than THE English PATIENT. The direction is uninspired so the supporting cast (who are probably very capable) didn't do their best, and it's photographed like a sitcom with flat lighting in the interiors.\n\nBut it's got Larry, and that made it worth the $5.50 any day.\n\nPlus, it's encouraging that this was at least made in the United States, in Orlando, Florida and at the Universal Studios there. It seems like half the movies showing now are made in Canada with American money.\n\nPeople have a delusion that what works on the live stage or in a thirty minute TV show is going to make a great movie. Not necessarily. If HEALTH INSPECTOR were a series, this would be one thirty minute episode. With titles and ads that would be about twenty-two minutes of show. This is four times that long (plus a minute) and it moves as slowly as a glacier. And the plot (something about a cookoff to see who's the best chef in the city) is way more complicated than need be.\n\nLarry has created a wonderful character, and I'd like to see him try another movie with a real director and real writers. It could be dynamite.\n\nHe plays a modern day Will Rogers who (between farts) dispenses folksy wisdom. The screenplay brings on a string of bureaucrats, self important politicians and snobs for him to shoot down with his easygoing humor. Unfortunately, mere seconds into the film we see a closeup of Larry's buttcrack showing above his boxers. This is an indicator of what's to come.\n\nHe's teamed up with Amy, a new, by-the-book rookie health inspector. Thank goodness there's no attempt to start a romance with her and Larry (though much of the film he thinks Amy's a gay man, an illusion she disabuses him of in a hilarious scene involving a hidden microphone), but she's lucky in one respect. If she'd partnered with Clint Eastwood in a DIRTY HARRY movie her character would have been dead three fourths of the way through the story.\n\nLarry deserves another movie. I'm looking forward to it.\n\nFart jokes can be funny. There's a scene in a fancy restaurant with two yuppies on a romantic date that turns into a symphony of farts, but that can only get you so much mileage out of that.\n\nBetter luck next time, Larry."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "jwbcdb",
        "review_rating": "7",
        "review_title": "SUmmary",
        "review_detailed_main": "\"I walked into the theater hoping I would get some good laughs. I went with my friend who worships Larry's humor. I left the theater disappointed. This movie is filled with the same joke over and over again. Basically overdone toilet humor. I have nothing against the humor, it's just the same jokes repeated over and over again. Nothing new or inventive here. Larry's humor was not creative. Just diarrhea jokes over and over throughout the whole entire movie! And that was the whole running gimmick!\"\n\nWhat the heck? it wasn't filmed to be an Oscar winner.\n\nLarry is one funny SOB! great movie 7/10 from me. i hope he does more movies. yes there was a lot of bathroom humor but thats not larry's fault as much as the writers fault. Anyone who likes larry and wants to laugh should go rent the DVD when it comes out support the redneck comedy! I hope it catches on as good as the black comedy movies like Friday, White Chicks etc...\n\nCountry Music is already taken over why not movies? I'm still laughing from this movie!\n\nGet-R-Done!"
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "stevenball2",
        "review_rating": "10",
        "review_title": "Best of Three",
        "review_detailed_main": "This is Larry's first movie & the best of the three he has done so far. Delta Farce & Witless Protection are the other 2. I don't include the Cars movies because those are animated. Health Inspector came out in 2006 & made enough money to insure Larry's career. Although it is a comedy most people overlook the tender romance between Larry & Jane. Of course in real life no girl would ever give their phone number to Larry. But in the movies unusual things can happen. Jane's mother is played by Lisa Lampanelli. I didn't recognize her at first. It was only after repeated viewings it dawned on me. Hey that's the chick who hosts those celebrity roasts! My favorite scene is the one with the rats. The pairing of Larry and Butlin is inspired. Why doesn't Bruce Bruce get more work. He's a natural. Unfortunately as Larry gets bigger & bigger he may loose some of the innocence of his early work. I hope not. I hope he never goes legitimate."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "picrob2000",
        "review_rating": "10",
        "review_title": "This movie's funny. I don't care who you are, it's funny.",
        "review_detailed_main": "I don't know why most newspaper movie critics said this movie wasn't all that great, but I believe they are awfully wrong. Matter of fact, us movie goers do a better job criticizing movies than most \"professinoal\" movie critics can. I loved this movie (That's right, GIT-R-DONE). I was interested since the first time I watched the trailer. From what I saw in the movie, a lot of Larry's stand-up comedy bits were applied, especially visiting the lingerie store. Not one bad scene in this movie at all. I recommend this movie as a must-see for all Larry the Cable Guy or Blue Collar Comedy Tour fans. This movie, in what would appear to be Larry's terms :\"That's funny right there. I don't care who you are, that's funny right there.\" Remember, GIT-R-DONE."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "twistedpipes",
        "review_rating": "9",
        "review_title": "plain humor, dumb, stupid, and I laughed so hard I cracked a rib",
        "review_detailed_main": "I went to see Larry the cable guy last week with my son. we both thought it was extremely funny. we are not red necks and both have very high I.Q.'s, but this was a great break from the normal movies we see together. I think as far as funny movies go it was one of the best. the whole theater was in stitches the whole movie. their are a few slow parts, and the plot gets kind of confusing, but I have to say I find Larry in this movie very funny, even though I am not a fan of his stand up.\n\nit's funny how many people write that don't like this movie. I guess they are the ones who go see the stupid horror and demonic films out their not to mention the filth that Hollywood puts out.\n\nSo if you want to see a good clean movie go see Larry the cable guy's new one. peeing in the shower and all."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "Jessell24",
        "review_rating": "8",
        "review_title": "not as bad as everyone says",
        "review_detailed_main": "I thought it was an alright movie. From everyones opinion's, this movie was garbage, I thought it was pretty funny throughout the whole movie. Not the greatest comedy I've seen, but if you have never seen Larry the cable guy, you wouldn't like this movie. It could of definitely been better, but there was something missing in the movie to make it more entertaining. It is pretty funny that he thinks her partner is a man throughout the movie. I don't think i would see this movie again, but I think if you have heard of Larry the cable guy and seen him, you'll like this movie, if you haven't, this movie isn't for you. I'm giving it a 8 because Larry is pretty funny, and the story seemed pretty easy to track and was pretty good."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "pintousmcff-1",
        "review_rating": "10",
        "review_title": "Is this a movie? Yes it is, and it is much more",
        "review_detailed_main": "Once in a generation, a movie will come along that will change your life. Such a movie is Larry the Cable Guy: Health Inspector. Based on the 15th century novella by Shakespeare entitled \"Boobs Boobs Everywhere\", this is the kind of timeless classic that will define our generation. Men of the last 1000 years? How about Albert Einstein, Abraham Lincoln, Ghandi, Jesus, and Larry The Cable Guy. This Larry guy is the kind of slack-jawed, fresh-faced, young upstart that will likely attract hordes of fans. He has that kind of hip-hop urban appeal that African American males will love. His smart, campy humor has become the voice of a generation. I submit that we rename December 25th \"Larry The Cable Guy Day\". Move over Jesus, your ass is getting kicked to the curb. What have you done for us lately? It is the age of Larry now."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "cripes_wolf",
        "review_rating": "10",
        "review_title": "Fantastic",
        "review_detailed_main": "If you've seen Larry on the Blue Collar Comedy Tour, then you should be prepared for the movie. His comedy act is toilet humor, crude jokes, and not at all PC. His movie is no different. The movie lives up to what anyone can expect from a Larry the Cable Guy movie. If you liked him in the Blue Collar shows, you should like him in this movie.\n\nThe movie was worth seeing, and I plan to see it again, and so does my boyfriend.\n\nActually, I plan to get this movie on DVD when it comes out.\n\nAnd then I'll watch it over and over again, and continue to laugh at the jokes, because they are funny."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "thomasquires",
        "review_rating": "9",
        "review_title": "funniest movie ever",
        "review_detailed_main": "this was an awesome movie and i don't care if this is a 1 and a half star movie i laughed the crap out of myself.\n\nit is so funny i swear there should be a sequel i think it would of been better if Jeff fox-worthy would of been it i also thought it would of been better if button was actually a guy. It also should of been longer come on, you have to make it two hours to at least be a good movie. I think Larry did a good job for his first big movie, you have to five him some credit, if you watch it you will change your mind about what you think. It was funny, had you guessing, what more could you want."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "sethn172",
        "review_rating": "10",
        "review_title": "Yeah!!!!!",
        "review_detailed_main": "About a year ago, I found a very interesting phrase. That phrase, as some of you probably already know, is \"Git 'R Done!\" I've thought to myself, \"What in the world does that mean?\" After some time, I found a DVD of the original comedy show by Larry the Cable Guy, and it said on the cover: \"Git 'R Done!\" Now, I began to know what the heck that odd phrase of his meant!\n\nAfter Larry the Cable Guy's success on his original comedy bit, this movie, \"Larry the Cable Guy: Health Inspector,\" was produced. Think of this as more of a gigantic, big-screen version of his first comedy show. He is a very funny guy, and if he were a real cable guy in my hometown, I'd ask him to set up an HD box for me!\n\n10 stars!"
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "Coasterfreak10",
        "review_rating": "10",
        "review_title": "Hilarious",
        "review_detailed_main": "I loved this movie! It is one of the funniest movies I have seen in 2006. You know, many people have been saying how bad it is, but I found it to be an extremely hilarious film. I'm not listening to anyone else. My opinion is, as follows: LARRY THE CABLE GUY IS A FUNNY PERSON. Why can't people at least give him respect? The movie was very funny, and he did a great job depicting the daily life of a redneck person. Thank you Larry for giving the world this funny film to show us how trailer trash makes life very fun. I love the comedy acts he does on television, and this movie was just as funny as his TV act. I wish there would be a sequel. I would sure as heck see it."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "sportsman674",
        "review_rating": "10",
        "review_title": "This movie is redneckishly funny and it gits a 10",
        "review_detailed_main": "you know I'm 15 years old and i am a redneck. I'm speaking for three of my friends and myself as well, its funny how most peoples reviews i've read have bashed this movie, at least it ain't no film called gilgi or whatever that one was with Jennifer Lopez in it. Anyways, Larry The Cable Guy: Health Inspector was very funny to me and it was amusing right as it came on. I couldn't stop laughing. I like the Larry mobile\n\nHis humor expressed in this movie was vigilant. I enjoyed it all, and I'm buying this one on DVD. So, if your not sure on seeing it or renting it, you should if you like to laugh because trust me you will laugh, and its my new favorite movie bumping out some kind of monster."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "prattenkaty",
        "review_rating": "10",
        "review_title": "its frigging awesome",
        "review_detailed_main": "the movie is a great one i never stop ed laughing i think its the funniest movie i have seen in a long time hope then come up with a next one. I am totally going out and buying this one. i love the get-r-done part it makes me laugh so much over all think if this author makes another movie like think or another funny movie lie this he will make millions. I love it when the swore in the movie and all the cock roaches coming out of the boards in the beginning that was really scary i hid behind a blanket i hate bugs and that big fat black guy he was so funny oh my god i am going to go watch that movie again right now its just that good"
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "maczac",
        "review_rating": "8",
        "review_title": "Surprisingly entertaining and very funny!",
        "review_detailed_main": "I took my 11 year old son to this movie because I know that he loves this type of humor. I went in with an open mind, but still thinking \"what can you really expect from a movie starring Larry the Cable Guy?\" It was very funny and I was surprised that the plot, albeit predictable, was very entertaining! Larry's genuine hillbilly sweetness makes everyone fall in love with him. Pretty good acting abilities for a someone who I thought was just a comedian! The entire (packed) movie theater was laughing from the opening scene to the closing outtakes. I recommend this movie if you want an easy watch and a good time at the movies."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "missattied33",
        "review_rating": "10",
        "review_title": "SO Awesome!!",
        "review_detailed_main": "To watch this you have to love Larry the Cable guy anyway. If your a prude this isn't for you. It has some raw humor but is rated PG-13. I think this age really applies to this movie. If you kids are younger don't take them. I see a lot of movies but I can say I have never ever laughed so hard at any movie in my whole life. I was wiping the tears from my face for hours. The whole movie is funny. Its not just the preview parts you see on TV. I would see this everyday until its not playing anymore if I could. I am truly going to buy this when it comes out on DVD. You will not waste any money on this one. Have fun and enjoy!"
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "JerryLambert",
        "review_rating": "10",
        "review_title": "One of the best Dawgum movin' pitchers ever maid",
        "review_detailed_main": "More boobies than you can shake a stick at and plenty of commode scenes. I bet they had to bring one of them farty cows in for backup. Princess Leah looked great as a boy and I think I went to grade school with that one girl. It's got Cypher from that thar Matrix movin pitcher too.\n\nThis pitcher is politicly correct. You got your retards, your asians, your homosexuals and democrats. Oh yeah and the mean guy from Back to the Future.\n\nI highly recommend you'ins watch this here movin pitcher after about a case of Pabst Blue Ribbon to fully enjoy it. I reckon."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "sunniebrezenc",
        "review_rating": "10",
        "review_title": "The Funniest Movie",
        "review_detailed_main": "I do not understand why others thought this movie was a bust. My husband and I attended this movie 3 weeks after it was over on a tuesday evening and the whole screening room was packed! Throughout the entire movie all you could hear was laughter one person almost fell out in the floor laughing so hard. My husband does not laugh at a lot, and he laughed the entire movie. I laughed so much that my stomach and cheeks hurt. If people watch the blue collar comedy tour they know that Larry speaks a lot about gas and \"redneck\" things, so exactly what were they expecting out of the movie? Roses? Anyhow I thought it was the funniest movie I have ever seen. I cannot wait for it to come out on DVD."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "rogue-angel-1",
        "review_rating": "10",
        "review_title": "Mindless entertainment...",
        "review_detailed_main": "Although I think this movie is quite safe from ever being bombarded by Oscars, one can't help but be entertained by the brain-numbing comedy this film offers. This is probably one of the worst films of the year, but it's a refreshing change to the seamlessly endless trend of re-makes and sequels. This is anything but a romantic comedy and probably a poor choice for taking a date to. Don't go see this movie if you feel the need for intellectual stimulation because there is nothing intellectual about it. This movie is a tribute to the term \"lack of sophistication.\" The movie left me laughing out loud, while shaking my head in disbelieve. This is generally not my kind of movie, but I gave it a rating of \"7\" because I found it entertaining and, even though I'm ashamed to admit it, it made me laugh. Do go see this movie if you are not offended by offensive humor."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "a357124",
        "review_rating": "10",
        "review_title": "Git R Done!",
        "review_detailed_main": "Larry the Cable Guy is downright hilarious in this film. This film will be an awesome treat for fans, and, yes, it's gross humor. There's a very funny bathroom scene, among other things. Larry is a wonderful comedian, and my sides hurt from laughing so hard at several points during the movie.\n\nIn this film, Larry is a city health inspector, and he lives in a junky house in this film. He has a neighbor who is a retard. One thing that I found refreshing was that this film was sort an of anti-Brokeback Mountain. With homosexuality being glorified everywhere you go, it's refreshing to see a movie where it is put in its place. Because of general hilariousness, and because of Larry's position on the issue I mentioned above, I will make a point of seeing any future movies he makes, on opening weekend. With all the trash that's come out of Hollywood lately, it's nice to have a movie that's actually worth the price of a ticket."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "midtra52",
        "review_rating": "10",
        "review_title": "If you need a easy movie to watch and a good laugh",
        "review_detailed_main": "I don't see how people can say they hated this movie.\n\nThere is some gross stuff in it but I must say peeing in the shower is actually sanitary so maybe Larry is smarter than we realize. I mean after all he was the health inspector.\n\nBut this is a good easy movie to watch, get some good laughs, question what goes on inside his head and just have a good time. There honestly haven't been too many good comedies lately and this one while not being a high budget major Hollywood film did actually provide the laughs and that's what counts. So I say good job to all who worked on this movie it did what it was made to do."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "jamiem-20",
        "review_rating": "8",
        "review_title": "An OK film",
        "review_detailed_main": "Not bad for a Larry the Cable Guy film. It shouldn't have been nominated for a Razzie though. It's kinda worth seeing, but at the same though its kinda worth owning. It wasn't as good as Git-R-Done. I liked the fart jokes and the retard. It's pretty good, but more 8 star worthy. So the only time you might wanna see this is only if you're not eating. It's about this silly health inspector who has a new partner that's not all that beautiful. Then he is infatuated with this girl at the panty store. Then there is something in the food that makes everyone puke and all. It's something you may not want to eat and watch at the same time. But rent for some good laughs. Git-R-Done."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "Kevin_Nicks_Comedian",
        "review_rating": "10",
        "review_title": "Larry The Cable Guy movie",
        "review_detailed_main": "Well I enjoyed this movie a lot. Not just because I'm always told I should be Larry's look a Like or stunt double. But the humor is some of the greatest ever written into such a clean arrangement.\n\nComedy has many different flavors, Larry The Cable Guys \"Get R Done\" has been a contagious phrase that you can hear from a restroom at Denny's to the Restroom at the Waffle house, but the blue is one that satisfied many comedy lovers for many years. Thanks to everyone who has supported our blue humor all these years.\n\nI enjoy saying Gator Done! I get away with that at ever event. We say Hoe Hum or Yeee Haaaa to get a sentence to become shorter than normal. Thanks again for all the love and support.\n\nComedian Kevin Nicks."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "tkarlmann",
        "review_rating": "8",
        "review_title": "Fun & funny movie ; watch it!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "unchartedxero",
        "review_rating": "10",
        "review_title": "I love Larry but...",
        "review_detailed_main": "Larry the Cable guy is a very funny comic but his movie is awful. It is very gross (lots of farting). There are funny parts that will make you laugh. Overall it is very silly. The plot is simple to figure out - who done it!\n\nIn some scenes you can see the microphone hanging down - now that is a low budget flick!\n\nUnless you a hardcore Larry fan don't waste your money going to see it, this is a movie to rent at best. If you like Larry catch him on TV, many of the same jokes are used in the movie.\n\nI would much rather see an Ernest movie. They are a lot funnier."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "lingle1112",
        "review_rating": "9",
        "review_title": "A Breath Of Fresh Air",
        "review_detailed_main": "You gotta see this movie if you like Larry. Even if just to upset the nay sayers. It is amazing how many people come out of the woodwork to try and discredit the man. \" I went to school with him.\",\" Larry isn't even his real name.\" Come on people find another place to vent because people who have fun in life and understand real humor will watch it. They enjoy it. The movie isn't supposed to be Shakespeare it's supposed to be funny. It does live up to that. If you like his stand up and you like his radio commentary then you will love this movie. It's rude, and it's crude, but definitely not lude. Larry has a real winner with this one. I can't spoil it but I can say this. Not one person wasn't laughing at the jokes in the movie theatre!! Now that's funny right there, I don't care who you are. That's funny right there. Enjoy!"
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "wolfmoon2",
        "review_rating": "10",
        "review_title": "I loved it! Don't mind the snowflake 1 star raters.",
        "review_detailed_main": "Don't pay attention to the star rating. This is actually a funny movie. It is being downplayed by the politically correct. Notice how all the bad reviews say, \"I'm a big Larry fan, but...\" If they were truly big Larry fan, they would love this movie because he is doing exactly what people love him for! Larry did a great job! I recommend it 100%! Watch it. It will not disappoint."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "drubner",
        "review_rating": "8",
        "review_title": "if it's so not funny then why are you laughing?",
        "review_detailed_main": "I took my little cousin to see this movie and I don't like movies or my little cousin very much, so I was prepared for the worst. and yet there I was, and there you were, laughing the whole time. literally. parents, kids, morons and men of intellect, all laughing the whole time. it may be low-brow low-brow low-brow humor, but you can't argue with people laughing, and that's what happens when this movie is screened. maybe all you haters don't hate the movie, you hate yourselves for laughing at the movie. and you should hate yourselves, you're probably terrible people. just a guess. And Trent can direct. you seen his shorts? hilarious. now go see V for vendetta. that's a crap movie."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "rupertraptor",
        "review_rating": "10",
        "review_title": "you don't need to think",
        "review_detailed_main": "If your watching a good FUNNY movie you don't need to think \"now why is that funny\" in health inspector i never had to wonder why something was funny i just got it. I didn't sit up in bed that night and say i get it now! I got it when it was given. Other funny movies you sometimes have to ask yourself why that is funny and sometimes it comes to you in bed! Health inspector was great i loved it, i didn't have to think too hard and everything was funny like Larry says \"i don't care who you are right there, now thats funny\" It seems like most people just didn't like it because it had toilet humor, and i know its still funny to everyone it has been since we were five and it always will be, i don't care how sophisticated you think you are!"
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "rick-mehlman",
        "review_rating": "9",
        "review_title": "Good film - not as bad as the reviewers say.",
        "review_detailed_main": "Anytime a movie whips by without my noticing, it's a good movie. Larry the Cable guy's movie did just that.\n\nLarry made me laugh. It was warm-hearted and tender.\n\nWhat's wrong with that?\n\nThese so-called critics who loved '40-year old Virgin have somehow brain-washed the masses again into believing movies with 'heartland' or 'middle America' must be mocked at. I'm getting tired of the people who love 'Borat', but won't make room for other types of humor. It's my way or the highway.\n\nI say, 'forget them'. Forget the critics. They're mostly jerks who never made a film.\n\nThese so-called critics annoy me. Have you noticed they all sound the same? They have the cynical, abrasive personality that you see on talk shows. This is what this country is headed.\n\nWhat made Larry the Cable Guy a great film was it never once made me bored."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "welovelabs",
        "review_rating": "8",
        "review_title": "redneck humor is always funny",
        "review_detailed_main": "imagine this, a redneck hillbilly working in a big city. That is tough to do.But only Larry the Cable Guy could pull this one off. OK,it is not the blue collar comedy tour, but i give him credit to try and venture off the stage and into Hollywood.\n\nI thought it was pretty funny. But if you have never watched Larry the cable guy before,\n\nthen you probably would not enjoy this film.\n\nBut if you are a backyard redneck hillbilly or a good old country boy or gal than you will\n\nenjoy this film. A must see. Larry is funnier\n\nthan Jeff Foxworthy. GIT-R-DONE."
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "George_Strait_Junkie",
        "review_rating": "10",
        "review_title": "It's funnier than watching midgets run track",
        "review_detailed_main": "Well, I must say that I'm disappointed in many of the posts I've seen here regarding Larry The Cable Guy. People who make it their life-long dreams to insult Larry at all costs are just those people who are too uptight to giggle a little. Really, his humor is just immature, which I find funny because it reminds me of the jokes my friends and I used to laugh about in junior high and high school. Many people still find that type of humor funny. For instance, \"Man, I don't know what I ate, but I could sh** through a screen door and not touch a single wire!\" Tell me that's not funny. It is crude, but still rates a good belly-laugh.\n\nSo, why do people not like Larry? It's not because of the humor, it is because they don't like Larry's politics AND his method of speaking his mind. Why is it if a liberal tells jokes and speaks his/her mind it's hilarious and if a conservative tells jokes and speaks his/her mind, it's not funny- it's bigoted and racist? It's not the jokes. In my opinion, it's the attitude of the listener. For example, how many people who comment negatively on this movie have actually seen it? If we took a survey, I would venture to guess that a majority of people who did comment negatively have never seen it! And why is that? It's because they have been polluted by every liberal media outlet across the globe and whatever anybody who thinks differently than a liberal is automatically a racist and a bigot.\n\nFurthermore, those individuals who seek out to insult redneck humor just don't get the culture. But again, I really don't expect them to. They accuse us of being close-minded and freedom of speech for them is only a one-way street. They can say whatever they want (no matter how absurd it is) and if a conservative speaks out, then it's bad and we're suddenly the worst evil scum in the world.\n\nSo here's a message to \"those\" people: if you haven't seen the movie, you really shouldn't be voting on it. That's like asking a retard to go beat up Jackie Chan! It doesn't make sense to go do something like that. Would you wipe before you poop? NO!"
    },
    {
        "movie_id": "tt0462395",
        "movie_name": "Larry the Cable Guy: Health Inspector",
        "movie_rating": "3.5",
        "review_username": "damiannagasaka",
        "review_rating": "10",
        "review_title": "Pass Gas but don't pass on this movie",
        "review_detailed_main": "Another Cole Swier review:\n\n\"Larry the Cable Guy: Health Inspector\" is an absolute gem of a comedy film. With Larry's signature humor and his unique approach to health inspections, this movie delivers non-stop laughter from start to finish. The film's witty one-liners and hilarious situations keep you entertained throughout. Larry's character is endearing, and his antics in the world of health inspections are nothing short of side-splitting. The supporting cast adds to the comedic charm, making it a perfect ensemble. If you're in need of a good laugh and appreciate Larry's brand of comedy, this movie is a solid 10 out of 10, and a must-watch for anyone looking for pure, unadulterated fun!\n\nI Cole Swier personally guarantee you will love this movie."
    }
]