[
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "ketgup83",
        "review_rating": "9",
        "review_title": "Airlift is nail-biting, reality-based action thriller that is going to give you goose bumps. Brilliant !!",
        "review_detailed_main": "Over the years Akshay Kumar's choice of selecting the films has certainly improved with significant examples being Holiday, Baby, Special Chabbis, Gabbar Is Back to name few. Move over commercial masala potboilers with item songs, hero smashing 10 guys with a single blow and typical song-dance routine – Raja Menon's Airlift will give you goosebumps with fast-paced gritting thrills and excitement.\n\nBased on a true story, Airlift speaks about the Ranjit Katyal (played by Akshay Kumar) who helps the Indian Government collaborate with Air India to help evacuate 1,70,000 Indians from Kuwait after Iraq raided the country.\n\nFrom the director of critical acclaimed films like Bas Yun Hi and Barah Aana, Raja Menon does a fantastic research about the feat that was even recorded in the Guinness Book of World Record and surprisingly people are unaware about it. Airlift will consume you right from the beginning especially when Akshay's family faces the issue of Iraqi raiding Kuwait. From here onward, there is no turning back as the movie gives you nice twist-n-turns with well- choreographed action scenes. Icing on the cake is the climax scenes which has been well executed. On the flip side, length of the movie could have been reduced little further. But brilliant screenplay, Art direction and cinematography is spellbinding. Background score gels well with the mood of the film. Dialogues are fine. The music of the film is doing well on the chartbuster. The soulful number such as 'Soch Na Sake' is already a superhit among the viewers. Besides, other tracks are catching up fast as well.\n\nIt is Akshay Kumar's show all the way. A thumbs up to him for doing something different from his usual masala potboilers. After giving back-to-back hits in 2015 with Baby, Gabbar Is Back and Singh Is Bliing, Akshay Kumar is definitely on a roll. With Holiday, Baby and now Airlift, Akshay Kumar has managed to create a image of \"Mera Bharat Mahaan\" actor and fans will love him in new avatar. The fresh pairing of Akshay Kumar and Nimrat Kaur works well. Nimrat Kaur's realistic subtlety would harness Akshay Kumar's machismo and give us that perfect thriller\n\nOverall , Airlift is nail-biting, reality-based action thriller that is going to give you goose bumps. Brilliant 4.5/5"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "maulin5",
        "review_rating": "9",
        "review_title": "Airlift will surely touch all Indians by heart!",
        "review_detailed_main": "As this year has been started well with Wazir, the good work of Bollywood is on the road with increasing the speed and performance. Yes, I'm talking about Akshay Kumar starer Airlift, directed by Raja Krishna Menon, and which is based on true events! Film starts in Kuwait. Rajiv Katyal (Akki) has been reached on the top level in business with his ability. He refers himself as a Kuwait citizen. But when the government leaves their citizens when Iraq attacks on Kuwait under the order of Saddam Hussain, the people becomes needless. Rajiv now feels that he is an Indian, and so along with other 1,70,000 people who are actually Indians but lives in Kuwait, he starts the mission to run from Kuwait as soon as possible. His tries, his communication to India for the help, and the officer's help from India - These things you can find out in this movie. Some factors, like emotions of love for the family, for the nation, for the coworkers and their relatives, for the people who are only belongs to the same nation, have been described very well. Many moments where we can feel patriotism. Raja has directed a superb film. Akshay has given a stunning performance as usual. I was comparing Baby film with this, but both are different. But if you ask for just one movie, than I'll go with this one. Nimrat Kaur is my favorite since The Lunchbox and Dairy Milk commercials. She has delivered a fine supportive job. She shines as a wife of a rich businessman and a caring mother. Kumud Mishra fits absolutely in the character of a government officer. Poorab Kohli has a small role. Supportive cast are fine, too. De Di and Soch Na Sake are very small songs. Perfectly situated. Tu Bhula Jise is the song to remember. Background score suits to the film. Dialogues are good. Nimrat's 3/4 minuets long conversation with a unsatisfied man of the camp who always complains, is a must! Cinematography is good. Some scenes give are shaky, those could have been shoot better. Editing is fine. Indian flag has been waved by an airport staff of Jordan and Akki is watching that, while Tu Bhula Jise song is playing - the scene has been brought so many whistles and shouts. And than one more, in which Air India plane is taking off, while Akki is watching that and in background Vande Mataram is playing - a truly emotional scene! It will surely gives you goosebumps! Overall, a must watch movie for every Indians, to know the largest human evacuation. Salute to all the real heroes! Jai Hind!"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "MuviFan73",
        "review_rating": "7",
        "review_title": "A good movie 4 an event to remember!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "saivenkat02",
        "review_rating": "10",
        "review_title": "Steals Hearts!",
        "review_detailed_main": "After Bajrangi Bhaijaan, this one is the next heart stealer! In an industry where good films are not as often coming, movies like these are hugely treasured. Airlift is a real story where humanity is celebrated, and a movie on humanity needs to strike the right chord to enter the audience's hearts. And this one very memorably goes! Akshay Kumar gives his heart and soul to the role and is a huge reason why the movie achieves its heights. The screenplay and direction are top notch, and the music is very hum worthy. And best thing, it felt like it ended early as audiences were wanting more. Seriously Indian cinema standards will take a rise more with this movie. Highly recommended watch!"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "krishnacv",
        "review_rating": "10",
        "review_title": "Great Movie. Nice start for 2016",
        "review_detailed_main": "Airlift is simply a great movie whether you talk about direction or acting,its simply mind blowing. Akshay kumar's gritty acting is simply mesmerizing.Unlike other movies , songs of this movie are soothing and full of melody. Its great that they didn't put a item song. The film is based on the real-life conflict and bloodshed that took place twenty five years back in Kuwait, and the way it is done—with a sense of urgency and immediacy, bringing alive a city over-run and under siege—sends out a crucial message to star-driven-yet-drivel- producing Bollywood.Other than that Nimrat kaur's was also very good. Overall, 'Airlift' is a good film,solidly plotted, well executed and well- acted. A must watch. Its a perfect movie for Republic Day Week !"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "rhindistar",
        "review_rating": "10",
        "review_title": "Airlift movie review: Akshay Kumar film is well executed and well-acted",
        "review_detailed_main": "Over the years Akshay Kumar's choice of selecting the films has certainly improved with significant examples being Holiday, Baby, Special Chabbis, Gabbar Is Back to name few. Move over commercial masala potboilers with item songs, hero smashing 10 guys with a single blow and typical song-dance routine \u0096 Raja Menon's Airlift will give you goosebumps with fast-paced gritting thrills and excitement. Based on a true story, Airlift speaks about the Ranjit Katyal (played by Akshay Kumar) who helps the Indian Government collaborate with Air India to help evacuate 1,70,000 Indians from Kuwait after Iraq raided the country. From the director of critical acclaimed films like Bas Yun Hi and Barah Aana, Raja Menon does a fantastic research about the feat that was even recorded in the Guinness Book of World Record and surprisingly people are unaware about it. Airlift will consume you right from the beginning especially when Akshay's family faces the issue of Iraqi raiding Kuwait. From here onward, there is no turning back as the movie gives you nice twist-n-turns with well- choreographed action scenes. Icing on the cake is the climax scenes which has been well executed. On the flip side, length of the movie could have been reduced little further. But brilliant screenplay, Art direction and cinematography is spellbinding. Background score gels well with the mood of the film. Dialogues are fine. The music of the film is doing well on the chartbuster. The soulful number such as 'Soch Na Sake' is already a superhit among the viewers. Besides, other tracks are catching up fast as well. It is Akshay Kumar's show all the way. A thumbs up to him for doing something different from his usual masala potboilers. After giving back-to-back hits in 2015 with Baby, Gabbar Is Back and Singh Is Bliing, Akshay Kumar is definitely on a roll. With Holiday, Baby and now Airlift, Akshay Kumar has managed to create a image of \"Mera Bharat Mahaan\" actor and fans will love him in new avatar. The fresh pairing of Akshay Kumar and Nimrat Kaur works well. Nimrat Kaur's realistic subtlety would harness Akshay Kumar's machismo and give us that perfect thriller Overall , Airlift is nail-biting, reality-based action thriller that is going to give you goose bumps. Brilliant 4.5/5"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "divash-rock22",
        "review_rating": "10",
        "review_title": "Every Indian must watch Airlift for once.2016 starts with bang. Akshay kumar nailed the role....",
        "review_detailed_main": "Airlift is the best film of Akshay kumar till date. The story is all about a business man in Kuwait(Akshay) thinks that he is also a Kuwaiti. But when Iraq invades Kuwait he realizes that he is an Indian and helped all 170000 Indian. This movie give u goosebumps there is no boring scene in the movie. A perfect movie for Rebublic day. This movie is perfect for classy movie lovers who love this type of patriotic movies. All the star cast of the movie done a fantastic job. This time Akshay will surely get an award for Airlift. ...... Go with yours friends, family and watch AIRLIFT in theaters. U guys surely fell proud to be an Indian after watching this movie."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "scottshak_111",
        "review_rating": "6",
        "review_title": "A historical achievement enfeebled by poor film-making! Airlift is mediocre. Period.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "nidhi_india",
        "review_rating": "10",
        "review_title": "Great Movie, must watch.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "dineshprakash",
        "review_rating": "7",
        "review_title": "Uplifts Indian cinema standard",
        "review_detailed_main": "Director Mr. Raja Krishna Menon work is superb. You feel yourself in to the screen. Story is inspired by real incident. It is OK. Screenplay makes its interesting by adding so many good and balanced plot, like introducing Kuwaiti girl and its culmination, one scene of secretary with his father, telling him about pain of migration, which triggers him to take the matters personally, track of irritating George etc. Credit goes to screenplay writers Ritesh Shah, Suresh Nair, Director himself and Rahul Nangia . Dialogues by Ritesh Shah, are real and impactful. Transformation of characters are very good, like a hardcore businessman to an extra emotional human being of main character. Productions design by Mustafa Staionwala needs to be applauded. Film looks so real and then great work by Director of photography, Priya Seth, to capture it perfectly. It could have been brutal but makers kept it very balanced. One scene where lead actor scuffles with Iraqi soldiers is a note above but its culmination again makes it worth clapping. Performance wise Akhshay Kumar is fantabulous. He is just amazing in every scene, especially in emotional ones. Nimraut Kaur as Amrita is OK. She had a good scene but it was just OK performance by her. Inaamul Haq as Iraqi Major Khalaf Bin Zayd, is first rate. He had gone deep into character that its hard to believe that he is an Indian. His balanced greed in eyes and accent make his character believable. Kumud Mishra as secretary Sanjeev Kohli is impressive. Purab Kohli as Abraham makes his presence felt. Ajay Arya Singh as Akshay kumar first driver is fine in his brief role. Feryana Wazheir as Kuwaiti girl, Tasneem looks innocent as the requirement of character. There was least scope for music but when it comes gives the much needed relief and boosts the pace. Credit goes to music directors Ankit Tiwari and Amaan Malik."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "ravi-mudgil1996",
        "review_rating": "10",
        "review_title": "A must Watch Movie For every Indian and its doesn't matter u r Hindu or Muslim but if u are a real Indian and go and watch awesome movie",
        "review_detailed_main": "Guys a must watch movie for all peoples we are always watching Hollywood movie and think they are awesome and if u want a Indian heroism story so go and watch airlift best performance by akshay and nimrat and other star cast \"Some stories *should* be told. #Airlift sheds light on the evacuation of Indians in Kuwait after the invasion by Iraq. Narrated BRILLIANTLY. #Airlift is taut, engrossing, leaves a hammer-strong impact. Raja Krishna Menon is a director to watch out for. Deserves brownie points. #Airlift is a must must watch. One of the finest films to come out of the Hindi film industry. Just do not miss this one"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "singhrohan-89622",
        "review_rating": "7",
        "review_title": "Airlift is Nice, Need more movies with this seriousness in Bollywood",
        "review_detailed_main": "It's a really nice movie to watch if you want to know Indian POV for Kuwaiti war and problems they face You might actually like the movie if you are whole hearted tricolored flag lover, that is why I feel it's give 9.7 till this review. Everything was nice in the movie but not Excellent, I expected a sort of more from Akshay Kumar after Baby(Movie). Speaking Numerically I stepped in to expect to give an 8 after interval I thought to give 6 and after the movie I'm giving an 7. The Things that I liked about the movie was obviously acting by Akshay Kumar, because he wasn't loud like his previous movies, Purab Kohl was Midas as Always. Technically the movie felt good, the story concept was good, characterization was average, because there were too many character. The things that I didn't like about the movie was that actresses like Nimrat Kaur and Feryna Wazheir weren't utilized properly, It was the first time I saw Nimrat Kaur on screen after hearing praises about her, but I was let down as she felt as an Rich Punjabi housewife nothing else, Feryna Wazheir's A talented theater actress and her Talent wasn't used properly either. The other thing is TOO MANY MALYALEE CHARACTER representations, even the role of there General felt to be a bit on funny side instead of the serious one. BOTTOM LINE: You should obviously go to see this movie once, but it's not an that type Masterpiece but you'll like if it even though. You'll over like it if you are Pretentious Indian(No Offense)."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "pushkarpandey",
        "review_rating": "5",
        "review_title": "The film trivializes the issues. This appears like a deliberate attempt to spread misinformation.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "gurucena",
        "review_rating": "10",
        "review_title": "Historic Airlift..... One of India's best movie ever..... Akshay Kumar is just awesome He's the Best",
        "review_detailed_main": "What a beautiful gift to the Indian Cinema by Akshay Kumar, Raja Menon & the whole team of Airlift. The story of biggest human evacuation told amazingly well. Its so good from the start to end that you can feel what condition those 1,70,000 Indians would have gone through. Clap, clap & clap in the end that's what me & the whole theater was doing.\n\nAkshay Kumar as Ranjit Katiyal was just awesome he has taken his acting to another level with this one. Salute to him for doing amazing & inspirational movies like OMG, Holiday, Baby, Gabbar & now Airlift. Nimrat Kaur as his wife was just too good, her scene with Prakash Belawadi is awesome & clap worthy. Purab Kohli, Kumud Mishra & especially Prakash Belawadi were too good.\n\nDirection by Raja Menon is fabulous he has done a great work in researching this true story.\n\nFeeling so proud to be an Indian & realized what great thing my country India has done for all of us. Salute to all those unsung heroes of this biggest human evacuation ever.\n\nAnd Thank You to the whole team of Airlift for this historic movie. One of India's best ever."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "saurabhrathi",
        "review_rating": "10",
        "review_title": "A classic that India will always be proud of",
        "review_detailed_main": "Its rare, in its extremity, for Bollywood to make a masterpiece. But Akshay kumar has now the habit to steal the audiences, Last year it was with BABY and now its AIRLIFT.\n\nI was waiting for this movie since October and this is up to the mark,I had never review a movie but this made me to review.\n\nAs it was mentioned by Akki that every family should take their children for airlift, and I will also recommend this to you. Their is a scene which will make you shout \"VANDE MATRAM\" and IF YOU ARE A Indian ,YOU MUST SEEE THIS EPIC. Definitely ,you will feel proud after watching this."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "akav-41347",
        "review_rating": "10",
        "review_title": "one of the best thriller made in India ever!!",
        "review_detailed_main": "Raja menon proved that one can make a superb thriller from an real life incident.Direction and acting is superb.Akshay proved again that he is one of the most versatile star today.Overall this movie is a treat for all Indian .Every one should watch it irrespective of whose fan you are.Release time is great(near republic day).Movie will keep you on the edge of seat all the time.Believe me this one is better than baby(akshay 2015 thriller movie) with more detailed and entertaining story line.It will face good competition from kkhh3 but as we all know content is king so the competition will be initial..in longer run airlift will be a sure shot winner."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "cutiepurva",
        "review_rating": "10",
        "review_title": "Best Bollywood Movie Ever",
        "review_detailed_main": "Awesome Movie, quite a Realistic Depiction of of Iraqi Invasion of Kuwait, great Direction by Raj K menon, Akshay Kumar has played his part in q realistic way, His Best performance so has Nimrat Kaur and the entire crew as well.\n\na great movie of decade and movie of patriotism. this movie will be guideline to current generation with balanced emotions action and romance. really great movie in recent times. if u miss this then u r looser. P.S. I am not Akshay fan\n\nAirlift is worth some hundred bucks. A story that will make you feel, that India cares for its Indian's. Exhilarating performance by AkshayKumar. Trust me guys this movie will surely lift you up."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "duttarahul",
        "review_rating": "7",
        "review_title": "Just do not miss this one!",
        "review_detailed_main": "The film is based on a true event. The film follows Ranjit Katyal (Kumar), a Kuwait-based businessman, carries out a biggest civil operation of evacuation of Indians based in Kuwait during the Iraq- Kuwait war carried out during the reign of Iraqi emperor Saddam Hussein....some stories should be told. It narrated brilliantly. Director Raja Krishna Menon just done a fine job. Akshay Kumar is outstanding. His performance is the soul of Airlift. Undoubtedly an award-worthy act. It surely one of his finest works. How can i forget Prakash Belawade..He is so impressive. Screenplay is really good. Some directional fault i saw but that is forgettable when you watch a movie like this..\n\nAirlift is a must watch. I know some guys and obviously some audiences are always want to watch a sex comedy like kya super cool hain hum 3...The film are not for those guys.....\n\nJust do not miss this one!"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "user-81-131504",
        "review_rating": "10",
        "review_title": "Airlift - Stays true to its name!!!",
        "review_detailed_main": "It is one of those movies which will test your sensibilities and in the end will only make you stand up and clap.Just like an aircraft takes time to lift ,same is the case with Airlift.It takes time to build up in the first half but in the second it just flies and knocks you left right and center.\n\nCredit goes to Akshay Kumar who invested in the script.He brought the real patriotic Indian on screen.His performance was a total standout.\n\nIt is a must watch for all those cynical and worthless Indians who do nothing but portray the essence of the nation in a bad light.Feeling really proud after watching this.Such movies really need to be encouraged!!!\n\nVande Matram"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "simply_ankit",
        "review_rating": "6",
        "review_title": "Good, not exceptional!",
        "review_detailed_main": "A movie such as this is supposed to be a nail-biting thriller, which unfortunately Airlift isn't. The movie doesn't offer you much to feel the actual tension that might have existed, the fear of death which people lived everyday, stuck in a war zone. The movie goes on like a monotonous narration of a series of incidents which led to a historic achievement in the form of world's most successful evacuation. The thrill, and the gripping plot behind each of those events is missing.\n\nIt's a brave attempt to bring to the world the story of a brave rescue operation, but as I read in one of the comments here, the movie lacks sharpness. It stops just at good when it could have been exceptional."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "fatfitnessworld",
        "review_rating": "10",
        "review_title": "An excellent heart touching + thriller package, AIRLIFT is a benchmark for all film industry. Must watch movie.",
        "review_detailed_main": "This film is crisp, engaging and racy with lots of action and seriousness along. Never does the film lag in pace or substance. A lot of Bollywood films have been made on terrorism, smuggling and anti social elements previously, most of which sank without a trace. But with fame of Holiday & Baby, Akshay takes a completely different approach with Airlift. Talking about the music & characters of the films, then critics are all satisfied with the star casts. Akshay & Nimrat Kaur all are looking suitable to their roles. Plus music of film is also very catchy and nice. That is the reason most of the critics have rated the film 4 out of 5 stars which clearly shows that not only audience but critics are also in support of Airlift. Very few analysts or critics have given somewhat mixed reviews for Airlift else everyone else is in favor of the film due to its strong entertainment quotient and high public craze."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "jayeshbnsl",
        "review_rating": "6",
        "review_title": "Overrated",
        "review_detailed_main": "This is a very highly overrated movie.This just tricks us into fake republic day patriotism.Yes the film has a new storyline and original one but performances are highly mediocre.Some people are saying that this is the best movie by Akshay Kumar.The film also shows bureaucracy in bad light.Yes,we as a country were ill prepared that time but that does not mean we don't value our citizens.Movies like Special 26,Baby etc had better acting +Storyline.Music as we all know is copied mostly and the film shows a person mantle rather than teamwork. Just want to summarize saying that its a decent time-pass movie but not worth going hall for.Better watch on DVD sets and that too once."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "nunapachuau92",
        "review_rating": "5",
        "review_title": "The Ratings though !!!",
        "review_detailed_main": "One thing I've found prevalent among Indian cinemas are the ratings.Some of them are absurd to a point where you doubt the authenticity of IMDb as a source for checking the quality of any movie.This movie is one of the good ones but still it does not deserve its rating at all.There is no way it comes close to it.For example consider the latest release like Deadpool or Batman vs Superman.Both are equally excellent in terms of story,cinematography and both possess a line of star studded casts.Yet both of them do not have a rating they deserve because of the fair and right ratings from experts and viewers not from a particular or single place but from all over the world.Looking at this rating,I seriously doubt the entire Indian cinema ratings and would rather skip than waste my time and energy to go through any of the high rated movies and would skip the ones that do not even reach 5.This is my personal opinion but all I'm saying is the fans are not doing anyone any favors by giving outrageous ratings."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "kskkiran",
        "review_rating": "10",
        "review_title": "#airlift #trueindians #patriotism #respect #akki",
        "review_detailed_main": "#airlift Awesome movie, we need this kind of the movie's and hero's like #akki, A movie which inspires and motivate everyone of us, To do good, even for unknown people's. #trueindians, #patriotism #respect from bottom of my heart. we are looking forward even in future for this kind of movies from #akshay sir. jai hind\u0085\u0085\u0085. #airlift Awesome movie, we need this kind of the movie's and hero's like #akki, A movie which inspires and motivate everyone of us, To do good, even for unknown people's. #trueindians, #patriotism #respect from bottom of my heart. we are looking forward even in future for this kind of movies from #akshay sir. jai hind\u0085\u0085\u0085."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "nagendrafauzdar",
        "review_rating": "10",
        "review_title": "Milestones are rarely produced.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "jsingh573-23-709604",
        "review_rating": "10",
        "review_title": "Review",
        "review_detailed_main": "Airlift is first and foremost a heart-stopping thriller coming all the way from Bollywood. It's the story of a man whose heroism is awakened in the hour of crisis. Some of the most engrossing moments in the deviously- scripted political thriller find Ranjit Katyal making contact with an officer in the Minister Of External officers in the slim of getting help from the Indian government.\n\nAll the actors, never known to let down there characters, creates tremendous empathy for there roles, at one point of time struggling to convince an apathetic Indian administration to send help for the stranded Indians in Kuwait. During times of a crisis the humanism of an otherwise self-centred civilization is known to surface effortlessly. Airlift takes us through that journey of the awakened conscience with exhilarating empathy."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "gargaman92",
        "review_rating": "10",
        "review_title": "Airlift Awesome plot",
        "review_detailed_main": "A story must to be spread #Airlift is compelling, thanks largely to a sterling performance from Akshay Kumar, who is both suitably weary and suitably level-headed for the part enough to anchor the proceedings. The actor is always fine when reined in, and Menon plays to his strengths and Kumar only snaps once, almost reflexively, into Bollywood hero mode, but he is mostly calm and grown-up and holding on.\n\nIt is several steps ahead of Kumar's other recent January releases, Baby (2015) and Special 26 (2013), and deserves all the box-office it can get. The bar has been raised and it's about bloody time.\n\nWatch Airlift because it tells a very important story that never got a mention in our history books. And also because the attempt to try out such subjects and story lines is applause worthy. Only if there were less songs and an editor who could tighten the length, Airlift would be soaring newer heights."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "aakashsingh-17839",
        "review_rating": "7",
        "review_title": "The movie with most positive & least negative comments.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "djlaha",
        "review_rating": "10",
        "review_title": "airlifted",
        "review_detailed_main": "The film is based on the real-life conflict and bloodshed that took place twenty five years back in Kuwait, and the way it is done—with a sense of urgency and immediacy, bringing alive a city over-run and under siege—sends out a crucial message to star-driven-yet-drivel- producing Bollywood. That given the backing of an A-list star, anything is possible: well done, Akshay Kumar, for donning the producer-with- conviction hat to create a crackling film. Airlift proves that quality of Indian cinema is getting raised day by day. Akki delivered a fantabulous performance again after baby and special 26. The vandemataram anthem will surely create Goosebumps and will make you stand in the theatre. Raja Krishna menon as a debutant made a landmark. Nimrat Kaur as female lead was more than okay. Comic nuisance created by Prakash belawadi was very good. All over it can be said that the movie of the year is this. Although it will not have any award. Just go and watch the movie. I'm more than satisfied."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "silvan-desouza",
        "review_rating": "7",
        "review_title": "Awesome film though may not be accurate in terms of facts",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "arshkumar9",
        "review_rating": "10",
        "review_title": "Akki with hit after hit.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "qi-rahi",
        "review_rating": "",
        "review_title": "very good movie with one big flaw",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "SAMTHEBESTEST",
        "review_rating": "7",
        "review_title": "Ordinary film as a movie lover and above Ordinary as an Indian.",
        "review_detailed_main": "AIRLIFT REVIEW- Want to clear 1 thing at the start only that although i am Akshay Kumar fan my review will be complete neutral. When we all saw the teaser and trailer we all felt like, yes Akki is coming with another Quality movie, patriotic film is coming, award winning film is coming and bla bla bla. In short we were expecting a Classic means our Expectations were high. So even i Watched it with very high expectations and came out of from Theater with at least satisfied face if not Fully satisfied. As we know it is based on true story so no doubts story will be good and all remains to be seen is how makers present it. Movie starts with beautiful locations as Akshay appears in very casual scene. Everything goes casual for 15 minutes 1 songs pasts which looks average and suddenly main story starts. How Iraq attacked Kuwait and killed all local people along with some Indians based there its all the starting of this story. Content was very sensitive but looks very casual on screens and here Film team fails. How all Indians face circumstances and their desperation to escape from everything keeps you immersed in film and Interval appears. Till Interval it looked ordinary film cause we get nothing special to watch till Interval. All weight of expectations comes to 2nd half which is certainly better than 1st half. Then last 10 minutes are full of Goosebumps but only if you are an Indian. And then some available original stills of true heroes of this evacuation story which left us with Patriotic feeling. Still after movie ends i feel like something was missing. Its not that level movie which i was expecting. Something looked spoiled and messed up. Acting- i am happy to talk about 1 of my favorite Actor that he has given excellent performance here. Not saying its award winning though, it was excellent at its particular level. Nimrat Kaur made me her fan now with this movie. Previously saw her in Lunchbox where she acted well but looked ordinary as heroin. But in this movie she improved as an Actor and looked beautiful as heroin too. Certainly she deserves all appreciation as her expression in frightened scenes and in arrogant scenes were fab. Somewhere it looked like she Overtook Akshay. I don't know the name of that guy who played Iraq Officer's role but whoever he is, he has given very very good performance with beautiful Iraqis accent and dialog delivery. So many actors in supporting roles including them and other star cast all were good. Music- music was good but i personally think all songs looked unnecessary in screenplay. All songs were average to good, not a single bad song in album. Songs are good to listen instead of watching in movie. Screenplay- It is the most important part for films like this and it is strictly good as i didn't find anything special or excellent in it. Still i think runtime could been 10 minutes less as movie looked stretched little bit. Cinematography- film shot at beautiful locations and camera scale look lavish. Some scenes in house could have been better as they shot in dim light. Direction- i don't know much about Raja Menon but as per my info he is not that high level quality director so expecting a masterpiece from him is not fair. He did good job but i expected classic direction which didn't happen. With this story Director has to make a Classic film but he failed little bit not fully. Final Words- Overall a good film and another good film in Akki's career. But my expectations were very high so i didn't find it that much good as it should be made. Don't know why but i expected something like Akshay's last year release Baby and if i compare Airlift with Baby then it is 1 Star lesser than Baby. Baby had tight screenplay and classic direction which Airlift had only Good which is not enough. Last year for Baby i said it is First Quality movie of the but i don't think i can say it for now for Airlift. I mean entire movie cannot be judged on its awesome last 10 minutes of climax. So Go and watch it for Akshay Kumar & Nimrat Kaur's fine performances and its Climax which will give you Goosebumps cause it is inspirational tale for us Indians.. 7/10 stars by me :)"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "areeb-jwd",
        "review_rating": "1",
        "review_title": "Historically inaccurate, and a terrible movie",
        "review_detailed_main": "Why have people rated this positively, I shall never understand. Being in Kuwait during the invasion, I know for a fact that the Indian army was no where near Kuwait for an 'airlift', and the role of government officials has been distorted drastically.\n\nThe acting is mediocre, the dialogues are a cliché, the script is just horrendous. Akshay Kumar should stop acting altogether, watching him makes me want to stab my eyes.\n\nIts a really poor film. I wish I'd seen interstellar for the 10th time instead.\n\nJust pathetic, absolute trash."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "aadesh-ceb",
        "review_rating": "10",
        "review_title": "Awesome Movie ans specially Akshay is impressive",
        "review_detailed_main": "he film is well shot, with cinematographer Priya Seth achieving the right mix of impressive aerial shots and cramped hand-held bits, and reasonably well-textured with credible Middle Eastern detailing.\n\nThere are hiccups -- like Kumar singing a Hindi song moments after refusing to listen to Hindi songs -- and the songs do indeed get in the way every single time they come on, but things are smoothened over by the solid character artists populating this film, from the surprisingly effective Purab Kohli to the ever-excellent Kumud Mishra to the businessmen who play Kumar's buddies to the fascinatingly helpless Feryna Wazheir, who plays a Kuwaiti woman hoping to make her escape with the Indians.\n\nIt isn't all on the up and up, though: Prakash Belawadi, who seems to be in every film now post his star turn in Talvar, plays an infuriatingly pigheaded and badly written character.\n\nMeanwhile Nimrat Kaur, who plays Kumar's wife, seems challenged by the brief of speaking softly with a strain of Punjabi, like a woman from a Pakistani play, while constantly wearing make-up regardless of how harrowed her character is, like a woman from an Indian television show."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "shekhar-sharma79",
        "review_rating": "10",
        "review_title": "Defines Patriotism",
        "review_detailed_main": "Not always do we think of the People around us in deep trouble. And this is what is the movie all about. Not just deep trouble, it is life threatening trouble that motivates a Gentleman to work for his country and bring back the People to their nation . \"\"INDIA\"\"\n\nAirlift focuses on the shocking repercussions of military adventurism on ordinary people.\n\nAt the receiving end here are the residents of Kuwait, a nation that was invaded by Saddam Hussein's Iraqi Republican Guard in August 1990.\n\nThe attack renders 1,70,000 Indians penniless and homeless as a rampaging army goes about killing defenseless Kuwaitis with impunity\n\nPatriotism REDefined !!!"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "mukundparmar",
        "review_rating": "10",
        "review_title": "Makes you feel proud to be Indian.",
        "review_detailed_main": "Although I have never been to India, being an Indian this film made me feel proud to be one.\n\nExcellent acting and great story.\n\nNimrat Kaur was just dashing in her role. And Akshay Kumar as always was superb.\n\nThe ending was a bit rushed up but that did not matter because the entire film was explicitly thrilling.\n\nViewers will literally feel a sense of sympathy for the Indians trapped in Kuwait. This shows how well the movie is presented.\n\nOverall, a great film. Must watch as this is one of Akshay's best!"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "ursvikassap",
        "review_rating": "10",
        "review_title": "looks like In and out Akshaykumar film",
        "review_detailed_main": "Story line and theme was based on some realistic base. Even though music was not that much but OK OK. And the action is again superb from the king of Bolly wood. Excellent taking and few shots are really impressive. looks like Director has complete belief in Akshay to uplift the movie Airlift.And he got the Good Result. Nimrat Kaur is good in her Role and gave her best. Actor Kumud Mishra did well. achieved the right mix of impressive aerial shots and cramped hand-held bits, and reasonably well-textured with credible Middle Eastern detailing. The director's decision to dodge grandstanding benefits the film as a whole, making it completely believable and convincing as a human drama. Finally we can say Airlift is a must watch film for all the Indians with a strong story line and Action to the peaks."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "kapilshriram",
        "review_rating": "6",
        "review_title": "Ordinary one time watch patriotic movie",
        "review_detailed_main": "Overall movie is average and really looks like a real story with super acting by Akshay Kumar and Nimrat Kaur. But on the basis of entertainment the first half of movie is not more than average.first part of movie was slightly slow. Overall the movie is better than the baby and phantom but not like the other patriotic movies like Rang De Basanti, Swadesh. At the same time they could have made the scene better when Indian Air force airlifted Thousands of people from Oman. The scene when Iraqi army attacked Kuwait was also look ordinary. They could have made serious scenes better An overall engaging watch with a few gritty moments, Airlift does stumble a few times as well. Blame it on the Bollywood audience but the filmmakers couldn't seem to let go of the masala and song-dance paraphernalia that goes with a moolah-raking star in a lead role. An 'Arabic' number is also thrown in for good measure. But in a film that hinges on realism, the songs are jarring."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "helloravijangid",
        "review_rating": "10",
        "review_title": "What critics have to say about Akshay-Nimrat starrer",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "pawanbltr-80-612226",
        "review_rating": "7",
        "review_title": "Patriotic...but less perfect as a movie!",
        "review_detailed_main": "movie signs in to the multiple climax without a proper development of characters, one can it is highly focused to let one only about the rescue operation, but the ground for the war should have been created in av little descriptive manner, and the devastating war scene could have been made a more realistic,Akshay Kumar suits in the role and emerging as new \"BHARAT KUMAR\". Rest characters have done their job not per excel, the dialogs lacked the applause from the audience as it was needed in such a movie based on patriotism.the background score is OK, and editing has done its perfect job , keeping the boring scenes out. being Indian we are emotionally attached will give it 10/10, as every Indian must watch our brave history not as movie viewer but as Indian."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "amitkumarshukla18",
        "review_rating": "10",
        "review_title": "MUST watch, One of the best DocuDrama",
        "review_detailed_main": "There are certain movies that appeal to your head and certain appeal to our heart. Airlift manages to do both.\n\nFilm is based on a real life incidence that has been mostly ignored by us.\n\nFirst half builds the story nicely and in second half fill really comes into its own. Film conveys fine balance between realism and patriotism. Real her of this movie is script. Direction is top notch. Screenplay mostly consistent. Akshay is in top form and delivers career best performance. Nimrat is very good and Amrita. Supporting cast could have been better. Overall, Go and watch Airlft and once again feel proud of being Indian."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "SivakumarBalachandran",
        "review_rating": "7",
        "review_title": "Well Executed but faces pace issues",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "freemyo-310-914550",
        "review_rating": "1",
        "review_title": "Most overrated movie ever made... ohhh boy why this is more than 9.0 in IMDb",
        "review_detailed_main": "To start with, i rarely wright reviews for movies, but after seeing this awful awful movie, i have decided to tell the truth about this piece of garbage.\n\nThe movie start very slow with cheesy production and laughable dialogue and once the climax supposedly should come, the movie just skip it as nothing happens!!\n\nIt very clear that the director had no clue on what is he doing or what is the direction of the movie.\n\nthe setup is bad, i will give you very good example, when Akshay goes to Iraq to meet with the officials, the cast was wearing a UAE national dress were they supposed to wear an Iraqi custom !!! what was the movie maker thinking??!!!\n\nOne of my biggest problem also with the movie is the character of the Iraqi military guy, how on earth you put an Indian to portray an Iraqi Officer !!!! they cant find any Arab speaking actor !!! and ohh my god that character is really bad and not believable at all.\n\nThis is ultimately & without doubts, one of the worst movies i have ever seen in my life from bad acting, dialogue, horrible director, cheap production... everything screams bad from this movie.\n\nTHE MOST OVERRATED MOVIE EVER EVER EVER"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "vivekvenky",
        "review_rating": "10",
        "review_title": "Plot",
        "review_detailed_main": "A truly aggressive movie. Firstly my regards for making real story so successful..hats off to cast. timing of songs.. hats off to the writer contributing to the screenplay - heart of the movie. As the movie reached last 30min i had no work than to control the tears rolling down my eyes.. The moment the office lifted the Indian Flag onto the building.. wow.!!! Not a single fight. no romance scenes.. no satirical dialogues. in one sentence. showed how various sections of people react in only mood to save their lives.. and later realize that they are to be unite.. Akshay Kumar deserves a applaud.. THIS IS WHAT INDIANS ARE WHEN THEY DECIDE TO HELP. AN Indian MOVIE..!!!!"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "kdedhia7",
        "review_rating": "10",
        "review_title": "Goosebumps.",
        "review_detailed_main": "First of all Thank You Mr Raj Krishna Menon and team for this movie. Brilliant direction and story. To show such subject on big screen in 2 hrs is big deal. The movie is excellent. Feels proud to be an Indian. Akshay Kumar at its best leaves you speechless. Specially during the emotional scenes. No doubt this is his best performance till date. Nimrat is fantastic. Amazing performance. Great chemistry with Ranjit. Her smile takes your breathe away. The VFX the cinematography are brilliant. People started clapping when the movie ended. The show was Housefull. Loved it. Every Indian Must Watch this movie.\n\nAirlift."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "anicool-91805",
        "review_rating": "10",
        "review_title": "After watching this movie, you will think twice before blaming India and the Government.",
        "review_detailed_main": "Akshay Kumar is back. That's what I felt like when I saw the teaser of Airlift for the first time. The movie released on 22nd January, just 4 days before the Republic Day. There won't be any day more suitable. Akshay Kumar, after giving hits like Baby and Gabbar Is Back, aims to hit the theaters once again and that too with a patriotic movie. However, Singh is Bliing was not a success, Airlift would definitely manage to make its way.\n\nThe movie is directed by Raja Krishna Menon starring Akshay Kumar and Nimrat Kaur in the lead. The story is about Mr.Ranjit Katyal(Akshay Kumar), an Indian businessmen living in Kuwait. He is a very well-reputed businessmen of Kuwait and is at the top of his form. Everything goes good but then all of a sudden, Iraq invades Kuwait. The citizens are killed ruthlessly and the food and health supplies are depleting. About 170000 Indians are trapped in the war- zone. And now, there is only one country that could help them. India.\n\nThe movie has some wonderful songs(I personally like all the tracks). After watching the movie you will feel really \"Proud of being an Indian\". My eyes were numb during the last few minutes of the movie. All(or most) of your negative thoughts about India and The Indian GOvernment will be shattered. I would suggest you that you should go as soon as possible."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "ggod-98955",
        "review_rating": "10",
        "review_title": "This film proves that bollywood can make non-commercial mainstream movie",
        "review_detailed_main": "Usually we expect a bollywood film to be full of commercial elements like power packed dialogues with heavy background music, melodrama and an unnecessary love track and I expected something similar to that in Airlift but no!\n\nDirector Raja Menon has done a very deep research on the entire subject and very carefully brings it on the screen. This film only shows us the reality and doesn't get into any other commercial elements like most of other films these days do. Like in that scene where Ibrahim tells Ranjit about his missing half-wedded wife, his eyes tell you everything and he doesn't go on delivering a 2 page dialogue. That's one of the moments where we understand how the director wants to present the movie.\n\nThere are a few enjoyable parts like the Mr. George track. There is an item song also in the beginning to lure the masses.\n\nCamera work is excellent and is one of the major highlights in the film. Rest all departments have also done their job very well.\n\nTalking about the performances, it's Akshay Kumar who as usual steals the show. He has not portrayed but lived the character of Ranjit Katyal. He's perfect in each and every scene. He looks superb with the salt-n-pepper beard (He's been in this look for almost 6 months) and that's really a brave decision by any big actor like him since it affects his image. He proves that he isn't obsessed with the factor of looking young and charming(he was looking kind-of old with the long hairstyle in 'Entertainment')\n\nNimrat Kaur gets less scope compared to what was expected from an actress like her but still she's good. Purab Kohli is effective as Ibrahim. Kumud Mishra(as Kohli) is also good. Rest all junior artists have done their parts well.\n\nI appreciate Akshay Kumar for doing films like this because apparently he's the only actor in bollywood or maybe in the entire country who is trying to bring films like Special 26 and Airlift into the mainstream category.\n\nConclusion - Bollywood must make more non-commercial movies like this if it really want to be in the Oscar race."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "anupviswanath",
        "review_rating": "7",
        "review_title": "Feels like Hotel Rwanda Script merged into real situation",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "mrabgl",
        "review_rating": "10",
        "review_title": "Best Movie Ever.",
        "review_detailed_main": "Best Movie Ever...Best movie of Bollywood better than any Hollywood movie.. must watch..even Oscar is small for this movie. Akshay Kumar one of the best actor of Bollywood deserves Oscar for this movie..Movie full of emotions ..full of patriotism ..Never seen any movie better than this ..Great songs and at the right time ..No stupid drama no illogical scenes...If you are emotional tears will roll out of eyes at the end...Direction is amazing .....amazing screen play.......Will not be able to leave your seat in the second half . Will touch your heart how a single person can make such an impact ..U don't need to be God to do wonders a common man can also save life of millions. ..Must watch deserves 10/10.."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "sbhydguy",
        "review_rating": "",
        "review_title": "Every Indian Must Watch this film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "ptandiya776",
        "review_rating": "6",
        "review_title": "Recalls world's largest rescue mission but failed to create the Magic like \"Argo\"",
        "review_detailed_main": "After watching its teaser,I thought it would be a great action- thriller film but sadly its limited to teaser only.Film gives a completely different experience.Airlift fails in two required elements;First,connecting people emotionally,Secondly,on imparting the sense of nervousness and excitement at ending stage of the film.Which\"Argo\",a Hollywood film based on the same subject,did. Also,typical Bollywood heroism and emotions are added in the film.As a hard-boiled man George continuously mocks Ranjit over the ongoing mission forces Ranjit and his wife to deliver monologues filled with typical Bollywood heroism and emotions. It would've been better if writers would've worked on showing the struggles faced and tactics used during the mission.Instead of focusing on a character named George."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "lalitsinghrksu",
        "review_rating": "10",
        "review_title": "awesome movie",
        "review_detailed_main": "Never before has Indian film industry been able to make such a brilliant movie.It has crisp and superb acting and heart touching scenes which give goosebumps specially the one when Indian flag is raised is high in the sky. Hardwork has been put to recreate Kuwait of 1990 and dedicated acting by all cast specially akshay kumar is worth appreciating. Must watch for everyone.Songs in background are relevant and pleasing.direction is crisp.But if u are looking for bollywood style drama then u would be in for a surprise.Akshay perfectly fits in his role.Nimrat kaur has a short role but does that perfectly.Looks like a documentary but it is epic.Will be worth your money.Have an exciting 2 hrs with this superb flick."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "nairtejas",
        "review_rating": "7",
        "review_title": "2016's First Good Film Is Here. ♦ Grade B-",
        "review_detailed_main": "There is a lot being written and read about Akshay Kumar in the media lately. This film is a standing testament that he deserves that.\n\nIndia-born Kuwaiti businessman Ranjit (Kumar) finds his whole world turn upside down after he is caught unawares in the middle of cranky Iraq's invasion of Kuwait. Already frantic enough to manage his own three-member family's escape to India, Ranjit finds that a mass of Indians, with no one else to turn to, is pulling at his sleeve for help. The story is basically about his, his family's, and his fellow compatriots' struggle to leave the warzone amid rising tension from all sides.\n\nThe story is told rather nicely, minimizing the bloodshed but staying realistic at the same time. It's no doubt an extraordinary tale, and the writers manage to make it gripping, and even jaw-dropping at one, maybe two, instances. Of course, the exodus story is too good to be true, but when you KNOW that it is truly based on a real life event and few hearts did beat for almost a quarter million people's rescue mission, you automatically get the idea, and begin to realize the importance of telling such a story.\n\nIt talks about one man's painstaking struggle as he reaches astronomical altruism with his bare hands, putting his own life on the warpath. It also talks about India's snail-paced bureaucracy, and how babus are the best benchwarmers in the country. However, a lot of essential minutiae were left out in the screenplay which makes the whole story look too incomprehensible for someone who hates history or who wasn't reading the news in 1990. Lot of questions are left unanswered, which if were at least attempted to answer, could have saved the audience from being in the dark. But still, the photography and production set supports in evincing the sheer madness that presumably engulfed our protagonist. (There is also a sly comment on the intolerance issue currently grappling India if you are attentive.)\n\nThe film, unfortunately for enthusiasts like us, looks like it has gone through the Bollywood machine. I say this because you will see random, totally unnecessary songs playing out throughout the film. And Ranjit also shakes a leg in one or two, the only time we get to se his pearl whites. Plus, the attempt at infusing wry humor at certain parts totally messes up with those parts of the flow. Kumar is brilliant as I have mentioned, and is well supported by Kaur and other cast members. Really happy to see Malayalam film star Lena in a role.\n\nBOTTOM LINE: Raja Menon's tense war drama, Airlift, is definitely a well-made thriller which will make you feel good about your country this Republic Day, but at the end, the question still creeps in: how much has changed in 25 years?\n\nCan be watched with a typical Indian family? YES"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "loga2604",
        "review_rating": "3",
        "review_title": "Historically inaccurate and overrated",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "ankiuever",
        "review_rating": "10",
        "review_title": "Never Seen before kind of AIRLIFT Film In Indian Cinemas",
        "review_detailed_main": "Watched Airlift 2 Times. Here Is The My Review= > Airlift is outstanding in every sense √ > It's a terrific film with a strong script and superb performances, which left you smiling with wet eyes in the end. > Tightly packed entertainer, loaded with thrill, emotions and patriotism. > Hats off to Raja Menon and Akshay Kumar for backing a film that deserves to be seen by every Indian. > Raja Menon Sir's direction leaves a super strong impact. > Screenplay is gripping. > Cinematography Is Superb. Well developed nd made Scenes. That War Scenes when Saddaim Husain Invades Was brilliant. > VFX top levels & what a background music. > Akshay Sir's gives Best Performance Of his career. This Time National Award Aapka smile emoticon\n\n> The way Raja Menon reveals his character without going overboard is best way. > His beard look kiss emoticon & his dance on Song 'dil tujhe dedi'\n\n> Nimraut acted brilliantly. She is perfect & right choice for the Amrita Katyal's character. cute and glamorous. > Here i specially mention Purab Kohli, he did good job. His charm Was well defined. When You watch the movie at climax You will find that why i said this.\n\n> Everyone (audience) seeing to each other as their own family member after interval tongue emoticon (they feels like Indians & i also tongue emoticon )\n\n> Dialogues are Superb kiss emoticon and brilliantly written.\n\n> Every 1 clapping at end of the movie angel emoticon\n\nStanding Ovation Film!\n\nOverall It's M-A-S-T-E-R-P-I-E-C-E FILM - AIRLIFT\n\nIndia's Most Heroic Rescue Mission AIRLIFT\n\nProud To Be Indian"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "vipcooldude",
        "review_rating": "10",
        "review_title": "One of the finest films in Indian History...Akshay Kumar is Terrific , his career best till date...Must Must Watch...Don't miss it !!",
        "review_detailed_main": "#Airlift‬ is an engaging historical drama showcasing the emotions, fear, hope n spirit of 1,70,000 Indians stuck in Kuwait during Iraqi invasion in 1990 n finally how they were successfully evacuated by our Indian Government with the help of Air India...Akki has delivered the finest performance till date by completely owning the character of Ranjit Katiyal (it's a combination of 2 real characters who actually planned this evacuation in 1990), with much needed emotional layers, intensity, realism n subtlety...he is absolutely terrific (an award winning performance :))...other actors have done a great job too n supported him well...Film is technically brilliant n detailed in every aspect from writing, cinematography to art direction...Kudos to the director, Raja Krishna Menon for doing so much of research on this subject n courageously bringing out this heroic untold story to the world...he has done superb direction n handled it very realistically making it less jingoistic n more subtle n real in terms of Patriotism...It is one of the finest n outstanding films from India...gripping, engaging, beautiful, moving n most importantly makes us proud as an Indian...Go n be a part of this emotional journey n celebrate India's biggest victory...don't miss this Gem (they come rarely)...a must must watch !! smile emoticon \"War never distinguishes between people in terms of wealth, religion, region, caste or status rather it unites them to fight against it\""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "rajeshnfriends",
        "review_rating": "10",
        "review_title": "One of the superb movies of Bollywood",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "iamkaushalmodi",
        "review_rating": "9",
        "review_title": "Airlift is an entertaining Classic movie based on true events and real life incidents. Must go for it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "Heretolearn",
        "review_rating": "",
        "review_title": "Pretty Decent But not Spectacular !!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "tejomoyvaidya",
        "review_rating": "7",
        "review_title": "Airlift is disappointing",
        "review_detailed_main": "What works: Good performances, historically accurate film.\n\nWhat doesn't: The film fails to capture the horror of the war. Also, the film feels like a documentary.\n\nThe first half is quite slow. But the film picks up in the second half leading to an average climax which feels extremely rushed.\n\nOverall, the movie is a good watch. Akshay kumar has really given an outstanding performance which made the movie better. However it had much greater potential and a great trailer and expectations which it failed to live up to. In my opinion, Airlift works more as a docu-drama and not a thriller. The thrill element that the trailer showed was just missing."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "cooldudehoney",
        "review_rating": "10",
        "review_title": "Awesome work must go n Watch",
        "review_detailed_main": "What to Expect? If you have seen the promos and promotions you would know that this movie is based on the biggest evacuation in human history in which around 1,70,000 people were evacuated by India when Iraq invaded Kuwait in 1990.\n\nRecommendation It is one of those movies that really deserves Rs 300+ crore super hit tag. This is not the regular masala stuff. Don't miss this one.\n\nPerformances: Inaamulhaq impresses in his role of Major Khalaf Bin Zayd. Prakash Belawadi is Awesome as George Kutti. Nirmat Kaur is first rate, this is her yet another excellent performance after the much acclaimed 'The Lunchbox'. Akshay Kumar is in great form as he brings the fictional character of Ranjit Katiyal alive on the silver screen. This is one of his best work till date.\n\nDoes it Deliver? It works like magic. Very realistic depiction of a war torn country. Excellent direction. Depiction of Indian bureaucracy is also very touching.\n\nLoose Ends? There are hardly any loose ends. Films length is about 124 minutes, it is very crisp and to the point. Very well edited.\n\nFinal word Watch it because it raises the bar of bollywood higher. For a change, you get relief from the usual guy girl romance, senseless comedies or action. Finally we get to see something that makes us proud."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "Abby_qadir",
        "review_rating": "7",
        "review_title": "Not so high on patriotism but not so less on entertainment.",
        "review_detailed_main": "Airlift (2016) directed by Raja Krishna Menon starring Akshay Kumar and Nimarat Kaur in the lead is the story of when iraq invades kuwait and how 1,70,000 Indians were rescued in a most heroic way and that was the biggest evacuation in the history of the world.\n\nThe best thing about this movie I liked is that it doesn't take time to built the story and the detailing of the character because there is no need of it if you are presenting a film which base on true events. You need to be more cautious about the facts and events happened during that time because some of the audience may have already done some research about the event. This film may not be so high on patriotism but it is surely an entertaining ride.\n\nAkshay Kumar in the role of Ranjit Katiyal was the best choice and I don't think that any other actor can pull up such a charisma rather than him. He was brilliant in his act and his hard work shows while he act. Nimrat Kaur in the role of Mrs Katiyal was average, I was missing the spark in her, Rest from all the supporting cast I liked Kumud Mishra the most. The direction from Raja krishna Menon was good but it could have been brilliant.\n\nAt last I can only say that Airlift is a strong attempt to bring out the most historical evacuation of India in a form of entertainment.\n\n7/10 or 3/5"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "shuklaprakhar",
        "review_rating": "8",
        "review_title": "A must watch",
        "review_detailed_main": "Starting with a house full theater my expectations were very high... As the story started , the director really connected with the audiences and the way ranjit katyal dances on the start of the movie just lighten up the show. Well I find the second half more promising but the first half also made a mark... with everything on its place with right songs at the right point , the movie was a perfect one with no defects at all.. and the way nimrat kaur scolded Joseph just made my day... and now 4 the Indian's its a movie u should spend some penny bcoz its really gonna make every Indian proud ... and really the movie lived on my expectations .. so without a doubt its 10 on 10"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "ankitcom",
        "review_rating": "7",
        "review_title": "Authentic and a simple flick, that focuses only on storyline",
        "review_detailed_main": "http://maggyreviews.com/2016/01/22/airlift/\n\nDirector: Raja Menon Actors: Akshay Kumar, Nimrat Kaur\n\nRating: 3 / 5\n\nPictorially this movie felt like last year's film Baby, but it certainly is different in all senses. Less in cinematography, it has no heroic angles at all. One of the most simplistic and genuine movie in recent times. It focuses heavily on story and sticks to it throughout its running time. It has a great scenic creation of Kuwait Iraq war sight.\n\nAkshay Kumar blends himself as a soul of this whole storyline. He has perfectly underplayed his character without any starry effects. The way movie wanted its leading actor to be, he has set himself entirely like that. Nimrat Kaur is a decent support and has played her role effectively.\n\nRaja Menon frankly hasn't done anything to raise movie standards. The good part is that he made sure nothing is out of place. Doing nothing bad and supporting the storyline authentically is a good experiment that he has done.\n\nOverall, a genuine and a simple flick that focuses only on the storyline."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "fonehackerx",
        "review_rating": "1",
        "review_title": "What's wrong with Indians? It's a Stupid overrated Movie!",
        "review_detailed_main": "Just our national song and just a flag to make Indians sentimental. This is what this movie is using to get these ratings. This is probably the most overrated Indian movie you'll see. If you see the movie then you can easily guess what will happen next and in the trailer it says \"Feel proud to be Indian\", but how? by protecting people of the country from a war? GET SOME MIND GUYS. This is just a movie which aims to make money. Nothing special.. Sad to see Indians rating this movie 10/10 just because of some sentimental things. Rated 1/10 just to decrease the ratings, else I would give it 5/10. Please watch this movie if you are not sentimental kind of person to put real review here!"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "tejussbvb",
        "review_rating": "10",
        "review_title": "Must watch",
        "review_detailed_main": "Awesome effort from the director to cast crew. This film definitely gives you goosebumps. This movie is definitely a treat on the occasion of Republic day. It makes you proud to be an Indian. It clearly shows that we Indians are gem & one of a kind when it comes to safeguarding the people. This movie awakens the patriot within every Indian. One man effort to risk his life & protect thousand hundreds of people. Inspiring one liners by Akshay Kumar in the movie. Entire setup in the movie look so real and connecting. Songs are good and apt. All are acted equally good. Ours is a nation where great minds like Swamy Vivekananda & Subhash Chandra Bose are born. So its shown in the movie that it is in our blood to always go on the righteous & courageous path."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "srd091",
        "review_rating": "10",
        "review_title": "Excellent, awesome, ultimate movie...",
        "review_detailed_main": "Ultimate Movie, proud to be Indian... Great Story of success, Excellent hard work of the whole team AIRLIFT. Brilliant acting by Akshay Kumar, and a very sound performance by Nimrat Kaur. Great emotions, feeling like I was there. Quality music, Arijit Singh Sung with his pure heart. Airlift is based on the true incident of India's biggest human evacuation mission during the 1990 Gulf War in which 1.7 lakh Indians were airlifted using 488 flights in just 59 days. Airlift is a tale of heroism, courage, patriotism, and a lot more. And deserves a standing ovation. In all, Airlift is the story of unparalleled courage and unsung heroes. From unknown names in the Ministry of External Affairs in Delhi to people who had their Indianness rearing its head from within just when it was required, Airlift is un-miss-able."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "mauryadevendra",
        "review_rating": "10",
        "review_title": "The movie which fill us proud to be Indian",
        "review_detailed_main": "This is the first movie I seen in which people were clapping rather than whistle.This movie looks just like a real story at all time from beginning to end.The superstar Akshay Kumar also look like a simple business men(Ranjit Katyal). Each seen of the movie is perfect and keep us on the sit. Nimrat Kaur also perform her best. Raja Menon turns an important story into a compelling film. On the whole, Airlift is an entertaining film which will be liked by the classes and family audience.There is not much Kumar has to do besides have faith and talk to people; there is no audacious plan, there is no stroke of genius -- it's all just hope and humanity.In almost every frame of the film, he doesn't let his grip loose even once.Airlift is raw, real and well-acted.Don't miss it."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "nirbhayjariwala24",
        "review_rating": "10",
        "review_title": "GEM made by Indian Cinema and Akshay and the whole cast !!",
        "review_detailed_main": "I have no words for this film.. right from the start the movie takes you through different emotions ... in starting it depicts the characteristics of Ranjit (akshay) .. i mean how shrewd businessman he was ... but then .. Iraq invades Kuwait.. and the whole scenario changes.. Ranjit who once was considering himself as Kuwaiti experiences a change in personality ... decides to take every Indian trapped in Kuwait war zone back to India. Talking of acting and direction ... Just one word comes to mind .. Phenomenal.. Akshay only is the man in Bollywood who fits in this role perfectly .. no other star is capable of such a class serious role ... Nimrat too was outstanding throughout the movie .. The scene in which Indian Flag rise up at the airport will surely give Goosebumps to Indian !! Its Correct ..Feel Proud for our country - India ... A cinematic GEM .. Must go for it !! if u can take Khan's films which are baseless to 200- 300 crs ... this movie surely deserves more than that !! JAI HIND"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "preetjee313",
        "review_rating": "6",
        "review_title": "Good but could have been much better",
        "review_detailed_main": "The movie explores an interesting piece of history which sits on a potentially thrilling story but unfortunately the final product slyly drifts toward hero worhsip trend of Indian movies rather than making the story talk. The screenplay focuses too much on Akshay Kumar and even neglects the potential struggles faced by an extraction seeking group.\n\n1 - 5 July, 20"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "sidharth_sarma",
        "review_rating": "9",
        "review_title": "This Akshay-Nimrat starrer is bound to enthrall you!",
        "review_detailed_main": "Based on India's biggest rescue operation of its citizens in war-torn Kuwait,Airlift is one of Akshay's best films till date! He plays the role of Ranjit Katyal, a Kuwait-based businessman, who lives with his wife Amrita(Nimrat Kaur) and daughter (Abida Hussain). His life turns upside down when Kuwait gets invaded by Iraqi forces. The rest of the movie is about Ranjit's struggle to safely evacuate the Indian Citizens of Kuwait. The highlight of the movie is the screenplay, which has been brilliantly written! An intriguing storyline, crisp editing and a vivid cinematography makes the movie bang for the buck!This movie is perhaps, one of the best in its genre. Akshay delivers a stellar performance. He gets into the flesh of the character and looks completely real. He shines in each and every scene! Nimrat, as Akshay's wife, performs at par with Akshay. Despite being just 2 films old (Peddlers and Lunchbox), she performs like a seasoned actor. Her 'outburst' scene is worth applauding! Purab Kohli has been aptly cast and he doesn't disappoint. Other actors perform equally well! Final Verdict- Just go for it. You won't be disappointed!"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "SumanShakya",
        "review_rating": "7",
        "review_title": "Common man turning into a hero.... an inspirational film.....",
        "review_detailed_main": "In 1990, when Irag attacked Kuwait, over 1 Lakh Seventy thousand Indians were stranded in Kuwait. The film is based on the evacuation of the Indians during Gulf War in Iraq. The stranded were airlifted by Air India, which is considered one of the biggest evacuation operations in the history. The film majorly deals with the efforts of a Kuwait based Indian businessman who leads the evacuation of the Indians by setting shelter and helping them to cross the borders of Kuwait to take them to Jordan from where they were all airlifted by Air India.\n\nIndeed the story is marvelous which just grip you tight to your seats. Besides, the film remains tremendously well made with a taut direction and sequences that touch you. At least there were 4-5 sequences in the film in which you just feel like applauding. The success of this film owes to the humanity it brings in its story. The film just depicts how a common man can turn into a hero when he saves humanity which gets well reflected in Akshay's character. You don't need to fight or show your valor in a battlefield. Once you think beyond your family to save someone else' life, it's not less heroic. In terms of theme the film is similar to \"Schindler's List.\" \"Airlift\" might not find itself in the list of historical landmark of film making like \"Schindler's List\" but the story and Akshay Kumar's and Namrata Kaur's performance does touch you for a while. Though the film might lack the rawness and calibre of \"Schindler's List,\" making the film on such a historical event which has never been seen in the screen is indeed commendable.\n\nRating: 3 stars out of 4"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "goutam-53229",
        "review_rating": "10",
        "review_title": "A Movie that Shows What India can do for Indians",
        "review_detailed_main": "Awesome will be an understatement for this movie. It might look bit tiring, lengthy and boring at patches but its only because of the story shown in a real way and without much commercial flavor or manipulation done to the real event.\n\nAkshay shines out without a trace of his super-stardom, Purab Kohli and Kumud Mishra just hit the chords right and makes it believable in whatever they do! Nimrata too plays a wonderful role.\n\nBut the star of the movie is the story.\n\nThis story will show NRI's about what their forgotten motherland \"INDIA\" can do for them even if they themselves hate to be called as Indians! And the best part is its true story and non manipulated one! Goosebumps guaranteed.. The last monologue by Akshay is something that should not be missed.. GO ahead guys watch this classic movie with some stellar performance! their is no excuse for missing this movie. it deserves its due credit!"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "chemingineer",
        "review_rating": "6",
        "review_title": "A Film that makes Bollwood and India Proud",
        "review_detailed_main": "In 1991 Iraq invaded Kuwait and nearly 175,000 Indians were left high and dry, before being brought to India, in what is regarded as the largest war-time evacuation of its kind. Airlift narrates the story of events leading up to this evacuation. It shows the Indian Government in rather poor light, which is probably exaggerated under cinematic license. Notwithstanding that it is a very credible story, crisply told and tautly executed. It is not easy to narrate events that go back 25 years, and that too featuring a foreign land; this is where the film scores very high. Top marks for the crowd sequences. The stoicism with which most Indians accept their situation is brought out exceedingly well. Another remarkable thing is the film's economy of script; a lot is conveyed through looks and gestures. Though there are many characters, the director does well to keep the limelight on Akshay Kumar, who is intense without being melodramatic. The urgency and emergency that he manages to deliver are very palpable. The film also makes us look at our countrymen laboring in the Gulf with more sympathy.\n\nFinally it is a feel-good film; a film that both Bollywood and the country can be proud of."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "HarshitWise",
        "review_rating": "5",
        "review_title": "Mediocre...?",
        "review_detailed_main": "This movie had some very good aspects and some very bad aspects. Nothing was mediocre. All subplots were unrealistic and overdramatic viz. Mr. George subplot, Kuwaiti in the camp subplot, the driver subplot, etc. Cinematography was weak. War zones were very weakly depicted. All wide angle shots of Kuwait city under attack looked animated. All fire, burning vehicles were CGI and looked inauthentic to the limit. Makeup and costumes were good. Nimrat Kaur especially looked gorgeous in the whole movie. But, did Amrita Katyal and other cast supposed to look good? Background score was overpushed. Scenes were tried to be made thriller or melodramatic on the basis of background score even when it is not needed. Acting was overall very good. This was the best acting by Akshay Kumar I've ever seen. After the lunchbox, Nimrat Kaur yet again proved her talent. Screenplay was plain bad, eg. Ranjit Katyal goes to the party just because an item number needs to be inserted. It neither sheds a light on Ranjit-Amrita relationship (as suggested by the preceding scene), nor helps the story to move forward. Stereotypes were used for comic element. Direction was subpar. Between the awesomeness of some departments and utter dismal by the other, the movie as a whole failed to rise above ordinary."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "vanditbery-09726",
        "review_rating": "10",
        "review_title": "A must watch",
        "review_detailed_main": "Airlift is here to stay in your heart for many years to come. A film that will make you feel proud of your country. The grips you from the very first scene and stays with you as you the hall.The movie has finest performances from stalwarts like Akshay Kumar, Nimrat Kaur, Purab Kohli, Prakash Belawadi. Though, i have never been a great fan of Akshay Kumar or his films but this film makes me think the otherwise. This beautifully crafted film is definitely going to be in my list of favorite movies that i would come back to watch. This film is soon going to be a part of the Top 10 films you must watch before you die. This film definitely gives it back to all those people who believe that Hindi movies are not worth watching.\n\nAkshay Kumar and Nimrat Kaur deserve all the Awards and accloades for their sparkling performances."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "hirenvaishnani",
        "review_rating": "10",
        "review_title": "AIRLIFT, Best Movie Experience",
        "review_detailed_main": "As an Indian I can only say, I AM PROUD OF MY COUNTRY. LOVE U India. These emotions suddenly raised after being witnessed the love, loyalty and bravery of an Indian for his country and countrymen. Tremendously directed as well as acted by each and every single character. AIRLIFT makes India Proud. Please please please watch the movie, and get idea of what Indian Cinema can do and of course what India did. Akshay is best as always in every scene at every single second. Nimrat Kaur, beautiful lady is amazing with outstanding performance. Feryna Wazheir, less dialogue, not in Hindi too, but her eyes and her tears were enough to deliver her best performance. The remaining staff, last but not the least were AMAZING !!! Each and every single actor did their best job ever. Congrats Bollywood, U delivered Ur BEST. Thank U So Much Raja Menon."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "arpandewanjee60",
        "review_rating": "10",
        "review_title": "One word Masterpiece...",
        "review_detailed_main": "Honestly saying it's one of the best have all time...It's all about Kuwait War in 1990...I'll not expose the movie here...Now a days the quality of Indian Cinema is increasing...Last year Akshay Kumar gave us Baby which was also a masterpiece itself...But Now every year he's giving us minimum 1 masterpiece...And Airlift is one of them and even better than so many other great movies, there's nothing to compare it with those other great movies but you must watch it in theaters if you're an Indian...This is truly the most heroic mission had done by India... It's not copied from any Hollywood movie, so if you're not an Indian u can also give it a chance...It'll not bore u, even you'll enjoy it from 1st to last... Akshay Kumar has proved again why he's the best actor of India along with Irrfan Khan and Nana Patekar... Lastly I've to say that watch it or you'll miss a masterpiece..."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "sagarshares7854",
        "review_rating": "9",
        "review_title": "Breezy pace,good supporting cast and a very good watch!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "wdrpwarnakula",
        "review_rating": "7",
        "review_title": "Good movie but overrated",
        "review_detailed_main": "I was waiting to watch this after seeing ratings like 9. But after seeing I felt like why that much rating for a movie like this.. Even films like 3 idiots have a rating of 8.4 Nevertheless the rescue mission is really admirable. Acting was good particularly akshay delivers one of his best performance. Still it didn't reach my expectations. In the middle it looses it's grip... This real heroic mission is unmatchable, but it doesn't mean that this movie is excellent.. Acting-9 Direction-7 Story -8 but the execution far less in the movie.. Must watch for sure...but don't get misled by these high ratings.. 7 is more than enough for this"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "ksilentstorm",
        "review_rating": "10",
        "review_title": "Best patriotic movie after almost 2 decades",
        "review_detailed_main": "The movie is excellent. The best patriotic movie India has ever got. Synchronization is average. But Acting, direction, screenplay, script and dialogs, all are balanced and heart touching. Watch it how human helps human in crisis. Watch how a real hero is far beyond the hate of everyone. Watch how your national flag is always respectful. Watch first time, How people were eager to see their own national flag. Airlift team performed best in every stage. All characters were perfectly fitted in their roles. The storyline is having interest-holder formula in it. Its all worth spending time and money watching this movie. Some Indian refugees added fun in the movie. And it"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "bobbysing",
        "review_rating": "7",
        "review_title": "Akshay's films might not be reaching the infamous 100 crore status, but the man is rightly choosing his subjects becoming the new-age Bharat Kumar for the present generation.",
        "review_detailed_main": "Based on the genuinely lesser-known heroes of the past, AIRLIFT is a completely focused and a sincere effort by director Raja Krishna Menon enlightening the viewers about the time of first Gulf War, when around 1,70,000 Indians left stranded in Kuwait were safely rescued by the efforts made by a few local businessmen of Indian origin, a few government employees and diplomats here in India going out of their way compromising with the set protocol.\n\nThe rare and unbelievable kind of incident deserved to be adapted on the silver screen as a must and team AIRLIFT does the given important task pretty well with only a few preventable minuses revealed in the later part of the review, mentioning the merits first.\n\nThe film begins with a non-Hindi sequence giving you a feel of where the story is actually based and then the lead character of Akshay gets revealed as a cunning, money-minded businessman with a song \"Dil Cheez Tujhe De Di', reminding you of Khaled's hit track of the early '90s titled DIDI. However, the relief moments get over soon within the opening 10 minutes and the narration straight away comes to its basic shocking plot without wasting any more time as required.\n\nThe director, along with his cinematographer (Priya Seth), brilliantly recreates the absurd, life-threatening and hell of a scary scenario on the streets very intelligently (with fine detailing), without going into any hugely grand scale (try to catch the sight of all wrecked shops at the back with boards like of CASIO). As a result one truly feels the fear watching military tanks moving around the houses, heavy guns in the hands of young soldiers and people being shot dead on just hearing a word said in Arabic.\n\nPersonally speaking, the well-shot and conceived transformation of life within seconds – without caring about any kind of richness one might have achieved – reminded me of a similar sequence in Yash Chopra's WAQT where the life-changing twist is a result of devastating earthquake and not any foreign attack. The story progression remains convincing and majorly gripping till intermission despite some unrequired songs and the film keeps heading towards an expectedly uplifting climax arousing patriotic feeling among the audience that honestly could have been much more energetic and exciting giving the event a thrilling edge.\n\nApart from the fact that AIRLIFT largely works due to its rare, unheard-of historical event and its (said to be) authentic portrayal, the other truth remains that the film completely relies on the strong shoulders of Akshay alone and the actor underplays the heroic act well without falling back to the usual Bollywood heroism. Akshay's first-rate performance gets decently supported by Nimrat Kaur, who could have done much better underplaying it too, because at times it does make you feel awkward watching her calmly living in her big house overlooking the gravely dangerous situation in the country they are living in. The supporting cast has some effective portrayals from Purab Kohli, Kumud Mishra, Feryna Wazheir and above all Prakash Belawadi who successfully annoys the viewers too along with Akshay and others on screen.\n\nComing to the hiccups in AIRLIFT, which unfortunately don't let you rate the film as any classic exemplary attempt making a major breakthrough, firstly it's the usual inclusion of love songs (with another inspired one from a Punjabi hit number 'Soch') coming at a time when there is tension written all over the screen with people dying. Admittedly post the first acceptable party track, the moment a melody begins, you feel like why they are adding songs in such a finely progressing movie based on a serious subject?\n\nThe second drawback in the film for me was the casting of Inaamulhaq as the Iraqi general speaking with a funny accent. No doubt Inaamulhaq is a fine actor who tried his best to deliver the expected result in the assigned job. But as I felt, another terrifying face in that particular role could have resulted in much more scary impact in those important sequences with Akshay avoiding all the unintentional comic touches.\n\nAs the third and most important hiccup of the film, its climax lacked that expected exaggeration or cinematic tension that should have been there depicting probably the biggest civil evacuation in the world history. The detailing was completely missing as it actually had more than 450 planes airlifting the 1,70,000 people from the region, that took around one to two months as reported. Besides, the emphasis entirely remains on talks and requests made on humanitarian ground, without any kind of exciting cinematic moments bringing the viewer on to the edge of his seat as seen in similar attempts in the west like in ARGO.\n\nTalking about the political involvement and will showcased in the film as per the real life happenings, AIRLIFT actually doesn't make you feel proud for the government or political leaders of those times not taking any instant timely action as desired. On the contrary, it makes you feel proud for those few government employees and concerned officials who in reality made it possible through their personal efforts fighting against all the usual political drama and time-lags.\n\nSo keeping in mind the shortcomings, do watch AIRLIFT as a good film inspiring us all to be together as INDIANS irrespective of any caste, colour or region. But don't expect anything as exciting and effective as ARGO, HOTEL RWANDA or SCHINDLER's LIST."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "greenbajgain",
        "review_rating": "10",
        "review_title": "Airlift is master piece",
        "review_detailed_main": "OK what is trend of Bollywood films? hero heroine item song boring ending? But this movie deserve a lot.\n\nBut this film airlift is so much real . No unnecessary songs. And the best thing about this film is its message and morality given to all the people.\n\nThere are some scenes which makes so much mystery. There is feeling of humanity and much more. You will also see how much careless can a government can be?\n\nActually this film indeed reflect our society . It shows person should be great by his heart not by money. This film also illustrate before saying religions , person from particular country first we need to treat them as human.\n\nAnd also this film shows how to life is full of mystery and struggle. We can also imagine how people are living in such country ?\n\nThank You all team of airlift for giving such a nice film."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "siddhantmohapatra",
        "review_rating": "6",
        "review_title": "Average",
        "review_detailed_main": "The plot is historic, no doubt but the execution was very slow. Constantly they are showing people losing hope and akshay reassuring them, same fkn thing there wasnt anything particularly engaging. I walked out of the theatre pretty much below my expectations."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "PimpinAinttEasy",
        "review_rating": "4",
        "review_title": "Do not be fooled by the 9.2 rating",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "bhavneet_sash",
        "review_rating": "10",
        "review_title": "One of most intense movies ever made. Great efforts!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "pyaare_aman",
        "review_rating": "10",
        "review_title": "Deftly done Film: Airlift",
        "review_detailed_main": "Finally watched Airlift.... smile emoticon This is Akshay Kumar's best ever.... Raja Menon's Airlift will give you goosebumps with fast paced gritting thrills and excitement. The last 20 minutes tell us, why we should feel proud as an Indian. This is a deftly done film, which slide a little in the second half, but never abandons its mission: to tell the story of unsung heroes. Akshay Kumar leads from the front, but shares space when it is needed: Nimrat Kaur, keeps pace with her co-star ; Inaamulhaq as Saddam's man-in-Kuwait, is suitably menacing, Belawadi (George) as the annoying refugee, Kohli is kohl-eyed and restrained and makes us feel for him, Kumud Mishra as the MoEA Babu, disinterested at first, then taking charge, fits right in. Sometimes, being human comes naturally to cinema. That's the moment we need to salute, celebrate and sanctify such movies so that we get to see more unsung heroes on screen. We didn't know Ranjit Katyal. It's Team Airlift has brought this unclaimed hero out of the rubble of history. For your money and time, Some previous movies of Akshay Kumar makes him, the most watchable star in Bollywood today. See Airlift, you will know why. ‪#Airlift‬ ‪#ProudIndian‬"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "raigarvit",
        "review_rating": "10",
        "review_title": "Superb movie",
        "review_detailed_main": "10/10\n\nGuys a must watch movie for all peoples we are always watching Hollywood movie and think they are awesome and if u want a Indian heroism story so go and watch airlift best performance by Mr.akshay. and other star cast \"Some stories *should* be told. #Airlift sheds light on the evacuation of Indians in Kuwait after the invasion by Iraq. Narrated BRILLIANTLY. #Airlift is taut, engrossing, leaves a hammer-strong impact. Raja Krishna Menon is a director to watch out for. Deserves brownie points. #Airlift is a must must watch. One of the finest films to come out of the Hindi film industry. Just do not miss this one"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "amitsatiya",
        "review_rating": "10",
        "review_title": "Excellent Movie",
        "review_detailed_main": "Amazing movie. Masterpiece by Raja Menon. Akshay Kumar has done his best acting till date. Other cast has also performed very well. The story screenplay songs are perfect. Director has not tried to stretch it unnecessary and kept it as real as possible. Its well timed with Republic day. A must watch movie in theatres. Its a treat for Akshay kumar fans. Hoping this movie to cross 100cr soon. Amazing movie. Masterpiece by Raja Menon. Akshay Kumar has done his best acting till date. Other cast has also performed very well. Its well timed with Republic day. A must watch movie in theatres. Its a treat for Akshay kumar fans. Hoping this movie to cross 100cr soon."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "kumarvarun1989",
        "review_rating": "7",
        "review_title": "Movie is well executed & well Acted",
        "review_detailed_main": "It is August, 1990. Kuwait-based Indian businessman Ranjit Katyal (Akshay Kumar) is awoken rudely from slumber by the news that Iraqi forces have attacked the city. It is the sort of awakening that shakes loose Katyal from his cocooned wealthy life, which he shares with his wife Amrita (Nimrat Kaur) and young daughter, forcing him to deal with a series of dangerous situations, and leading to the evacuation of more than a lakh Indians stuck between Saddam Hussain's brutal forces and an alarmingly slow-to-take-heed Indian state. The film is based on the real-life conflict and bloodshed that took place twenty five years back in Kuwait, and the way it is done—with a sense of urgency and immediacy, bringing alive a city over-run and under siege—sends out a crucial message to star-driven-yet-drivel-producing Bollywood. That given the backing of an A-list star, anything is possible: well done, Akshay Kumar, for donning the producer-with- conviction hat to create a crackling film. And another pat for the performance. Katyal is made believable because Akshay junks faux heroics for an unshowy heroism, which comes from a place of initial reluctance, seguing into a slow acceptance of the situation, and the gradual taking charge because there is no one else that can do the job. And brings his star power to lift the film, in much the same way Ben Affleck buoyed the Hollywood evacuation tale, 'Argo'. This is a deftly done film, which does slide a little in the second half, but never abandons its mission: to tell a tale. Akshay Kumar leads from the front, but shares space when it is needed: Nimrat Kaur, in her second Hindi film after 'The Lunchbox', keeps pace with her co-star ; Inaamulhaq (so enjoyable in 'Filmistaan'), as Saddam's man-in-Kuwait, is suitably menacing, Belawadi as the annoying refugee really does make you want to slap him, Kohli is kohl-eyed and restrained and makes us feel for him, Mishra as the Dilli babu, disinterested at first, then taking charge, fits right in. Bollywood doesn't do well with basing its films on real-life events because it mostly has no idea how to straddle the line between fact and fiction, which is so crucial to the genre. It overdoes things, and turns them into melodrama and schmaltz. 'Airlift' plays it right, and gives us drama, even if things slow down and turn a trifle repetitious post interval. But overall, 'Airlift' is a good film, solidly plotted, well executed and well-acted. Just lose the songs, and the occasional underlined background music the next time, okay?"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "jinoytommanjaly",
        "review_rating": "10",
        "review_title": "Seen the real story through Movie",
        "review_detailed_main": "First of all, i have heard the story from my parents from childhood that they faced during Saddam attack at Kuwait before my Birth. The attacked happened when my sister was 1month old. I just didn't take it seriously because I mother told this story several times and I simply makes jokes on her.. because I didn't get affected (not born at that time).\n\nAfter watching the movie.., really GOD shows my eyes that the story I had heard several times..It seems i just watching the video part only...,the Audio is my mother's😉... A big Salute to the brave hero's.... Really a nice movie..."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "garfielfreak",
        "review_rating": "8",
        "review_title": "Reminds me of Hotel Rwanda",
        "review_detailed_main": "It reminds me of Hotel Rwanda, a story that must be told.\n\nThe story Is good and true and the actors (you almost never hear about them up north in Europe) does a fine job.\n\nBut the man known as \"george\" how can behave like a snob when he should be happy to get home?"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "hamadaljuwaied",
        "review_rating": "1",
        "review_title": "Making Iraq as the heroes + disregarding the Kuwaiti government + mistakes and bad effort",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "amitwb-31821",
        "review_rating": "10",
        "review_title": "Masterpiece",
        "review_detailed_main": "In a word masterpiece. Feeling bad, I didn't watch this in theatre. Akshay Kumar's acting skill is becoming better day by day."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "mans-90711",
        "review_rating": "10",
        "review_title": "AIRLIFT",
        "review_detailed_main": "I wonder why this script was in the industry for 6 years and no one agreed to do it until Akshay Kumar stepped in. This is a very less known story of one of the bravest evacuations in the history. Saving 1,70,000 people in another country and bring them back to their home is applaudable, or something even bigger. All the performances are brilliant. Screenplay and background score stands out. Brilliantly designed and edited. One of the bests from the industry and the star power of Akshay Kumar has made it even bigger.\n\nThis film makes you proud in every which way for being an Indian.\n\nHats off to the director Raja Krishna Menon, his sincerity and brilliance can be easily seen in this film.\n\nTwo scenes that stand out, first, Indian flag put on at Jordon Airport and Second, when the first Air India takes off and Vande Matram plays in the background. You'll cry, you'll feel happy and most importantly you'll feel proud for you country.\n\nMust watch."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "nanoo-shashwat",
        "review_rating": "10",
        "review_title": "After 3 Idiots , Waited 6 Years for Another Perfect Movie Again .",
        "review_detailed_main": "Raja Krishna Menon is well known for his Skills in direction and this movie by far took his level to all time high . Direction , Screenplay , Cinematography and every other aspects were perfect .\n\nNo wonder it is stable with almost 10k votes at 9.5/10 . I think 9.5 is also a little less for this masterpiece .\n\nFilm never waited as it was in such a pace that nothing will bore you ever . From start to end , it gets better . Usually most of the films fail to achieve this heroic . Usually a film of this genre goes flatten after 1 hr but it never did .\n\nThis movie was so much awaited in gulf countries and well-received too . Reviews from Overseas are flawless and by Indian are over-whelming .\n\nTalking of Songs , Frankly speaking , Songs weren't needed i think (Like Baby) but since it targeted a few more audience , it played it part .\n\nRip-Off characters are great and comic .\n\nAs far as Acting goes , Akshay as Ranjit Katiyal was too good to watch , One of his best . Nimrita was beautiful and amazing too . Purab Kohli as Ibrahim was nice and other characters were well fitted too .\n\nNow for story , it was little alterated but i think it was needed to make it from 1.45 hrs to 2 hrs Movie .\n\nLast 30 Mins was a well executed patriotic plot and went amazingly with the story .\n\nWhat else can i say , If you miss it from theaters , You are missing one of the epics from bollywood . Worth your bucks once definitely or maybe twice and thrice for goosebumps at the climax .\n\nIn One Word - \" Masterpiece \" .\n\nMovie - 10/10 without any doubt . Acting - 9.5/10 Songs - 8/10 Story - 11/10"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "navasamajasthapana",
        "review_rating": "10",
        "review_title": "The Best Movie, The Best Performances, The Best Hero, The Best Direction , The Best Screen Play , The Best THe Best The Best ...Thanks For Such A NIce Movie",
        "review_detailed_main": "One of the best movie i ever seen , what a performances , Akshay Kumar is really a great actor proved once again.As i do not know Hindi fluently i am able to understand easily because of wonderful direction. its simply superb. This is Pure Indian movie. it shows unity in diversity of India, i don't know where to start and where to end to praise the air lift team.Especially this is the perfect time to come these kind of movies to know about the real Attitude and character of Indians. There is no religions barriers for Indian Unity Hindu,Muslim, Sikh, Christian, Jain, Buddh, Parsee all are equal ..We Indians are United.This movie changes the mind set of the people who thinks about Intolerance in India."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "ayushaggar",
        "review_rating": "9",
        "review_title": "Akshay Kumar plays a role who masterminded the dramatic rescue operation during the first Gulf War in 1990.",
        "review_detailed_main": "film is well shot, with cinematographer Priya Seth achieving the right mix of impressive aerial shots and cramped hand-held bits, and reasonably well-textured with credible Middle Eastern detailing.\n\nThere are hiccups -- like Kumar singing a Hindi song moments after refusing to listen to Hindi songs -- and the songs do indeed get in the way every single time they come on, but things are smoothened over by the solid character artists populating this film, from the surprisingly effective Purab Kohli to the ever-excellent Kumud Mishra to the businessmen who play Kumar's buddies to the fascinatingly helpless Feryna Wazheir, who plays a Kuwaiti woman hoping to make her escape with the Indians."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "adi-ashishfun",
        "review_rating": "10",
        "review_title": "Don't think about region or language, go and watch",
        "review_detailed_main": "please go and watch this movie, if you are a true Indian then go and watch, I am pretty much sure you will like it. What a performance of all actors, salute to Akki.\n\nWhat a great movie I have ever seen in Bollywood.\n\nI would say, don't think about the region or language, the movie is about the Nation.\n\nYou will feel like: Proud to be Indian. The movie is not kind of drama, action, romance, comedy, it's a story about the evacuation of Indians from war zone Kuwait.\n\nSalute to Ranjit Katyal and team and salute to Indian govt, Indian air force, and Air India.\n\n\"The great evacuation\"\n\nDon't think much go and watch the movie.\n\nStory: The movie tells the story about NRI's, who thinks India is a backward, corrupt, nation, who doesn't wants to come India. but unfortunately some incident happens and they cry like a child and says: \"Ma, Ma\". \"Ma (Mother)\" is nothing but India from where they born."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "eldreddsouza",
        "review_rating": "1",
        "review_title": "They changed the name of the main character to suit their political agenda!",
        "review_detailed_main": "The great man on whom this movie is based, his name is Sunny Matthews. Why was the name changed to that of a Hindu guy? This is political on another level and very disrespectful to the Catholic community. I'm sorry but this is not done.\n\nThis film came out in 2016 and you all know that the lead actor of this film is a stooge of the govt. That came in power in '14. Being a RW extremist party, they are infamous for their Hindu appeasement as it being a majority religion guarantees them votes in large numbers. This is the sad reality and breaks my heart. It's extremely disrespectful to the man whose courage and valour led to the largest evacuation of innocent people who would have otherwise lost their lives.\n\nExtremely disappointed!"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "godhanigopal",
        "review_rating": "9",
        "review_title": "One of the best story and performance....much much better than expected!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "aalokbhinde",
        "review_rating": "10",
        "review_title": "One of the best film in Indian Cinema",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "abhimanyu-singh32",
        "review_rating": "10",
        "review_title": "Probably the best ever seen",
        "review_detailed_main": "RIP to those who think this is a movie. If you could feel it , it is not movie. Brilliance of Akshay, Nimrat and Bollywood at its best.\n\nIf you didn't see this, you lack a feeling of being a proud Indian. Not sure, if Akshay gets an award for it but you truly made it look real.\n\nThanks for bringing this story so alive that we could feel it. Thanks for taking out such an idea of bringing this story to every Indian and made us proud.\n\nThis movie had every thing which can make it a Superhit or rather one of the finest in BollyWood So far.\n\nStoryline acting screenplay cinematography has been on its peak.\n\nAwesome"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "prakash_gss",
        "review_rating": "10",
        "review_title": "Airlift - Another magnificent movie in Akshay Kumar's career.",
        "review_detailed_main": "Airlift is a Brilliant movie driven by Akshay Kumar in a splendid way. The conditions and the typical human attitude in that disaster were well portrayed in the celluloid. Must watch movie by every Indian. Nimrat Kaur's performance was excellent too. Akshay again proved that he only can do such kind of movies. I would say A Special 26, A Baby and An Airlift. A good start of 2016 for Bollywood. This movie will definitely bag some awards.Inaamulhaq, Purab Kohli also did their roles very well.\n\nHats off, Akshay.\n\nCheers, Prakash"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "anuj-56868",
        "review_rating": "10",
        "review_title": "A must watch movie",
        "review_detailed_main": "This is really a must watch biopic for everyone. The movie is about will of two people to save 1, 70, 000 Indians. One worked hard through all the efforts in Kuwait and Iraq while the other one moved rocks inside India to save the people.\n\nThis is the movie about the largest civilian mission ever and yes after watching this movie you all can say that Bollywood's standards are moving fast. Akshay Kumar perfectly demonstrated the frustration, will for survival and humanity everything in all aspects.\n\nI loved the movie and yes surely wants say \"Well Done\" to real the person \"Sunny Mathews\" who made this all possible back in 1990 when India was not as renowned among the world as it is today."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "dhirajbjangid",
        "review_rating": "8",
        "review_title": "Yet another fabulous movie from Akshay Kumar",
        "review_detailed_main": "Everything about the movie is unique. Akshay Kumar is simply awesome as a hero. No one would have been able to portray a character with two opposite pole personalities. He's simply the best actor Bollywood industry has right now.\n\nThe film has a perfect balance of family emotions, patriotism,fear and courage. Right from the start, it takes control of your heart and unfolds a story that was never known.\n\nThe pace of the movie at sometimes feels going down, but that apart Raja Krishna Menon has beautifully created the story along with classic cinematography. Nimrat Kaur, though she doesn't share too much screen, is impressive as well.\n\nA big thumbs up for the movie and the team."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "chemba_85",
        "review_rating": "4",
        "review_title": "Pathetic",
        "review_detailed_main": "Badly written poorly made idiotic cliche irritating movie"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "ashsu",
        "review_rating": "10",
        "review_title": "nailed it",
        "review_detailed_main": "its one of the great movie to watch...some scenes really give you goosebumps.go to your nearby theater and do watch it as fast as you can.Akshay nailed the screen and so as Nimrit. I have become an Akshay Kumar fan in the recent years. From being Bollywood's favorite Khiladi in more ways than one, this person has matured as an actor. He brings that rare thing to the screen - persona. Nimrat Kaur does justice to her role. I would have liked a lot more layering in the expressions of this rather complex character, but that's just me. Joseph - who grows in stature from that first shot when Akshay Kumar is asking him how much moneys they have, to the end. Purab Kohli as Iqbal.. what can one say? He stands out, really, REALLY stands out, is all. You will have to see his performance to know what I mean. From the man who escorts the hero to a small gathering of friends in a supermarket, to the man who ensures an identity for a woman with an infant, and then looks the hero in the eye as he walks past, this man truly is an equal."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "vishal-s14",
        "review_rating": "10",
        "review_title": "A Must Must watch film for every Indians",
        "review_detailed_main": "What a film man! What a performance! I would like to say only one sentence that is \"Bhai_saab_maza_aa_gaya\" The film is belongs to 1990 incident, You probably remember the moment you first heard of Iraq's invasion of Kuwait, of Saddam Hussein, and of the incident that sparked off the Gulf War. In Airlift, he plays Ranjit Katyal, the unsung, unknown hero who masterminded the evacuation of thousands of Indians stranded in Kuwait in August 1990 when Saddam Hussain's army decided to take over. Akshay delivers a performance that is subtle and skilled. He weaves his way around the crisis, looking for center to his war-torn conscience-stricken character. When he finds that center, the actor builds a character who uses his negotiating skills as an entrepreneur to rescue innumerable lives from danger. I would say that you should go and watch the film it is extremely good and one of the best movie done by Akshay Kumar. He and Nimrat Kaur (The leading lady) gave the heart pumping performance. I'm telling you, after watching this epic film you'll definitely proud to be an Indian. #Must_must_watch_film."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "Indian_Joker",
        "review_rating": "10",
        "review_title": "Charm To Eyes, Warmth To Heart & Invoking Patriotism in Blood, Airlift is a GEM which should not be missed...!!!",
        "review_detailed_main": "What A Film! Recently Bollywood has produced some top notch films. This film is one of them. This is not to be missed at any cost. Not only acting, but screenplay, dialogues, scenes, action, drama... There is everything in this film. Everything is excellent.\n\nAkshay Kumar (Ranjit Katyal) is a businessman who only care is about his family and money. When the Iraq Army starts to invade Kuwait, he finds himself and his family in trouble. While getting his family into safety, he finds other people have no option but to look up to him. Now he has to save them all.\n\nAkshay Kumar as Ranjit Katyal has played flawless role. His wife (Nimrat Kaur) is supportive. Nimrat has a good acting skill. Purab Kohli is good with his supportive role in film. Kumud Mishra has a good government employee role and he has played it excellent. Others are good too.\n\nThe film has a tight screenplay. We think this evacuation was simple as we read it in the papers or on wikipedia but the director has researched all about it and presented in a brilliant way. Each problems they faced was worst and worst and the director has shown it in a brilliant way. This is what makes the film so special.\n\nThe reasons this film should not be missed is:\n\n1) The main reason is the history which (i am amazed) 60% of indians don't know (Especially the younger generation). These are the heroes of India.\n\n2) The efforts director made to show this history to Indian Cinema and the rest of the world.\n\n3) Brilliant Acting. Flawless Screenplay. Very Good War Scenes. On-The-Point Dialogues. And most of all... Patriotism!\n\nJai Hind!"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "balsandeep-bal",
        "review_rating": "10",
        "review_title": "What a movie it is and what a horrible reality that people faced in those years..",
        "review_detailed_main": "Akki is a great actor as well as comedian,but he should do movies like BABY,SPECIAL 26 and of course AIRLIFT.Nice movie,great story and salute to Mr. Kohli(the govt officer),one of the most important character who made possible of the evacuation.\n\nAnd friends forget to compare the khans and akki and any other actors with each other.Everyone has their own speciality.We have a trend of non-sense and good movies test,thats the credit going to bollywood.But this is the best movie i ever seen in Hindi film industry so called bollywood.And what a performance given by akki and nimrit kaur and everybody."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "ashish_mehta28",
        "review_rating": "10",
        "review_title": "Akshay Kumar's Excellency",
        "review_detailed_main": "I am not complementing because I like Akshay Kumar but since few years He had blast in Film Industry, He has worked in best movies, I noticed that if there is a best story in movie they don't need Item song or Item girl, He has proved that He is \"One Man Show\", If we talk about Airlift, I feel that this movie is One of The Best Movie, I will suggest every Indian to watch this movie because this kind of movie should not miss it if you are real Indian then must watch, Congratulations Akki Sir, Last but not in the list his Special 26, Holiday, Baby, Brothers, Airlift all are the best movies and all the best for his upcoming movie Robot 2."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "aboka-481-578437",
        "review_rating": "10",
        "review_title": "Hollywood could learn from Bollywood",
        "review_detailed_main": "First I will state that I am not Indian.\n\nThis is the third Bollywood movie I've watched in as many weeks. Every one of them has been leaps and bounds better than the nonsense we are fed by Hollywood. Every aspect of these movies is better, from the writing, the character building, the passionate acting, and the top notch musical scores. All the technical qualities and filmography are first rate as well.\n\nAirlift was no exception. The story was engaging, the characters inspiring, and the acting impeccable. The only slight knock, which is not even a knock in my opinion was that the spectacular multi-million dollar special effects you would expect to see in a Hollywood version of the opening scenes were a bit underwhelming. That said, I would trade these any day for the great story I got from the rest of the film.\n\nBollywood movies seem more in touch with humanity than products from Hollywood. Whereas Hollywood movies often leave you feeling that humanity is failing, movies like Airlift, Dear Zindagi, and others reconnect you with the best part of ourselves and show us that there is hope for us.\n\nI'm becoming a real Bollywood fan. I also love how these films are often spoken partially in Hindi and often more than half in English, so I am able to enjoy the film without spending too much time reading the subtitles.\n\nAmerica, watch this film; you will not be disappointed."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "salex-25670",
        "review_rating": "1",
        "review_title": "2 hours from very very big lies",
        "review_detailed_main": "In fact I don't like Iraq but always we like the truth, This movie is empty from truth, Iraqi forces did not kill people like that, I'm Saudi and I know what happened, It was full of lies."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "chandansarangi",
        "review_rating": "10",
        "review_title": "Finally a movie to compete with Hollywood...",
        "review_detailed_main": "It hardly happens in a bollywood movie when the viewer has goosebumps throughout the movie.Nail biting thriller. The setting , plot , direction all were awesome.. .Really , This movie uplifts Indian film industry status throughout the world. The entire cast .. guys you were all amazing.. Finally, Akshay ..you are truly the boss of bollywood..Salute to your choice of movies. Holiday,Baby, Gabbar is back, Brothers.. Your movies always have some x-factor in them. You don't worry if you would get the best actor award for your movie. You do your best. You Are the BEST !!! Hoping to get a nomination in the Oscars. at least as a foreign language film !!!"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "graviravinder",
        "review_rating": "9",
        "review_title": "The taut script is the highlight",
        "review_detailed_main": "It could have been an all-out action movie with all the usual Akshay Kumar moves. But here's a script that describes aided by a background and the story concisely and clearly - - the oil politics, the national politics, the reluctance of the External Affairs Ministry to get involved, the migrant experience, the rich-poor divide even amongst Indian expats. And the story keeps moving, maintaining the tension (even though every Indian knows the outcome). There are some moments of biting humour was well. Akshay Kumar respects this script in a nuanced performance supported by Belawadi, Mishra and Inaamul Haq. As for Director Menon (is he a rookie?), superb job. Some favourite moments have been mentioned by others. But see how Menon handles this 5-second bit. The airlift pilots (from Air- India) briskly walk into the aircraft; the rescued passengers already seated watch them come in. They break into applause by way of thanks. The (volunteer) pilots stop, surprised, and then their faces light up when they realise what the passengers are conveying to them. No words, just applause, all in just 5 seconds. And a lump in my throat."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "rashmi1230",
        "review_rating": "9",
        "review_title": "A must watch and a great Republic Day Treat",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "ashishbhandari",
        "review_rating": "10",
        "review_title": "If you are a true Indian just go & see this..masterpiece..no one can beat this man!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "koustavavc",
        "review_rating": "8",
        "review_title": "Hidden truth unfolded with best performance. Deserves standing ovation",
        "review_detailed_main": "Being an Indian it's hard to accept that such a large scale evacuation in the history done by an Indians were not publicized in the past. If you are a true Indian then you will be proud of yourself being an Indian. The true story finally been revealed by medium of a film AIRLIFT. A very different genre with such a detailed researched and well performed is nothing less than a gift for REPUBLIC DAY weekend. The film is so perfect that it's really hard to tell from where the appreciation should be start. At the end of 130 minutes all you can do is to stand on your feet and give a loud applaud.\n\nRAJA MENON: Director Raja Menon has to be thanked to bring out such a wonderful story. His sincere effort will help you to visualized the real incident that happened in the time of GULF WAR. The kind of effort he made in research and later jot down his whole research into a paper in form of a movie is appreciable. His direction will definitely make you realize what the AIRLIFT is all about and why AIRLIFT happened. Starting from the scratch to the end of movie his crystal clear visualization skill is definitely felt about. Hats off Raja.\n\nAKSHAY KUMAR: There is no other actor who can perfectly suite this this character. Out of his comfort zone Akshay accepted the challenge and he delivered his best in the movie. His acting definitely reveals that before screen test and other pre-production works he too did detail research about the incident occurred in the past. His bold appearances, emotional involvement and dialogue delivery was better than the best. He proves at every second that why his name is KHILADI KUMAR.\n\nNIMRAT KAUR: She was absolutely stunning to the amount of role she had to play in this movie. In past she was well appreciated for her role in the movie LUNCH BOX. Her second film in her carrier was nevertheless was far more deserving because she was no less than Akshay in this film. She deserves an applaud.\n\nPURAB KOHLI: Though his character is a kind of supporting role but he delivered the best. For me this was his best movie in his carrier.\n\nThere are certain lacking in the film. Unnecessary songs included, climax was too short thus suspense doesn't end well. The film could have been made a little longer to provide best climax.\n\nFinally the film deserves standing ovation in all aspects. Outstanding.."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "binducherungath",
        "review_rating": "8",
        "review_title": "Raja Krishna Menon's Airlift is a tribute to the human spirits which finds path even amidst turbulence, gears up courage in spite of losing everything.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "amitashb803",
        "review_rating": "5",
        "review_title": "Highly fictional & melodramatic depiction of a true story.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "user-902-747362",
        "review_rating": "9",
        "review_title": "It's a must watch!!",
        "review_detailed_main": "Incredible! It's a must watch for all Indians. The director has crafted the movie very well & has not wasted with unnecessary things so is won't feel like a drag. He introduced the character Ranjit Katyal and has gone ahead with the main theme. Direction, acting, background score everything is at par. Akshay is excellent, it is one of his best movies. Nimrat Kaur has also done very well. All supporting characters have contributed well. Salutes to the spirit and the grit of Ranjit Katyal to get so many Indians home. During the climax, entire crowd in the movie hall felt ecstatic. Since it is a real story, my salutes to the real heroes too!"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "Pramitheus",
        "review_rating": "9",
        "review_title": "Hope in the darkest hours",
        "review_detailed_main": "Very few Bollywood movies are as moving and stirring as Airlift. Due to Akshay Kumar movies like this are seeing the light of the day and are getting the publicity which is necessary for these kind of non-commercial movies. I am reducing one star from this movie only because of the songs. Bollywood's love of songs are very harmful to a serious movie, and in this case, a documentary. Real life doesn't have any songs and documentaries should also be treated the same so that we don't snap out of the serious moments in the movies.\n\nThe movie is pretty much flawless. Akshay Kumar immerses himself completely into the character. Every year he makes one such movie which begs you to ask him personally that why does he make all those mindless comedies which have no cinematic value. If you rate him on the basis of his commercial movies you will definitely rate him a 3/10. Then he comes up with a \"Special 26\" or \"Baby\" and you are completely thrown off-balance. He lets go of all his mannerisms and digs deep and gives such a convincing performance. Actors like Nimrat Kaur, Poorab Kohli or Kumud Mishra are completely in their zone and are almost taken for granted that they are going to do well and they do well.\n\nThe direction is flawless. The CGI in the war affected areas are used aptly. Often producers go cheap on small scenes like that and they take you out of the moment because you start searching for the flaws. The director Raja Menon, didn't go for much gore or display of devastation. Instead he trusted his actors to portray the helplessness through their performance. The work of the Indian Government has been both sneered and praised. It is almost like a wake-up call for the Government to do their job by citing an incident which had occurred 26 years ago. It is a wake-up call to humanity in general, showing us that even though evolution has made us smart and technologically advanced but what do we become during times of desperation. This movie shows us that there is hope during the darkest times and also that there is hope for Indian cinema to come out of the trend of commercial movies because the audience is maturing."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "tonymeads",
        "review_rating": "10",
        "review_title": "Hate subtitles......but",
        "review_detailed_main": "This was an excellent movie and i really don't care to read subtitles but this movie just kept my attention and before i knew it the movie was over,\n\nThis is a very timely movie right now, as my country a beacon of freedom and hope for refugees has been forced to turn her back on refugees facing much worse than these folks caught in Kuwait,because of a scared and hateful segment of our population who voted for a disgusting man{CHEETO}.\n\nRecommend the haters who are blocking refugees to our country watch this movie and maybe it will soften their hearts."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "bhajgovindam",
        "review_rating": "10",
        "review_title": "Great movie",
        "review_detailed_main": "Airlift is a 2016 Indian war thriller film directed by Raja Krishna Menon, starring Akshay Kumar and Nimrat Kaur.[4] The script, written by Raja Krishna Menon developed the idea after studying the whole incident of the war, and which he subsequently expanded. The film follows Ranjit Katyal (Akshay Kumar), a Kuwait- based businessman, as he carries out the evacuation of Indians based in Kuwait during the Invasion of Kuwait by Saddam Hussein's Iraq.[5][6]\n\nWith a budget of ₹300 million (US$4.5 million), the film premiered worldwide on 22 January 2016. The marketing of the film played an important role in the film's promotion and collaborated with the flight company Air India, who had a major contribution in the evacuation of record- breaking number of Indians during the war. I have now start finding great movies on www.flickstree.com. It not only suggests great movies to watch, it also tells where you can watch the movie online... Highly recommended."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "vermasp-81789",
        "review_rating": "9",
        "review_title": "Proud to be an Indian--- by Maharishi Verma",
        "review_detailed_main": "Now, I'm not going to tell you about the mistakes of this movie I'm going to tell you that what I liked in this movie.There is no need to discuss the plot because that is well-known.first thing which I like in this film is performances of actors , every actors in lead or supporting role have tried their best.Akshay Kumar has delivered a soul-full performance. He goes into the depth of his character and what we get is the best performance of Akshay's career.Nimrat also does her best .The other supporting cast including Purab Kohli does justice to their roles.Raja Menon ,the director, has successfully evolved the human drama in this war- thriller.But there is another plus point which is the songs which are brilliantly written.The cinematography is awesome and same for the VFXs.This is a movie which will be remembered as a classic, for its effort ,especially for AKSHAY KUMAR."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "bajaj-sahil",
        "review_rating": "9",
        "review_title": "A Rare Subject to find a movie from Bollywood",
        "review_detailed_main": "It is rare to find a movie on such subjects from Bollywood. I rate it 10 on 10 just on that basis. To top it the plot has been developed well with a lot of characters thrown in to keep the plot interesting. The George and Ibrahim character for example. George is particularly interesting as he displays the typical Indian stereotype who are so fond of picking on others mistakes but will rarely do something on their own. It also shows how there are some very good people in the Indian bureaucracy because of which things still move. I would love to see another movie on the Yemen evacuation. I would recommend this just on the basis on the subject on which this movie has been made."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "lediscipledessocrates",
        "review_rating": "2",
        "review_title": "Fraudulent, Unimpressive and Lame",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "amitkray",
        "review_rating": "10",
        "review_title": "Well written Script and excellent performance by actors",
        "review_detailed_main": "This movie is must watch movie and much better then the recently released movies which wasted my time. This is based on a true story how Iraq invaded Kuwait. The best acting was by Inaamullhaq (The Iraqi Major). Akshay as usual was excellent and Nimrat kaur too. A movie cannot be successful if a single actor does any mistake. In this film everyone acted perfectly. Indian Airlines did more then 400 trips to evacuate the entire 1.7 lakh Indian population. Best part was they could even save some kuwaitis in the act. It also showed that we had good relationship with all the Saudi countries including Iraq. Without the permission of Iraq it was impossible for Indians to escape that place. This shows why we should have good relationship with other countries."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "superindrajit",
        "review_rating": "9",
        "review_title": "Another meaningful Akshay Kumar movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "rakshits",
        "review_rating": "9",
        "review_title": "Akshay Kumar is simply amazing He's the Best",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "pawanfeverbaba",
        "review_rating": "10",
        "review_title": "The equivalent of Shawshank redemption and schindlers list of Ibdia",
        "review_detailed_main": "Some thoughts on airlift:\n\nI don't remember a movie that moved me to this extent in the longest time. We saw war thrillers like madras cafe which dealt with it only on political level . airlift deals with it at both political and human level yet never goes filmy or remotely unrealistic. Its a proper docudrama . The journey of akshay in the movie is from a cynical selfish businessman to a man who starts caring for even a Kuwaiti woman. His gradual transformation from murder of his driver to the last flight of air India is touching and inspiring. Nimrat kaur as his wife is excellent and shows how underrated she is in bw. Supporting cast is equally great. Director Menon has proved his worth whether it's story or direction. The way he has covered the human emotions in such a movie is commendable. At the end when Jordan airport staff hoists the Indian flag you get goosebumps that stays with you long after you leave the hall. The end credits nearly made me cry again. It is difficult to believe that ppl like these existed and did what they did.\n\nAirlift at the end is not a film but an experience that everyone must get."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "dr-sucharitaray",
        "review_rating": "10",
        "review_title": "Uplifting storytelling about the humanity that lives in all of us",
        "review_detailed_main": "This was my first movie hall experience for an Akshay Kumar movie. For a long time, I have watched his movies months and maybe years after they have released. As a disinterested Bollywood fan ( largely for the churners that are belted out like the irritating Dilwale, the hypocritical PK and god knows how many KJ productions that Indian audiences are made to go through ) AK has been coming of age.\n\nThis movie is based on a huge truth of Indian history, the story trifles the Government of India ( the erstwhile 'unstable' government, as the movie says but the truth was not that, GOI had a huge contribution for the evacuation of those who were trapped...but anyways) and the Civil Aviation ( who apparently were reluctant to go to a warzone initially, without them it would have never been possible ). Neither of these took any credit, and a Kuwaiti Indian origin business tycoon who thought of Kuwait as his motherland till the invasion, is a faceless nameless man till date.\n\nTruths aside, (which will dampen the expectations of the larger audience in India, still expecting AK to give karate chops to ? Saddam Hussein ??? ), the story is a fine attempt to move into reality. I had friends asking for action scenes, but this s real life, where a person can only go so far as a punch or a slap. AK is restrained. He does not do the best acting ( I still think Sangharsh was his best acted out perhaps) but the situations are compelling. And he is refreshingly subdued.\n\nThe invasion by Iraqi troops seems outright realistic ( and you are forced to forgive the pseudoiraqi general and AK's Punjabi tinged Arabic) Nimraat Kaur plays the wife that tycoons perhaps have to bear, sophisticated and ill with the largesse until jolted into truth by her husband's about turn. And what a graceful way she does it..\n\nA bit more of the truth about Indian Governemnt and Civil Aviation could have helped. But who knows, maybe the writer hates the last 60 years of Indian Democracy as much as ranjit Katyal and the majority of Indians do.\n\nNo wonder the bigger tigers of the Industry are panning the cinema. This is a kind of movie very few people living in our country will rise up for. i do not know if this movie will also win any awards, the technicalities are also a bit loose here and there.\n\nTaking the last line from a previously mentioned comment, and also a big thank you to the pilots of all those aircrafts who flew 1,70,000 people, and a foreign minister of the unstable government who chatted Saddam Hussein in the face of International sanctions. A beautiful tribute to the most beautiful flag in the world. A must know, must see without prejudices.\n\nJai Hind"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "steffycyril",
        "review_rating": "9",
        "review_title": "review",
        "review_detailed_main": "Airlift is one of the must watch movies.First of all it is a true incident.There are a lot of survivors helped by him and many people who are thankful for him. Many characters are appropriate and some scenes are admirable.I feel there should be more films in this genre. The heroine also is very wonderful.As the plot thickens,their love and care increases.The songs are much needed and important in the movie. It will inspire us to do something for the nation.The way he handles the situation is also good. The scenery is also depicted and things of that era are bought up wonderfully.The love for the baby is also bought here.The dialogues of heroine act to the humour."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "namashi_1",
        "review_rating": "5",
        "review_title": "Sincere, But Never Power-Packed!",
        "review_detailed_main": "Based on a courageous true-story, 'Airlift sadly isn't half as powerful as its story actually is. Director Raja Krishna Menon delivers a sincere tale, but the Writing lacks the sharpness & the urgency a film like this strongly needs. It only appeals in parts, that's it!\n\n'Airlift' Synopsis: Ranjit Katyal (Akshay Kumar), a Kuwait-based businessman, carries out a biggest civil operation of evacuation of Indians based in Kuwait during the Iraq-Kuwait war carried out during the reign of Iraqi emperor Saddam Hussein.\n\n'Airlift' is about a man's struggle to protect his people in the middle of a war-zone. But, for some odd reason, there is barely any tension in the film. Raja Krishna Menon, Suresh Nair, Rahul Nangia & Ritesh Shah's Screenplay is a mixed bag. It begins superbly, but 30-minutes into the film, the pace drops. I wasn't tensed or aghast by the way the war erupts nor was I particularly rooting for the Protagonist in his mission. And its the Writing to blame. Also, The first-hour moves on a slow-pace & the story doesn't move forward. The second-hour picks up momentum & fares better in comparison. But overall, 'Airlift' never soars! The Writing needed to be stronger & more urgent.\n\nRaja Krishna Menon's Direction is decent. Cinematography is gritty & nicely mounted. Editing is mostly crisp, although the first-hour is slow-paced! Art & Costume Design are average. Action-Sequences are raw & rustic. Background Score is top-class.\n\nPerformance-Wise: Akshay Kumar delivers a committed performance, enacting the heroic protagonist with honesty. Its his performance that acts as a major plus point to this otherwise ordinary film. Nimrat Kaur is okay. Purab Kohli is very good. Kumud Mishra is terrific, as always. Inaamulhaq & Prakash Belawadi ham it up in supporting roles.\n\nOn the whole, 'Airlift' works in parts. A great opportunity, lost!"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "skavitajoshi-80875",
        "review_rating": "10",
        "review_title": "Excellent!!! Top movie of 2016 (10/10)",
        "review_detailed_main": "Airlift!!! What a movie...what a patriotism...excellent Akshay Kumar and Nimrat Kaur The movie is superb or we can say excellent. Akshay Kumar has proved himself that he can do any kind of films let it be comedy, action or patriotic. Akshay Kumar as of always a very good actor. Nimrat Kaur was also good at many parts. Top emotions, top songs and top acting by the whole star-cast of the movie. It is based on a reality of the year 1990, when Iraq invaded Kuwait city and were killing the innocent lives. The movie is short and sweet of 2 hrs and 5 mins and is very enjoyable. The people loved it a lot after the release. The songs are superb with a bit of good music. The first part is based on the invasion of Iraq on the Kuwait city and is short and sweet. People will love it very much. The second part after the intermission is based on the evacuation of 1,50,000 Indians from the invaded Kuwait city by a true patriot Ranjit Katial (Akshay Kumar). The best part of the movie is its simplicity and swift flowing. The climax is great. The song \"Tu Bhoola Jise\" created goosebumps in the whole body when Ranjit realizes the importance of India and Tiranga. What a perfect 26th January entertainer patriotic movie. Hats off Akshay Kumar. You will love the movie do not matter how many times you watch. A superb Action/Emotion/Patriotic thriller of the year. I will give 10/10 for AIRLIFT JAI HIND!!! JAI BHARAT!!!"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "adityachandane",
        "review_rating": "8",
        "review_title": "Absolutely Honest Airlift Review!",
        "review_detailed_main": "Yes, it is among those movies you have to watch before you die. It is this movie that makes one cry during the last scene. The song Tu Bhoola Jise easily reminds one of his thoughts on leaving India to have a better future. It pricks a needle straight in the heart and the blood gushes out in form of tears. Airlift was the biggest operation of it's kind till date so a big applause to India & it's government. But, it was India's duty to rescue it's refugees. The movie portrays the exact situation of a government office. Today, we made this movie because it was a big thing for us whereas it was the mandatory duty of the government. The hardships made by Ranjit Katiyal with Akshay Kumar's heart-stealing out-of-this-world million-dollar performance make every penny you pay worthy of itself."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "manikagarwal2",
        "review_rating": "8",
        "review_title": "its all about being akshay",
        "review_detailed_main": "I have never been a fan of akshay with his so works including only action & commando roles, but one must see this flick to actually witness the macho man deliver an act of his life..be it his eyes, his mannerisms or simply his anguish or frustration, it all is one hell of a work & simply outstanding... also praiseworthy is the fact that the production house had the guts to take upon this forgotten piece of history 7 bring it alive on celluloid with being known to all that there have not been many movies in India similar to this.. Plus to the team for keeping the tension up & not making the script bogged down by too much of melodrama.. It does make me proud to be an Indian , a sure watch..."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "madhurkhanna94",
        "review_rating": "8",
        "review_title": "Airlift shows you absolute truth but still manages to inspire patriotic feelings",
        "review_detailed_main": "Airlift is not a very thrilling movie. What it is, is a crisp depiction of true incidents which make you respect the character of Ranjit Katyal in the movie. A successful man, who was righteous and moral at the right time. Nimrat Kaur plays the role of a rich man's wife and aristocratic mother with great conviction. The depiction of the whole scenario is so real, that the realism leaves you gasping. The supporting actors have done a wonderful job with Purab Kohli playing a very likable Ibrahim. The action of India during that time was indeed heroic, but the good part is the movie doesn't actually overdo it, and induces a patriotic feeling in a subtle manner with minimum drama. Overall, AIRLIFT is a must watch one-time watch movie."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "hanumantpatiljagtap",
        "review_rating": "9",
        "review_title": "Must Watch. The untold story of the biggest evacuation ever.",
        "review_detailed_main": "AIRLIFT, what an incredible movie. Raja Krishna Menon has efficaciously presented the biggest evacuation ever.\n\nAkshay Kumar delivers a power-packed performance. Ranjit Katyal is undoubtedly his best performance ever. I wonder why does he do movies like Tees Maar Khan and Singh is Bling, when he can make movies like AIRLIFT ,Baby and win our hearts. Nimrat Kaur is equally hot and talented. I am her fan now. She plays her character with such an ease and finesse, that you start wondering if she actually is like her character in real life. I wish she starts doing more movies now. Not just the lead cast, even the supporting cast has done a brilliant job. Special mention to Innamulhaq who has played an Iraqi major and Prakash Belawadi who plays a not-so-common man.\n\nRaja Krishna Menon, the director deserves an applause for making such an amazing movie and also for sticking to the reality and not making AIRLIFT a typical bollywood one. I, however was expecting a more impactful climax, but I guess for that the director had to move a bit from reality which would have diluted the essence of the movie. So, I won't complain about it.\n\nThe background music, the songs (Soch na sake) , the screenplay everything is perfect.\n\nThis movie has to be in your MUST WATCH list. This movie shows that patriotism runs in our blood, no matter which part of the world we settle in."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "sgupta001-817-774557",
        "review_rating": "8",
        "review_title": "An Excellent Masterpiece",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "OnjiMooteDaMarle",
        "review_rating": "5",
        "review_title": "Unfortunately, just another Bollywood film",
        "review_detailed_main": "Akshay Kumar was present for commercial purpose only. Nimrat Kaur doesn't impress as she had done a fine job in one of her previous film \"The Lunch Box\". Inaamulhaq playing Major Khalaf Bin Zayd is a good actor, but he doesn't seem convincing. His character feels like that of a jester. Making it a complete Bollywood film, the songs are an irritating lot. The screenplay was very simple and the character Ranjit played by Akshay had no major conflict as the road is clear for Ranjit at all times. There was no heart pounding moments which was a must for a film on rescue operation in foreign soil. Yes, it is based on a true story, but they do specify about the creative liberties taken, in the beginning of the film, so they could have been more creative without playing with the incident that happened. It is unfortunate that Ben Affleck made Argo. If he didn't, then Airlift would have at least been quite an average Bollywood film. For now, it isn't."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "oct-20388",
        "review_rating": "9",
        "review_title": "Gr8 movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "dubeyandy",
        "review_rating": "8",
        "review_title": "Airlift is a movie which sets high standards in Bollywood",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "chiranjivmalla",
        "review_rating": "8",
        "review_title": "#Airlift: Lifted the bar !",
        "review_detailed_main": "When I heard about Airlift movie that it is based on true events, I didn't know anything about those incidents. But then I googled & wiki'd about it and after sometimes I came to know that it is world's largest human evacuation performed ever. Since then my curiosity towards this movie has increased. Then I watched theatrical trailer of the movie and I was very much impressed. After watching the film, I was completely overwhelmed and totally it has reached the expectations.\n\nThe plot revolves around Iraq's Kuwait invasion which happened in August,1990. The movie shows how things changed overnight for all the 1,70,000 Indians settled in Kuwait as well as all other people in Kuwait.\n\nA wealthy and influential Kuwaiti-Indian businessman Mr. Ranjit Katyal is brilliantly played by Akshay Kumar. He has delivered a power- packed performance in it. It is just one man show and he steals the show. No doubt, this man is the most talented star of Bollywood and sadly as I mentioned earlier, he makes only 1-2 good movies per year but rest all are just shitty films. Nimrat kaur has done a excellent job in her role. Looks like she prefers performance oriented roles rather than those fashion or chick flick roles.\n\nRaja Krishna Menon, Director of this film, has done an intricate research on this incident and presented it very well on the screen. Screenplay has little resemblance with the movie 'Hotel Rwanda\", the way Akshay Kumar handles it to save all the Indians by arranging a camp in a school. But no one bothers about it, this film has its own identity because this is also a true story. There are many others that this movie will offer.. cinematography, background score, music -- all are really praiseworthy.\n\nIt is truly a must-watch for everyone. Basically making a big budget film with some senseless story & scenes will be become a boring film only, but making a compelling film like this can win awards. Indian film industry takes a step forward to educate or enlighten the people(like me ;) ) by making films on true events like this. Take a bow Team!. Despite this film has an offbeat appeal but the engaging screenplay in it will never make you bored.\n\n#ChiruReviews #Airlift"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "amitmardi-02904",
        "review_rating": "10",
        "review_title": "Great Movie",
        "review_detailed_main": "Airlift is surely a masterpiece. Probably best movie of Akshay Kumar. Great direction & performance."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "yunusitboss",
        "review_rating": "10",
        "review_title": "Airlift (U/A) Hindi ------------ my Rating: ★★★★★ WORTH WATCHING",
        "review_detailed_main": "New movie Reviews and lots more Hot news .... LIKE THIS PAGE : English Hindi TAMIL TELUGU Facebook : Movie Review by Yunus Irshad https://www.facebook.com/YunusIrshadsMovieReview\n\nAirlift (U/A) Hindi ------------ my Rating: ★★★★★ WORTH WATCHING\n\nSTRENGTHS:- * Story: based on true events well scripted.... * Casting and performances were mind blowing.... * Screenplay was gripping second half was seat edge... * Music: some good songs to hear.... * Dialogues were very meaningful and punching....\n\nFINAL VERDICT:- * Overall... it is a clean family entertainer, akshay delivers a perfect movie for republic day. I cannot see any weaknesses, each and every scene were realistic and very gripping. I salute and I strongly recommend to watch this movie. Please watch this flick and it must be celebrated.\n\nWhen Iraq invades Kuwait in August, 1990, a callous Indian businessman becomes the spokesperson for more than 170,000 stranded countrymen. Director: Raja Menon Writers: Ritesh Shah, Suresh Nair | 2 more credits » Stars: Nimrat Kaur, Akshay Kumar, Sameer Ali Khan | See full cast & crew »"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "madhuriswadia",
        "review_rating": "10",
        "review_title": "A nice entertaining movie",
        "review_detailed_main": "The story line is very good. It is a complete family entertainer."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "dabanggk-86503",
        "review_rating": "1",
        "review_title": "Dissapointed",
        "review_detailed_main": "Worst performance by actors in the movie not recommended."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "anuragkr",
        "review_rating": "10",
        "review_title": "An Epic Movie Going By The Standards Of BOLLYWOOD !!!",
        "review_detailed_main": "AIRLIFT- directed by raja menon is a perfect example of what bollywood can achieve if it tries.Guys a must watch movie for all peoples we are always watching Hollywood movie and think they are awesome and if u want a Indian heroism story so go and watch airlift best performance by akshay and nimrat and other star cast \"Some stories *should* be told. #Airlift sheds light on the evacuation of Indians in Kuwait after the invasion by Iraq.. a gripping plot,awesome acting by both the lead pairs and supporting cast,highly realistic,and near perfect direction..is what makes this thriller a must watch movie..for all the cinema lovers. akshay kumar rocks with his brilliant acting and the emotions he displays is simply great..backed up by the beautiful nimrat kaur..she too has done a perfect role of a wife and mother. other supporting cast including purab kohli kept their performances upto the mark .. this movie is not boring in any part and the story line will keep you glued to your seats. the climax of the movie will make you stand up from your seat and clap for it will make you feel special to be an \"INDIAN\". hats off@Akshay sir and the whole crew of AIRLIFT. and of course \"170000 Indians, 488 flights, 59 days, 1 man ! World's largest human evacuation performed by India !! A must-watch for everyone...!!!\""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "ankitb-09911",
        "review_rating": "10",
        "review_title": "Excellent movie ever :D",
        "review_detailed_main": "Fastrack, no love story, very straight forward and mature movie especially for Indians.\n\nOnly one religion and that is HUMANITY. One man army, took all the responsibilities and makes fastest decisions :)\n\nAwesome role of Akshay Kumar with less dialogues, just follow the Karma unconditionally.\n\nMovie must go for Oscar nomination. Social awareness to make unity to solve any impossible problems.\n\nGovernment must release it tax free.\n\nOnce again Akshay proved his best. Excellent start of 2016. Hats off, Cheers :D"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "inderjeet-bawra-bishnoi",
        "review_rating": "9",
        "review_title": "Airlift - The Best Movie Of Bollywood",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "ranvijaysinghrajawat",
        "review_rating": "10",
        "review_title": "A perfect patriotic thriller",
        "review_detailed_main": "This movie is beyond awesome.every indian should love it and proud of this movie. akshay is awesome in intense role."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "amantongia",
        "review_rating": "10",
        "review_title": "No Indian should miss out on this",
        "review_detailed_main": "Excellent movie.The best movie of akshay kumar by far.It brings out the Indian in you.A story of evacuation of 2 lakh people led by one man is not easy to direct,but this was directed with shear perfection.The songs were heart touching and bring out tears from your eyes.It is a perfect family thriller which does not let you take your eyes off for a moment.It is entertaining,gripping,touching and all the good words you can think in this world.The relations have been brilliantly shown,be it the father daughter relationship, a husband wife relationship and yes a country and her relationship with her children.Its a movie worth your money.No Indian should miss out on this.And yes,you might want to take a tissue with you.Jai Hind,Jai Bharat.!!!"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "joejames-06183",
        "review_rating": "5",
        "review_title": "Proud of my country but the movie isn't great at all..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "jmoneyjohal",
        "review_rating": "10",
        "review_title": "A patriotic cinematic gem, that has one of Akshay Kumar's best performances till date.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "nitin-65872",
        "review_rating": "10",
        "review_title": "Must Watch Movie",
        "review_detailed_main": "just watched #airlift, only saying is outstanding movie and marvelous acting by akshay and nimrat. feeling patriotism feel. its another hit by baby, holiday, gabbar nd special 26. keep doing movie like this justtt mind blowing....... story about ranjit Katiyal the unknow hero of this operation is faboulus, tried hard and succeed in saving thousands of life of their countymen. Nation is proud of him for this evacuation in Argo 4 or 5 persons are rescued but in airlift more than 170000 people are rescued. It also has the ability to win 1st Oscar for India for best movie. lets see the box office collections are same as the critics reviews just as awesome and outstanding. just go and eatch it.... best republic day release movie"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "ThisIsJammy",
        "review_rating": "9",
        "review_title": "Masterpiece making leads to a epic film.",
        "review_detailed_main": "I can vouch you that this film is surely the Indian version of 'Schindler's List'. *Proud me* The best thing about a film is 'The emotion in art'. No other form of art, be it books or paintings can shows the real emotions that films can do. When that art meets 'the best of history' the word 'epic' gets the right meaning and this film is one such epic.\n\nThe film follows Ranjit Katyal (Akshay Kumar), a Kuwait-based businessman, as he carries out the evacuation of 170,000 Indians based in Kuwait , the Invasion of Kuwait by Saddam Hussein's Iraq and believe me, the movie follows NOTHING ELSE than the plot (Pun intended).\n\nBig salute to the director of the film Raja Krishna Menon for keeping the film damn straight from the start. There are no plot twists, there is no sudden unwanted songs and the director only focuses on the emotions in the plot, which indeed makes you love the film. With such directing talent in hand and running time just 125 minutes, my greed for more characters and deep characterization's's has no bounds.\n\nThe Bollywood film industry is back to its old ways and with films like Bajirao Mastani, Neerja, Airlift and Fan, my love for the Hindi films has increased."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "sanjay-26251",
        "review_rating": "10",
        "review_title": "my best movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "p-recoverer",
        "review_rating": "10",
        "review_title": "\"Airlift\" is a Masterpiece, Brilliance & one of a Kind. 5/5",
        "review_detailed_main": "As we all know by now that India carried out the Greatest Human Evacuation in History saving more than 170000 Indians with 488 flights in 59 days. An Operation such as this in itself is a Proud moment for Indians no doubt and to justify its recreation on Big Cinema is no less than a Challenge. It not only accepts the challenge but stands out on par with the best of the best Hollywood movies ever made based on true events. I can proudly say that \"Airlift\" is one of the Greatest Movie I have ever seen in Hindi Cinema and it would be in my list of top 10 Movies of All Time.\n\nThe scenes directed by Menon in Airlift after Iraq invaded Kuwait are as real as they can get. First 20 minutes are absolutely The Best 20 minutes you will ever see in Indian Cinema. The cinematography is one of the Best; indeed, it changes the whole dimension of Indian audience's perspectives. The movie is visually rich and enchanting, looks as though shot on a very high budget with stunning artistic works on war, invasion and Crisis.\n\nThe husband and wife's relation depicted in the beginning of this movie is exactly the same as seen in many usual couples. They love each other but they do argue sarcastically every now and then which is bit irritating for the present audience.\n\nThere are so many Excellent scenes in the movie that it becomes difficult to choose one. The creativeness in recreation of invaded Kuwait is purely Genius's work of Art. Salute to him as he made it look like a real event caught on documentary, Unbelievable.\n\nI was never so much inspired by any movie such as this. This is a Landmark movie in Bollwood which should only inspire the creation of many more such movies in coming years.\n\nNimrat did her job with utmost honesty & sincerity to the character without looking for any credit for her character in the movie. Her argument with Prakash Belawadi was Fantabulous and Spontaneous.\n\nI would definitely applaud Prakash Belawadi as he was kind of smile in between on the saddest and darkest faces. Purab Kohli was brilliant in his short act. It's remarkable that these two guys made an impact in 10-15 Min's of screen time with impeccable their performances.\n\nThis is Akshay Kumar's Best Movie ever and his Best Performance in his Entire Career. He has gained huge respect from me doing this movie and I am sure from many other Audiences as well. Henceforth I will always look forth to his upcoming movies as he has turned the tide in his favor by delivering better & better movies every year consistently.\n\nI never remained in a theatre till the end credits roll on, I use to walk away to avoid rush but this time my family and 3 other Indian families in theatre remained till the last credit rolls were up. (last three as I watched this movie in its third week's weekday). The Vande Mataram Chant dispensed electrifying Goosebumps all over the body and they remained till I walked out of theatre. The last song is so beautiful, sentimental and patriotic that you yearn for more even after it stops playing. A huge respect for Akshay Kumar and Raja Menon from me, simply Awesome.\n\nAll in all, \"Airlift\" is a Masterpiece, Brilliance & one of a Kind. 5/5"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "ibawra-59289",
        "review_rating": "10",
        "review_title": "Airlift Most Heroic Mission Of India",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "gateway_909",
        "review_rating": "5",
        "review_title": "Don't expect too much. It's not a Baby or Argo!!",
        "review_detailed_main": "The plot had so much to offer but the makers were not able to capitalize on it. They just narrated how Indians were evacuated from Kuwait when it was invaded by Iraq. Performances, sets and camera work is first grade but the screenplay doesn't hold your attention. You never get tensed about the whole situation, can't remember if there were any edge of the seat moments. The movie was just not as intense as you expect when you go to watch a movie that deals with the backdrop of crisis during a war.\n\nBut still I would say it's good effort overall and deserves a watch. It will make you feel good about the country when there is so much negativity going around."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "othmanalamoudi4",
        "review_rating": "10",
        "review_title": "Akshay Kumar is best film till now",
        "review_detailed_main": "Airlift not just probable akshay kumar is best film but also one of the best bollywood I have ever seen I just liked every thing about this film be it the performances of the cast specially akki he has done tremendous work as Ranjit Katiyal also supporting cast is excellent be it Nimrat Kaur,Kumud Mishra,Purab Kohli or Prakash Belawadi all are good. the Direction is just perfect Raj K menon has done fantastic job the Screenplay and dialogue also perfectly done and makes the story even more thrilling. cinematography & background score, are also amazing. songs are also good and the last track Tu Bhoola Jise will make tears in your eyes. Airlift is not just patriotism Thriller film it is more human emotional film it is truly worth called as Masterpiece A Must Watch Film"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "atul-chavan",
        "review_rating": "10",
        "review_title": "Sureshot Blockbuster with full dose of Patriotism and Entertainment",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "sairallen",
        "review_rating": "9",
        "review_title": "Very nice!",
        "review_detailed_main": "It's a good patriotic film. Not perfect or excellent, but it's very nice. Akshay Kumar plays the role very well. Songs are also good. However having Nimrat Kaur as the wife would not be recommended by me, but I don't think any actresses in Bollywood would properly be able to play the role of Amrita Katyal either. I was born in Kuwait and lived there for the first 7 years of my life and the setting was a bit different from the real Kuwait, but that was in 1990 and I wasn't born at that time. May not be entirely based on the true event but I'm only looking at the event and the result, which is that India evacuates Kuwait and brings all the Indians safe to India, which did happen. Well done movie."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "nk13644",
        "review_rating": "10",
        "review_title": "Airlift movie review: Overall, Akshay Kumar's 'Airlift' is a good film, solidly plotted, well executed and well-acted.",
        "review_detailed_main": "The film is based on the real-life conflict and bloodshed that took place twenty five years back in Kuwait, and the way it is done—with a sense of urgency and immediacy, bringing alive a city over-run and under siege—sends out a crucial message to star-driven-yet-drivel-producing Bollywood. That given the backing of an A-list star, anything is possible: well done, Akshay Kumar, for donning the producer-with-conviction hat to create a crackling film.\n\nAnd another pat for the performance. Katyal is made believable because Akshay junks faux heroics for an unshowy heroism, which comes from a place of initial reluctance, seguing into a slow acceptance of the situation, and the gradual taking charge because there is no one else that can do the job. And brings his star power to lift the film, in much the same way Ben Affleck buoyed the Hollywood evacuation tale, 'Argo'."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "TheNonSmoker",
        "review_rating": "10",
        "review_title": "Highly Recommended 👍",
        "review_detailed_main": "Awesome movie, worth every bit of watch, the second airlift is presently happening here because of the c o v i d 1 9, Indian Government is evacuating almost 15K Indians from 12 different countries and with the help of 64+ Flights <3"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "faisalfaves",
        "review_rating": "9",
        "review_title": "I knew it, that just Akshay can do this role brilliantly",
        "review_detailed_main": "Just a few hours ago i watched this movie in Cinema at Karachi. 1st of all i am very disappointed that in Pakistan people mostly watch Indian movies, but if any movie from India is somehow patriotic then these Pakistani cinemas cut the scenes from movies.\n\nAnd let me say that this movie is very great example of being a human. You should always think about the people, whether they are from your nation or from other. I rate it 4.5/5. Background Music is very good, songs are nice. Scenes and camera work is good. Acting of whole cast is Awesome. Well-done!\n\nWe want more movies like this, simple and sensational."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "SquigglyCrunch",
        "review_rating": "4",
        "review_title": "I Forgot It an Hour After I Watched It",
        "review_detailed_main": "Airlift follows a man as he attempts to evacuate 170,000 Indians from Kuwait after the Iraqi invade in search of Kuwaitis to kill.\n\nTo start, I did not like this movie. At all. Maybe it's because its the first Bollywood movie I've seen and I'm not used to it, but I really just didn't enjoy it. There's this really weird scene at the beginning where the main character starts singing but it's so obvious that he's not. He can't even lip sync it well. And the voice of the singer is heavily auto-tuned, so it's super out of place and fake-looking and sounding. The rest of the music is all super upbeat and way out of place. There's no reason for any of the chosen music to be in the movie. Maybe that's just what Bollywood movies are like, but I don't care. It negatively affected the movie, so I don't see any reason to let it go simply because of the people behind the making of it.\n\nAlso this movie advertises itself as an action movie, and yet I recall one action scene towards the end, and its just a crappy fist fight. It was actually one of the worst looking fights I've ever seen. I've seen better fights in other foreign movies that advertise themselves as dramas. Yeah that's right. Movies that consist of almost nothing but talking have more exciting fights than the one in this 'action' movie.\n\nOn top of all that, the movie is boring. It moves at a slug's pace, and I really didn't find anything in this movie that could catch my attention. I've seen it all before, and it's extremely predictable.\n\nOverall I really didn't like Airlift. As I was trying to remember what I watched today I couldn't remember this movie. I even forgot to rate it on Netflix when I finished it. I just didn't care at all for it. In the end I wouldn't recommend this movie. It's a forgettable waste of 2 hours."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "fantabulous-99669",
        "review_rating": "10",
        "review_title": "Suspenseful and dramatic with a great story",
        "review_detailed_main": "Suspenseful and wonderful movie about a true story. Great movie from start to finish."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "anitakaur-16037",
        "review_rating": "10",
        "review_title": "Brilliant movie",
        "review_detailed_main": "Deserves 10 stars acted out perfectly. Lost for words it was executed out so brilliantly"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "rockinghrishabh",
        "review_rating": "10",
        "review_title": "Awesome movie",
        "review_detailed_main": "The story of biggest rescue operation of world where people stranded in the war zone were air lifted to safe place. A must watch for who likes a real life story."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "gurunathankrishnan",
        "review_rating": "8",
        "review_title": "Great act portrayed through great performances",
        "review_detailed_main": "One of the worlds largest aviation rescue mission till date gets carved in stone through a movie.\n\nIt goes back to 1990 when Iraq invaded Kuwait and 170000 Indians were stranded in Kuwait without job, safety, money or passports. The real life evacuation of these Indians have been conveyed through Ranjit Katiyal (Akshay Kumar) in the movie.\n\nIt's a two hour movie and it slowly moves into the plot where an Indian cynical business man slowly turns into a saviour of 170000 Indians. The characters have been established with some being interesting and some annoying, all essential for the story. The chemistry between Akshay and his wife slowly gets unraveled and that was heart warming.\n\nThe film relies heavily on Akshay Kumar who had been underplayed well without any heroism. The movie is more of an emotional drama which gives you a sense of satisfaction at the end of the movie more than entertainment. In fact, I saw that the entire theatre stayed till the credits to watch the actual pictures of the rescue mission. This is the actual success than amassing hundreds of crores. The movie also subtly highlighted the forgotten officials when the Minister takes the credit for the entire operation and the bureaucrat just smiles and goes back to work.\n\nSpecial mention to Akshay, who according to me, is the versatile actor of this era for choosing subjects like Special 26, Baby, Airlift etc. He dares when these do not fetch money or awards.\n\nBut hatsoff to all the real heroes who made this happen. 488 trips by Air India for 59 days evacuating 170,000 people is no mean task"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "akshayfan-83284",
        "review_rating": "10",
        "review_title": "Best Movie",
        "review_detailed_main": "One of the best movies I have ever seen. Probably Akshay Kumar's best performance ever. Highly recommended.A perfect movie."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "ironhorse_iv",
        "review_rating": "8",
        "review_title": "Airlift was a decent movie. Very uplifting.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "shubhamchowdhuri",
        "review_rating": "2",
        "review_title": "Good at times, Not so good at others....But an enjoyable movie for not so serious movie addicts......",
        "review_detailed_main": "When I saw airlift rating for the first time I was taken aback by its ratings and expected a cracking ride. But to be honest i was disappointed after coming out of the hall.For the good part Akshay Kumar's finest performance so far. Amazingly effective dialogue delivery except for some parts... Nimrat Kaur is also equally good if not more.... But the war scenes were not very effective. The script seemed a bit error ed in a few parts.. In terms of the movie it is good but I will have to say that the originality of the script is not up to the mark....The movie seems to have taken a page or two from Spielberg's epic Schindler's List and 2013 best picture Argo but not to good effect.... But if your going to enjoy, you will have a fun ride but going with too high expectations like I did will only disappointed you.....Good luck........"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "TheFirstExecutioner",
        "review_rating": "9",
        "review_title": "Great Bollywood Movie to Start the Year",
        "review_detailed_main": "Airlift was really good. It was at 9.7 at one point on IMDb and that's what made me want to watch it. The story was presented very well on the big screen and the acting was terrific. Akshay Kumar carried this movie and he knocked it out of the park. He nailed the callous businessman and the patriotic savior in the same movie and was a lot of fun to watch. Nimrat Kaur also is really good. The characters were written out so well, especially Mr. George. When Iraq invades Kuwait, you can feel the chaos in the city through the emotion on the actors' faces. I was surprised an Indian movie went so dark in some scenes. It really is a mature film. The atmosphere of the city felt just like Gotham in The Dark Knight Rises when Bane attacks. So a really good job with the cinematography.\n\nThe only real problem I had with the movie is it got a bit too dramatic at times. The songs were good by themselves, but some of them didn't really need to be in this movie, especially the first item song. Also it ends rather quick and I wanted to see a bit more. It's remarkably short for an Indian movie at only 2 hours and 10 minutes.\n\nAnyway, I really enjoyed Airlift and it is an excellent Bollywood film. It makes me feel proud to be an Indian. From A+ to F, Airlift gets an A."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "dhruvrahuja",
        "review_rating": "10",
        "review_title": "Excellent",
        "review_detailed_main": "Definitely a one time watch it loved it though it was a bit slow still is a very nice movie Akshays best Performance ever till date Nice direction Songs were fine Dialogues were amazing And it makes u proud of being an Indian as it's based on a real story My best movie till now U might hate if u prefer riot comedies like Housefull , Hera pheri etc But u will love it if u like serious movies like baby,special 26,Taalash etc. Akshay we need more movies like this not like Singh is bling Etc as u suit more in serious films Plz keep doing films like this Waiting. For. Rustom and guys I love this Akshay not the one doing comedy Riots so Akshay plz do better films"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "JarvisIndian",
        "review_rating": "8",
        "review_title": "Godlevel movie",
        "review_detailed_main": "Best acting of Akshay who is doing 5-6 films per year. But this movie is classical entertainer. Patriotic film"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "adimanav",
        "review_rating": "9",
        "review_title": "Super good movie ....Must watch",
        "review_detailed_main": "The movie start with a good set of direction, but the only thing i might spoil is the song in the starting 10 min. itself. except this the movie is straight forward and focus more on the main theme rather than hoopla. Really good movie and show the capability that now Indian audience can relate and understand real life movies. Also it focus the reality of the events. Even though they just manage to tie up all the events properly and thus sometimes the movie feel loosely knitted. Some characters will really annoy u in the starting but overall direction and casting of the movie is very good. The movie also change the way in which the movies are male. Now the audience is becoming more hungry for the real event movie, and this movie is yet another effort that Akshay Kumar took in this regard."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "dgourav",
        "review_rating": "9",
        "review_title": "Overall a masterpiece.",
        "review_detailed_main": "Excellent idea , excellent acting , excellent direction make this movie the highest IMDb rating movie of Bollywood till date. First to last an awesome thriller. Akshay Kumar again proved his ability.Nimrat Kaur also acted well on her character alongside with Akshay. The songs were perfectly used and were nice to listen. Inaamulhaq also acted well as Major Khalap. After Holiday , Baby , Gabbar is back Akshay again proved that he has born for this kind of films. Mindblowing idea by Raja Krishna Menon for making such kind of film . Few emotional scenes also felt us emotional. KK's Bandemataram as background song when the Indian flag was being hoisted in Jordon Airport touched the heart of every Indian. The cinema can easily claim as a Hollywood film. Overall a masterpiece."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "sanjidparvez",
        "review_rating": "9",
        "review_title": "India's own \"Schindler's List\"!",
        "review_detailed_main": "This is a magnificent effort by Indian cinema for finding & telling their own \"Schindler's List\" story. But other than a common businessman turning into an unlikely hero by saving thousands of innocent lives in a horrifying war setting, both Steven Spielberg's Oscar winning SCHINDLER'S LIST and Raja Menon's AIRLIFT basically have only one thing in common...the triumph of human spirit; a selfless individual's exemplary initiatives to come forward & rise to the occasion for the greatest cause of all during a very difficult time of war. Ironically both the films inspired by two separate true events and this tells us again that history not only repeat itself through bloody wars & countless human sufferings but also it recalls the very basic core of humanity as long as there are saviors like Oskar Schindler or Mathews & Vedi (inspired the character of Ranjit Katiyal in Airlift). Over the years, Indian cinema has developed a lot particularly in terms of production values and AIRLIFT is another shining example of that. Really liked the way they depicted the 1990s war torn Kuwait & the havoc on the streets demonstrated by Iraqi soldiers. The cast did a really good job in their respective roles and specially for Akshay Kumar, I believe AIRLIFT is going to seals his place in the history of Indian cinema like the way LAGAAN or SARFAROSH did for Amir Khan & SAWDES for SRK."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "salmanbabuji",
        "review_rating": "1",
        "review_title": "Ok film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "sunnyinsa93",
        "review_rating": "8",
        "review_title": "Airlift (a real based movie)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "rockvishnu-68301",
        "review_rating": "9",
        "review_title": "Best Evergreen Epic Film",
        "review_detailed_main": "This Story is based on true event's. Akshay kumar acting awesome. Music and Bgm epic style Super. Cinematography Awesome. Every Caracter also good performance.seat edged screen play,well written. The plot is adapted from real life story of a Kuwait-based Malayali businessman Mathunny Mathews.\n\nStory Point:-Successful businessman Ranjit Katiyala, an Indian expatriate from the 90's, lives happily with his family in Kuwait City. Unexpectedly a firefight broke out in Kuwait. The reason is that Iraq owes some money to Kuwait. In return, Iraq approves military force to invade Kuwait, kill the Kuwaiti people there and occupy the area. Then Ranjit wants to send his family somewhere far away from them. The rest of the Indians will be with them at the time of sending the whole family. The story of how he crossed the Iraqi army and moved the Indians and his family to India. So Don't miss it this movie."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "usama-someone",
        "review_rating": "10",
        "review_title": "This film is a must see for every good person of the world...",
        "review_detailed_main": "With 9.2 rating out of 10 by 20,081 educated and registered viewers of the film around the world at http://www.imdb.com/title/tt4387040/ (biggest films comments site in all languages with 65 million registered users from all countries) is one of best film of my life as a very rich man on very his own saved lives of about 125,000 Hindus, Indian Muslims and rest of other people by fully inserting his and his family lives in death's danger multiple times.\n\nIts latest Indian film Airlift in cinemas which I saw in best cinema of Pakistan Shabistan cinema in Lahore (www.supercinema.com.pk)...\n\nThis film is a must see for every good person of the world no matter from which religion he belongs to or belongs to no religion."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "sudhanshu-18277",
        "review_rating": "10",
        "review_title": "best movie of India",
        "review_detailed_main": "Every actor want that he should do at least one good film in his whole life time . And in Bollywood it is very difficult.\n\nBUT Akshay has made many such film . Quite a few year ago we all know that Akshay do only profit making movie which does not has any story but know he his known for all good movie he has done like holiday , special 26 , baby and now AIRLIFT.\n\nAirlift is brilliant movie . why ?\n\nbecause it shows what should be a movie . it show how cunning businessman Ranjit Katyal was , and after some time we find how he re transform himself .\n\nremember Ranjit Katyal not lost his intelligence but know he use this cunningness for his people.\n\ncharacter of Ranjit Katyal always impressed me . he show how human behaves , his fear and heroism.\n\ndoes you remember when Ranjit knew about Kuwaiti women he just don't became the SAVIOUR . he became frighten but his humanity covers this fear.\n\nNimrat Kaur again proved it that she alongside Kangana is one of perfect actress .\n\nstory was good , scene selection was good .\n\nthus movie became brilliant.\n\nnote :- some people are giving very less stars. yes , haters of Akshay are free to down-vote this movie but keep your reasons are quite known to all people. take side in politics not in movie ."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "aaradhyadixit",
        "review_rating": "10",
        "review_title": "Best Movie ever!!",
        "review_detailed_main": "This is a movie any Indian should not miss....What a movie.. Akshay is excellent...Nimrat is excellent..Direction is excellent...I was always critical of Indians and politics but after watching this, i am damn proud of being an India..what a movie...The best ever Indian movie..No Indian should miss this movie...This is worth watching..Indian's rocked it..Even the George's character was good...I loved it!! I can't stop watching it...This is inspirational!!Awesome...A Must watch thriller!! The film captures the story of the Indians stuck in Kuwait during that time, through the eyes of Ranjit Katiyal and a few other characters. Suggest all movie lovers to watch it..This is completely worth..Enjoy people!!"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "deewanaakkika",
        "review_rating": "10",
        "review_title": "Airlift is Masterpiece",
        "review_detailed_main": "One of the best Bollywood film I have ever seen. Akshay Kumar did a great job. What a performance. What a script. Cinematography, music all are perfect. Don't miss it.\n\nRecommended!"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "ctowyi",
        "review_rating": "5",
        "review_title": "Not convincing one-man show",
        "review_detailed_main": "The film follows Ranjit Katyal (Akshay Kumar), a Kuwait-based businessman, as he carries out the evacuation of Indians based in Kuwait during the Invasion of Kuwait by Saddam Hussein's Iraq.\n\nAkshay Kumar as the Indian Oskar Schindler? Sure. The guy has a very believable everyday man charm to pull this off. I love how he is portrayed from the start. Just like Liam Neeson in Schindler's List, he is no hero from the onset. He earns his way to being a hero as the story progresses. Katyal is a male chauvinist and a stubborn patriarch. But sad to say the movie just doesn't engage me in a deeper way. I find it so superficial and the whole story just maps out pre-determined emotional beats that I can see from a mile away. There are lots of missed opportunities here, like the character working in the ministry who steadfastly helps Katyal feels so under-developed. This can't be a heroic story of just one guy. How can it be?"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "Arahul1910",
        "review_rating": "10",
        "review_title": "India's SCHINDLER'S list",
        "review_detailed_main": "When I saw the movie, I didn't have much prior expectations from it due to recent track record of Akshay Kumar, but He wronged me this movie is damn awesome. Ranjit khatiyal can easily be now India's best heroic character for this ongoing decade.His transformation from an arrogant Businessman to a Savior reminded me of Oskar Schindler.This movie is truly a masterpiece for Indian Cinema , though it is not historically accurate but the haunting script, engaging screenplay and a stellar performance by Akshay Kumar and Kumud Mishra cover up for it. Coming to the performances as I earlier mentioned Akshay Kumar is the life of the movie, he carries the movie on his shoulder and it was not surprising as we all know he was supposed to do that. Apart from Akshay, Kumud Mishra is the second best thing in the movie, he underplays his character very well. Nimrat Kaur was as usual very good.In one of the scene where he lashes out a man for berating his husband, is simply wonderful. Purab Kohli didn't get much screen time but plays his part well. What the movie misses, is a strong villainous-character although Inaamulhaq offers some menacing dialogs in the film in so called \"Iraqi accent\" , he was not convincing enough. Direction by R.K men on was good. Final word \"A must watch\" for all Indians."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "aally_v",
        "review_rating": "9",
        "review_title": "Hats off to an Actor i couldn't once stand!",
        "review_detailed_main": "Akshay Kumar is some one i used to laugh at, and not because of his comedy.. Through the 90s when he was popular, he summed up bad acting and bad taste,. In the noughties he became a comedian and even more popular, still couldn't stand him, felt his comedy was crass and contrived. And then god knows what happened, he suddenly started consistently giving good movies and good performances.. I was left speechless at his work in Airlift along with Rustom and Baby.. What a turnaround.. Respect. Great, Great Movie."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "shirishgoyal",
        "review_rating": "10",
        "review_title": "best movie ever everyone must watch",
        "review_detailed_main": "this movie is a history,drama,thriller,etc.... must watch this movie ... The film captures the story of the Indians stuck in Kuwait during that time, through the eyes of Ranjit Katiyal and a few other characters. This is a story about how these Indians, with the help of Ranjit Katiyal, managed to survive the Iraqi invasion, andagainst all odds, move across Iraq into Jordan, from where they were brought home to India by the largest ever Airlift attempted in the history of the world. Arriving in Baghdad Katiyal discovers that the Indian Embassy is of no help. The consul explains that they cannot issue passports since many others – Pakistanis and Bangladeshis – use war as a convenient excuse to claim Indian nationality. Kuwaitis in Iraq have also fled. The only remaining option, Iraqi Foreign Minister Aziz is somewhat helpful. He is a friend of Katiyal and is sympathetic to the cause. He discloses that an Indian merchant ship is due to arrive in Iraq and he will tacitly permit the 500 Indians to leave on the ship. But as soon as the buses are loaded and ready to leave Katiyal receives the news that there is a UN embargo and ships are barred from entering or leaving Iraq. One of Katiyal's cantankerous employees rails against him. Amrita comes to his defense and after a loud argument everyone is resolutely supportive of Katiyal. Katiyal continues to keep in touch with the Indian Ministry officer Kohli but Kohli is somewhat of a sluggard. But when his own father recounts their tale of woe during the partition of India, Kohli awakens and begins to actively petition the Minister. The Minister, half in frustration and half in agreement, asks Kohli to handle it. Kohli approaches Air India (then national airline) and orchestrates an evacuation of the 170,000 Indians in Kuwait. Katiyal bluffs and threatens the Major to get him to let them leave. Kohli pleads and wrangles the Indian establishment to get the Amman Embassy to issue permits. When Katiyal finally loads up the Indians and leaves he encounters hostile Iraqi soldiers who stop him at a border checkpoint and threaten to rape Amrita. Katiyal fights them off when he finds the Indian contingent right behind him. The Iraqi soldier drops his weapons and lets them pass. They all arrive in Jordan and the Amman Embassy receives word in the nick of time to let them leave for India. Kohli has successfully negotiated safe passage of all the Indians. Air India supplies the planes and the pilots, previously unwilling to fly over war zones, have had a change of heart towards their brethren. The Indian tricolor is hoisted over the Jordan airport and the film ends as the Indians salute Katiyal as they board the planes that will take them home.\n\neven though the link would help many of you to watch this movie\n\nhttps://www.youtube.com/watch?v=ZD3xnsZ4tYs"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "tassotnadho",
        "review_rating": "10",
        "review_title": "A must watch !",
        "review_detailed_main": "Bollywood should keep attempting to tell such brave and patriotic stories about our nation, India, by producing more movies like Airlift and such. People are mostly not aware of the nation's glory in the past as well as present. Such movies helps give birth to that feeling of patriotism and love for one's nation which is seen lacking in recent times.\n\nThis movie has laid a pathway for a change that is very much needed in the recent trend of movie-making business in India especially Bollywood. Instead of just making and producing movies for the sake of raw entertainment and market profit, movie-makers should realize the importance and impact that a biopic movie like Airlift can have on Indian audience and individuals particularly.I applaud and congratulate each and every person involved in the movie as well as the event that actually took place. Bravo !!!"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "vinodemails",
        "review_rating": "9",
        "review_title": "A non-bollywood film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "fighters-30866",
        "review_rating": "10",
        "review_title": "Mind blowing",
        "review_detailed_main": "One of the best that bollywood has ever produced. Akshaya Kumar was in his best skin in this role. Kudos to the team. It is a must watch for every Indian."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "barcacatalunia",
        "review_rating": "1",
        "review_title": "Boring",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "alishahmohd",
        "review_rating": "9",
        "review_title": "A great movie which fantastically portrays the events of Kuwait Invasion",
        "review_detailed_main": "Airlift is based on Iraq's invasion of Kuwait in the year 1990, which resulted in the airlift of over 1 lac Indians, who were trapped in Kuwait because of the invasion. A rescue operation of this magnitude had never taken place before and may never take place again. And this entire movie perfectly portrays these events.\n\nWe follow a business Tycoon named Katiyal, who at the start of a movie is a conniving individual, who will go to any lengths to earn a profit, he also thinks of himself in a league of own and does not really care about his subordinates or servants. Things change when the Invasion takes place, and the people start to get killed. Although the Iraqi soldiers were just killing the Kuwaitis, Indians and others were also being killed if their identities were not confirmed.\n\nKaityal turns over a completely new leaf and now he is not only trying to escape Kuwait himself for the safety of his own family, but he is also trying to save more than 1 lac Indians who are trapped in Kuwait. And this does not just include his employees but other Indians trapped on Kuwait, who Katiyal does not even know. Katiyal goes to great lengths to get these Indians out of Kuwait, failing many times but never giving up hope. Although Katiyal could leave himself with his family, he simply refuses to abandon his people.\n\nKatiyal's character development throughout the movie is a huge high point, and Akshay Kumar plays his role perfectly. The other supporting characters in the movie who get screen time including Katiyal's wife and friends, Iraqi general, also stand out in their performances. the dialogue is also very well written, which leads to many memorable scenes.\n\nHowever, i do wish they could have explored a little bit more on how Kuwait was before the invasion, and a little more in-depth look into Katiyal's conniving businessman character. This would have made the movie and Katiyal's character development even better.\n\nAirlift is a fantastic, it is not your average Masala flick, but a more realistic movie based on a real life incident, with tremendous performances and acting by the cast, which will not only entertain you, but also inspire you and touch your heart.\n\nOverall Rating: 9/10"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "aryatambe-44071",
        "review_rating": "10",
        "review_title": "Worth it",
        "review_detailed_main": "This movie is really good. Akshay Kumar has rocked it. Must watch."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "amlanmukherjee",
        "review_rating": "9",
        "review_title": "One of the best film of Bollywood..",
        "review_detailed_main": "Airlift is merely a film,its an experience!We have seen human evacuation drama quite a few in Hollywood,but not in here.so suffice to say Airlift is first of its kind and thankfully an excellent one.Director Raja Krishna Menon has done a commendable job by touching a chord of audience with a subtle feel of patriotism.Mind you,this is not 'Chest-thumping i love my country' type emotion,its effective and real.And that's the power of Mr. Menon's direction.\n\nIt has to be said that Akshay Kumar emerged as the finest actor of his generation slowly and steadily.Lately,the superstar is producing and acting in films which shows that,he has the guts for experimenting.Airlift is such that film,which again proves that audience love to watch him in this kind of 'niche' films.It is by far Kumar's best film till date.From an arrogant businessman turning into sympathetic and finally a country loving man,Akshay's portrayal is simple yet beautiful.\n\nNimrat Kaur also does a fine job.The supporting cast lends a terrific job.Special mentions for Prakash Belawadi and Kumud Mishra.Cinematography is outstanding.Music goes well with the mood of the film.\n\nThere are films that releases every year and create hypes and makes money.Then there are films which are really good but nobody cares to watch it on big-screen.Airlift is the rare kind of film which respects the audience's intellect and also making it's producers happy,and rightfully so.Go Watch IT!"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "nikkipunjabi",
        "review_rating": "10",
        "review_title": "Movie worth watching repeatedly",
        "review_detailed_main": "Some movies are worth watching again and again! This is one of them. Very inspirational movie based on the true story. The largest civilian evacuation in history is by India. I recommend every Indian must watch this amazing movie which shows you the hassle a person had to take to achieve this and how it happened."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "DareDevilKid",
        "review_rating": "10",
        "review_title": "Spirits Lifted in a High-Quality Entertainer",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "indianature",
        "review_rating": "8",
        "review_title": "Good Plot",
        "review_detailed_main": "Airlift is a story that deserved to be told.\n\nIt is obviously more interesting for all those who were affected by or had anything to do with the mass exodus of Indians from Kuwait following the Iraqi attack. Not sure if today's youth would find it that interesting.\n\nThe settings are quite realistic.\n\nAkshay Kumar and most of the others barring Nimrat Kaur, did an excellent job. Nimrat Kaur cant act well and her soliloquy in the scene where Akshay is being assaulted by the Iraqi soldier in the desert, was pathetic.\n\nThat apart, Airlift is certainly worth watching. Especially when it comes on TV :)"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "rishabha",
        "review_rating": "8",
        "review_title": "Thrilling. Exciting. Edge of the seat!",
        "review_detailed_main": "It was a great movie and good acting by Akshay Kumar. The script was well written. The movie never felt like a drag. You were always on the edge of your seat.\n\nThe suspense and tension was built up in such a way that during some scenes you thought \"Now something bad is gonna happen\" and you were gripping your seat!\n\nThe overall acting by the entire cast was spot on except the Iraqi general. He was trying too hard with the accent and it looked out of place.\n\nOverall a great movie! A must Watch!"
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "prabhatkr-05392",
        "review_rating": "10",
        "review_title": "Must watch ...",
        "review_detailed_main": "You love this movie if u love mankind stories. How a person help his community in other countrie."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "duttab-05870",
        "review_rating": "10",
        "review_title": "Masterpiece",
        "review_detailed_main": "This movie is the main reason why I am a fan of Akshay Kumar. Akshay Kumar's best performance at that time ."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "abhijitkar-31630",
        "review_rating": "10",
        "review_title": "Masterpiece",
        "review_detailed_main": "In a word masterpiece. Best movie of Akshay in this decade so far. Brilliant acting by Akshay. Overall too good movie."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "kunalkhandwala",
        "review_rating": "9",
        "review_title": "Akshay Kumar proves his caliber as a hero that one can relate to",
        "review_detailed_main": "At the end of each year, audiences have been subjected to a crude and bizarre concoction of preposterous ideas that are formulated in Rohit Shetty's head and somehow, the masses just cannot get enough of it. But silently, as though compensating for such frivolous cinema, there has been one annual film starring Akshay Kumar that has some realism, patriotism, focused storyline and some solid performances. With 'Special 26', 'Holiday', 'Baby' and now with 'Airlift', Akshay Kumar proves his caliber as a hero that one can relate to and not the over-the-top nonsense portrayed in a vast majority of action films these days. Directed by Raja Krishna Menon, Airlift relives the Iraqi invasion of Kuwait in 1990 that threatened 170,000 Indian residents who left their homeland for better opportunities but were then stuck in a land without much of an identity. Now, it is up to one man to let go of his selfish motives and guarantee the security of his fellow countrymen in trying times as the Iraqi forces become more unpredictable.\n\nA brief intro and a song later, we are directly in the middle of the Iraqi forces storming into Kuwait city. While the locals get brutally executed by Saddam's fanatic army, the sub-continent population faces uncertainty and is constantly threatened even though they may not be identified as Kuwaitis. Realizing that his property, assets and family are at stake all of a sudden, businessman Ranjit Katyal (Akshay Kumar) decides to find a refuge for his company's workers while pleading for protection from a fickle Iraqi General. In no time, the office space is crowded with not just his workers but also their friends and family. With supplies running low, he desperately seeks to arrange for food and shelter for a few thousand and soon enough, the bigger refuge area now camps over 150,000 Indians due to Katyal's tireless efforts. While this arrangement provides some temporary relief, everybody is on the edge because of the anarchy outside their doors. In the absence and negligence of the local government, Katyal reaches out to officials in New Delhi to enable a rescue from the war zone but the bureaucracy and nonchalance from the babus left their fates hanging in the hands of a dangerous regime. There was but one last hope for Ranjit; to lead them all to Amman, Jordan through an arduous journey and uncertainty of border crossings, while an official in New Delhi sought to mobilize alliances and volunteers to aid a rescue operation.\n\nAirlift contains some pretty powerful moments that depict the trauma and stress during the invasion. The intensity of the first encounter between Iraqi soldiers and Ranjit, the traumatic drive through streets filled with military executing Kuwaitis outside their homes, the erratic behavior of Iraqi soldiers as they raid the camp and the border crossing through Iraq were effective in portraying the emotional turmoil of the numerous individuals who faced those dangers. There are light shades of patriotism that don't follow the #nationalism falseness that is rampant in current times. There are moments of heroism defined by one's actions towards a common good, through selfless deeds that make Ranjit's character even more likable.\n\nAkshay Kumar delivers a powerful yet subdued performance, just like he does every year in that one exceptional film. This time however, his acting is much more composed and thoughtful. With a sound understanding of the character and situations, he is able to deliver one of his career best acts. Nimrat Kaur has one stellar scene where she defends her husband's deeds of bravado that get misunderstood by an idiot in their company. The lashing she verbally delivers is far more potent than any other form of rebuttal. Purab Kohli is excellent too in his supporting role as he fights his tragedies in the face of danger that threatens the thousands around him.\n\nSoch na sake is a typical Arijit Singh melody, dil cheez tujhe dedi is of course inspired by Khaled's didi from yesteryear's while tu bhoola jise is deeply inspiring with its patriotic theme and is beautifully sung by Amaal Malik and KK. Raja Krishna Menon has not only achieved box office success for an honest film but also some well deserved acclaim for portraying true events with the right intention of reflecting upon the sacrifices made and hardships faced by thousands of Indians. Ranjit Katyal is a fictionalized version of the true heroes who stood up back then to save several who lost their identities in times of war. He brought them back home in troubled times, thus reflecting a powerful characteristic of human nature and Akshay Kumar, makes it all the more real."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "dutta-satyaki",
        "review_rating": "8",
        "review_title": "Patriotic and moving",
        "review_detailed_main": "Movies like Airlift are not rare. We get our dose of patriotism every year. The only things that change are the setting and the cast. Airlift, however, manages to strike a chord with the truth it portrays. Firstly, in sharp contrast to Argo, the Indian govt did not jump to the rescue of Indians stuck in Kuwait. Any Indian knows how things move in the govt sector and this was aptly portrayed. It is always one or two odd people who get things moving and such was the case in Airlift too. There are a couple of scenes which can happen only in movies but those apart, the movie painted a very real picture of the largest ever evacuation program conducted by any country. When Akshay Kumar signs off in the end saying he is still cynical about a lot of issues in India but never asks what his country has done for him, he is echoing the sentiments of 1.7 lakh people who were part of Operation Airlift and many more."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "geminipralhad",
        "review_rating": "10",
        "review_title": "Once in a life experience",
        "review_detailed_main": "The movie is simply awesome right from its beginning it has grip on audience.The story revolves around Ranjit Katyal who is a cruel business who literally don't have heart or soft corner for his friends,partners or anybody else who comes in between his business.But his cruel doesn't last long in the screen. As Iraqi Army invades Kuwat and attack Kuwati people his heart begins to melt and at one check point he asks his driver not to come out of car and he himself goes outside to deal with soldiers.As the story moves on Ranjit himself begins to melt and wants to help those victims Indians who were stuck in the war-zone.The story has its grip from beginning ,cast is perfect,Akshay has delivered his lifetime performance and deserves every award including national and probably the best actor award in international category of Oscar or Academy Award.From my side this film get thumbs up full 10* ratings,Enjoy movie with friends and family."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "akshaykini-97802",
        "review_rating": "8",
        "review_title": "Wonderful",
        "review_detailed_main": "I love Akshay Kumar. The crew was good. Excellent movie."
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "rangdetumpy",
        "review_rating": "",
        "review_title": "A tale of hope and humanity that breaks all political, societal, religious barriers.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4387040",
        "movie_name": "Airlift",
        "movie_rating": "7.9",
        "review_username": "sca727",
        "review_rating": "",
        "review_title": "Airlift a Movie To be proud of.. take a bow akshay kumar",
        "review_detailed_main": ""
    }
]