[
    {
        "movie_id": "tt3302962",
        "movie_name": "Shaadi Ke Side Effects",
        "movie_rating": "5.6",
        "review_username": "aayushmankaul",
        "review_rating": "6",
        "review_title": "Funny But Flawed",
        "review_detailed_main": "Let's get one thing cleared up here, Baby Ke Side Effects would be a more apt title for the movie, however, if you are ready to forgive that and get along with the movie, there is a fair chance of you enjoying it.\n\nThe movie relies heavily on its quirky writing and the humor that comes out of it. The best thing that the director of the movie could have done was to cast Farhan Akthar in the lead role as he suits the bill with his comic timing and delivery of witty dialogue. The actor is hysterical right from the word go. He drives the lead character in such a way that you will be rooting for him, even when most of the time he is playing a careless father. Vidya Balan's subtle portrayal of a urban woman struggling to be a new mother is remarkable. The vulnerability and emotions that she portrays makes sure that one does not forget her in a movie which is clearly tipped form a guy's perspective. The chemistry between the lead actors is what makes the whole experience worthwhile. Vir Das, Ram Kapoor, Purabh Kohli and Ila Arun chip in with good performances, though I'm not sure they were needed in this setup, they hardly fit the narrative, the exception being that of Ram Kapoor, but they could have made it short and it would have been sweeter.\n\nThe first half of the film is filled with witty moments and you will find yourself beaming, but as the movie progresses the narrative looses steam and its only the gags that keep you interested in it, but luckily enough there are enough gags to keep you feeling good about the movie. The second half of the movie starts on a promising note but soon it all goes astray and you secretly want the movie to reach its climax. The pacing of the movie is a big issue, even though the movie feels fresh and the direction is suave it does little to keep u engaged in the third act of the movie when the gags die and the movie takes a more serious turn.\n\nOverall its a fun movie and if you are not looking for something to be overwhelmed then you will definitely enjoy it."
    },
    {
        "movie_id": "tt3302962",
        "movie_name": "Shaadi Ke Side Effects",
        "movie_rating": "5.6",
        "review_username": "anupapu8",
        "review_rating": "7",
        "review_title": "Second Half Fails In Comparison Of The First Half",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3302962",
        "movie_name": "Shaadi Ke Side Effects",
        "movie_rating": "5.6",
        "review_username": "harsha442",
        "review_rating": "7",
        "review_title": "Enough entertainment for a suggestion",
        "review_detailed_main": "A family person may need some space for self even after marriage, but how far can (s)he really go looking for it makes the subject.\n\nThe movie starts with a confident young married guy who seems to know how to keep his married life happy, But he panics soon as he becomes a father and tries to adjust himself to his new 'family'.\n\nThe movie does exaggerate some aspects for the sake of humor.For an example, the ordeals of fathers in a supposed kids play. And the side effects that the title mentions were mostly one sided. But the director did try to make amends in this aspect with a hint at the end of the movie.\n\nAll the characters were carefully drafted and meticulously used."
    },
    {
        "movie_id": "tt3302962",
        "movie_name": "Shaadi Ke Side Effects",
        "movie_rating": "5.6",
        "review_username": "braddugg",
        "review_rating": "6",
        "review_title": "Wonderful performances and some crackling dialogs, made this worth a watch.",
        "review_detailed_main": "Wonderful performances and some crackling dialogs, made this worth a watch.\n\nMarriage is a beautiful alliance if the couple understand each other. It will be a nightmare, if they fail to do so. But more or less, it's an alliance filled of compromises and lies at times. Lies can be said to keep the spouse happy too. But at what cost, is a terrible question. The consequences are mostly dreadful at times even practically. This movie is about an alliance of Love and Lies.\n\nFarhan Akhtar is man with tons of talent and his acting talent and his coming come use in a great deal in this film. Vidya Balan has been one of the finest actress in recent years and she plays her role as a wife and mother wonderfully. Between the two, their chemistry is great, and they seem to slide well into their roles.\n\nAa script about a typical after marriage life, having baby, and trying to run away from responsibilities, learning from mistakes and forgiving each other would have been nonsensical if it did not have some great dialogs, which should make the stereotypes as fun but not as caricatures. that's what precisely happened in this well written script by Saket Chaudhary.\n\nFrom being together and have fun in early years of marriage, to changing anatomy through pregnancy, while the man becomes more responsible towards the family, and even earns more for them. This is all a clichéd tale that every family goes through. The parent teacher meetings, the birthday parties of the kid's friends, they are all part and parcel of life. Now, those are made interesting by some good writing and fine acting.\n\nTogether, the team has done a wonderful job in taking the script to a respectable level. The execution through cinematography is wonderful too. Though, editing seems to have disappointed in second half by dragging on some very dramatic moments, which would have been better chopped off.\n\nTo Farhan and Vidya alone, this film is worth. Also there are wonderful performances by others including Vir Das and Ram Kapoor among many others.\n\nA 3/5 would be apt in a film that's hilarious right through the first half, and a kind of drama in the second half. Yet, its fun all through."
    },
    {
        "movie_id": "tt3302962",
        "movie_name": "Shaadi Ke Side Effects",
        "movie_rating": "5.6",
        "review_username": "jmoneyjohal",
        "review_rating": "6",
        "review_title": "In Shaadi if you lie you will DIE!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3302962",
        "movie_name": "Shaadi Ke Side Effects",
        "movie_rating": "5.6",
        "review_username": "chowdhurytuhin",
        "review_rating": "4",
        "review_title": "Side effect from watching this movie- Confusion",
        "review_detailed_main": "The start is promising. Later its all confusing and then its ends with a big WTF... A struggling musician marries a well settled working woman. An ingredients for a serious movie. Instead it looks like dish supposed to a Biryani...turns out to be a Khichdi. How the hell did this struggling musician afford to go to exotic foreign locations with his girlfriend and also propose her with a big solitaire while in a hot air balloon? The wife's profession is not known. They lead a luxurious lifestyle. They even hire a 15000 Rupees nanny while the wife is not working. Though, through out the film its about the male leads struggle. Defies logic. The support acts were like playing kabaddi...they come and go at the drop of a popcorn. The main issues portrayed are genuine but the story really lags in dealing with them. Not to waste money on this. If you really want to watch this, wait for it come on a movie channel."
    },
    {
        "movie_id": "tt3302962",
        "movie_name": "Shaadi Ke Side Effects",
        "movie_rating": "5.6",
        "review_username": "Swapnilagarwal",
        "review_rating": "6",
        "review_title": "Effective side-effects of shaadi!",
        "review_detailed_main": "It took more than 7 years for 'pyar' to culminate into 'shaadi' for director Saket Chaudhary! His suave Sid and crazy Trisha (same character names as in the prequel 'Pyar ke side effects') finally get a reality check into the practical world of ' & they happily lived ever after'. Let's check all side-effects of this flick one-by-one:\n\n\u0095 Plot: SKSE narrates the mundane yet pragmatic nuances of married life through the eyes of its male protagonist making the movie a fun riot for guys (with wife-jokes and mother-in-law jibes). However, this one won't disappoint ladies either as it does have its moments of sensitivity, emotions, tenderness and utter feminism. The movie well depicts the scuffle and issues that emerge into life of 2 people when they graduate from being 'couple' to 'parents'. Vidya's dialogue to Farhan – \"We're pregnant\" says it all! While the first half is smooth and refreshing (tickling your funny bone on regular basis), it loses a little grip in the middle but ends with a tinge of emotional (yet predictable) maturity enunciating 'strategy' for happy marriage.\n\n\u0095 Cast: Farhan being the narrator, is the backbone of SKSE and literally wears Sid's soul on his sleeves! In all avatars, emotional/ fun, bachelor/ father, he excels and manages to convey with ease dilemmas of unprepared fatherhood along with his strife to strike a balance between the husband and father in him. Vidya, as per some people, is a misfit as she looks bloated throughout the movie. But then, who would have so easily portrayed the vulnerable yet suave yet wild Trisha who has just entered motherhood. I would rather say, her unshapely shape actually suited the demands of the character. The skin show could have been averted but then Vidya manages to carry it all with élan. Real-life couple Ram and Gautami Kapoor are endearing with Ram getting a good screen-space. He doesn't disappoint. Real-life VJs Purab Kohli and Vir Das manage to add funkiness through their respective characters. It was good to see Ila Arun after a long time while Rati Agnihotri fails to impress.\n\n\u0095 Music: Opening number, Indo-western 'Desi romance' is my pick from the album while title track rocks with its Punjabi touch and funny lyrics by Amitabh Bhattacharya. Jazzy B's 'Harry is not a Brahamchari' is becoming a rage among boys. 'I am sorry tumse pyar ho gaya' reminds of 'Kya karun' from 'Wake up Sid'. Pritam won't stop drawing inspirations! In all music and background score well-suit the mood and pace of movie.\n\n\u0095 Flaws: Despite superb acting by its actors, SKSE does have its share of flaws, major one being, extremity in certain situations reducing authenticity! Being narrated by male protagonist, it is quite skewed in favour of 'Adam' gender relegating the 'Eve' stereotyped. Also, the self-professed dual-life portion of Sid is a bit exaggerated.\n\nDespite these flaws, SKSE is a refreshing urbane rom-com dealing with relevant issues of modern-day couples. Go watch it with your friends for some good laugh or your spouse to rewind some memories! This shaadi ka laddoo is worth tasting at least once! "
    },
    {
        "movie_id": "tt3302962",
        "movie_name": "Shaadi Ke Side Effects",
        "movie_rating": "5.6",
        "review_username": "gforginnu",
        "review_rating": "4",
        "review_title": "A missed opportunity... could have been much better",
        "review_detailed_main": "The movie, being a sequel to directors fresh and delightful Pyaar Ke Side Effects, starts on a high note. The jokes are good and you have some really smart dialogs and funny situations as the first half progresses. Especially the part where Farhan tries to feel like a pregnant lady. However that's where the good things end.\n\nSecond half is a Mish-Mash of emotions and multiple characters which are totally wasted. Taking nothing away from Farhan or Vidya's acting, it's the director's confusion about what he wants to show that is the culprit. The love a father may have for his child has been totally ignored with Farhan's character treating his daughter as nothing more than a hassle as there is no father-child connect in the movie. Characters like Vidya's mother and Vir Das are underutilized. Even Ila Arun's character has been mis-handled.\n\nThe movie tries to show the issues a couple with kid with single income may face, yet we never see Farhan working hard while whining about expenses all the time (While living in a luxury house by Mumbai standards). The movie completely loses its plot and the climax leaves a bad taste as a half baked attempt.\n\nI would still say it deserves a one time watch for the first half which comes as a tasty appetizer, its the main course that got burnt."
    },
    {
        "movie_id": "tt3302962",
        "movie_name": "Shaadi Ke Side Effects",
        "movie_rating": "5.6",
        "review_username": "zar-ah-kh-an-94",
        "review_rating": "",
        "review_title": "Terrible for Bollywood",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3302962",
        "movie_name": "Shaadi Ke Side Effects",
        "movie_rating": "5.6",
        "review_username": "yunusitboss",
        "review_rating": "7",
        "review_title": "Shaadi Ke Side Effects (U/A) Hindi --------- my Rating : ★★★½ DECENT ROMANTIC COMEDY",
        "review_detailed_main": "Shaadi Ke Side Effects (U/A) Hindi New movie Reviews and lots more Hot news .... LIKE THIS PAGE : English Hindi TAMIL TELUGU Facebook : Movie Review by Yunus Irshad https://www.facebook.com/YunusIrshadsMovieReview\n\nShaadi Ke Side Effects (U/A) Hindi --------- my Rating : ★★★½ DECENT ROMANTIC COMEDY\n\nSTRENGTHS :- * Casting and Performances * Comedy scenes : in the first half .... * Story and Direction : was new and good...\n\nWEAKNESSES :- * Second half slows down .....\n\nFINAL VERDICT :- * Overall... it is a decent family entertainer ..... go and have fun watching it ...\n\nA complicated relationship develops between a man and woman after getting married and having a baby.\n\nDirector: Saket Chaudhary Writers: Saket Chaudhary (screenplay), Saket Chaudhary (story), 4 more credits » Stars: Farhan Akhtar, Vidya Balan, Vir Das | See full cast and crew »"
    },
    {
        "movie_id": "tt3302962",
        "movie_name": "Shaadi Ke Side Effects",
        "movie_rating": "5.6",
        "review_username": "bobbysing",
        "review_rating": "4",
        "review_title": "An utterly confused, less entertaining and one sided take on the after effects of having a child rather than a marriage.",
        "review_detailed_main": "After a long gap of 8 years, post his fairly likable PYAAR KE SIDE/EFFECTS in 2006, director Saket Chaudhary makes a comeback with SHAADI KE SIDE/EFFECTS exactly like an eight year long affair gets converted into a marriage after a prolonged thinking and decision making. Now interestingly I am not sure that whether this should be considered as a praise or as a negative comment about the film. But Saket's new product is quite similar to the confused mindset of the present generation which is really finding tough to understand this traditional concept of marriage in the right perspective. And that is the reason why we are having so many broken marriages, divorces, splits and live in relationships widely happening in our society, particularly since the last decade.\n\nSo making it clear in the beginning itself, yes SHAADI KE SIDE EFFECTS has its good, intelligent & entertaining moments mostly visible in its first half. But the film cannot be presented as any positive take on the 'institution of marriage' at all due to a pretty weird, puzzled and silly story progression in its final hour which simply ruins the entire fine build up in a highly casual or careless manner.\n\nBesides, it is to be understood that 'getting married' and 'having a child' are two different steps of a newly formed relationship between a couple, which obviously have their own individual value, significance and timings. But since Saket's film gives only 10-15 minutes to the married couple and more than 135 moments to their life after having a child, therefore it should ideally be called \"BACCHA HONE KE SIDE EFFECTS\" rather than \"SHAADI KE SIDE EFFECTS\" to be clear. So in reality this is not a film about the first few years of a newlywed couple (which certainly have a completely different meaning for the two) but a film about their changing relationship after having their first child to be precise.\n\nThankfully, SKSE begins on an interesting, fresh note focusing on how the couple is managing to keep the love flame burning in their first (one or two) years of a married life. And therefore does have that novelty and amusing humour too coming at regular intervals with few songs in its initial reels. Also, the moment it all starts becoming monotonous, the director plays a very intelligent twist with Ram Kapoor (just before the intermission) and you get assured that this surely is a smart take on the issue handled well.\n\nBut unfortunately everything crashes down with some deliberately added, over length subplots in the second half just like a honeymoon ending after the first 5-6 months of a marriage getting back to the real tough repetitive life as usual. The dramatic scenes result in loss of grip and the over stretched climax leads to boredom. However, most importantly it's the confusing culmination of the script which simply pulls the film down drastically and you are just not able to make what the director wished to say with all this crazy mess representing nothing.\n\nIn short, if you are expecting it to be an entertaining and enlightening take on the concept of new-age marriage then you are seriously mistaken. Because the film is simply not made with any such clear mindset and it will leave you even more confused than before after the end credits start rolling. Though, the director tries many tricks to keep the smiles coming in the post interval sequences. But in the process shatters all the high expectations raised by its intelligent first half and you get nothing exceptional in the next hour right till the end.\n\nHaving said that the film does have some superlative performances by the lead couple, as well as the supporting cast providing you something to watch constantly. Farhan once again proves his amazing versatility and so does Vidya playing the enthusiastic mother (though I am still amazed how they said yes to such unconvincing script). The role fits like 'T' to both the talented stars and I seriously wish the writers had given them something more sensible and sane to do on the screen honestly. Ram Kapoor is excellent as the friendly guide and Ila Arun shows her under- rated skill of a great performer yet again. Vir Das tries hard to be funny but Rati Agnihotri, Purab Kohli and Gautami Kapoor are just there for only a few scenes.\n\nThe soundtrack has some peppy tracks used well. Plus both cinematography and background score are fine as per the limited requirements of the concept. So strictly being a multiplex film, it might get noticed by the youngsters thinking about their own marriage and their first child in particular. But at the same time they are also going to find the entertainment factor largely missing and the film not giving any enlightening message on this serious subject, performing below the expectation.\n\nIn strong words, till you are dealing with love, affair and friendship, everything is fine and can be taken in the lighter sense. But once you venture into the 'serious theme of marriage' then you got to treat it responsibly and just cannot play with it in a casual mode with the sole motive of delivering a hit at the box office, walking on a disrespectful or unbalanced path.\n\nAnd since SHAADI KE SIDE EFFECTS does the same in an utterly confused, unsure and irresponsible manner so I am not able to give it any higher ratings taking it as an interesting yet baffling, silly take on 'marriage'."
    },
    {
        "movie_id": "tt3302962",
        "movie_name": "Shaadi Ke Side Effects",
        "movie_rating": "5.6",
        "review_username": "dhivyarani28",
        "review_rating": "8",
        "review_title": "A quirky yet relatable take on marriage; worth the moolah",
        "review_detailed_main": "I don't understand the fuss surrounding the movie, considering how it's probably one of the better scripts and execution of comedy I've seen in Bollywood in recent times. I had watched this is a fully booked theater and from the roars of laughter and clapping, I can assure you that 'Shaadi Ke Side Effects' is worth at least a one time watch.\n\nFarhan and Vidya play a married couple (Sid and Trisha) who complement each other and are a breath of fresh air. (Definitely a break from seeing much older actors romancing heroines who could very much be their daughters.) The \"unconventional\" pairing plays out lovely on screen and needless to say, both actors nailed their respective roles with such conviction.\n\nFarhan's comic timing and delivery of witty dialogue has again ascertain his strength as an actor (amongst his ever growing list!) and Vidya's subtle portrayal of a urban woman struggling to be a new mother is remarkable.\n\nSaket Chaudhary's hilarious take on parenthood and painful truth of life after marriage is well-balanced with all-too-familiar scenarios of both \"the good\" and \"the bad\". While this uni-sided film is written in a male's perspective, we do get to see Trisha's woes as a wife/mother, too.\n\nThe second half of the movie seems a tad draggy with some unnecessary parts but the film manages to pick up its pace at the climax. The twist is certainly unexpected and gets you wondering how the movie is set to end. (I actually did like the ingenious ending, too.)\n\nIt's possible that audiences who didn't quite like the movie had much higher expectations of Farhan and Vidya for they are actors who have done quite \"serious\" films in the past. However, do keep in mind that 'Shaadi Ke Side Effects' is a light-hearted comedy that invariably takes you on a quirky ride while occasionally tapping on the seriousness of marriage.\n\nI'd recommend this relatable film to anyone who's in the mood for some laughs!"
    },
    {
        "movie_id": "tt3302962",
        "movie_name": "Shaadi Ke Side Effects",
        "movie_rating": "5.6",
        "review_username": "dineshprakash",
        "review_rating": "6",
        "review_title": "Sweet and cute side effects, except the pre climax and climax",
        "review_detailed_main": "Director Mr. Saket Choudhary work is good. He has completely justified the content and script. This movie does not have a story but full of witty and humorous scenes. Screenplay is good. Dialogues are very good. We have a typical prejudice about the married person and their life. This movie gives the proper detail of a sweet and sour journey of a believable married life . Problems in marriages are mostly the difference in prospective of husband and wife. Movie deals smartly on this note ,balancing between both's point of view. Main drawback of this movie is its climax. Climax is typical forced one and lengthy. So, one gets bored. They tried to touch some emotional notes in climax but failed to justify it. Some scenes are written very smartly. When Sid (Farhan Akhter) keeps balloon inside his t-shirt to just get the feel of pregnancy. They started this scene at a funny note but ended with very emotional note and shown the last journey of pregnancy in new style. Performance wise Farhan Akhter is impressive. Vidya Balan is very good. Both are great actors and portrayed the character perfectly. Ram Kapoor is good. Music is OK."
    },
    {
        "movie_id": "tt3302962",
        "movie_name": "Shaadi Ke Side Effects",
        "movie_rating": "5.6",
        "review_username": "nairtejas",
        "review_rating": "3",
        "review_title": "\"Let's Cook Up Some Side/Effects, Shall We?\" ♦ 33%",
        "review_detailed_main": "That is what the writers asked themselves before the film went on floor. I mean, they should be awarded for fabricating such a make- believe story of which not one sequence looks credible. Saket Chaudhary seemed eager to make a sequel after his Pyaar Ke Side/Effects being an unexpected, sleeper hit as the two lead characters were quirky, original and the plot actually made sense.\n\nVidya Balan & Farhan Akhtar are good idiosyncratically, but they are not wacky, yet ordinary people. As a result, an ordinary story breaks out which everyone experiences in their lives. In other words, the film does not show anything new that we already already don't know, the kinda- humorous jokes notwithstanding. Starting off with the couple's fancy idea of spicing their marriage up, they immediately jump into parenthood. Then, they show how an infant can break havoc in the love life. So, I feel personally, that this film should be renamed \"Parenthood Ke Side-Effects!\" Because marriage only stays on-screen for a minute or two. In fact, the first sequence is so ironic to the whole idea. That sequence seemed like there ARE no side/effects.\n\nScenes that contain humor are totally co-incidental or situational and they turned me off rather than tickling my bone. It was like fillers that we see in some cultural events which are both boring and time- consuming.\n\nNext, predictability kicks in and we are shown how selfish people can become, that is, after getting stricken with these so-called side/effects. Unwanted character (Purab) comes and goes after making a silly point (Makers should understand, we won;t believe when you show someone jumping from a 19th floor's balcony to 18th floor). Ram Kapoor's character is the only one who is believable, but then again, it was cliché. Towards the end, the characters self-realize how they are not loving themselves and letting the kid come in between. The climax is supposed to be emotional, but since the genre is comedy, it ends with the most disastrous scene in cinema history. A very poor closure.\n\nIn other words, this film lacks elements that can carry a story further. Basically, it coheres itself with parts that are exaggerated. This is not at all how married couple behave when they invite a baby to their lives. It gives a wrong idea to newly married people and is a poorly made solution of utter hyperbole. To prove what? A point, maybe? Nope. To mock the whole institution.\n\nVir Das is one good player in here and although his participation was unnecessary, the writers make us believe that he was important because it is he who maneuvers the situation for Farhan's character. Songs are blown-off party smashers and there is nothing much to consider, as far as celluloid is concerned. It was even worse that the seriousness is lost in an attempt to create humor.\n\nBOTTOM LINE: Akhtar & Balan will save the day for people (like me) who are obsessed with the theme. But I assure you, this is a very silly film. Not sticking to facts and actuality, it is a piece of exaggeration coupled with sheer imagination.\n\nCan be watched with a typical Indian family? YES"
    },
    {
        "movie_id": "tt3302962",
        "movie_name": "Shaadi Ke Side Effects",
        "movie_rating": "5.6",
        "review_username": "pareshgfirst",
        "review_rating": "1",
        "review_title": "The one movie NO ONE should go through...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3302962",
        "movie_name": "Shaadi Ke Side Effects",
        "movie_rating": "5.6",
        "review_username": "namashi_1",
        "review_rating": "5",
        "review_title": "A So-So Fare!",
        "review_detailed_main": "'Shaadi Ke Side Effects' has its share of glorious moments & spirited performances working for it, but an erratic screenplay plays a spoilsport.\n\n'Shaadi Ke Side Effects' Synopsis: A complicated relationship develops between a man & woman after they get married & have a baby.\n\n'Shaadi Ke Side Effects', at first, seems pro anti-marriage. But, later comes on to its favor. Its an erratic film, that chooses different sides in phases. A consistent mood & pace, is also missing!\n\nHowever, a few light moments cannot be forgotten. The humor in the first-hour is first-rate, even some of its characters, are indeed interesting. How one wishes if Writer/Director Saket Chaudhary's Screenplay had been much stronger. His Direction, on the other-hand, is fair. Cinematography, Editing & Art Design, are standard. Music by Pritam is decent.\n\nPerformance-Wise: Farhan, now a seasoned actor, dominates the show with an earnest performance. Vidya Balan is good, though her character comes across more as negative than positive. Ram Kapoor is very funny. His scenes stand out. Vir Das hams. Rati Agnihotri & Ila Arun shine in brief roles.\n\nOn the whole, 'Shaadi Ke Side Effects' is a half-baked fare."
    },
    {
        "movie_id": "tt3302962",
        "movie_name": "Shaadi Ke Side Effects",
        "movie_rating": "5.6",
        "review_username": "ravik-kant",
        "review_rating": "4",
        "review_title": "Good at certain points",
        "review_detailed_main": "The movie is good at points and that the summary of this entire movie. If you need to look at, you'd like the first half more than second half. After interval the movie just seems to drag too much without much of a logic and coherence. End is slightly predictable but it is ideal for the movie.\n\nBacche Hone Ke Side Effects would have been right title for the movie. Because it all starts with a baby in family. The typical husband-wife things are not in enough quantity and its so very particular to the type of couple they are.\n\nFrankly, the movie wasn't up to the mark and falls below the expectation. I simply couldn't connect the husband-wife and kid in the family - they all looked disjointed and wasn't felt like a family. Shaadi Ke side effects had to be generic in nature just because the message it has - but it went too specific to a particular type of couple and then didn't justify the title it had.\n\nBest of the acting came from Ram Kapoor - his dialogs delivery and conviction on them was simply amazing and live wire of the movie. Vidya and Farhan's pair doesn't look sparkling and it disappoints slightly. Individually, they have acted very well.\n\nCouple of songs are good and the don't bore you much. Script is disappointing and so is the editing. Struggling music director Farhan in the film seems to be living very comfortable life with staying in hotels - buying bikes as he wishes etc.\n\nThe movie is full of promotions - Cars, bikes, cloths, TVs, phones, hospitals - everything has been branded nicely to get sponsor money. Looked sad to see all that. Its just tad too much.\n\nOverall, I wont be too excited to watch this film. Its strictly a decent watch but not up to the mark."
    },
    {
        "movie_id": "tt3302962",
        "movie_name": "Shaadi Ke Side Effects",
        "movie_rating": "5.6",
        "review_username": "mr_zain93",
        "review_rating": "8",
        "review_title": "A great take on life after marriage..something rare in bollywood..",
        "review_detailed_main": "I was really looking forward for this film , as after a long time it looked like a sensible movie was coming out of Bollywood..and I was not disappointed , as the movie turned out exactly how I expected to be , funny and realistic at the same time..It may not be the most unconventional movie churned out , but still something worth watching If you're a fan of sitcoms nonetheless..\n\nFarhan was just brilliant as the confused husband cum dad , while Vidya was perfect as the typical wife cum mum..both of them complemented each other wonderfully , which is one of the main reason the movie worked big time..\n\nThe only bad thing about the movie is it was too damn long , which shouldn't be for this kind of film , as some unnecessary scenes and songs could have been avoided..there comes a point in the 2nd half where you start wondering what is actually going on , but the movie picks up right before the climax..\n\nSo nothing much to say here I guess , if you love sensible cinema , you'll really enjoy the movie , but If you are into mindless masala movies , I suggest you ignore this one.."
    },
    {
        "movie_id": "tt3302962",
        "movie_name": "Shaadi Ke Side Effects",
        "movie_rating": "5.6",
        "review_username": "jdicctv",
        "review_rating": "4",
        "review_title": "Feminist",
        "review_detailed_main": "I knew at end husband will be stated wrong . feminist's society and feminist Bollywood"
    },
    {
        "movie_id": "tt3302962",
        "movie_name": "Shaadi Ke Side Effects",
        "movie_rating": "5.6",
        "review_username": "adityakumarprasad",
        "review_rating": "2",
        "review_title": "Go watch 'Pyaar Ke Side Effects', instead!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3302962",
        "movie_name": "Shaadi Ke Side Effects",
        "movie_rating": "5.6",
        "review_username": "ahwaan_padhee",
        "review_rating": "",
        "review_title": "Shaadi Ke Side/Effects : Shaadi ka Superhit formula",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3302962",
        "movie_name": "Shaadi Ke Side Effects",
        "movie_rating": "5.6",
        "review_username": "achyutaghosh",
        "review_rating": "5",
        "review_title": "pretty but lacks warmth",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3302962",
        "movie_name": "Shaadi Ke Side Effects",
        "movie_rating": "5.6",
        "review_username": "nadkarnisumeet",
        "review_rating": "4",
        "review_title": "Lengthy and boring fare.",
        "review_detailed_main": "Shaadi ke side effects review:\n\nListing down side effects of any \"shaadi\" and linking it to this film:\n\nHoneymoon period: First half hour of the movie. Full of fun n masti.\n\nTours: Australia tourism has part funded the venture, it seems.\n\nPerformance: I meant Farhans and Vidya's competent act. Nothing more. :)\n\nHumour: Akhtar's comic timing is superb, after Zindagi naa Milegi Dobaara (2011).\n\nMisunderstandings and problems: Too many in second half of the film makes it a lengthy and boring fare.\n\nRegards, Sumeet Nadkarni."
    },
    {
        "movie_id": "tt3302962",
        "movie_name": "Shaadi Ke Side Effects",
        "movie_rating": "5.6",
        "review_username": "rahuljonathan-nair",
        "review_rating": "8",
        "review_title": "Wonderful film for married couples!",
        "review_detailed_main": "Yet the film's consistently crackling dialogue and terrific performances from its leads makes it enjoyable despite its obvious bumps.But Shaadi Ke Side Effects belongs to Farhan, who reveals incredible comic timing as he slips into the role of the self-obsessed man-child struggling to cope with change. Steering clear of melodrama even when the script falls prey to it, Farhan plays it effortlessly cool. The film then is easy and breezy, although too long at nearly two-and-a-half hours. I'm going with three out of five for Shaadi Ke Side Effects. Predictable and occasionally misguided, but also hopelessly fun. SHAADI KE SIDE/EFFECTS is more about rediscovering your partner, post marriage. The fact that Saket borrows from real-life instances makes it relatable and identifiable. The connect is tremendous, with the spectator often drawing parallels with his/her life. On the whole, SHAADI KE SIDE/EFFECTS is a delicious take on contemporary relationships. This one's relatable, heart-warming, amusing and thoroughly enjoyable!"
    },
    {
        "movie_id": "tt3302962",
        "movie_name": "Shaadi Ke Side Effects",
        "movie_rating": "5.6",
        "review_username": "ankitabose76",
        "review_rating": "1",
        "review_title": "a film which is provides far from reality",
        "review_detailed_main": "Well, my first reason for seeing this movie was Vidya Balan and Farhan Akhtar. They both are great actors something which they carry on with in this movie also. But in order for a movie to succeed one needs not only good actors portraying their parts correctly but also a part good enough to portray. The main reason why this film is such a letdown for me is its storyline which is a complete cliché. I expected this film to be an urban comic caper on the likes of its predecessor 'PYAAR KE SIDE EFFECTS'. PKSE was funny and took an entirely new take on the relationship between a girl and a boy. This film however is far from taking a new take. it goes along the same route of all mindless comic films where the characters who are madly in love with each other are nevertheless lying to each other and not conversing with each other. they share the most dysfunctional relationship ever seen, but are still shown to be in LOVE! the ending is again a cliché. I thought it would be the only saving grace of the film, but, no; it was not.\n\nI could go on and on about how this movie disappointed me; but I choose to brood on my own from hereon.\n\nSee it only if you are a fan of the leading pair,like me.(sadly)"
    },
    {
        "movie_id": "tt3302962",
        "movie_name": "Shaadi Ke Side Effects",
        "movie_rating": "5.6",
        "review_username": "miiszmalissa",
        "review_rating": "9",
        "review_title": "awesome movie!",
        "review_detailed_main": "Shaadi Ke Side Effects Review (By Me); most marriage movies don't go into dept of what goes on beside closed doors, but Shaadi Ke Side Effects does. when you put actors like Farhan Akhtar & Vidaya Balan on screen together it's just makes the whole film even better. As they portray their roles as husband and wife it was nailed! SKSE shows you the fun & serious parts of marriage, which everyone should know exists. marriage is about having fun and loving each other but what happens when your not ready for more responsibility like a baby or another car?? what if all you wanna do is have fun with the marriage?? SKSE takes you there and shows your the outcome of what marriages are like with lies and betrayal. FA & VB have done such an excellent job of making the audience understand that there is such a thing a love forgiveness & understanding. the funny moments of the film will make you laugh like crazy and the serious parts will have you think either is that how I feel or am u ready for marriage? Awesome movie altogether ."
    },
    {
        "movie_id": "tt3302962",
        "movie_name": "Shaadi Ke Side Effects",
        "movie_rating": "5.6",
        "review_username": "abhishekx",
        "review_rating": "8",
        "review_title": "Two great actors make great film.",
        "review_detailed_main": "Beautiful movie! A bit different Rom-com, but still well depicted. It was really good to see the two talented actors of B-town sharing screen. Besides, people really appreciate Farhan and Vidya and that is what will attract people towards the movie. The might not have a rocking opening because the songs are something which didn't attract the people to some extend. According to the predictions, the flow and speed of the box office collection of 'Shaadi key side effects' will be same as that of 'Hasee to Phasee'. The movie is worth watching. Since 'Shaadi key side effects' has been quite awaited film, no doubt it will dilute the box office collections of 'Highway' which might be very threatening for Highway as it has earned only 20 crores in its first week which exactly half of its budget. The competition between 'Higway' and 'Shaadi Key side effects' will undoubtedly be very biased."
    },
    {
        "movie_id": "tt3302962",
        "movie_name": "Shaadi Ke Side Effects",
        "movie_rating": "5.6",
        "review_username": "ketgup83",
        "review_rating": "8",
        "review_title": "Shaadi Ke Side effects is a welcome change for audience with stupendous performances, nice songs and funny scenes.",
        "review_detailed_main": "When you have two epitome of Bollywood talents - Farhan Akhtar and Vidya Balan in one film, the expectation soars high. Shaadi Ke Side Effects is hilarious, ravishing and refreshing.\n\nSid is a struggling musician who is married to Trisha. All hell break loose on Sid when Trisha announces her pregnancy news. As they welcome the new member in the family, Sid's life becomes monotonous and boring with sense of failure and insecurities as he must find a way to cope up the daily problems.\n\nSequel to fun-loving Pyaar Ke Side Effects, Shaadi Ke Side Effects is a humorous way of describing the daily issues one faces in married life. The first half is outstanding and few scenes like sleeping habits of Sid, being the best father in children's birthday parties are surely going to bring down the house. Second half is melodramatic but does not get overboard. Hats off to Saket Chaudhary for doing fine job as director. Screenplay is tight. Cinematography is exceptional. Dialogues are funny. Art direction is nice. Songs are good. Farhan Akhtar delivers again. This is second film in which he plays a comic role and is absolutely stunning. Vidya Balan is enthralling playing the role of a house wife with aplomb. Ram Kapoor is dependable along with Vir Das.\n\nShaadi Ke Side effects is a welcome change for audience with stupendous performances, nice songs and funny scenes. Excellent 4.5/5\n\nwww.facebook.com/FilmyChowk"
    },
    {
        "movie_id": "tt3302962",
        "movie_name": "Shaadi Ke Side Effects",
        "movie_rating": "5.6",
        "review_username": "silvan-desouza",
        "review_rating": "",
        "review_title": "A good successor",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3302962",
        "movie_name": "Shaadi Ke Side Effects",
        "movie_rating": "5.6",
        "review_username": "sesht",
        "review_rating": "",
        "review_title": "Putting things in perspective",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3302962",
        "movie_name": "Shaadi Ke Side Effects",
        "movie_rating": "5.6",
        "review_username": "leenarete",
        "review_rating": "",
        "review_title": "Fresh Pair Rocks",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3302962",
        "movie_name": "Shaadi Ke Side Effects",
        "movie_rating": "5.6",
        "review_username": "binducherungath",
        "review_rating": "",
        "review_title": "Shaadi ke Side Effects has virtually no side effects, it is all about how one perceives.",
        "review_detailed_main": ""
    }
]